[
    {
        "data": {
            "description": "One part of a series of courses to train students in the quantitative methods typically used by economic analysts in a professional setting. Provides students with the opportunity to synthesize the material they've learned in their coursework in a start-to-finish econometric analysis similar in scope and timeline to what they often would be expected to do in a professional setting. The final course product is a professional report. Students should think of this report as a professional analyst's Master's thesis - a demonstration of the student's training and capability for professional work, to be shared with prospective employers.",
            "id": "AAE 724",
            "parent": "AAE",
            "title": "PRACTICUM FOR APPLIED ECONOMISTS"
        }
    },
    {
        "data": {
            "description": "Focus on extending the standard regression model. Topics include nonlinear regression models, maximum likelihood estimation, panel data, simultaneous equations, linear and nonlinear systems, analysis of discrete choice, limited dependent variables, empirical economic applications and policy analysis.",
            "id": "AAE 637",
            "parent": "AAE",
            "title": "APPLIED ECONOMETRIC ANALYSIS II"
        }
    },
    {
        "data": {
            "description": "Introduction to the standard linear regression model with an emphasis on application issues. Includes statistical foundation, hypothesis testing, functional form, model selection and procedures for handling violations of model assumption.",
            "id": "AAE 636",
            "parent": "AAE",
            "title": "APPLIED ECONOMETRIC ANALYSIS I"
        }
    },
    {
        "data": {
            "id": "AAE",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "AAE 636",
            "target": "AAE 637"
        }
    },
    {
        "data": {
            "source": "AAE 637",
            "target": "AAE 724"
        }
    }
]