[
    {
        "data": {
            "description": "Introduction to the standard linear regression model with an emphasis on application issues. Includes statistical foundation, hypothesis testing, functional form, model selection and procedures for handling violations of model assumption.",
            "id": "AAE 636",
            "parent": "AAE",
            "title": "APPLIED ECONOMETRIC ANALYSIS I"
        }
    },
    {
        "data": {
            "description": "Professional communication for careers in applied economics. Writing for technical and non-technical audiences, including writing about research findings, client memos executive summaries, detailed analysis reports etc.",
            "id": "AAE 721",
            "parent": "AAE",
            "title": "PROFESSIONAL COMMUNICATION OF APPLIED ECONOMIC ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Professional development for applied economists in sequential contexts. Examples include understanding and preparing for the professional economist job market; preparing and packaging job search materials; technical and non-technical interactions with potential employers and clients; understanding leadership styles and exploring leadership potential; examining professional ethics and norms; and gaining exposure to trends in professional development. Students will develop career skills by completing stand-alone activities, and by coordinating soft skill development tasks with exercises in simultaneously or previously offered theory and econometric classes.",
            "id": "AAE 723",
            "parent": "AAE",
            "title": "PROFESSIONAL DEVELOPMENT SEMINAR"
        }
    },
    {
        "data": {
            "id": "AAE",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "AAE 636",
            "target": "AAE 721"
        }
    },
    {
        "data": {
            "source": "AAE 721",
            "target": "AAE 723"
        }
    }
]