[
    {
        "data": {
            "description": "Introduction to economic ways of thinking about a wide range of problems and issues. Topics include consumption, production, prices, markets, finance, trade, pollution, growth, farms, taxes, and development.",
            "id": "AAE 101",
            "parent": "AAE",
            "title": "INTRODUCTION TO AGRICULTURAL AND APPLIED ECONOMICS"
        }
    },
    {
        "data": {
            "id": "AAE",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "AAE 101",
            "target": "AAE/CIVENGR/ENVIRST/URBRPL 561"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "AAE/CIVENGR/ENVIRST/URBRPL 561"
        }
    },
    {
        "data": {
            "id": "ECON",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Integrated treatment of macroeconomics and microeconomics (seeECON 101andECON 102). Accelerated approach to economics training, especially for Economics: Math Emphasis majors.",
            "id": "ECON 111",
            "parent": "ECON",
            "title": "PRINCIPLES OF ECONOMICS-ACCELERATED TREATMENT"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON 111"
        }
    },
    {
        "data": {
            "description": "Economic problems of individuals, firms and industries with emphasis on value, price, and distribution of income.",
            "id": "ECON 101",
            "parent": "ECON",
            "title": "PRINCIPLES OF MICROECONOMICS"
        }
    },
    {
        "data": {
            "description": "Energy resources are an essential element of the world's business, political, technical and environmental landscape. Analytic tools provided by the discipline of economics expands our understanding of this critical issue. Energy supply markets reviewed include both fossil fuels and renewable resources. Energy demand sectors include residential, commercial, industrial and transportation. Electricity represents an intermediate energy market. The interactions among these markets participants indicate how scarce resources are allocated among competing needs in the world economy.",
            "id": "AAE/CIVENGR/ENVIRST/URBRPL 561",
            "title": "ENERGY MARKETS"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON 101"
        }
    }
]