[
    {
        "data": {
            "description": "Application and analysis of professional scientific communication, both written and oral. Focuses on designing documents that convey complex, data-rich technical and scientific content to audiences with diverse information needs using a variety of professional genres, including reports, proposals, presentations, and documentation.",
            "id": "ABT 710",
            "parent": "ABT",
            "title": "PROFESSIONAL AND TECHNICAL COMMUNICATION IN BIOTECHNOLOGY"
        }
    },
    {
        "data": {
            "description": "Ethical and safety concerns in development, production, funding, and application of biotechnology. Analysis of socioeconomic impacts. Understanding the importance of data integrity. Overview of risk assessment and management in a regulatory environment designed to ensure safety of workers, study subjects, and patients, and protect intellectual property, data, and the environment.",
            "id": "ABT 705",
            "parent": "ABT",
            "title": "ETHICS, SAFETY, AND REGULATORY ENVIRONMENTS IN BIOTECHNOLOGY"
        }
    },
    {
        "data": {
            "description": "Identifies and examines the key regulatory agencies and practices that govern the highly regulated and diverse biotechnology industry, both domestically and internationally. Highlights current and emerging FDA and ICH regulations and guidance documents to successfully navigate meeting with the agencies and to submit required documentation for successful product development.",
            "id": "ABT 740",
            "parent": "ABT",
            "title": "REGULATORY PRACTICE AND COMPLIANCE"
        }
    },
    {
        "data": {
            "description": "Principles and techniques pertaining to biotechnology and its applications to our society. Survey of classical and emerging techniques.",
            "id": "ABT 700",
            "parent": "ABT",
            "title": "PRINCIPLES OF BIOTECHNOLOGY"
        }
    },
    {
        "data": {
            "id": "ABT",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ABT 700",
            "target": "ABT 740"
        }
    },
    {
        "data": {
            "source": "ABT 705",
            "target": "ABT 740"
        }
    },
    {
        "data": {
            "source": "ABT 710",
            "target": "ABT 740"
        }
    }
]