[
    {
        "data": {
            "description": "Examines regulatory environments in risk-based assessment of biotechnological developments in industry, agriculture, and probiotics ensuring consumer and environmental protection. Addresses how validation is essential to the incorporation of emerging technologies into viable, accessible, and successful products. Highlights the stakeholders' role in regulatory oversight and policy through relevant industry case studies.",
            "id": "ABT 745",
            "parent": "ABT",
            "title": "INDUSTRIAL APPLICATIONS IN REGULATORY AFFAIRS"
        }
    },
    {
        "data": {
            "description": "Application and analysis of professional scientific communication, both written and oral. Focuses on designing documents that convey complex, data-rich technical and scientific content to audiences with diverse information needs using a variety of professional genres, including reports, proposals, presentations, and documentation.",
            "id": "ABT 710",
            "parent": "ABT",
            "title": "PROFESSIONAL AND TECHNICAL COMMUNICATION IN BIOTECHNOLOGY"
        }
    },
    {
        "data": {
            "description": "Ethical and safety concerns in development, production, funding, and application of biotechnology. Analysis of socioeconomic impacts. Understanding the importance of data integrity. Overview of risk assessment and management in a regulatory environment designed to ensure safety of workers, study subjects, and patients, and protect intellectual property, data, and the environment.",
            "id": "ABT 705",
            "parent": "ABT",
            "title": "ETHICS, SAFETY, AND REGULATORY ENVIRONMENTS IN BIOTECHNOLOGY"
        }
    },
    {
        "data": {
            "description": "Principles and techniques pertaining to biotechnology and its applications to our society. Survey of classical and emerging techniques.",
            "id": "ABT 700",
            "parent": "ABT",
            "title": "PRINCIPLES OF BIOTECHNOLOGY"
        }
    },
    {
        "data": {
            "id": "ABT",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ABT 700",
            "target": "ABT 745"
        }
    },
    {
        "data": {
            "source": "ABT 705",
            "target": "ABT 745"
        }
    },
    {
        "data": {
            "source": "ABT 710",
            "target": "ABT 745"
        }
    }
]