[
    {
        "data": {
            "description": "Application of federal tax provisions and administrative rules common to most taxpayers with introductions to rules specific to corporations, pass-through entities, and individuals.",
            "id": "ACCTIS 620",
            "parent": "ACCTIS",
            "title": "FUNDAMENTALS OF TAXATION"
        }
    },
    {
        "data": {
            "description": "Examines generally accepted accounting principles for measurement and reporting of financial information in a balance sheet, income statement, and statement of cash flows; introduction to analysis and interpretation of financial accounting data for decision-making purposes.",
            "id": "ACCTIS 100",
            "parent": "ACCTIS",
            "title": "INTRODUCTORY FINANCIAL ACCOUNTING"
        }
    },
    {
        "data": {
            "description": "Federal income taxation; basic rules, theory and policy.",
            "id": "LAW 742",
            "parent": "LAW",
            "title": "TAXATION I"
        }
    },
    {
        "data": {
            "source": "ACCTIS 300",
            "target": "ACCTIS 100"
        }
    },
    {
        "data": {
            "source": "ACCTIS 100",
            "target": "ACCTIS 301"
        }
    },
    {
        "data": {
            "source": "ACCTIS 620",
            "target": "ACCTIS 725"
        }
    },
    {
        "data": {
            "source": "ACCTIS 100",
            "target": "ACCTIS 300"
        }
    },
    {
        "data": {
            "description": "Examines current and emerging financial accounting theory and techniques used to measure and report financial information to investors, creditors, and other external users. Emphasizes asset and income determination, preparation and interpretation of financial statements, and related disclosure requirements.",
            "id": "ACCTIS 301",
            "parent": "ACCTIS",
            "title": "FINANCIAL REPORTING I"
        }
    },
    {
        "data": {
            "id": "ACCTIS",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Examines both financial and managerial accounting for business decisions. Emphasizes preparation and interpretation of financial statements, analysis of financial information, determination of costs for products and services, and use of accounting information for planning and control of business operations.",
            "id": "ACCTIS 300",
            "parent": "ACCTIS",
            "title": "ACCOUNTING PRINCIPLES"
        }
    },
    {
        "data": {
            "source": "ACCTIS 301",
            "target": "ACCTIS 620"
        }
    },
    {
        "data": {
            "id": "LAW",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "LAW 742",
            "target": "ACCTIS 725"
        }
    },
    {
        "data": {
            "description": "An introduction to international tax issues. Topics covered may include tax treaties, foreign tax credit provisions, Subpart F rules, and taxation of inbound investment and business income.",
            "id": "ACCTIS 725",
            "parent": "ACCTIS",
            "title": "ANALYSIS OF INTERNATIONAL TAXATION"
        }
    }
]