[
    {
        "data": {
            "description": "Examines generally accepted accounting principles for measurement and reporting of financial information in a balance sheet, income statement, and statement of cash flows; introduction to analysis and interpretation of financial accounting data for decision-making purposes.",
            "id": "ACCTIS 100",
            "parent": "ACCTIS",
            "title": "INTRODUCTORY FINANCIAL ACCOUNTING"
        }
    },
    {
        "data": {
            "source": "ACCTIS 100",
            "target": "ACCTIS 211"
        }
    },
    {
        "data": {
            "source": "ACCTIS 300",
            "target": "ACCTIS 100"
        }
    },
    {
        "data": {
            "source": "ACCTIS 100",
            "target": "ACCTIS 301"
        }
    },
    {
        "data": {
            "source": "ACCTIS 100",
            "target": "ACCTIS 300"
        }
    },
    {
        "data": {
            "description": "Understand, document, and evaluate integrated enterprise systems and critical information tracked in core business processes, applying technology to model, capture, and query data needed, and assess system design and controls.",
            "id": "ACCTIS 340",
            "parent": "ACCTIS",
            "title": "ACCOUNTING INFORMATION SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Examines current and emerging financial accounting theory and techniques used to measure and report financial information to investors, creditors, and other external users. Emphasizes asset and income determination, preparation and interpretation of financial statements, and related disclosure requirements.",
            "id": "ACCTIS 301",
            "parent": "ACCTIS",
            "title": "FINANCIAL REPORTING I"
        }
    },
    {
        "data": {
            "source": "ACCTIS 211",
            "target": "ACCTIS 340"
        }
    },
    {
        "data": {
            "id": "ACCTIS",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Examines both financial and managerial accounting for business decisions. Emphasizes preparation and interpretation of financial statements, analysis of financial information, determination of costs for products and services, and use of accounting information for planning and control of business operations.",
            "id": "ACCTIS 300",
            "parent": "ACCTIS",
            "title": "ACCOUNTING PRINCIPLES"
        }
    },
    {
        "data": {
            "source": "ACCTIS 301",
            "target": "ACCTIS 340"
        }
    },
    {
        "data": {
            "description": "Managerial accounting concepts relevant for decision-making; use of accounting information for planning, decision-making, and control of business operations in various management and business environments.",
            "id": "ACCTIS 211",
            "parent": "ACCTIS",
            "title": "INTRODUCTORY MANAGERIAL ACCOUNTING"
        }
    }
]