[
    {
        "data": {
            "description": "Design of actual and standard cost systems for reporting product costs in job costing, process costing, and activity costing production environments. Overhead allocation methods. Budgeting and profit planning procedures. Techniques for variance analysis and performance evaluation. Behavioral considerations in the design and use of cost accounting information systems.",
            "id": "ACCTIS 310",
            "parent": "ACCTIS",
            "title": "COST MANAGEMENT SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Development and analysis of accounting data for managerial planning, control, decision-making, and costing, with a focus on the integration of financial and non-financial information needs for various managerial functions.",
            "id": "ACCTIS 771",
            "parent": "ACCTIS",
            "title": "ANALYSIS OF PERFORMANCE MEASUREMENT & CONTROL"
        }
    },
    {
        "data": {
            "description": "Examines both financial and managerial accounting for business decisions. Emphasizes preparation and interpretation of financial statements, analysis of financial information, determination of costs for products and services, and use of accounting information for planning and control of business operations.",
            "id": "ACCTIS 300",
            "parent": "ACCTIS",
            "title": "ACCOUNTING PRINCIPLES"
        }
    },
    {
        "data": {
            "description": "Examines generally accepted accounting principles for measurement and reporting of financial information in a balance sheet, income statement, and statement of cash flows; introduction to analysis and interpretation of financial accounting data for decision-making purposes.",
            "id": "ACCTIS 100",
            "parent": "ACCTIS",
            "title": "INTRODUCTORY FINANCIAL ACCOUNTING"
        }
    },
    {
        "data": {
            "description": "Interpretation and use of accounting data for management planning, decision making and control. Consideration of cost-volume-profit relationships, relevant costs, variable (direct) costing, activity-based costing, transfer pricing and performance evaluation of segments of the firm.",
            "id": "ACCTIS 710",
            "parent": "ACCTIS",
            "title": "MANAGERIAL ACCOUNTING"
        }
    },
    {
        "data": {
            "description": "Managerial accounting concepts relevant for decision-making; use of accounting information for planning, decision-making, and control of business operations in various management and business environments.",
            "id": "ACCTIS 211",
            "parent": "ACCTIS",
            "title": "INTRODUCTORY MANAGERIAL ACCOUNTING"
        }
    },
    {
        "data": {
            "description": "Measurement and reporting guidelines underlying preparation of general purpose financial statements. Explore current measurement and reporting issues. Analyze and interpret financial statement data for investment, lending, and related decisions.",
            "id": "ACCTIS 700",
            "parent": "ACCTIS",
            "title": "FINANCIAL ACCOUNTING"
        }
    },
    {
        "data": {
            "id": "ACCTIS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ACCTIS 100",
            "target": "ACCTIS 211"
        }
    },
    {
        "data": {
            "source": "ACCTIS 100",
            "target": "ACCTIS 300"
        }
    },
    {
        "data": {
            "source": "ACCTIS 211",
            "target": "ACCTIS 310"
        }
    },
    {
        "data": {
            "source": "ACCTIS 300",
            "target": "ACCTIS 100"
        }
    },
    {
        "data": {
            "source": "ACCTIS 310",
            "target": "ACCTIS 771"
        }
    },
    {
        "data": {
            "source": "ACCTIS 700",
            "target": "ACCTIS 710"
        }
    },
    {
        "data": {
            "source": "ACCTIS 710",
            "target": "ACCTIS 771"
        }
    }
]