[
    {
        "data": {
            "description": "Analytics has become an integral part of accounting to support decision making, coordination and control, and compliance with regulations. Being able to identify and pursue relevant questions using data is a critical skill for new hires, as is the ability to successfully communicate one's findings. This pursuit and communication requires a strong facility with a variety of analytics technologies.",
            "id": "ACCTIS 640",
            "parent": "ACCTIS",
            "title": "FOUNDATION IN ACCOUNTING ANALYTICS"
        }
    },
    {
        "data": {
            "description": "Covers the graphs, properties and geometric significance of trigonometric functions of a real variable. Other topics include trigonometric equations and identities, application, trigonometric form of complex numbers, DeMoivre's theorem, and polar and parametric equations. The course also has a significant number of applications, especially related to other disciplines.",
            "id": "MATH 113",
            "parent": "MATH",
            "title": "TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "Build fundamental skills and processes to develop a strong foundation in business analysis utilizing Excel. Learn the fundamentals of data construction, manipulation, summarization, analysis and presentation.",
            "id": "GENBUS 106",
            "parent": "GENBUS",
            "title": "FOUNDATIONAL SKILLS FOR BUSINESS ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Development of quantitative intuition through practical applications and use of analysis tools. Specifically, emphasis will be on how to manage, summarize, explore, and visualize databases. The essentials of probability will be introduced and applied to decision problems where there is uncertainty. Emphasis on hypothesis testing and regression analysis and include an introduction to simulation methods. Throughout, attention will be paid to effective communication of data analysis. The use of business cases will connect the course material to both real world settings and recent advances in data analysis, including big data and data mining.",
            "id": "GENBUS 306",
            "parent": "GENBUS",
            "title": "BUSINESS ANALYTICS I"
        }
    },
    {
        "data": {
            "description": "Emphasis on hands-on experience with many commonly used analytic methodologies using the modeling and optimization tools available on almost every professional desktop. The focus is predictive and prescriptive analytics. Predictive approaches use historical data to infer causal relationships and forecast future outcomes from a given action. Prescriptive methods take this a step further, helping managers formulate decision models that identify optimal actions given a set of circumstances.",
            "id": "GENBUS 307",
            "parent": "GENBUS",
            "title": "BUSINESS ANALYTICS II"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "Examines both financial and managerial accounting for business decisions. Emphasizes preparation and interpretation of financial statements, analysis of financial information, determination of costs for products and services, and use of accounting information for planning and control of business operations.",
            "id": "ACCTIS 300",
            "parent": "ACCTIS",
            "title": "ACCOUNTING PRINCIPLES"
        }
    },
    {
        "data": {
            "description": "Examines generally accepted accounting principles for measurement and reporting of financial information in a balance sheet, income statement, and statement of cash flows; introduction to analysis and interpretation of financial accounting data for decision-making purposes.",
            "id": "ACCTIS 100",
            "parent": "ACCTIS",
            "title": "INTRODUCTORY FINANCIAL ACCOUNTING"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "id": "ACCTIS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "GENBUS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ACCTIS 100",
            "target": "ACCTIS 300"
        }
    },
    {
        "data": {
            "source": "ACCTIS 100",
            "target": "ACCTIS 640"
        }
    },
    {
        "data": {
            "source": "ACCTIS 300",
            "target": "ACCTIS 100"
        }
    },
    {
        "data": {
            "source": "GENBUS 106",
            "target": "GENBUS 306"
        }
    },
    {
        "data": {
            "source": "GENBUS 106",
            "target": "GENBUS 307"
        }
    },
    {
        "data": {
            "source": "GENBUS 306",
            "target": "GENBUS 307"
        }
    },
    {
        "data": {
            "source": "GENBUS 307",
            "target": "ACCTIS 640"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 113"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 113",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "GENBUS 306"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    }
]