[
    {
        "data": {
            "description": "Measurement and reporting guidelines underlying preparation of general purpose financial statements. Explore current measurement and reporting issues. Analyze and interpret financial statement data for investment, lending, and related decisions.",
            "id": "ACCTIS 700",
            "parent": "ACCTIS",
            "title": "FINANCIAL ACCOUNTING"
        }
    },
    {
        "data": {
            "description": "Examines generally accepted accounting principles for measurement and reporting of financial information in a balance sheet, income statement, and statement of cash flows; introduction to analysis and interpretation of financial accounting data for decision-making purposes.",
            "id": "ACCTIS 100",
            "parent": "ACCTIS",
            "title": "INTRODUCTORY FINANCIAL ACCOUNTING"
        }
    },
    {
        "data": {
            "source": "ACCTIS 700",
            "target": "ACCTIS 640"
        }
    },
    {
        "data": {
            "source": "ACCTIS 300",
            "target": "ACCTIS 100"
        }
    },
    {
        "data": {
            "source": "ACCTIS 100",
            "target": "ACCTIS 300"
        }
    },
    {
        "data": {
            "description": "Analytics has become an integral part of accounting to support decision making, coordination and control, and compliance with regulations. Being able to identify and pursue relevant questions using data is a critical skill for new hires, as is the ability to successfully communicate one's findings. This pursuit and communication requires a strong facility with a variety of analytics technologies.",
            "id": "ACCTIS 640",
            "parent": "ACCTIS",
            "title": "FOUNDATION IN ACCOUNTING ANALYTICS"
        }
    },
    {
        "data": {
            "id": "ACCTIS",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Examines both financial and managerial accounting for business decisions. Emphasizes preparation and interpretation of financial statements, analysis of financial information, determination of costs for products and services, and use of accounting information for planning and control of business operations.",
            "id": "ACCTIS 300",
            "parent": "ACCTIS",
            "title": "ACCOUNTING PRINCIPLES"
        }
    },
    {
        "data": {
            "source": "ACCTIS 100",
            "target": "ACCTIS 640"
        }
    }
]