[
    {
        "data": {
            "description": "Continuation ofA F AERO 202. Provides a fundamental understanding of leadership and team building. Discover the many layers to Air Force leadership, such as understanding oneself, listening to others, and being a good follower. Apply these leadership perspectives when completing team building activities and discussing topics such as Full Range Leadership, Problem Solving, and Motivation. Demonstrate basic verbal and written communication skills.",
            "id": "AFAERO 202",
            "parent": "AFAERO",
            "title": "TEAM AND LEADERSHIP FUNDAMENTALS II"
        }
    },
    {
        "data": {
            "description": "Continuation ofA F AERO 301. Provides a fundamental understanding of leadership. Learn about the leadership process with its complex interaction among leaders, followers and circumstances. Focus on developing intermediate to advanced verbal and written communication skills. Cadets apply knowledge in leadership laboratories and other cadet wing activities. Demonstrate intermediate to advanced verbal and written communication skills.",
            "id": "AFAERO 302",
            "parent": "AFAERO",
            "title": "LEADING PEOPLE AND EFFECTIVE COMMUNICATION II"
        }
    },
    {
        "data": {
            "description": "Prepares cadets for life as Second Lieutenants. Covers various human resources topics to prepare each future officer for mid- to upper-level management positions, including evaluation systems, supervision and counseling, and annual training requirements. Become familiar with a myriad of officer responsibilities that they will incur upon joining the Active Duty community. Demonstrate intermediate to advanced verbal and written communication skills.",
            "id": "AFAERO 402",
            "parent": "AFAERO",
            "title": "LEADERSHIP RESPONSIBILITIES & COMMISSIONING PREPARATION"
        }
    },
    {
        "data": {
            "description": "Provides a fundamental understanding of National Security Strategy and the organization of the Department of Defense. Introduces strategic-level thinking by exploring the various domains in which the Air Force operates. Discuss joint operations and the integration of air, space, land and sea forces. Demonstrate intermediate to advanced verbal and written communication skills.",
            "id": "AFAERO 401",
            "parent": "AFAERO",
            "title": "NATIONAL SECURITY AFFAIRS"
        }
    },
    {
        "data": {
            "description": "Provides a fundamental understanding of leadership. Learn about the leadership process with its complex interaction among leaders, followers and circumstances. Focus on developing intermediate to advanced verbal and written communication skills. Cadets apply knowledge in leadership laboratories and other cadet wing activities.",
            "id": "AFAERO 301",
            "parent": "AFAERO",
            "title": "LEADING PEOPLE AND EFFECTIVE COMMUNICATION I"
        }
    },
    {
        "data": {
            "id": "AFAERO",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "AFAERO 202",
            "target": "AFAERO 301"
        }
    },
    {
        "data": {
            "source": "AFAERO 301",
            "target": "AFAERO 302"
        }
    },
    {
        "data": {
            "source": "AFAERO 302",
            "target": "AFAERO 401"
        }
    },
    {
        "data": {
            "source": "AFAERO 401",
            "target": "AFAERO 402"
        }
    }
]