[
    {
        "data": {
            "description": "Introduces foundational texts in the study of modern Africa and the social, political, and economic contexts of the continent's cultural production and productivity. Conceptual explorations of interesting issues such as the African encounter with Europe, anticolonialism, race, racialism, and subjectivity, African and European languages and epistemology, transformations in gendered structures, and the environment, and the circulation and consumption of cultural forms and practices. Examines the long histories and theories of cultural production and practices in Africa, the local/global provenance of forms and styles, and the contexts of their local, national, and global circulation and consumption. Promotes critical thinking by putting like and unlike texts together and considering rhetoric and implied meanings, all in the context of Africa's interactive history with the world in the modern era.",
            "id": "AFRICAN 605",
            "parent": "AFRICAN",
            "title": "ADVANCED TOPICS IN AFRICAN CULTURAL STUDIES"
        }
    },
    {
        "data": {
            "description": "A study of culture and cultural production, circulation, consumption, and meaning making in Africa. Discussions foreground material and imaginative cultural forms and practices-their origins, languages, contents, forms, functions, genres, and audiences. Examines the uses to which particular meanings of culture and its forms are put, by whom, and to what purpose, and how meanings are fought over, reshaped, and reconstituted, and under what conditions those are or can be possible. Surveys the entrenched modes of both conceptual and critical apprehension of the cultural forms and practices (from Negritude to postcolonialism and postmodernism), explores their methods of reading, raises the issue of their linkages to sources in Euro-America, and assesses the extent to which the unique concerns of the biography of culture in Africa (expressed by its creators and scholars) have tried to tame and refashion what are now globally shared critical tools of cultural reading.",
            "id": "AFRICAN 403",
            "parent": "AFRICAN",
            "title": "THEORIES OF AFRICAN CULTURAL STUDIES"
        }
    },
    {
        "data": {
            "description": "Examines various mediated cultural forms such as broadcasting, news, performance, music, film, or social media created and used across regions and countries in Africa, addressing issues such as cultural identity, nation building, constraints on expression, access, and reception, and the interaction of global and African cultural forms.",
            "id": "AFRICAN 405",
            "parent": "AFRICAN",
            "title": "TOPICS IN AFRICAN CULTURAL STUDIES"
        }
    },
    {
        "data": {
            "description": "Introduction to a special topic in African literature, focused on a specific region or genre.",
            "id": "AFRICAN 203",
            "parent": "AFRICAN",
            "title": "INTRODUCTORY TOPICS IN AFRICAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Overview on Arabic cultural production. Develops a historic and critical understanding of Arabic literary traditions, as well as related musical and visual arts, up to the twenty-first century.",
            "id": "AFRICAN 231",
            "parent": "AFRICAN",
            "title": "INTRODUCTION TO ARABIC LITERARY CULTURE"
        }
    },
    {
        "data": {
            "description": "Provides a conceptual focus for the study of various forms of literature from around the African world. Literary forms studied may include novels, drama, poetry, short stories, cinema, and more. Depending on the conceptual focus, texts from a particular region, period, or language may be stressed, or they will coalesce around certain themes, such as modernity, cultural identity, nation building, ideology, globalization, and more.",
            "id": "AFRICAN 406",
            "parent": "AFRICAN",
            "title": "TOPICS IN AFRICAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Studies modern African literature, written in English, and covering various genres such as poetry, the novel, drama, and/or the short story.",
            "id": "AFRICAN 453",
            "parent": "AFRICAN",
            "title": "MODERN AFRICAN LITERATURE IN ENGLISH"
        }
    },
    {
        "data": {
            "description": "Survey of African literary traditions and introduction to literary analysis.",
            "id": "AFRICAN 201",
            "parent": "AFRICAN",
            "title": "INTRODUCTION TO AFRICAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "The oral tradition and the written word; the composition of stories, relationship between performer and audience, and transmission of tradition in various African societies.",
            "id": "AFRICAN/FOLKLORE 210",
            "title": "THE AFRICAN STORYTELLER"
        }
    },
    {
        "data": {
            "id": "AFRICAN",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "AFRICAN 201",
            "target": "AFRICAN 406"
        }
    },
    {
        "data": {
            "source": "AFRICAN 201",
            "target": "AFRICAN 453"
        }
    },
    {
        "data": {
            "source": "AFRICAN 203",
            "target": "AFRICAN 406"
        }
    },
    {
        "data": {
            "source": "AFRICAN 203",
            "target": "AFRICAN 453"
        }
    },
    {
        "data": {
            "source": "AFRICAN 231",
            "target": "AFRICAN 406"
        }
    },
    {
        "data": {
            "source": "AFRICAN 231",
            "target": "AFRICAN 453"
        }
    },
    {
        "data": {
            "source": "AFRICAN 403",
            "target": "AFRICAN 605"
        }
    },
    {
        "data": {
            "source": "AFRICAN 405",
            "target": "AFRICAN 605"
        }
    },
    {
        "data": {
            "source": "AFRICAN 406",
            "target": "AFRICAN 605"
        }
    },
    {
        "data": {
            "source": "AFRICAN 453",
            "target": "AFRICAN 605"
        }
    },
    {
        "data": {
            "source": "AFRICAN/FOLKLORE 210",
            "target": "AFRICAN 406"
        }
    },
    {
        "data": {
            "source": "AFRICAN/FOLKLORE 210",
            "target": "AFRICAN 453"
        }
    }
]