[
    {
        "data": {
            "description": "Introduction to the morphology of Oneida at the most basic level, including the interaction with, and awareness for, Ukwehuwehneha and an Oneida universal perspective. An emphasis on the development of a basic understanding of the syntactic structure of Ukwehuhwehneha and a base vocabulary. Includes the utilization of existing resources, becoming familiar with current best practices for endangered language learning, and building language proficiency.",
            "id": "AMERIND 312",
            "parent": "AMERIND",
            "title": "BEGINNER LEVEL ONEIDA LANGUAGE"
        }
    },
    {
        "data": {
            "description": "Introduction to the morphology of Oneida at the most basic level, including the interaction with, and awareness for, Ukwehuwehneha and an Oneida universal perspective. An emphasis on the development of a basic understanding of the syntactic structure of Ukwehuhwehneha and a base vocabulary. Includes the utilization of existing resources, becoming familiar with current best practices for endangered language learning, and building language proficiency.",
            "id": "AMERIND 313",
            "parent": "AMERIND",
            "title": "BEGINNER LEVEL ONEIDA LANGUAGE II"
        }
    },
    {
        "data": {
            "description": "Learn the sounds and writing system of the language and examine the associated morphology and syntactical verb structures. Develop literacy and an understanding of the unique verb-based polysynthetic sentence structures, and utilize basic conversational skills currently being used among Ukwehuwehneha speakers. Ukwehuwehneha (Oneida) is one of the five Indigenous aboriginal languages spoken in the state of Wisconsin and part of a larger Iroquoian language family found only in North America. Ukwehuwehneha is considered to be a critically endangered language.",
            "id": "AMERIND 411",
            "parent": "AMERIND",
            "title": "INTERMEDIATE LEVEL ONEIDA LANGUAGE"
        }
    },
    {
        "data": {
            "id": "AMERIND",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "AMERIND 312",
            "target": "AMERIND 313"
        }
    },
    {
        "data": {
            "source": "AMERIND 313",
            "target": "AMERIND 411"
        }
    }
]