[
    {
        "data": {
            "description": "Chemistry, nutrition, and metabolism of biological systems.",
            "id": "BIOCHEM 501",
            "parent": "BIOCHEM",
            "title": "INTRODUCTION TO BIOCHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Core organic chemistry concepts of structure, reactivity, and synthesis with regards to the functional groups commonly found in commercial and biological substances. Covers a selection of topics fromCHEM 343and345.",
            "id": "CHEM 341",
            "parent": "CHEM",
            "title": "ELEMENTARY ORGANIC CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Nutrients and their assimilation, function, and interactions that affect metabolism in mammals.  Differences among species will be used to emphasize unique digestive and physiological functions and how these differences affect metabolism of nutrients. Humans will be used in some comparisons. Follows physiological progression of nutrients, starting with an overview of the digestive tract followed by water and builds on specific roles of nutrients and substrates needed to provide basic processes required for maintenance, tissue accretion, and homeostatic regulation of nutrients.",
            "id": "ANSCI/DYSCI/NUTRSCI 311",
            "title": "COMPARATIVE ANIMAL NUTRITION"
        }
    },
    {
        "data": {
            "description": "Principles and application of chemical equilibrium, coordination chemistry, oxidation-reduction and electrochemistry, kinetics, nuclear chemistry, introduction to organic chemistry, and chemistry laboratory skills.",
            "id": "CHEM 104",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Stoichiometry and the mole concept, the behavior of gases, liquids and solids, thermochemistry, electronic structure of atoms and chemical bonding, descriptive chemistry of selected elements and compounds, intermolecular forces, and chemistry laboratory skills.",
            "id": "CHEM 103",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "The two semester sequenceMATH 112-MATH 113covers similar material asMATH 114, but in a slower pace. Not recommended for students with less than an AB inMATH 96.",
            "id": "MATH 114",
            "parent": "MATH",
            "title": "ALGEBRA AND TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Part of a 2-semester sequence withMATH 217; these two courses together are equivalent toMATH 114and221.",
            "id": "MATH 171",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY I"
        }
    },
    {
        "data": {
            "id": "BIOCHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 501",
            "target": "ANSCI/DYSCI/NUTRSCI 311"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 341"
        }
    },
    {
        "data": {
            "source": "CHEM 341",
            "target": "BIOCHEM 501"
        }
    },
    {
        "data": {
            "source": "MATH 114",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 114"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 171"
        }
    }
]