[
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics and selected topics in Animal Physiology.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "General biological principles. Topics include: evolution, ecology, animal behavior, cell structure and function, genetics and molecular genetics and the physiology of a variety of organ systems emphasizing function in humans.",
            "id": "BIOLOGY/ZOOLOGY 101",
            "title": "ANIMAL BIOLOGY"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "PSYCH 450"
        }
    },
    {
        "data": {
            "source": "PSYCH 450",
            "target": "ANTHRO 420"
        }
    },
    {
        "data": {
            "source": "ANTHRO 105",
            "target": "ANTHRO 420"
        }
    },
    {
        "data": {
            "id": "PSYCH",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 101"
        }
    },
    {
        "data": {
            "description": "Explore the psychology and biology of our closest living ancestors and how it can provide insights into human behavior and cognition. Learn how a variety of factors (ecological, evolutionary, developmental, and experiential) shape the variation we see across and within primate species. Topics include investigation of similarities and differences across taxa in development, learning, memory, evolution of the brain, spatial navigation, tool-use, social behavior, parental behavior, communication, self-recognition, and theory of mind, as well as ethical issues and conservation.",
            "id": "PSYCH 450",
            "parent": "PSYCH",
            "title": "PRIMATE PSYCHOLOGY: INSIGHTS INTO HUMAN BEHAVIOR"
        }
    },
    {
        "data": {
            "id": "ANTHRO",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Behavior, including its development, motivation, frustrations, emotion, intelligence, learning, forgetting, personality, language, thinking, and social behavior.",
            "id": "PSYCH 202",
            "parent": "PSYCH",
            "title": "INTRODUCTION TO PSYCHOLOGY"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Genetic basis of morphological, physiological and behavioral variations within and between human populations, and their origins and evolution.",
            "id": "ANTHRO 105",
            "parent": "ANTHRO",
            "title": "PRINCIPLES OF BIOLOGICAL ANTHROPOLOGY"
        }
    },
    {
        "data": {
            "source": "PSYCH 202",
            "target": "PSYCH 450"
        }
    },
    {
        "data": {
            "description": "Supervised research on topics selected by students. Independently design a research project, synthesize methods and empirical results, and report one's findings. Develop the skills necessary for independent research in Primatology.",
            "id": "ANTHRO 420",
            "parent": "ANTHRO",
            "title": "INTRODUCTION TO PRIMATOLOGICAL RESEARCH"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 151"
        }
    }
]