[
    {
        "data": {
            "description": "General understanding of humans in relation to cultures, evolutionary development and racial diversity, capacities for society, and the development of the world's major cultures.",
            "id": "ANTHRO 100",
            "parent": "ANTHRO",
            "title": "GENERAL ANTHROPOLOGY"
        }
    },
    {
        "data": {
            "source": "ANTHRO 100",
            "target": "ANTHRO 340"
        }
    },
    {
        "data": {
            "id": "ANTHRO",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Focuses on music's significant role in the formation and maintenance of Brazilian national identity. Learn how a variety of Brazilian individuals, groups, and institutions have contributed to popular and scholarly debates about Brazilian culture, identity, and forms of belonging. These discussions will be anchored to important themes in Brazil's recent history, present, and imagined future, such as cultural cannibalism (antropofagia), and racial hybridity (mestiçagem). Gain insight into how Brazilian artists and their audiences have debated race and racism through expressive means by analyzing a variety of anthropological and ethnomusicological texts about Brazilian popular music, literature, and its most famous annual ritual, Carnival.",
            "id": "ANTHRO 340",
            "parent": "ANTHRO",
            "title": "MUSIC, RACE, AND CULTURE IN BRAZIL"
        }
    },
    {
        "data": {
            "source": "ANTHRO 104",
            "target": "ANTHRO 340"
        }
    },
    {
        "data": {
            "description": "Introduction to cultural anthropology. Comparative cross-cultural consideration of social organization, economics, politics, language, religion, ecology, gender, and cultural change. Includes a primary focus on U.S. ethnic and racial minorities.",
            "id": "ANTHRO 104",
            "parent": "ANTHRO",
            "title": "CULTURAL ANTHROPOLOGY AND HUMAN DIVERSITY"
        }
    }
]