[
    {
        "data": {
            "description": "Behavior, including its development, motivation, frustrations, emotion, intelligence, learning, forgetting, personality, language, thinking, and social behavior.",
            "id": "PSYCH 202",
            "parent": "PSYCH",
            "title": "INTRODUCTION TO PSYCHOLOGY"
        }
    },
    {
        "data": {
            "description": "Explore the psychology and biology of our closest living ancestors and how it can provide insights into human behavior and cognition. Learn how a variety of factors (ecological, evolutionary, developmental, and experiential) shape the variation we see across and within primate species. Topics include investigation of similarities and differences across taxa in development, learning, memory, evolution of the brain, spatial navigation, tool-use, social behavior, parental behavior, communication, self-recognition, and theory of mind, as well as ethical issues and conservation.",
            "id": "PSYCH 450",
            "parent": "PSYCH",
            "title": "PRIMATE PSYCHOLOGY: INSIGHTS INTO HUMAN BEHAVIOR"
        }
    },
    {
        "data": {
            "description": "General biological principles. Topics include: evolution, ecology, animal behavior, cell structure and function, genetics and molecular genetics and the physiology of a variety of organ systems emphasizing function in humans.",
            "id": "BIOLOGY/ZOOLOGY 101",
            "title": "ANIMAL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Genetic basis of morphological, physiological and behavioral variations within and between human populations, and their origins and evolution.",
            "id": "ANTHRO 105",
            "parent": "ANTHRO",
            "title": "PRINCIPLES OF BIOLOGICAL ANTHROPOLOGY"
        }
    },
    {
        "data": {
            "description": "Primate behavior examined from an evolutionary and ecological perspective, focusing on adaptations to the social and nonsocial environment. Topics include: nepotism, reciprocity, competition, cooperation, sex differences, the ecological role of primates in their communities, cognition, and conservation. Considers the major threats to primates today, and how behavioral adaptations and anthropogenic variables interact to affect the future survival of primates at local, regional, and global scales.",
            "id": "ANTHRO 458",
            "parent": "ANTHRO",
            "title": "PRIMATE BEHAVIORAL ECOLOGY"
        }
    },
    {
        "data": {
            "description": "The relationships of organisms and the environment. Population dynamics and community organization, human-environment relationships, action programs.",
            "id": "BOTANY/ENVIRST/ZOOLOGY 260",
            "title": "INTRODUCTORY ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics and selected topics in Animal Physiology.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "id": "ANTHRO",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "PSYCH",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ANTHRO 105",
            "target": "ANTHRO 458"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 101"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 151"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "PSYCH 450"
        }
    },
    {
        "data": {
            "source": "BOTANY/ENVIRST/ZOOLOGY 260",
            "target": "ANTHRO 458"
        }
    },
    {
        "data": {
            "source": "PSYCH 202",
            "target": "PSYCH 450"
        }
    },
    {
        "data": {
            "source": "PSYCH 450",
            "target": "ANTHRO 458"
        }
    }
]