[
    {
        "data": {
            "description": "Explores the ways in which humans have used of rocks and associated minerals, i.e. lithics and lapidary technology, to create utilitarian as well as ornamental objects in the past and the present.  Explores gender roles in lithic technology and how specific technologies were used to create utilitarian as well as ornamental and symbolic objects. Gain a new perspective of the critical role of lithic technologies in long term human adaptive strategies as well as in ornament and symbolic art.",
            "id": "ANTHRO 337",
            "parent": "ANTHRO",
            "title": "LITHICS AND ARCHAEOLOGY"
        }
    },
    {
        "data": {
            "description": "Introduction to the ancient world from origins of human culture to the beginnings of written history as revealed by archaeological research at great sites and ruins around the globe. Archaeological analyses of important sites as case studies to illustrate concepts and techniques used by archaeologists in their efforts to understand the diversity of the human past.",
            "id": "ANTHRO 102",
            "parent": "ANTHRO",
            "title": "ARCHAEOLOGY AND THE PREHISTORIC WORLD"
        }
    },
    {
        "data": {
            "description": "Introduction to the methods, historical development, and scientific principles of archaeology. Discover how archaeologists generate and interpret information about the human past. Introduces scientific inquiry and provides a foundation for pursuing advanced archaeological courses and field research.",
            "id": "ANTHRO 212",
            "parent": "ANTHRO",
            "title": "PRINCIPLES OF ARCHAEOLOGY"
        }
    },
    {
        "data": {
            "id": "ANTHRO",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ANTHRO 102",
            "target": "ANTHRO 337"
        }
    },
    {
        "data": {
            "source": "ANTHRO 212",
            "target": "ANTHRO 337"
        }
    }
]