[
    {
        "data": {
            "description": "An introduction to a range of digital media techniques for artists and designers, including digital imaging, vector graphics, web design and 3D digital modeling.  Emphasis on creative development along with technical skill building.",
            "id": "ART 107",
            "parent": "ART",
            "title": "INTRODUCTION TO DIGITAL FORMS"
        }
    },
    {
        "data": {
            "description": "Examines the major developments in graphic design and typography as the fields slowly emerged and began to define themselves during the 19th, 20th, and 21st centuries.",
            "id": "ART 438",
            "parent": "ART",
            "title": "HISTORY OF GRAPHIC DESIGN AND TYPOGRAPHY"
        }
    },
    {
        "data": {
            "description": "Introduces the basic principles of graphic design. Develop an initial understanding of formal, conceptual, and technical aspects of the field. Emphasis will be given to the importance of working process, presentation and craftsmanship.",
            "id": "ART 346",
            "parent": "ART",
            "title": "BASIC GRAPHIC DESIGN"
        }
    },
    {
        "data": {
            "description": "Introduction to user-centered, responsive web design for mobile, tablet, and laptop. Write HTML, CSS, and Javascript directly to design and develop fully responsive websites.",
            "id": "ART 333",
            "parent": "ART",
            "title": "INTRO TO RESPONSIVE WEB DESIGN"
        }
    },
    {
        "data": {
            "description": "Provides an introduction to the fundamentals of two-dimensional design. Develop a clear understanding of visual communication through problem-solving and formal and conceptual experimentation. Learn the elements and principles of design and manipulate those using analog and digital processes. Introduction to the Adobe Creative Suite of products, including InDesign, Illustrator, and (to a lesser degree) Photoshop. Serves as an introduction to professional presentation skills and techniques to hone craftsmanship.",
            "id": "ART 102",
            "parent": "ART",
            "title": "TWO-DIMENSIONAL DESIGN"
        }
    },
    {
        "data": {
            "id": "ART",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ART 102",
            "target": "ART 346"
        }
    },
    {
        "data": {
            "source": "ART 102",
            "target": "ART 438"
        }
    },
    {
        "data": {
            "source": "ART 107",
            "target": "ART 333"
        }
    },
    {
        "data": {
            "source": "ART 346",
            "target": "ART 333"
        }
    },
    {
        "data": {
            "source": "ART 346",
            "target": "ART 438"
        }
    },
    {
        "data": {
            "source": "ART 438",
            "target": "ART 333"
        }
    }
]