[
    {
        "data": {
            "description": "Examines the major developments in graphic design and typography as the fields slowly emerged and began to define themselves during the 19th, 20th, and 21st centuries.",
            "id": "ART 438",
            "parent": "ART",
            "title": "HISTORY OF GRAPHIC DESIGN AND TYPOGRAPHY"
        }
    },
    {
        "data": {
            "description": "Focuses on developing an understanding of design processes through the utilization of specific fabrication materials and methods. Experience is gained in giving form to objects and products. Prototyping techniques and digital design tools will be explored. In addition, investigates the movements in the history of product design and the development of materials, production, technologies, consumption and other social and cultural concerns that impact the field. A special focus on the identification and use of sustainable materials and processes.",
            "id": "ART 558",
            "parent": "ART",
            "title": "PRODUCT DEVELOPMENT FOR GRAPHIC DESIGN"
        }
    },
    {
        "data": {
            "description": "Introduces the basic principles of graphic design. Develop an initial understanding of formal, conceptual, and technical aspects of the field. Emphasis will be given to the importance of working process, presentation and craftsmanship.",
            "id": "ART 346",
            "parent": "ART",
            "title": "BASIC GRAPHIC DESIGN"
        }
    },
    {
        "data": {
            "description": "Provides an introduction to the fundamentals of two-dimensional design. Develop a clear understanding of visual communication through problem-solving and formal and conceptual experimentation. Learn the elements and principles of design and manipulate those using analog and digital processes. Introduction to the Adobe Creative Suite of products, including InDesign, Illustrator, and (to a lesser degree) Photoshop. Serves as an introduction to professional presentation skills and techniques to hone craftsmanship.",
            "id": "ART 102",
            "parent": "ART",
            "title": "TWO-DIMENSIONAL DESIGN"
        }
    },
    {
        "data": {
            "id": "ART",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ART 102",
            "target": "ART 346"
        }
    },
    {
        "data": {
            "source": "ART 102",
            "target": "ART 438"
        }
    },
    {
        "data": {
            "source": "ART 102",
            "target": "ART 558"
        }
    },
    {
        "data": {
            "source": "ART 346",
            "target": "ART 438"
        }
    },
    {
        "data": {
            "source": "ART 346",
            "target": "ART 558"
        }
    },
    {
        "data": {
            "source": "ART 438",
            "target": "ART 558"
        }
    }
]