[
    {
        "data": {
            "description": "Builds on the work begun in Making Comics 1. Students will already be comfortable working on deadline, with applying previous comics-making experience to a variety of story styles, both fictional and non-fictional, and with using a variety of materials. This class is just as rigorous and demanding as Art 307. You'll be required to write and draw in your journal every day. Homework is substantial. Students will finish a 3-4 page comic strip each week, even when feeling uninspired. Readings will include more long-form comics. Students will identify a theme present in their own work to be explored through drawing and writing. In the last part of the semester, students will create a 'zine with a focused narrative. It will be an original, reproducible, handmade book of at least 32 pages, comprised of both visual and written elements. Everything created will be drawn, painted and written by hand.",
            "id": "ART 507",
            "parent": "ART",
            "title": "MAKING COMICS 2"
        }
    },
    {
        "data": {
            "description": "An introduction to making comics as both a subject and means of academic inquiry. This is a rigorous class and the workload is substantial. Students will learn a variety of ways of making pictures and stories using materials that will vary over the course of the semester. Final project will be an original, reproducible, handmade book of at least 32 pages, based on the stories or comics or characters created during the semester. No previous drawing experience necessary, but must be eager to draw seven days per week throughout the duration of the course.",
            "id": "ART 307",
            "parent": "ART",
            "title": "MAKING COMICS 1"
        }
    },
    {
        "data": {
            "id": "ART",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ART 307",
            "target": "ART 507"
        }
    }
]