[
    {
        "data": {
            "description": "A project-based introduction to the examination of user experience, and is oriented toward practical methods for approaching a design problem. The focus of the course is to develop conceptual design based on the needs of users. Students will receive grounding in user research methods, design sketching, and design validation.",
            "id": "ART 575",
            "parent": "ART",
            "title": "USER EXPERIENCE FOR GRAPHIC DESIGN"
        }
    },
    {
        "data": {
            "description": "An introduction to a range of digital media techniques for artists and designers, including digital imaging, vector graphics, web design and 3D digital modeling.  Emphasis on creative development along with technical skill building.",
            "id": "ART 107",
            "parent": "ART",
            "title": "INTRODUCTION TO DIGITAL FORMS"
        }
    },
    {
        "data": {
            "description": "Introduces the basic principles of graphic design. Develop an initial understanding of formal, conceptual, and technical aspects of the field. Emphasis will be given to the importance of working process, presentation and craftsmanship.",
            "id": "ART 346",
            "parent": "ART",
            "title": "BASIC GRAPHIC DESIGN"
        }
    },
    {
        "data": {
            "description": "Provides an introduction to the fundamentals of two-dimensional design. Develop a clear understanding of visual communication through problem-solving and formal and conceptual experimentation. Learn the elements and principles of design and manipulate those using analog and digital processes. Introduction to the Adobe Creative Suite of products, including InDesign, Illustrator, and (to a lesser degree) Photoshop. Serves as an introduction to professional presentation skills and techniques to hone craftsmanship.",
            "id": "ART 102",
            "parent": "ART",
            "title": "TWO-DIMENSIONAL DESIGN"
        }
    },
    {
        "data": {
            "id": "ART",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ART 102",
            "target": "ART 346"
        }
    },
    {
        "data": {
            "source": "ART 102",
            "target": "ART 575"
        }
    },
    {
        "data": {
            "source": "ART 107",
            "target": "ART 346"
        }
    },
    {
        "data": {
            "source": "ART 346",
            "target": "ART 575"
        }
    }
]