[
    {
        "data": {
            "description": "Examination of current artists' motivations, intentions, and processes and their relationship to general developments in contemporary art.",
            "id": "ART 208",
            "parent": "ART",
            "title": "CURRENT DIRECTIONS IN ART"
        }
    },
    {
        "data": {
            "description": "An introduction to a range of digital media techniques for artists and designers, including digital imaging, vector graphics, web design and 3D digital modeling.  Emphasis on creative development along with technical skill building.",
            "id": "ART 107",
            "parent": "ART",
            "title": "INTRODUCTION TO DIGITAL FORMS"
        }
    },
    {
        "data": {
            "description": "An introduction to time-based art forms including video, installation, and visual art performance.",
            "id": "ART 318",
            "parent": "ART",
            "title": "INTRODUCTION TO VIDEO, PERFORMANCE & INSTALLATION ART"
        }
    },
    {
        "data": {
            "description": "Principles and techniques in video art.",
            "id": "ART 518",
            "parent": "ART",
            "title": "ARTIST'S VIDEO"
        }
    },
    {
        "data": {
            "description": "Seek answers to the fundamental question \"What is art?\" from multiple perspectives such as historical, theoretical, critical, conceptual, formal, and experiential. Develop visual literacy, sophisticated observational skills and a formal language to assist in the interpretation of objects and experiences in the context of art. Through both theory and practice, develop an understanding of the ways artists arrive at the ideas that inform their creative processes. Includes a survey of developments in art media and looks broadly at art movements, trends and styles throughout history and in varied world cultures.",
            "id": "ART 100",
            "parent": "ART",
            "title": "INTRODUCTION TO ART"
        }
    },
    {
        "data": {
            "id": "ART",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ART 100",
            "target": "ART 318"
        }
    },
    {
        "data": {
            "source": "ART 107",
            "target": "ART 318"
        }
    },
    {
        "data": {
            "source": "ART 208",
            "target": "ART 518"
        }
    },
    {
        "data": {
            "source": "ART 318",
            "target": "ART 518"
        }
    }
]