[
    {
        "data": {
            "description": "Advanced level drawing course taught in a structured format where students work on various problems/issues in drawing.",
            "id": "ART 512",
            "parent": "ART",
            "title": "ADVANCED DRAWING I"
        }
    },
    {
        "data": {
            "description": "Apply the elements of drawing to more exploratory drawing methods and explore a wide variety of drawing concepts and applications in the context of Modern and Contemporary Art. Provides foundational skillsets for drawing and painting, printmaking and book art.",
            "id": "ART 212",
            "parent": "ART",
            "title": "DRAWING FOUNDATIONS"
        }
    },
    {
        "data": {
            "description": "Introduction to basic drawing. Core elements of drawing such as the use of line, shape, composition, space, perspective, value, and texture. Provides foundational skillsets for drawing.",
            "id": "ART 112",
            "parent": "ART",
            "title": "DRAWING FOR NON-ART MAJORS"
        }
    },
    {
        "data": {
            "description": "Seek answers to the fundamental question \"What is art?\" from multiple perspectives such as historical, theoretical, critical, conceptual, formal, and experiential. Develop visual literacy, sophisticated observational skills and a formal language to assist in the interpretation of objects and experiences in the context of art. Through both theory and practice, develop an understanding of the ways artists arrive at the ideas that inform their creative processes. Includes a survey of developments in art media and looks broadly at art movements, trends and styles throughout history and in varied world cultures.",
            "id": "ART 100",
            "parent": "ART",
            "title": "INTRODUCTION TO ART"
        }
    },
    {
        "data": {
            "description": "The exploration of conceptual drawing in various media. Emphasis on conceptual/formal solutions.",
            "id": "ART 312",
            "parent": "ART",
            "title": "INTERMEDIATE DRAWING I"
        }
    },
    {
        "data": {
            "id": "ART",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ART 100",
            "target": "ART 512"
        }
    },
    {
        "data": {
            "source": "ART 112",
            "target": "ART 212"
        }
    },
    {
        "data": {
            "source": "ART 212",
            "target": "ART 312"
        }
    },
    {
        "data": {
            "source": "ART 312",
            "target": "ART 512"
        }
    }
]