[
    {
        "data": {
            "description": "Further investigation into anatomical structure and intrinsic forms involved in drawing from different models. Development of concepts and technique.",
            "id": "ART 332",
            "parent": "ART",
            "title": "LIFE DRAWING II"
        }
    },
    {
        "data": {
            "source": "ART 532",
            "target": "ART 632"
        }
    },
    {
        "data": {
            "description": "Further examination of the percepts of drawing with the human figure. Emphasis on formal elements. Problems of structure. Intense studio practice working from the model.",
            "id": "ART 532",
            "parent": "ART",
            "title": "ADVANCED LIFE DRAWING I"
        }
    },
    {
        "data": {
            "source": "ART 112",
            "target": "ART 212"
        }
    },
    {
        "data": {
            "description": "To develop perceptions, use of perspective, line, light and dark, development of space, and expressive qualities in drawing.",
            "id": "ART 112",
            "parent": "ART",
            "title": "DRAWING I"
        }
    },
    {
        "data": {
            "id": "ART",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ART 212",
            "target": "ART 232"
        }
    },
    {
        "data": {
            "source": "ART 100",
            "target": "ART 232"
        }
    },
    {
        "data": {
            "source": "ART 232",
            "target": "ART 332"
        }
    },
    {
        "data": {
            "source": "ART 332",
            "target": "ART 532"
        }
    },
    {
        "data": {
            "description": "Explore the drawing process through projects that address one or more formal, technical, and/or conceptual issues. The concept of drawing as a vehicle for conveying ideas will be addressed through the study of composition, illusional space, perspective and proportion, and the analysis of form.",
            "id": "ART 212",
            "parent": "ART",
            "title": "DRAWING METHODS & CONCEPTS"
        }
    },
    {
        "data": {
            "description": "Advanced work and examination of the percepts of drawing with the human figure. Emphasis on conceptual development in conversation with contemporary life drawing practices.",
            "id": "ART 632",
            "parent": "ART",
            "title": "ADVANCED LIFE DRAWING II"
        }
    },
    {
        "data": {
            "description": "Seek answers to the fundamental question \"What is art?\" from multiple perspectives such as historical, theoretical, critical, conceptual, formal, and experiential. Develop visual literacy, sophisticated observational skills and a formal language to assist in the interpretation of objects and experiences in the context of art. Through both theory and practice, develop an understanding of the ways artists arrive at the ideas that inform their creative processes. Includes a survey of developments in art media and looks broadly at art movements, trends and styles throughout history and in varied world cultures.",
            "id": "ART 100",
            "parent": "ART",
            "title": "INTRODUCTION TO ART"
        }
    },
    {
        "data": {
            "description": "Anatomical structure and intrinsic forms involved in drawing from different models. Development of technical control in a range of media.",
            "id": "ART 232",
            "parent": "ART",
            "title": "LIFE DRAWING I"
        }
    }
]