[
    {
        "data": {
            "source": "ART 346",
            "target": "ART 563"
        }
    },
    {
        "data": {
            "source": "ART 102",
            "target": "ART 346"
        }
    },
    {
        "data": {
            "id": "ART",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "An introduction to a range of digital media techniques for artists and designers, including digital imaging, vector graphics, web design and 3D digital modeling.  Emphasis on creative development along with technical skill building.",
            "id": "ART 107",
            "parent": "ART",
            "title": "INTRODUCTION TO DIGITAL FORMS"
        }
    },
    {
        "data": {
            "description": "Game design is a subdiscipline in which graphic designers create meaningful play and interactive experience through words, images, structure, process, and the study of user experience. This course, which explores both digital and non-digital games, aims to provide you with a critical vocabulary and historical context for analyzing games, as well as the skills and techniques necessary to incorporate game design into your ongoing design practice.",
            "id": "ART 563",
            "parent": "ART",
            "title": "GRAPHIC DESIGN FOR GAMES"
        }
    },
    {
        "data": {
            "source": "ART 102",
            "target": "ART 563"
        }
    },
    {
        "data": {
            "source": "ART 107",
            "target": "ART 346"
        }
    },
    {
        "data": {
            "description": "Provides an introduction to the fundamentals of two-dimensional design. Develop a clear understanding of visual communication through problem-solving and formal and conceptual experimentation. Learn the elements and principles of design and manipulate those using analog and digital processes. Introduction to the Adobe Creative Suite of products, including InDesign, Illustrator, and (to a lesser degree) Photoshop. Serves as an introduction to professional presentation skills and techniques to hone craftsmanship.",
            "id": "ART 102",
            "parent": "ART",
            "title": "TWO-DIMENSIONAL DESIGN"
        }
    },
    {
        "data": {
            "description": "Introduces the basic principles of graphic design. Develop an initial understanding of formal, conceptual, and technical aspects of the field. Emphasis will be given to the importance of working process, presentation and craftsmanship.",
            "id": "ART 346",
            "parent": "ART",
            "title": "BASIC GRAPHIC DESIGN"
        }
    }
]