[
    {
        "data": {
            "description": "Further practice in reading and writing. Extensive as well as intensive readings in contemporary texts. Conducted in Korean. Students with prior experience in the language are required to take a placement test administered by the department. Not open to students with credit for E ASIAN 348 prior to Summer 2019",
            "id": "ASIALANG 305",
            "parent": "ASIALANG",
            "title": "FIFTH SEMESTER KOREAN"
        }
    },
    {
        "data": {
            "description": "Further practice in reading and writing. Extensive as well as intensive readings in contemporary texts. Conducted in Korean. Students with prior experience in the language are required to take a placement test administered by the department. Not open to students with credit for E ASIAN 348 prior to Summer 2019",
            "id": "ASIALANG 306",
            "parent": "ASIALANG",
            "title": "SIXTH SEMESTER KOREAN"
        }
    },
    {
        "data": {
            "source": "ASIALANG 105",
            "target": "ASIALANG 106"
        }
    },
    {
        "data": {
            "source": "ASIALANG 206",
            "target": "ASIALANG 305"
        }
    },
    {
        "data": {
            "source": "ASIALANG 305",
            "target": "ASIALANG 306"
        }
    },
    {
        "data": {
            "source": "ASIALANG 106",
            "target": "ASIALANG 205"
        }
    },
    {
        "data": {
            "id": "ASIALANG",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Further practice in speaking, reading and writing Korean. Students with prior experience in the language are required to take a placement test administered by the department. Not open to students with credit for E ASIAN 346 prior to Summer 2019.",
            "id": "ASIALANG 206",
            "parent": "ASIALANG",
            "title": "FOURTH SEMESTER KOREAN"
        }
    },
    {
        "data": {
            "description": "Improve listening comprehension, media literacy, speaking, and writing skills. Using various genres of audio-visual media materials, including drama, news, documentaries, talk/variety shows, and advertisements, gain a deeper understanding of contemporary Korean society and culture. Develop listening comprehension skills by watching and listening to authentic Korean media content. Analyze media content critically and develop media literacy skills. Practice speaking and writing skills through engaging discussions and assignments.",
            "id": "ASIALANG 456",
            "parent": "ASIALANG",
            "title": "ADVANCED KOREAN THROUGH AUDIO-VISUAL MEDIA"
        }
    },
    {
        "data": {
            "source": "ASIALANG 205",
            "target": "ASIALANG 206"
        }
    },
    {
        "data": {
            "description": "Focus on two areas of Korean language learning (listening  speaking) so that students can understand and express themselves in contemporary Korean. Students with prior experience in the language are required to take a placement test administered by the department. Not open to students with credit for E ASIAN 345 prior to Summer 2019.",
            "id": "ASIALANG 205",
            "parent": "ASIALANG",
            "title": "THIRD SEMESTER KOREAN"
        }
    },
    {
        "data": {
            "description": "Essentials of modern spoken and written Korean. Students with prior experience in the language are required to take a placement test administered by the department. Not open to students with credit for E ASIAN 106 prior to Summer 2019",
            "id": "ASIALANG 106",
            "parent": "ASIALANG",
            "title": "SECOND SEMESTER KOREAN"
        }
    },
    {
        "data": {
            "description": "Provides students with basic conversation skills and grammatical patterns, assuming that students have no or little previous background knowledge of the Korean language. The learning goal of the course is to equip students with communicative skills in speaking, listening, reading, and writing at a basic level in Korean; Using contemporary standard Korean, students will learn how to express simple ideas such as attributes, identities, locations, time, daily activities, weekend plan, desires, as well as how to combine simple ideas in a various way. Not open to students who completed E ASIAN 105 prior to summer 2019.",
            "id": "ASIALANG 105",
            "parent": "ASIALANG",
            "title": "FIRST SEMESTER KOREAN"
        }
    },
    {
        "data": {
            "source": "ASIALANG 306",
            "target": "ASIALANG 456"
        }
    }
]