[
    {
        "data": {
            "description": "Introduces intermediate-level communication skills in varying Chinese settings. Students will learn a wide range of vocabulary, grammar structure and pragmatic usage in situated dialogues. They will improve four language skills (listening, speaking, reading and writing) and pragmatic competence through interactive and meaningful in-class activities and after-class assignments. Students with prior experience in the language are required to take a placement test administered by the department.",
            "id": "ASIALANG 201",
            "parent": "ASIALANG",
            "title": "THIRD SEMESTER CHINESE"
        }
    },
    {
        "data": {
            "description": "Introduces learners of Chinese to the culture, commerce, and etiquette in the Chinese society. Students will acquire a working knowledge of the vocabulary and expressions that are essential for business transactions. They will also learn culturally applicable business strategies and understand Chinese people's expectations, concerns and needs. Students with prior experience in the language are required to take a placement test administered by the department. Not open to students with credit for E ASIAN 379 prior to Fall 2019.",
            "id": "ASIALANG 379",
            "parent": "ASIALANG",
            "title": "BUSINESS CHINESE"
        }
    },
    {
        "data": {
            "source": "ASIALANG 202",
            "target": "ASIALANG 301"
        }
    },
    {
        "data": {
            "description": "Introduces the basic grammar along with 400 Chinese characters of standard spoken Chinese. Students with prior experience in the language are required to take a placement test administered by the department.",
            "id": "ASIALANG 102",
            "parent": "ASIALANG",
            "title": "SECOND SEMESTER CHINESE"
        }
    },
    {
        "data": {
            "id": "ASIALANG",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ASIALANG 102",
            "target": "ASIALANG 201"
        }
    },
    {
        "data": {
            "source": "ASIALANG 301",
            "target": "ASIALANG 379"
        }
    },
    {
        "data": {
            "description": "Selections principally from materials in modern Chinese society, to expose students to reading a variety of topics and styles. Classes conducted in Chinese. Students with prior experience in the language are required to take a placement test administered by the department. Not open to students with credit for E ASIAN 301 prior to Fall 2019.",
            "id": "ASIALANG 301",
            "parent": "ASIALANG",
            "title": "FIFTH SEMESTER CHINESE"
        }
    },
    {
        "data": {
            "description": "Introduction to the fundamental phonetic system and grammar of standard spoken Chinese along with 200 characters. Students with prior experience in the language are required to take a placement test administered by the department.",
            "id": "ASIALANG 111",
            "parent": "ASIALANG",
            "title": "ELEMENTARY CHINESE II"
        }
    },
    {
        "data": {
            "description": "Introduction to the fundamental phonetic system and grammar of standard spoken Chinese along with 200 characters. Not open to students with credit forASIALANG 101(or E ASIAN 101 or 121 prior to Fall 2019).",
            "id": "ASIALANG 110",
            "parent": "ASIALANG",
            "title": "ELEMENTARY CHINESE I"
        }
    },
    {
        "data": {
            "source": "ASIALANG 111",
            "target": "ASIALANG 102"
        }
    },
    {
        "data": {
            "description": "Introduces intermediate-level communication skills in varying Chinese settings. Students will learn a wide range of vocabulary, grammar structure and pragmatic usage in situated dialogues. They will improve four language skills (listening, speaking, reading and writing) and pragmatic competence through interactive and meaningful in-class activities and after-class assignments. Students with prior experience in the language are required to take a placement test administered by the department.",
            "id": "ASIALANG 202",
            "parent": "ASIALANG",
            "title": "FOURTH SEMESTER CHINESE"
        }
    },
    {
        "data": {
            "source": "ASIALANG 201",
            "target": "ASIALANG 202"
        }
    },
    {
        "data": {
            "source": "ASIALANG 110",
            "target": "ASIALANG 111"
        }
    }
]