[
    {
        "data": {
            "source": "ASIALANG 356",
            "target": "ASIALANG 357"
        }
    },
    {
        "data": {
            "id": "ASIALANG",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ASIALANG 355",
            "target": "ASIALANG 356"
        }
    },
    {
        "data": {
            "description": "Graduate students enrolled in this course attend, and complete all assigned coursework, for one of the second-semester Asian languages offered by the department (Burmese, Chinese, Filipino, Hindi, Hmong, Indonesian, Japanese, Khmer, Korean, Persian, Sanskrit, Thai, Tibetan, Urdu, Vietnamese). In addition, graduate students develop vocabulary lists and other target language materials linked to individual research goals, and reflect both in oral discussion and in writing on progress towards research and professional language learning goals, and will have additional regular meetings with the instructor or supervisor. May be repeated if enrolled in a different language.",
            "id": "ASIALANG 356",
            "parent": "ASIALANG",
            "title": "SECOND SEMESTER ASIAN LANGUAGE FOR GRADUATE STUDENTS"
        }
    },
    {
        "data": {
            "description": "Graduate students enrolled in this course attend, and complete all assigned coursework, for one of the first-semester Asian languages offered by the department (Burmese, Chinese, Filipino, Hindi, Hmong, Indonesian, Japanese, Khmer, Korean, Persian, Sanskrit, Thai, Tibetan, Urdu, Vietnamese). In addition, graduate students develop vocabulary lists and other target language materials linked to individual research goals, and reflect both in oral discussion and in writing on progress towards research and professional language learning goals. Graduate students will have additional regular meetings with the instructor or supervisor. May be repeated if enrolled in a different language.",
            "id": "ASIALANG 355",
            "parent": "ASIALANG",
            "title": "FIRST SEMESTER ASIAN LANGUAGE FOR GRADUATE STUDENTS"
        }
    },
    {
        "data": {
            "description": "Graduate students enrolled in this course attend, and complete all assigned coursework, for one of the third-semester Asian languages offered by the department (Burmese, Chinese, Filipino, Hindi, Hmong, Indonesian, Japanese, Khmer, Korean, Persian, Sanskrit, Thai, Tibetan, Urdu, Vietnamese). In addition, graduate students develop field work interview scripts, simple research proposals, or other intermediate target language materials linked to individual research goals, and reflect both in oral discussion and in writing on progress towards research and professional language learning goals. Graduate students will have additional regular meetings with the instructor or supervisor. Students with prior experience in the language are required to take a placement test administered by the department. May be repeated if enrolled in a different language.",
            "id": "ASIALANG 357",
            "parent": "ASIALANG",
            "title": "THIRD SEMESTER ASIAN LANGUAGE FOR GRADUATE STUDENTS"
        }
    }
]