[
    {
        "data": {
            "description": "Proficiency at the advanced level in listening, speaking, reading and writing, using communicative approaches. Students with prior experience in the language are required to take a placement test administered by the department. Not open to students with credit for LCA LANG 571 prior to Fall 2019.",
            "id": "ASIALANG 339",
            "parent": "ASIALANG",
            "title": "FIFTH SEMESTER URDU"
        }
    },
    {
        "data": {
            "description": "Proficiency at the advanced level in listening, speaking, reading and writing, using communicative approaches. Students with prior experience in the language are required to take a placement test administered by the department. Not open to students with credit for LCA LANG 572 prior to Fall 2019.",
            "id": "ASIALANG 340",
            "parent": "ASIALANG",
            "title": "SIXTH SEMESTER URDU"
        }
    },
    {
        "data": {
            "description": "Proficiency at the elementary level in listening, speaking, reading and writing, using communicative approaches. Not open to students with credit for LCA LANG 371 prior to Fall 2019.",
            "id": "ASIALANG 139",
            "parent": "ASIALANG",
            "title": "FIRST SEMESTER URDU"
        }
    },
    {
        "data": {
            "description": "Proficiency at the elementary level in listening, speaking, reading and writing, using communicative approaches. Students with prior experience in the language are required to take a placement test administered by the department. Not open to students with credit for LCA LANG 372 prior to Fall 2019.",
            "id": "ASIALANG 140",
            "parent": "ASIALANG",
            "title": "SECOND SEMESTER URDU"
        }
    },
    {
        "data": {
            "description": "Proficiency at the intermediate level in listening, speaking, reading and writing, using communicative approaches. Students with prior experience in the language are required to take a placement test administered by the department. Not open to students with credit for LCA LANG 471 prior to Fall 2019.",
            "id": "ASIALANG 239",
            "parent": "ASIALANG",
            "title": "THIRD SEMESTER URDU"
        }
    },
    {
        "data": {
            "description": "Proficiency at the intermediate level in listening, speaking, reading and writing, using communicative approaches.",
            "id": "ASIALANG 240",
            "parent": "ASIALANG",
            "title": "FOURTH SEMESTER URDU"
        }
    },
    {
        "data": {
            "id": "ASIALANG",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ASIALANG 139",
            "target": "ASIALANG 140"
        }
    },
    {
        "data": {
            "source": "ASIALANG 140",
            "target": "ASIALANG 239"
        }
    },
    {
        "data": {
            "source": "ASIALANG 239",
            "target": "ASIALANG 240"
        }
    },
    {
        "data": {
            "source": "ASIALANG 240",
            "target": "ASIALANG 339"
        }
    },
    {
        "data": {
            "source": "ASIALANG 339",
            "target": "ASIALANG 340"
        }
    }
]