[
    {
        "data": {
            "description": "Proficiency at the advanced level in listening, speaking, reading and writing, using communicative approaches. Students with prior experience in the language are required to take a placement test administered by the department. Not open to students with credit for LCA LANG 507 prior to Fall 2019.",
            "id": "ASIALANG 325",
            "parent": "ASIALANG",
            "title": "FIFTH SEMESTER HMONG"
        }
    },
    {
        "data": {
            "description": "Proficiency at the elementary level in listening, speaking, reading and writing, using communicative approaches. Students with prior experience in the language are required to take a placement test administered by the department. Not open to students with credit for LCA LANG 308 prior to Fall 2019.",
            "id": "ASIALANG 126",
            "parent": "ASIALANG",
            "title": "SECOND SEMESTER HMONG"
        }
    },
    {
        "data": {
            "source": "ASIALANG 325",
            "target": "ASIALANG 326"
        }
    },
    {
        "data": {
            "source": "ASIALANG 226",
            "target": "ASIALANG 325"
        }
    },
    {
        "data": {
            "id": "ASIALANG",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ASIALANG 225",
            "target": "ASIALANG 226"
        }
    },
    {
        "data": {
            "source": "ASIALANG 125",
            "target": "ASIALANG 126"
        }
    },
    {
        "data": {
            "description": "Proficiency at the elementary level in listening, speaking, reading and writing, using communicative approaches. Not open to students with credit for LCA LANG 307 prior to Fall 2019.",
            "id": "ASIALANG 125",
            "parent": "ASIALANG",
            "title": "FIRST SEMESTER HMONG"
        }
    },
    {
        "data": {
            "description": "Proficiency at the intermediate level in listening, speaking, reading and writing, using communicative approaches. Students with prior experience in the language are required to take a placement test administered by the department. Not open to students with credit for LCA LANG 407 prior to Fall 2019.",
            "id": "ASIALANG 225",
            "parent": "ASIALANG",
            "title": "THIRD SEMESTER HMONG"
        }
    },
    {
        "data": {
            "description": "Proficiency at the intermediate level in listening, speaking, reading and writing, using communicative approaches. Students with prior experience in the language are required to take a placement test administered by the department. Not open to students with credit for LCA LANG 408 prior to Fall 2019.",
            "id": "ASIALANG 226",
            "parent": "ASIALANG",
            "title": "FOURTH SEMESTER HMONG"
        }
    },
    {
        "data": {
            "source": "ASIALANG 126",
            "target": "ASIALANG 225"
        }
    },
    {
        "data": {
            "description": "Proficiency at the advanced level in listening, speaking, reading and writing, using communicative approaches. Students with prior experience in the language are required to take a placement test administered by the department. Not open to students with credit for LCA LANG 508 prior to Fall 2019.",
            "id": "ASIALANG 326",
            "parent": "ASIALANG",
            "title": "SIXTH SEMESTER HMONG"
        }
    }
]