[
    {
        "data": {
            "description": "Covers the history of Chinese literature from the Zhou through the end of the Yuan, focusing primarily on poetic and prose genres. Primary source readings will be in Chinese, with additional critical assessment of published translations; secondary source readings in both Chinese and English.",
            "id": "ASIAN 641",
            "parent": "ASIAN",
            "title": "HISTORY OF CHINESE LITERATURE I"
        }
    },
    {
        "data": {
            "description": "Emphasizes reading and writing skills. Students will acquire a wide range of vocabulary, grammatical points and sentence patterns from a variety of readings about Chinese culture. They will also learn how to write compositions about the covered topics. Students with prior experience in the language are required to take a placement test administered by the department. Not open to students with credit for E ASIAN 214 prior to Fall 2019.",
            "id": "ASIALANG 212",
            "parent": "ASIALANG",
            "title": "HERITAGE CHINESE II"
        }
    },
    {
        "data": {
            "description": "Introduces functional vocabulary and grammar, various cultural related topics, reading skills, and writing techniques. Designed for heritage Chinese learners who possess speaking and listening skills but little or no reading/writing skills in Chinese. These learners include those who were born in a non-Chinese-speaking country, but were raised in a home where Mandarin or another dialect was spoken, and those who were born in a Chinese-speaking country but received zero or limited formal education in that country. Students should contact the department about placement. Not open to students with credit for E ASIAN 113 or 213 prior to fall 2019.",
            "id": "ASIALANG 211",
            "parent": "ASIALANG",
            "title": "HERITAGE CHINESE I"
        }
    },
    {
        "data": {
            "description": "Selections principally from materials in modern Chinese society, to expose students to reading a variety of topics and styles. Classes conducted in Chinese. Students with prior experience in the language are required to take a placement test administered by the department. Not open to students with credit for E ASIAN 301 prior to Fall 2019.",
            "id": "ASIALANG 301",
            "parent": "ASIALANG",
            "title": "FIFTH SEMESTER CHINESE"
        }
    },
    {
        "data": {
            "description": "Selections principally from materials in modern Chinese society, to expose students to reading a variety of topics and styles. Classes conducted in Chinese. Students with prior experience in the language are required to take a placement test administered by the department. Not open to students with credit for E ASIAN 302 prior to Fall 2019.",
            "id": "ASIALANG 302",
            "parent": "ASIALANG",
            "title": "SIXTH SEMESTER CHINESE"
        }
    },
    {
        "data": {
            "id": "ASIALANG",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ASIAN",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ASIALANG 211",
            "target": "ASIALANG 212"
        }
    },
    {
        "data": {
            "source": "ASIALANG 212",
            "target": "ASIALANG 301"
        }
    },
    {
        "data": {
            "source": "ASIALANG 301",
            "target": "ASIALANG 302"
        }
    },
    {
        "data": {
            "source": "ASIALANG 302",
            "target": "ASIAN 641"
        }
    }
]