[
    {
        "data": {
            "description": "A critical introduction to the literature of China from early texts through the late imperial period. Works include poetry, prose, fiction and drama. Not open to students who completed E ASIAN 351 prior to Fall 2019.",
            "id": "ASIAN 351",
            "parent": "ASIAN",
            "title": "SURVEY OF CLASSICAL CHINESE LITERATURE"
        }
    },
    {
        "data": {
            "description": "Introduces intermediate-level communication skills in varying Chinese settings. Students will learn a wide range of vocabulary, grammar structure and pragmatic usage in situated dialogues. They will improve four language skills (listening, speaking, reading and writing) and pragmatic competence through interactive and meaningful in-class activities and after-class assignments. Students with prior experience in the language are required to take a placement test administered by the department.",
            "id": "ASIALANG 201",
            "parent": "ASIALANG",
            "title": "THIRD SEMESTER CHINESE"
        }
    },
    {
        "data": {
            "description": "Introduces the basic grammar along with 400 Chinese characters of standard spoken Chinese. Students with prior experience in the language are required to take a placement test administered by the department.",
            "id": "ASIALANG 102",
            "parent": "ASIALANG",
            "title": "SECOND SEMESTER CHINESE"
        }
    },
    {
        "data": {
            "description": "Introduction to the fundamental phonetic system and grammar of standard spoken Chinese along with 200 characters. Not open to students with credit forASIALANG 101(or E ASIAN 101 or 121 prior to Fall 2019).",
            "id": "ASIALANG 110",
            "parent": "ASIALANG",
            "title": "ELEMENTARY CHINESE I"
        }
    },
    {
        "data": {
            "description": "Introduction to the fundamental phonetic system and grammar of standard spoken Chinese along with 200 characters. Students with prior experience in the language are required to take a placement test administered by the department.",
            "id": "ASIALANG 111",
            "parent": "ASIALANG",
            "title": "ELEMENTARY CHINESE II"
        }
    },
    {
        "data": {
            "id": "ASIALANG",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ASIAN",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ASIALANG 102",
            "target": "ASIALANG 201"
        }
    },
    {
        "data": {
            "source": "ASIALANG 102",
            "target": "ASIAN 351"
        }
    },
    {
        "data": {
            "source": "ASIALANG 110",
            "target": "ASIALANG 111"
        }
    },
    {
        "data": {
            "source": "ASIALANG 111",
            "target": "ASIALANG 102"
        }
    },
    {
        "data": {
            "source": "ASIALANG 201",
            "target": "ASIAN 351"
        }
    }
]