[
    {
        "data": {
            "description": "Extensive readings in early Modern or Classical Japanese literature, and discussion of visual-verbal content. Students may repeat this course if the topic is different.",
            "id": "ASIAN 573",
            "parent": "ASIAN",
            "title": "READINGS IN CLASSICAL JAPANESE LITERATURE"
        }
    },
    {
        "data": {
            "description": "Focus on proficiency in four skills (speaking, listening, reading, and writing) and Japanese culture. Continuation of skill development from elementary language courses reviewing, reinforcing and expanding grammar, kanji and vocabulary/ expressions. Students with prior experience in the language are required to take a placement test administered by the department. Not open to students with credit for E ASIAN 203 prior to Summer 2019.",
            "id": "ASIALANG 203",
            "parent": "ASIALANG",
            "title": "THIRD SEMESTER JAPANESE"
        }
    },
    {
        "data": {
            "description": "Focus on proficiency in four skills (speaking, listening, reading, and writing) and Japanese culture. Continuation of skill development from the second-year language courses reviewing, reinforcing and expanding grammar, kanji and vocabulary/ expressions. Students with prior experience in the language are required to take a placement test administered by the department. Not open to students with credit for E ASIAN 303 prior to Summer 2019.",
            "id": "ASIALANG 303",
            "parent": "ASIALANG",
            "title": "FIFTH SEMESTER JAPANESE"
        }
    },
    {
        "data": {
            "description": "Focus on proficiency in four skills (speaking, listening, reading, and writing) and Japanese culture. Continuation of skill development fromASIALANG 203. Students with prior experience in the language are required to take a placement test administered by the department. Not open to students with credit for E ASIAN 204 prior to Summer 2019.",
            "id": "ASIALANG 204",
            "parent": "ASIALANG",
            "title": "FOURTH SEMESTER JAPANESE"
        }
    },
    {
        "data": {
            "description": "Focus on proficiency in four skills (speaking, listening, reading, and writing) to communicate in Japanese in basic everyday situations. Continuation of skill development fromASIALANG 103. Students with prior experience in the language are required to take a placement test administered by the department. Not open to students with credit for E ASIAN 104 prior to Summer 2019.",
            "id": "ASIALANG 104",
            "parent": "ASIALANG",
            "title": "SECOND SEMESTER JAPANESE"
        }
    },
    {
        "data": {
            "description": "Focus on proficiency in four skills (speaking, listening, reading, and writing) to communicate in Japanese in basic everyday situations. No previous knowledge of Japanese expected. Not open to students with credit for E ASIAN 103 prior to Summer 2019).",
            "id": "ASIALANG 103",
            "parent": "ASIALANG",
            "title": "FIRST SEMESTER JAPANESE"
        }
    },
    {
        "data": {
            "description": "Focus on proficiency in four skills (speaking, listening, reading, and writing) to communicate in Japanese in basic everyday situations. Students with prior experience in the language are required to take a placement test administered by the department.",
            "id": "ASIALANG 114",
            "parent": "ASIALANG",
            "title": "SECOND SEMESTER ELEMENTARY JAPANESE"
        }
    },
    {
        "data": {
            "description": "Focus on proficiency in four skills (speaking, listening, reading, and writing) to communicate in Japanese in basic everyday situations.",
            "id": "ASIALANG 113",
            "parent": "ASIALANG",
            "title": "FIRST SEMESTER ELEMENTARY JAPANESE"
        }
    },
    {
        "data": {
            "description": "Further practice in reading and writing. Extensive as well as intensive readings in contemporary texts. At least 1,000 more characters introduced. Conducted in Japanese. Students with prior experience in the language are required to take a placement test administered by the department. Not open to students with credit for E ASIAN 304 prior to Summer 2019.",
            "id": "ASIALANG 304",
            "parent": "ASIALANG",
            "title": "SIXTH SEMESTER JAPANESE"
        }
    },
    {
        "data": {
            "id": "ASIALANG",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ASIAN",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ASIALANG 103",
            "target": "ASIALANG 113"
        }
    },
    {
        "data": {
            "source": "ASIALANG 104",
            "target": "ASIALANG 203"
        }
    },
    {
        "data": {
            "source": "ASIALANG 113",
            "target": "ASIALANG 114"
        }
    },
    {
        "data": {
            "source": "ASIALANG 114",
            "target": "ASIALANG 103"
        }
    },
    {
        "data": {
            "source": "ASIALANG 114",
            "target": "ASIALANG 104"
        }
    },
    {
        "data": {
            "source": "ASIALANG 203",
            "target": "ASIALANG 204"
        }
    },
    {
        "data": {
            "source": "ASIALANG 204",
            "target": "ASIALANG 303"
        }
    },
    {
        "data": {
            "source": "ASIALANG 303",
            "target": "ASIALANG 304"
        }
    },
    {
        "data": {
            "source": "ASIALANG 304",
            "target": "ASIAN 573"
        }
    }
]