[
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics and selected topics in Animal Physiology.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "General biological principles. Topics include: evolution, ecology, animal behavior, cell structure and function, genetics and molecular genetics and the physiology of a variety of organ systems emphasizing function in humans.",
            "id": "BIOLOGY/ZOOLOGY 101",
            "title": "ANIMAL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Nature and variability of wind, temperature, clouds and precipitation. Storm systems, fronts, thunderstorms, tornadoes and their prediction. Air composition and pollution. Global winds, seasonal changes, climate and climatic change.",
            "id": "ATMOCN 100",
            "parent": "ATMOCN",
            "title": "WEATHER AND CLIMATE"
        }
    },
    {
        "data": {
            "source": "ATMOCN/ENVIRST 171",
            "target": "ATMOCN/ENVIRST 520"
        }
    },
    {
        "data": {
            "description": "Atmospheric problems of global significance. Greenhouse warming, ozone layer, acid rain, climate change. Study based on elementary principles of atmospheric science. Systems approach applied to changing atmospheric composition. Interactions among geochemical cycles, anthropogenic inputs and other parts of the environment.",
            "id": "ATMOCN/ENVIRST 171",
            "title": "GLOBAL CHANGE: ATMOSPHERIC ISSUES AND PROBLEMS"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 152"
        }
    },
    {
        "data": {
            "id": "ATMOCN",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ATMOCN 101",
            "target": "ATMOCN/ENVIRST 520"
        }
    },
    {
        "data": {
            "source": "ATMOCN 101",
            "target": "ATMOCN 100"
        }
    },
    {
        "data": {
            "source": "ATMOCN 100",
            "target": "ATMOCN 101"
        }
    },
    {
        "data": {
            "description": "Basic principles of ecology and interrelations between individuals, populations, communities, ecosystems and their environment; transmission genetics and introduction to population genetics; origin of life, evolutionary mechanisms, ancestral relationships among species, and the diversity of life.",
            "id": "BIOCORE 381",
            "parent": "BIOCORE",
            "title": "EVOLUTION, ECOLOGY, AND GENETICS"
        }
    },
    {
        "data": {
            "description": "How climate systems and biological organisms operate and interact at the global scale and the implications of this for climate change, ecosystem ecology and human land use.",
            "id": "ATMOCN/ENVIRST 520",
            "title": "BIOCLIMATOLOGY"
        }
    },
    {
        "data": {
            "description": "Topics include: selected topics in plant physiology, a survey of the five major kingdoms of organisms, speciation and evolutionary theory, and ecology at multiple levels of the biological hierarchy.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 151"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "ATMOCN/ENVIRST 520"
        }
    },
    {
        "data": {
            "id": "BIOCORE",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Nature and variability of wind, temperature, clouds and precipitation. Storm systems, fronts, thunderstorms, tornadoes and their prediction. Air composition and pollution. Global winds, seasonal changes, climate and climatic change. Includes map analyses and basic quantitative lab exercises.",
            "id": "ATMOCN 101",
            "parent": "ATMOCN",
            "title": "WEATHER AND CLIMATE"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 101"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "target": "ATMOCN/ENVIRST 520"
        }
    }
]