[
    {
        "data": {
            "description": "Covers the graphs, properties and geometric significance of trigonometric functions of a real variable. Other topics include trigonometric equations and identities, application, trigonometric form of complex numbers, DeMoivre's theorem, and polar and parametric equations. The course also has a significant number of applications, especially related to other disciplines.",
            "id": "MATH 113",
            "parent": "MATH",
            "title": "TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "Introduction to theory of fluid motions for atmosphere and ocean. Elementary kinematics, fundamental forces, effects of earth's gravity and rotation, concepts and applications of hydrostatic and geostrophic balance.",
            "id": "ATMOCN 310",
            "parent": "ATMOCN",
            "title": "DYNAMICS OF THE ATMOSPHERE AND OCEAN I"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for Physics, AMEP, and Astronomy-Physics majors. Mechanics, waves, thermodynamics and statistical mechanics, topics in modern physics; with computation.  A more mathematically rigorous and in-depth introduction to physics than the other introductory physics sequences.",
            "id": "PHYSICS 247",
            "parent": "PHYSICS",
            "title": "A MODERN INTRODUCTION TO PHYSICS"
        }
    },
    {
        "data": {
            "description": "Continuation ofPHYSICS 247. Electromagnetism, circuits, optics, additional topics in modern physics; with computation.",
            "id": "PHYSICS 248",
            "parent": "PHYSICS",
            "title": "A MODERN INTRODUCTION TO PHYSICS"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Cyclone and frontal theory; case studies illustrating the structure and evolution of the frontal cyclone; diagnostic techniques: interpretation of satellite photographs, preparation of vertical cross sections and isentropic analysis.",
            "id": "ATMOCN 452",
            "parent": "ATMOCN",
            "title": "SYNOPTIC LABORATORY I: THE FRONTAL CYCLONE"
        }
    },
    {
        "data": {
            "description": "Intermediate theory of fluid motions for atmosphere and ocean. Emphasis on large scale applications and basic theory for geophysical wave types. Thermal wind shear, frictional flow, vorticity concepts, Rossby waves, Sverdrup ocean flow.",
            "id": "ATMOCN 311",
            "parent": "ATMOCN",
            "title": "DYNAMICS OF THE ATMOSPHERE AND OCEAN II"
        }
    },
    {
        "data": {
            "description": "Introduction to calculus of functions of several variables; calculus on parameterized curves, derivatives of functions of several variables, multiple integrals, vector calculus.",
            "id": "MATH 234",
            "parent": "MATH",
            "title": "CALCULUS--FUNCTIONS OF SEVERAL VARIABLES"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Physical variables, laws, characteristics and direct measurements for atmosphere and ocean. Thermodynamics and moist atmospheric processes. Basic physics of clouds, precipitation, and chemical constituents.",
            "id": "ATMOCN 330",
            "parent": "ATMOCN",
            "title": "PHYSICS OF THE ATMOSPHERE AND OCEAN I"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Radiation, energy budget, and cloud physics. Scattering, absorption, emission and diabatic heating by shortwave and longwave processes. Introduction to cloud physics including cloud nucleation processes, particle growth, precipitation development, and convective cloud processes.",
            "id": "ATMOCN 340",
            "parent": "ATMOCN",
            "title": "PHYSICS OF THE ATMOSPHERE AND OCEAN II"
        }
    },
    {
        "data": {
            "description": "Techniques of integration, improper integrals, first order ordinary differential equations, sequences and series, Taylor series, vector geometry in two and three dimensions.",
            "id": "MATH 222",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 2"
        }
    },
    {
        "data": {
            "id": "ATMOCN",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "PHYSICS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ATMOCN 310",
            "target": "ATMOCN 311"
        }
    },
    {
        "data": {
            "source": "ATMOCN 311",
            "target": "ATMOCN 452"
        }
    },
    {
        "data": {
            "source": "ATMOCN 330",
            "target": "ATMOCN 340"
        }
    },
    {
        "data": {
            "source": "ATMOCN 340",
            "target": "ATMOCN 452"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 113"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 113",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 222"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 234"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "PHYSICS 247"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "ATMOCN 310"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "ATMOCN 330"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "PHYSICS 247",
            "target": "PHYSICS 248"
        }
    },
    {
        "data": {
            "source": "PHYSICS 248",
            "target": "ATMOCN 310"
        }
    },
    {
        "data": {
            "source": "PHYSICS 248",
            "target": "ATMOCN 330"
        }
    }
]