[
    {
        "data": {
            "description": "Collaborate with students inB M E 300on a client-centered biomedical engineering design project to learn concept generation, product analysis, specifications, evaluation, regulation, and ethics.",
            "id": "BME 200",
            "parent": "BME",
            "title": "BIOMEDICAL ENGINEERING DESIGN"
        }
    },
    {
        "data": {
            "description": "Applies classroom study and prior design course experiences for senior teams to solve a directed client-based biomedical engineering design project.",
            "id": "BME 400",
            "parent": "BME",
            "title": "CAPSTONE DESIGN COURSE IN BIOMEDICAL ENGINEERING"
        }
    },
    {
        "data": {
            "source": "BME 301",
            "target": "BME 400"
        }
    },
    {
        "data": {
            "source": "BME 201",
            "target": "BME 301"
        }
    },
    {
        "data": {
            "description": "Technical communication for biomedical engineering practice applied to real-world, client-based projects including research methods, documentation, preparing and critiquing reports, ethical problem solving, diversity and inclusion, presenting, and professional development.",
            "id": "BME 301",
            "parent": "BME",
            "title": "BIOMEDICAL ENGINEERING DESIGN AND COMMUNICATION"
        }
    },
    {
        "data": {
            "source": "BME 201",
            "target": "BME 300"
        }
    },
    {
        "data": {
            "id": "BME",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Work on a client-centered biomedical engineering design project to learn leadership styles, concept generation, product analysis, specifications, evaluation, regulation, and ethics. Provide leadership and mentorship to students inB M E 200.",
            "id": "BME 300",
            "parent": "BME",
            "title": "BIOMEDICAL ENGINEERING DESIGN AND LEADERSHIP"
        }
    },
    {
        "data": {
            "source": "BME 200",
            "target": "BME 201"
        }
    },
    {
        "data": {
            "source": "BME 300",
            "target": "BME 400"
        }
    },
    {
        "data": {
            "description": "Fundamentals of biomedical engineering and principles of design including the design process, standards, documentation, inclusion in design and research methods. Hands-on skills including electronics, programming, computer-aided design, machining, safety training, microscopy, cell and tissue engineering principles and fabrication of physical prototypes.",
            "id": "BME 201",
            "parent": "BME",
            "title": "BIOMEDICAL ENGINEERING DESIGN AND FUNDAMENTALS"
        }
    }
]