[
    {
        "data": {
            "description": "Addresses the range of materials currently being utilized for various biomedical applications, the biological systems governing biomaterial applications, analytical techniques pertinent to biomaterial evaluation, and selected major medical applications in which biomaterials play an important role.",
            "id": "BME/PHMSCI 430",
            "title": "BIOLOGICAL INTERACTIONS WITH MATERIALS"
        }
    },
    {
        "data": {
            "description": "General biological principles. Topics include: evolution, ecology, animal behavior, cell structure and function, genetics and molecular genetics and the physiology of a variety of organ systems emphasizing function in humans.",
            "id": "BIOLOGY/ZOOLOGY 101",
            "title": "ANIMAL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "General concepts of animal biology at an introductory level emphasizing the evolutionary relationships between animals. Learn about general body plans and strategies used to accomplish the basic tasks of staying alive in major animal groups using preserved and live animals. Study the diversity within each group of animals by integrating the body plans with the lifestyle and ecology of animals. Dissections of earthworm, freshwater mussel, squid, sea star, and rat aid the study of these general principles.",
            "id": "BIOLOGY/ZOOLOGY 102",
            "title": "ANIMAL BIOLOGY LABORATORY"
        }
    },
    {
        "data": {
            "description": "Overview of tissue engineering, including discussion of cell sources, cell-material interactions, tailoring biomaterials, methods of culture and characterization of engineering tissues, ethical issues, concluding with case studies of specific types of tissue engineering. Optional laboratory exercises offered throughout semester.",
            "id": "BME 510",
            "parent": "BME",
            "title": "INTRODUCTION TO TISSUE ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Tissue engineering refers to the generation of biological substitutes to restore, maintain, or improve tissue function. Laboratory techniques are multi-disciplinary, from basic biological sciences, engineering, and biotechnology. Engineering approaches and analysis will be applied to these techniques.",
            "id": "BME 511",
            "parent": "BME",
            "title": "TISSUE ENGINEERING LABORATORY"
        }
    },
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics and selected topics in Animal Physiology.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics, and selected topics in Animal Physiology. Designed for engineering majors that do not need a lab component.",
            "id": "ZOOLOGY 153",
            "parent": "ZOOLOGY",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Topics include: selected topics in plant physiology, a survey of the five major kingdoms of organisms, speciation and evolutionary theory, and ecology at multiple levels of the biological hierarchy.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "id": "BME",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ZOOLOGY",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 152"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 101"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BME/PHMSCI 430"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "target": "BIOLOGY/ZOOLOGY 102"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 151"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ZOOLOGY 153"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 102",
            "target": "BME/PHMSCI 430"
        }
    },
    {
        "data": {
            "source": "BME 510",
            "target": "BME 511"
        }
    },
    {
        "data": {
            "source": "BME/PHMSCI 430",
            "target": "BME 510"
        }
    },
    {
        "data": {
            "source": "ZOOLOGY 153",
            "target": "BME/PHMSCI 430"
        }
    }
]