[
    {
        "data": {
            "description": "Application of ecological principles and human dimensions to the conservation of biological diversity. Topics: biodiversity science; conservation planning; population ecology; habitat loss, species exploitation, invasive species, pollution; human attitudes and activities as they affect the biosphere; approaches to monitoring interventions.",
            "id": "BOTANY/ENVIRST/F&WECOL/ZOOLOGY 651",
            "title": "CONSERVATION BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Ecology of individual organisms, populations, communities, ecosystems, landscapes, and the biosphere. The interaction of organisms with each other and their physical environment. These relationships are studied, often in quantitative terms, in both field and laboratory settings.",
            "id": "BOTANY/F&WECOL/ZOOLOGY 460",
            "title": "GENERAL ECOLOGY"
        }
    },
    {
        "data": {
            "description": "General biological principles. Topics include: evolution, ecology, animal behavior, cell structure and function, genetics and molecular genetics and the physiology of a variety of organ systems emphasizing function in humans.",
            "id": "BIOLOGY/ZOOLOGY 101",
            "title": "ANIMAL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics and selected topics in Animal Physiology.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Topics include: selected topics in plant physiology, a survey of the five major kingdoms of organisms, speciation and evolutionary theory, and ecology at multiple levels of the biological hierarchy.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 152"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 101"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "target": "BOTANY/F&WECOL/ZOOLOGY 460"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 151"
        }
    },
    {
        "data": {
            "source": "BOTANY/F&WECOL/ZOOLOGY 460",
            "target": "BOTANY/ENVIRST/F&WECOL/ZOOLOGY 651"
        }
    }
]