[
    {
        "data": {
            "source": "CHEM 329",
            "target": "CHEM 327"
        }
    },
    {
        "data": {
            "description": "Fundamentals of chemical measurement in chemistry, biology, engineering, geology, and the medical sciences. Topics include equilibria of complex systems, spectroscopy, electrochemistry, separations, and quantitative laboratory technique.",
            "id": "CHEM 327",
            "parent": "CHEM",
            "title": "FUNDAMENTALS OF ANALYTICAL SCIENCE"
        }
    },
    {
        "data": {
            "description": "Introduction to modeling of chemical processes and introduction to using modern computational tools to analyze the models.",
            "id": "CBE 255",
            "parent": "CBE",
            "title": "INTRODUCTION TO CHEMICAL PROCESS MODELING"
        }
    },
    {
        "data": {
            "description": "Fundamentals of chemical measurement in chemistry, biology, engineering, geology, and the medical sciences. Topics include equilibria of complex systems, spectroscopy, electrochemistry, separations, and quantitative laboratory technique. Covers chemical equilibria in greater depth and with greater mathematical rigor thanCHEM 327.",
            "id": "CHEM 329",
            "parent": "CHEM",
            "title": "FUNDAMENTALS OF ANALYTICAL SCIENCE"
        }
    },
    {
        "data": {
            "description": "Introduction to thermodynamics, energy balances, applications to steady state and unsteady state processes, behavior of pure fluids, chemical reaction equilibria.",
            "id": "CBE 310",
            "parent": "CBE",
            "title": "CHEMICAL PROCESS THERMODYNAMICS"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "BSE 249"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 213"
        }
    },
    {
        "data": {
            "source": "CBE 310",
            "target": "BSE 364"
        }
    },
    {
        "data": {
            "description": "Study of various physical, mechanical, thermal and other properties of food and biological materials. Importance of such property values on the design and operation of various food and bioprocess engineering systems.",
            "id": "BSE 364",
            "parent": "BSE",
            "title": "ENGINEERING PROPERTIES OF FOOD AND BIOLOGICAL MATERIALS"
        }
    },
    {
        "data": {
            "description": "An introduction to the invention of processes for the large scale, low cost processing of materials such as water, chemicals, petroleum products, food, drugs and wastes.",
            "id": "CBE 250",
            "parent": "CBE",
            "title": "PROCESS SYNTHESIS"
        }
    },
    {
        "data": {
            "id": "BSE",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "CHEM 329",
            "target": "CBE 250"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "First order differential equations, introduction to multivariable calculus and constrained optimization, infinite sequences and series, methods of approximation, and a brief introduction to probability. Models and applications from business and the social sciences.",
            "id": "MATH 213",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 2"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 375",
            "target": "MATH 376"
        }
    },
    {
        "data": {
            "source": "MATH 376",
            "target": "CBE 255"
        }
    },
    {
        "data": {
            "source": "CBE 250",
            "target": "CBE 310"
        }
    },
    {
        "data": {
            "id": "CBE",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "CHEM 327",
            "target": "CHEM 329"
        }
    },
    {
        "data": {
            "source": "CBE 255",
            "target": "CBE 310"
        }
    },
    {
        "data": {
            "source": "BSE 249",
            "target": "BSE 364"
        }
    },
    {
        "data": {
            "description": "Applications of basic engineering principles such as mass and energy balances, psychrometric heat and mass transfer and fluid flow to problems encountered in agricultural and biological systems including grain conditioning, fruit and vegetable storage, food processing, animal housing, and environmental control.",
            "id": "BSE 249",
            "parent": "BSE",
            "title": "ENGINEERING PRINCIPLES FOR BIOLOGICAL SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "source": "MATH 213",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "description": "Vector spaces and linear transformations, differential calculus of scalar and vector fields, determinants, eigenvalues and eigenvectors, multiple integrals, line integrals, and surface integrals. Freshmen students are invited to enroll by the Department of Mathematics.",
            "id": "MATH 375",
            "parent": "MATH",
            "title": "TOPICS IN MULTI-VARIABLE CALCULUS AND LINEAR ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Topics in multi-variable calculus and introduction to differential equations.",
            "id": "MATH 376",
            "parent": "MATH",
            "title": "TOPICS IN MULTI-VARIABLE CALCULUS AND DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "CBE 250",
            "target": "CBE 255"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    }
]