[
    {
        "data": {
            "description": "Applied linear regression modeling for social scientists. Bivariate and multiple regression, dummy variables, interactions, nonlinear relationships, indirect effects and omitted variable bias, outliers, heteroskedasticity, and mulitcollinearity; associated diagnostics and corrections. Use of Stata and/or SAS for dataset creation and analysis.",
            "id": "C&ESOC/SOC 361",
            "title": "STATISTICS FOR SOCIOLOGISTS II"
        }
    },
    {
        "data": {
            "description": "Basic principles and definitions of sociology. Readings and discussion of the perspectives of sociology, the individual and society, groups and social process, stratification, organizations and power, demography, and social change.",
            "id": "C&ESOC/SOC 211",
            "title": "THE SOCIOLOGICAL ENTERPRISE"
        }
    },
    {
        "data": {
            "description": "Introduction to the field of American sociology, its subfields and specialized areas of research, theoretical traditions and research methods.",
            "id": "C&ESOC/SOC 210",
            "title": "SURVEY OF SOCIOLOGY"
        }
    },
    {
        "data": {
            "description": "Practical experience in techniques of social research through assignment to a research project for the semester. Focuses on the art and practice of research and the writing of research reports.",
            "id": "C&ESOC/SOC 693",
            "title": "PRACTICUM IN ANALYSIS AND RESEARCH"
        }
    },
    {
        "data": {
            "description": "Presentation of sociological data; descriptive statistics; probability theory and statistical inference; estimation and tests of hypotheses; regression and correlation and the analysis of contingency tables.",
            "id": "C&ESOC/SOC 360",
            "title": "STATISTICS FOR SOCIOLOGISTS I"
        }
    },
    {
        "data": {
            "description": "Scientific methods in the study of society; procedures for testing sociological theory: problem definition, hypothesis construction, collection and evaluation of data. Practical experience conducting small research projects.",
            "id": "C&ESOC/SOC 357",
            "title": "METHODS OF SOCIOLOGICAL INQUIRY"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 210",
            "target": "C&ESOC/SOC 211"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 210",
            "target": "C&ESOC/SOC 357"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 211",
            "target": "C&ESOC/SOC 210"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 357",
            "target": "C&ESOC/SOC 693"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 360",
            "target": "C&ESOC/SOC 361"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 361",
            "target": "C&ESOC/SOC 693"
        }
    }
]