[
    {
        "data": {
            "description": "A quantitative treatment of macroscopic phenomena including thermodynamics, chemical equilibria, solution behavior, electrochemistry, and chemical kinetics.",
            "id": "CHEM 116",
            "parent": "CHEM",
            "title": "CHEMICAL PRINCIPLES II"
        }
    },
    {
        "data": {
            "description": "Accelerated coverage of topics in general chemistry, including introduction to laboratory techniques. Topics include atomic and molecular structure, chemical equilibrium, acid-base chemistry, thermodynamics, kinetics, and electrochemistry.",
            "id": "CHEM 109",
            "parent": "CHEM",
            "title": "ADVANCED GENERAL CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "An introduction to linear algebra and differential equations with emphasis on the relationship between the theory of linear algebra and analytical and numerical techniques for solving differential equations. Linear algebra topics include linear systems, matrices and their algebra, vector spaces and linear transformations, eigenvalues and eigenvectors. Topics from differential equations include first order ODE, homogeneous and nonhomogeneous linear systems, and numerical methods.",
            "id": "MATH 320",
            "parent": "MATH",
            "title": "LINEAR ALGEBRA AND DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "description": "An introduction to the invention of processes for the large scale, low cost processing of materials such as water, chemicals, petroleum products, food, drugs and wastes.",
            "id": "CBE 250",
            "parent": "CBE",
            "title": "PROCESS SYNTHESIS"
        }
    },
    {
        "data": {
            "description": "Analysis of chemical engineering operations involving fluid flow and heat transfer. Flow of fluids through ducts and porous media; motion of particulate matter in fluids; general design and operation of fluid-flow equipment. Conductive, convective and radiative heat exchange with and without phase change; general design and operation of heat-exchange equipment.",
            "id": "CBE 326",
            "parent": "CBE",
            "title": "MOMENTUM AND HEAT TRANSFER OPERATIONS"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for engineering students. Mechanics: kinematics, statics, dynamics; energy and momentum.",
            "id": "PHYSICS 201",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for students majoring in biological sciences. Mechanics: kinematics, statics, dynamics; energy and momentum. Heat and sound.",
            "id": "PHYSICS 207",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "Explores a detailed atomic and molecular view of matter and its interactions, with a specific focus on quantum theory, molecular structure, and chemical bonding. Application required for enrollment.",
            "id": "CHEM 115",
            "parent": "CHEM",
            "title": "CHEMICAL PRINCIPLES I"
        }
    },
    {
        "data": {
            "description": "First and second laws of thermodynamics; thermodynamic properties of gases, vapors, and gas-vapor mixtures; energy-systems analysis including power cycles, refrigeration cycles and air-conditioning processes. Introduction to thermodynamics of reacting mixtures.",
            "id": "ME 361",
            "parent": "ME",
            "title": "THERMODYNAMICS"
        }
    },
    {
        "data": {
            "description": "First order differential equations, introduction to multivariable calculus and constrained optimization, infinite sequences and series, methods of approximation, and a brief introduction to probability. Models and applications from business and the social sciences.",
            "id": "MATH 213",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 2"
        }
    },
    {
        "data": {
            "description": "Fundamental concepts of conduction, convection, radiation. Heat-exchanger principles.",
            "id": "ME 364",
            "parent": "ME",
            "title": "ELEMENTARY HEAT TRANSFER"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Introduction to modeling of chemical processes and introduction to using modern computational tools to analyze the models.",
            "id": "CBE 255",
            "parent": "CBE",
            "title": "INTRODUCTION TO CHEMICAL PROCESS MODELING"
        }
    },
    {
        "data": {
            "description": "Introduction to thermodynamics, energy balances, applications to steady state and unsteady state processes, behavior of pure fluids, chemical reaction equilibria.",
            "id": "CBE 310",
            "parent": "CBE",
            "title": "CHEMICAL PROCESS THERMODYNAMICS"
        }
    },
    {
        "data": {
            "description": "Laws of mechanics and thermodynamics applied to fluids at rest and in motion; potential flow; dimensional analysis; viscous flow; pipe flow; boundary-layer theory; compressible flow.",
            "id": "ME 363",
            "parent": "ME",
            "title": "FLUID DYNAMICS"
        }
    },
    {
        "data": {
            "description": "Mass, momentum, and energy transport; calculation of transport coefficients; solution to problems in viscous flow, heat conduction, and diffusion; dimensional analysis; mass, momentum, and heat transfer coefficients; over-all balances; elementary applications.",
            "id": "CBE 320",
            "parent": "CBE",
            "title": "INTRODUCTORY TRANSPORT PHENOMENA"
        }
    },
    {
        "data": {
            "description": "Principles and application of chemical equilibrium, coordination chemistry, oxidation-reduction and electrochemistry, kinetics, nuclear chemistry, introduction to organic chemistry, and chemistry laboratory skills.",
            "id": "CHEM 104",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Radiant energy transfer and its application to solar exchangers; energy balances for solar exchangers, review of theory, economics, and practice of solar energy applications.",
            "id": "CBE/ME 567",
            "title": "SOLAR ENERGY TECHNOLOGY"
        }
    },
    {
        "data": {
            "description": "Review of linear differential equations; series solution of linear differential equations; boundary value problems; Laplace transforms; possibly numerical methods and two dimensional autonomous systems.",
            "id": "MATH 319",
            "parent": "MATH",
            "title": "TECHNIQUES IN ORDINARY DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "description": "Stoichiometry and the mole concept, the behavior of gases, liquids and solids, thermochemistry, electronic structure of atoms and chemical bonding, descriptive chemistry of selected elements and compounds, intermolecular forces, and chemistry laboratory skills.",
            "id": "CHEM 103",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Techniques of integration, improper integrals, first order ordinary differential equations, sequences and series, Taylor series, vector geometry in two and three dimensions.",
            "id": "MATH 222",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 2"
        }
    },
    {
        "data": {
            "id": "CBE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ME",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "PHYSICS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "CBE 250",
            "target": "CBE 255"
        }
    },
    {
        "data": {
            "source": "CBE 250",
            "target": "CBE 310"
        }
    },
    {
        "data": {
            "source": "CBE 255",
            "target": "CBE 310"
        }
    },
    {
        "data": {
            "source": "CBE 310",
            "target": "CBE 326"
        }
    },
    {
        "data": {
            "source": "CBE 320",
            "target": "CBE 326"
        }
    },
    {
        "data": {
            "source": "CBE 326",
            "target": "CBE/ME 567"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "ME 361"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 109"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "ME 361"
        }
    },
    {
        "data": {
            "source": "CHEM 115",
            "target": "CHEM 116"
        }
    },
    {
        "data": {
            "source": "CHEM 116",
            "target": "CBE 250"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 213"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 213",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 222"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 319"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 320"
        }
    },
    {
        "data": {
            "source": "MATH 319",
            "target": "ME 363"
        }
    },
    {
        "data": {
            "source": "MATH 320",
            "target": "CBE 255"
        }
    },
    {
        "data": {
            "source": "ME 361",
            "target": "ME 363"
        }
    },
    {
        "data": {
            "source": "ME 361",
            "target": "ME 364"
        }
    },
    {
        "data": {
            "source": "ME 363",
            "target": "ME 364"
        }
    },
    {
        "data": {
            "source": "ME 364",
            "target": "CBE/ME 567"
        }
    },
    {
        "data": {
            "source": "PHYSICS 201",
            "target": "CBE 320"
        }
    },
    {
        "data": {
            "source": "PHYSICS 201",
            "target": "PHYSICS 207"
        }
    },
    {
        "data": {
            "source": "PHYSICS 207",
            "target": "CBE 320"
        }
    },
    {
        "data": {
            "source": "PHYSICS 207",
            "target": "PHYSICS 201"
        }
    }
]