[
    {
        "data": {
            "source": "CHEM 329",
            "target": "CHEM 327"
        }
    },
    {
        "data": {
            "description": "Fundamentals of chemical measurement in chemistry, biology, engineering, geology, and the medical sciences. Topics include equilibria of complex systems, spectroscopy, electrochemistry, separations, and quantitative laboratory technique.",
            "id": "CHEM 327",
            "parent": "CHEM",
            "title": "FUNDAMENTALS OF ANALYTICAL SCIENCE"
        }
    },
    {
        "data": {
            "description": "Introduction to modeling of chemical processes and introduction to using modern computational tools to analyze the models.",
            "id": "CBE 255",
            "parent": "CBE",
            "title": "INTRODUCTION TO CHEMICAL PROCESS MODELING"
        }
    },
    {
        "data": {
            "description": "Fundamentals of chemical measurement in chemistry, biology, engineering, geology, and the medical sciences. Topics include equilibria of complex systems, spectroscopy, electrochemistry, separations, and quantitative laboratory technique. Covers chemical equilibria in greater depth and with greater mathematical rigor thanCHEM 327.",
            "id": "CHEM 329",
            "parent": "CHEM",
            "title": "FUNDAMENTALS OF ANALYTICAL SCIENCE"
        }
    },
    {
        "data": {
            "description": "Introduction to thermodynamics, energy balances, applications to steady state and unsteady state processes, behavior of pure fluids, chemical reaction equilibria.",
            "id": "CBE 310",
            "parent": "CBE",
            "title": "CHEMICAL PROCESS THERMODYNAMICS"
        }
    },
    {
        "data": {
            "description": "An introduction to the invention of processes for the large scale, low cost processing of materials such as water, chemicals, petroleum products, food, drugs and wastes.",
            "id": "CBE 250",
            "parent": "CBE",
            "title": "PROCESS SYNTHESIS"
        }
    },
    {
        "data": {
            "source": "CHEM 329",
            "target": "CBE 250"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "MATH 375",
            "target": "MATH 376"
        }
    },
    {
        "data": {
            "source": "MATH 376",
            "target": "CBE 255"
        }
    },
    {
        "data": {
            "source": "CBE 250",
            "target": "CBE 310"
        }
    },
    {
        "data": {
            "id": "CBE",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "CHEM 327",
            "target": "CHEM 329"
        }
    },
    {
        "data": {
            "source": "CBE 255",
            "target": "CBE 310"
        }
    },
    {
        "data": {
            "description": "Vector spaces and linear transformations, differential calculus of scalar and vector fields, determinants, eigenvalues and eigenvectors, multiple integrals, line integrals, and surface integrals. Freshmen students are invited to enroll by the Department of Mathematics.",
            "id": "MATH 375",
            "parent": "MATH",
            "title": "TOPICS IN MULTI-VARIABLE CALCULUS AND LINEAR ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Topics in multi-variable calculus and introduction to differential equations.",
            "id": "MATH 376",
            "parent": "MATH",
            "title": "TOPICS IN MULTI-VARIABLE CALCULUS AND DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "CBE 250",
            "target": "CBE 255"
        }
    }
]