[
    {
        "data": {
            "source": "CHEM 329",
            "target": "CHEM 327"
        }
    },
    {
        "data": {
            "description": "Fundamentals of chemical measurement in chemistry, biology, engineering, geology, and the medical sciences. Topics include equilibria of complex systems, spectroscopy, electrochemistry, separations, and quantitative laboratory technique.",
            "id": "CHEM 327",
            "parent": "CHEM",
            "title": "FUNDAMENTALS OF ANALYTICAL SCIENCE"
        }
    },
    {
        "data": {
            "source": "PHYSICS 207",
            "target": "CIVENGR 324"
        }
    },
    {
        "data": {
            "description": "Introduction to modeling of chemical processes and introduction to using modern computational tools to analyze the models.",
            "id": "CBE 255",
            "parent": "CBE",
            "title": "INTRODUCTION TO CHEMICAL PROCESS MODELING"
        }
    },
    {
        "data": {
            "description": "Fundamentals of chemical measurement in chemistry, biology, engineering, geology, and the medical sciences. Topics include equilibria of complex systems, spectroscopy, electrochemistry, separations, and quantitative laboratory technique. Covers chemical equilibria in greater depth and with greater mathematical rigor thanCHEM 327.",
            "id": "CHEM 329",
            "parent": "CHEM",
            "title": "FUNDAMENTALS OF ANALYTICAL SCIENCE"
        }
    },
    {
        "data": {
            "description": "Introduction to thermodynamics, energy balances, applications to steady state and unsteady state processes, behavior of pure fluids, chemical reaction equilibria.",
            "id": "CBE 310",
            "parent": "CBE",
            "title": "CHEMICAL PROCESS THERMODYNAMICS"
        }
    },
    {
        "data": {
            "source": "CIVENGR 324",
            "target": "CBE 512"
        }
    },
    {
        "data": {
            "description": "An introduction to the invention of processes for the large scale, low cost processing of materials such as water, chemicals, petroleum products, food, drugs and wastes.",
            "id": "CBE 250",
            "parent": "CBE",
            "title": "PROCESS SYNTHESIS"
        }
    },
    {
        "data": {
            "source": "CBE 310",
            "target": "CBE 512"
        }
    },
    {
        "data": {
            "source": "CHEM 329",
            "target": "CBE 250"
        }
    },
    {
        "data": {
            "description": "A systematic introduction to the application of the first and second laws of thermodynamics to systems relevant to environmental engineering. Energy balances used to solve environmental engineering problems in flowing and non-flowing systems. Examines the relationship between energy, heat and work using theoretical and practical models. Chemical reactions as well as gas and fluid mixing from a thermodynamics perspective. Performance limits imposed by the second law of thermodynamics on devices used in power generation, fluid flow, refrigeration, and air conditioning.",
            "id": "CIVENGR 324",
            "parent": "CIVENGR",
            "title": "ENVIRONMENTAL ENGINEERING THERMODYNAMICS"
        }
    },
    {
        "data": {
            "source": "PHYSICS 207",
            "target": "PHYSICS 201"
        }
    },
    {
        "data": {
            "source": "PHYSICS 201",
            "target": "PHYSICS 207"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "MATH 375",
            "target": "MATH 376"
        }
    },
    {
        "data": {
            "description": "Chemical engineering principles of material and energy balances, chemical process design, and chemical engineering economics are used to analyze a wide variety of energy systems and their impact on the economy, the environment, society, and the chemical process industry.",
            "id": "CBE 512",
            "parent": "CBE",
            "title": "ENERGY TECHNOLOGIES AND SUSTAINABILITY"
        }
    },
    {
        "data": {
            "source": "MATH 376",
            "target": "CBE 255"
        }
    },
    {
        "data": {
            "source": "CBE 250",
            "target": "CBE 310"
        }
    },
    {
        "data": {
            "id": "CBE",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "CHEM 327",
            "target": "CHEM 329"
        }
    },
    {
        "data": {
            "source": "CBE 255",
            "target": "CBE 310"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for students majoring in biological sciences. Mechanics: kinematics, statics, dynamics; energy and momentum. Heat and sound.",
            "id": "PHYSICS 207",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Vector spaces and linear transformations, differential calculus of scalar and vector fields, determinants, eigenvalues and eigenvectors, multiple integrals, line integrals, and surface integrals. Freshmen students are invited to enroll by the Department of Mathematics.",
            "id": "MATH 375",
            "parent": "MATH",
            "title": "TOPICS IN MULTI-VARIABLE CALCULUS AND LINEAR ALGEBRA"
        }
    },
    {
        "data": {
            "id": "PHYSICS",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for engineering students. Mechanics: kinematics, statics, dynamics; energy and momentum.",
            "id": "PHYSICS 201",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "id": "CIVENGR",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Topics in multi-variable calculus and introduction to differential equations.",
            "id": "MATH 376",
            "parent": "MATH",
            "title": "TOPICS IN MULTI-VARIABLE CALCULUS AND DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "CBE 250",
            "target": "CBE 255"
        }
    },
    {
        "data": {
            "source": "PHYSICS 201",
            "target": "CIVENGR 324"
        }
    }
]