[
    {
        "data": {
            "description": "Accelerated coverage of topics in general chemistry, including introduction to laboratory techniques. Topics include atomic and molecular structure, chemical equilibrium, acid-base chemistry, thermodynamics, kinetics, and electrochemistry.",
            "id": "CHEM 109",
            "parent": "CHEM",
            "title": "ADVANCED GENERAL CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Explores the properties, reactions and uses of elements and compounds, with emphasis on coordination chemistry of transition-metal ions, bioinorganic chemistry, solid-state structure and main-group elements. Introduces the synthesis and characterization of inorganic compounds.",
            "id": "CHEM 311",
            "parent": "CHEM",
            "title": "CHEMISTRY ACROSS THE PERIODIC TABLE"
        }
    },
    {
        "data": {
            "description": "Principles and application of chemical equilibrium, coordination chemistry, oxidation-reduction and electrochemistry, kinetics, nuclear chemistry, introduction to organic chemistry, and chemistry laboratory skills.",
            "id": "CHEM 104",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Stoichiometry and the mole concept, the behavior of gases, liquids and solids, thermochemistry, electronic structure of atoms and chemical bonding, descriptive chemistry of selected elements and compounds, intermolecular forces, and chemistry laboratory skills.",
            "id": "CHEM 103",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Synthesis, purification, and characterization of compounds spanning the sub-disciplines of inorganic chemistry, including main-group, transition metal, bioinorganic, organometallic, and solid-state compounds. Laboratory skills developed include Schlenck techniques, glovebox methods, and high-temperature methods, all with an emphasis on chemical safety. Characterization methods may include UV-visible and IR spectroscopy, multi-nuclear NMR spectroscopy, magnetic susceptibility, cyclic voltammetry, mass spectrometry, X-ray diffraction, and chromatographic methods.",
            "id": "CHEM 512",
            "parent": "CHEM",
            "title": "ADVANCED SYNTHESIS AND LABORATORY TECHNIQUES"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 109"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 311"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 311",
            "target": "CHEM 512"
        }
    }
]