[
    {
        "data": {
            "description": "A quantitative treatment of macroscopic phenomena including thermodynamics, chemical equilibria, solution behavior, electrochemistry, and chemical kinetics.",
            "id": "CHEM 116",
            "parent": "CHEM",
            "title": "CHEMICAL PRINCIPLES II"
        }
    },
    {
        "data": {
            "description": "Accelerated coverage of topics in general chemistry, including introduction to laboratory techniques. Topics include atomic and molecular structure, chemical equilibrium, acid-base chemistry, thermodynamics, kinetics, and electrochemistry.",
            "id": "CHEM 109",
            "parent": "CHEM",
            "title": "ADVANCED GENERAL CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Chemistry of biological materials, intermediary metabolism and protein structure.",
            "id": "BIOCHEM 507",
            "parent": "BIOCHEM",
            "title": "GENERAL BIOCHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Chemistry, nutrition, and metabolism of biological systems.",
            "id": "BIOCHEM 501",
            "parent": "BIOCHEM",
            "title": "INTRODUCTION TO BIOCHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Core organic chemistry concepts of structure, reactivity, and synthesis with regards to the functional groups commonly found in commercial and biological substances. Covers a selection of topics fromCHEM 343and345.",
            "id": "CHEM 341",
            "parent": "CHEM",
            "title": "ELEMENTARY ORGANIC CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Equilibrium thermodynamics and chemical kinetics with emphasis on solution behavior and applications to biological macromolecules in solution. Focus on biological applications of physical chemistry.",
            "id": "CHEM 665",
            "parent": "CHEM",
            "title": "BIOPHYSICAL CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Explores a detailed atomic and molecular view of matter and its interactions, with a specific focus on quantum theory, molecular structure, and chemical bonding. Application required for enrollment.",
            "id": "CHEM 115",
            "parent": "CHEM",
            "title": "CHEMICAL PRINCIPLES I"
        }
    },
    {
        "data": {
            "description": "Explores the properties, reactions and uses of elements and compounds, with emphasis on coordination chemistry of transition-metal ions, bioinorganic chemistry, solid-state structure and main-group elements. Introduces the synthesis and characterization of inorganic compounds.",
            "id": "CHEM 311",
            "parent": "CHEM",
            "title": "CHEMISTRY ACROSS THE PERIODIC TABLE"
        }
    },
    {
        "data": {
            "description": "Fundamentals of chemical measurement in chemistry, biology, engineering, geology, and the medical sciences. Topics include equilibria of complex systems, spectroscopy, electrochemistry, separations, and quantitative laboratory technique. Covers chemical equilibria in greater depth and with greater mathematical rigor thanCHEM 327.",
            "id": "CHEM 329",
            "parent": "CHEM",
            "title": "FUNDAMENTALS OF ANALYTICAL SCIENCE"
        }
    },
    {
        "data": {
            "description": "Fundamentals of chemical measurement in chemistry, biology, engineering, geology, and the medical sciences. Topics include equilibria of complex systems, spectroscopy, electrochemistry, separations, and quantitative laboratory technique.",
            "id": "CHEM 327",
            "parent": "CHEM",
            "title": "FUNDAMENTALS OF ANALYTICAL SCIENCE"
        }
    },
    {
        "data": {
            "description": "Introduction to solid state materials chemistry, with an emphasis on contemporary topics in the chemistry of nanomaterials. Incorporates fundamental knowledge of solid-state chemistry and traditional materials chemistry with current nanoscale and nanostructural materials research.",
            "id": "CHEM 653",
            "parent": "CHEM",
            "title": "CHEMISTRY OF NANOSCALE MATERIALS"
        }
    },
    {
        "data": {
            "description": "Macroscopic theory:  laws and fundamental equations of thermodynamics, chemical equilibria, phase equilibria, and kinetic theory of gases.",
            "id": "CHEM 561",
            "parent": "CHEM",
            "title": "PHYSICAL CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Principles and application of chemical equilibrium, coordination chemistry, oxidation-reduction and electrochemistry, kinetics, nuclear chemistry, introduction to organic chemistry, and chemistry laboratory skills.",
            "id": "CHEM 104",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Principles of molecular structure and bonding applied to predict and explain the reactivity of alkanes, alkenes, alkynes, alkyl halides, alcohols, and thiols. Emphasis placed on rationalizing the stereochemical and regiochemical outcome of chemical processes.",
            "id": "CHEM 343",
            "parent": "CHEM",
            "title": "ORGANIC CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Principles of molecular structure and bonding applied to predict and explain the reactivity of aromatic systems, benzylic and allylic systems, aryl and vinyl halides, and carbonyl-containing compounds (e.g., ketones, carboxylic acids, esters, acid chlorides, amides). Emphasis placed on rationalizing the stereochemical and regiochemical outcome of chemical processes as well as arguing reaction outcomes from spectroscopic evidence.",
            "id": "CHEM 345",
            "parent": "CHEM",
            "title": "ORGANIC CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Stoichiometry and the mole concept, the behavior of gases, liquids and solids, thermochemistry, electronic structure of atoms and chemical bonding, descriptive chemistry of selected elements and compounds, intermolecular forces, and chemistry laboratory skills.",
            "id": "CHEM 103",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY I"
        }
    },
    {
        "data": {
            "id": "BIOCHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 501",
            "target": "CHEM 665"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 507",
            "target": "CHEM 665"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 109"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 311"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 343"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 115",
            "target": "CHEM 116"
        }
    },
    {
        "data": {
            "source": "CHEM 116",
            "target": "CHEM 561"
        }
    },
    {
        "data": {
            "source": "CHEM 311",
            "target": "CHEM 653"
        }
    },
    {
        "data": {
            "source": "CHEM 327",
            "target": "CHEM 329"
        }
    },
    {
        "data": {
            "source": "CHEM 329",
            "target": "CHEM 327"
        }
    },
    {
        "data": {
            "source": "CHEM 329",
            "target": "CHEM 561"
        }
    },
    {
        "data": {
            "source": "CHEM 341",
            "target": "BIOCHEM 501"
        }
    },
    {
        "data": {
            "source": "CHEM 343",
            "target": "BIOCHEM 501"
        }
    },
    {
        "data": {
            "source": "CHEM 343",
            "target": "CHEM 345"
        }
    },
    {
        "data": {
            "source": "CHEM 345",
            "target": "BIOCHEM 507"
        }
    },
    {
        "data": {
            "source": "CHEM 345",
            "target": "CHEM 341"
        }
    },
    {
        "data": {
            "source": "CHEM 561",
            "target": "CHEM 653"
        }
    },
    {
        "data": {
            "source": "CHEM 561",
            "target": "CHEM 665"
        }
    },
    {
        "data": {
            "source": "CHEM 665",
            "target": "CHEM 561"
        }
    }
]