[
    {
        "data": {
            "description": "Advanced language practice, including intensive writing and work in pertinent areas of grammar and stylistics.",
            "id": "SPANISH 311",
            "parent": "SPANISH",
            "title": "ADVANCED LANGUAGE PRACTICE"
        }
    },
    {
        "data": {
            "description": "An introduction to reading and analyzing literary works, with special emphasis on development of oral and written skills for the discussion of literature. Concentration on methods of analyzing basic literary forms, conventions, genres, and representative short texts in Spanish.",
            "id": "SPANISH 224",
            "parent": "SPANISH",
            "title": "INTRODUCTION TO HISPANIC LITERATURES"
        }
    },
    {
        "data": {
            "description": "Drawing from cultural studies, border studies and/or critical race theory, this course explores through cultural and literary texts the social and political issues regarding migration, contact zones, transculturation, and/or diaspora.",
            "id": "CHICLA/SPANISH 478",
            "title": "BORDER AND RACE STUDIES IN LATIN AMERICA"
        }
    },
    {
        "data": {
            "description": "Intensive practice in reading, writing, and grammar.",
            "id": "SPANISH 226",
            "parent": "SPANISH",
            "title": "INTERMEDIATE LANGUAGE PRACTICE WITH EMPHASIS ON WRITING AND GRAMMAR"
        }
    },
    {
        "data": {
            "description": "Offers an introduction to the culture and history of the Mexican and Latin American origin people in the United States. Emphasis on diversity, emergence of new imagined communities, and cultural hybridity. Focusing on key issues such as U.S. imperial expansion, colonialism, nation and community formations, migration, urban spaces, and the dynamics of race, class, gender, ethnicity, and sexuality, study a range of socio-political, historical, literary, and artistic expressions that inform the whole process of culture and reveal the way Latinos and Latinas negotiate their presence, cultural difference, and creativity in the U.S.",
            "id": "CHICLA/SPANISH 222",
            "title": "INTRODUCTION TO LATINX CULTURES"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "SPANISH",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "CHICLA/SPANISH 222",
            "target": "CHICLA/SPANISH 478"
        }
    },
    {
        "data": {
            "source": "SPANISH 224",
            "target": "CHICLA/SPANISH 478"
        }
    },
    {
        "data": {
            "source": "SPANISH 226",
            "target": "CHICLA/SPANISH 222"
        }
    },
    {
        "data": {
            "source": "SPANISH 226",
            "target": "SPANISH 224"
        }
    },
    {
        "data": {
            "source": "SPANISH 226",
            "target": "SPANISH 311"
        }
    },
    {
        "data": {
            "source": "SPANISH 311",
            "target": "SPANISH 226"
        }
    }
]