[
    {
        "data": {
            "description": "Advanced language practice, including intensive writing and work in pertinent areas of grammar and stylistics.",
            "id": "SPANISH 311",
            "parent": "SPANISH",
            "title": "ADVANCED LANGUAGE PRACTICE"
        }
    },
    {
        "data": {
            "description": "An introduction to reading and analyzing literary works, with special emphasis on development of oral and written skills for the discussion of literature. Concentration on methods of analyzing basic literary forms, conventions, genres, and representative short texts in Spanish.",
            "id": "SPANISH 224",
            "parent": "SPANISH",
            "title": "INTRODUCTION TO HISPANIC LITERATURES"
        }
    },
    {
        "data": {
            "description": "Intensive practice in reading, writing, and grammar.",
            "id": "SPANISH 226",
            "parent": "SPANISH",
            "title": "INTERMEDIATE LANGUAGE PRACTICE WITH EMPHASIS ON WRITING AND GRAMMAR"
        }
    },
    {
        "data": {
            "description": "Introduction to the issues which shape the national cultures and the cultural practices of the Hispanic world. Emphasis on diversity, emergence of new imagined communities, cultural hybridity, and social movements within a historical framework.",
            "id": "SPANISH 223",
            "parent": "SPANISH",
            "title": "INTRODUCTION TO HISPANIC CULTURES"
        }
    },
    {
        "data": {
            "description": "Study the literature of Latinos and Latinas in the United States, particularly of writers of Mexican, Puerto Rican, Cuban, Dominican and Central American descent. Examines the impact of race and how individuals and communities negotiate situations of internal colonialism, migration, generational conflicts, tensions between assimilation and cultural preservation, gender roles, literary traditions, and transnational situations. Considers the linguistic, cultural and formal singularity of Latinx literature, the use of Spanish and English languages, the advent of feminist and queer writing, and the vision of the United States in their works regarding its past, its present and its future. Explores the intersectionality of race, ethnicity, class, gender, sexuality, and literary forms. Diverse theories and ways to read literary texts will be explored. Literary texts - novels, short stories, poetry and essays - will be read in English or Spanish, or a combination of both. Taught in Spanish",
            "id": "CHICLA/SPANISH 467",
            "title": "US LATINO LITERATURE"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "SPANISH",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "SPANISH 223",
            "target": "CHICLA/SPANISH 467"
        }
    },
    {
        "data": {
            "source": "SPANISH 224",
            "target": "CHICLA/SPANISH 467"
        }
    },
    {
        "data": {
            "source": "SPANISH 226",
            "target": "SPANISH 223"
        }
    },
    {
        "data": {
            "source": "SPANISH 226",
            "target": "SPANISH 224"
        }
    },
    {
        "data": {
            "source": "SPANISH 226",
            "target": "SPANISH 311"
        }
    },
    {
        "data": {
            "source": "SPANISH 311",
            "target": "SPANISH 226"
        }
    }
]