[
    {
        "data": {
            "source": "CHEM 109",
            "target": "CIVENGR 320"
        }
    },
    {
        "data": {
            "id": "CIVENGR",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Fundamental sanitary aspects of environmental engineering. Role of the engineer in the control of the environment; water supply and wastewater problems; solid waste disposal; air pollution; and administration in environmental engineering.",
            "id": "CIVENGR 320",
            "parent": "CIVENGR",
            "title": "ENVIRONMENTAL ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Accelerated coverage of topics in general chemistry, including introduction to laboratory techniques. Topics include atomic and molecular structure, chemical equilibrium, acid-base chemistry, thermodynamics, kinetics, and electrochemistry.",
            "id": "CHEM 109",
            "parent": "CHEM",
            "title": "ADVANCED GENERAL CHEMISTRY"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CIVENGR 320"
        }
    },
    {
        "data": {
            "description": "Principles and application of chemical equilibrium, coordination chemistry, oxidation-reduction and electrochemistry, kinetics, nuclear chemistry, introduction to organic chemistry, and chemistry laboratory skills.",
            "id": "CHEM 104",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY II"
        }
    },
    {
        "data": {
            "source": "CHEM 115",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "source": "CIVENGR 320",
            "target": "CIVENGR 422"
        }
    },
    {
        "data": {
            "description": "Explores a detailed atomic and molecular view of matter and its interactions, with a specific focus on quantum theory, molecular structure, and chemical bonding. Application required for enrollment.",
            "id": "CHEM 115",
            "parent": "CHEM",
            "title": "CHEMICAL PRINCIPLES I"
        }
    },
    {
        "data": {
            "description": "Overview of the public health profession and the role of environmental  sanitary engineers in public health. Introduction to chemical and microbial contaminants of public health concern - their routes of exposure and development of regulatory standards for drinking water, air, hazardous wastes, and industrial workplaces. Introduction to occurrence, toxicity, and virulence as components of public health risk and the engineer's role in identifying occurrence and design of engineering controls for public health protection.",
            "id": "CIVENGR 422",
            "parent": "CIVENGR",
            "title": "ELEMENTS OF PUBLIC HEALTH ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Stoichiometry and the mole concept, the behavior of gases, liquids and solids, thermochemistry, electronic structure of atoms and chemical bonding, descriptive chemistry of selected elements and compounds, intermolecular forces, and chemistry laboratory skills.",
            "id": "CHEM 103",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY I"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 109"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "CHEM 104"
        }
    }
]