[
    {
        "data": {
            "description": "Utilize computer and information/decision science to support quality and safety in health care. Explore informatics issues and examine nursing's role in healthcare technology. Opportunities to use and master various healthcare technologies and healthcare data will be given.",
            "id": "CNP 453",
            "parent": "CNP",
            "title": "INFORMATION MANAGEMENT AND HEALTHCARE TECHNOLOGY"
        }
    },
    {
        "data": {
            "description": "Designed to advance knowledge of nursing as it is embedded in clinical practice, address current and emerging health care trends, and examine healthcare workforce data and health care policy as it impacts opportunities for and impediments to nursing practice.",
            "id": "CNP 306",
            "parent": "CNP",
            "title": "TRANSITIONS: PRACTICE, PROFESSIONAL AND PERSONAL"
        }
    },
    {
        "data": {
            "description": "Examines nursing leadership and management using relevant theories and concepts. Analyze decision-making in relation to communication, delegation, supervision and group process.",
            "id": "CNP 447",
            "parent": "CNP",
            "title": "LEADERSHIP AND MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Exploration of interaction of biological, psychological, social, and environmental factors important to understanding management of chronic conditions at the individual, family, community, and societal levels.",
            "id": "CNP 441",
            "parent": "CNP",
            "title": "CHRONIC CARE MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Introduces the concept of evidence-based practice, the importance of evidence to improve clinical practice, strategies to evaluate the quality of evidence, and how to design an evidence-based project.",
            "id": "CNP 446",
            "parent": "CNP",
            "title": "NURSING RESEARCH AND EVIDENCE-BASED PRACTICE"
        }
    },
    {
        "data": {
            "description": "Nursing care of populations and communities to facilitate optimal health outcomes.",
            "id": "CNP 454",
            "parent": "CNP",
            "title": "COMMUNITY HEALTH NURSING"
        }
    },
    {
        "data": {
            "description": "Philosophical perspectives, theories, and standards are applied to the practice of professional nursing. Factors influencing nursing/healthcare delivery are analyzed. Professional communication and critical thinking skills are enhanced.",
            "id": "CNP 407",
            "parent": "CNP",
            "title": "FOUNDATIONS OF PROFESSIONAL NURSING PRACTICE"
        }
    },
    {
        "data": {
            "description": "Synthesizes professional nursing knowledge in a variety of practice settings. Practicum sites may include hospitals, clinics, long-term care (LTC), and community-based settings, or practicums in policy or health care systems. Expand skills sets by exposure to best practices in a clinical setting of choice. The practicum enriches the integration of knowledge from current and past academic and clinical learning experiences.",
            "id": "CNP 519",
            "parent": "CNP",
            "title": "CAPSTONE PRACTICUM FOR REGISTERED NURSES"
        }
    },
    {
        "data": {
            "id": "CNP",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "CNP 306",
            "target": "CNP 519"
        }
    },
    {
        "data": {
            "source": "CNP 407",
            "target": "CNP 519"
        }
    },
    {
        "data": {
            "source": "CNP 441",
            "target": "CNP 519"
        }
    },
    {
        "data": {
            "source": "CNP 446",
            "target": "CNP 519"
        }
    },
    {
        "data": {
            "source": "CNP 447",
            "target": "CNP 519"
        }
    },
    {
        "data": {
            "source": "CNP 453",
            "target": "CNP 519"
        }
    },
    {
        "data": {
            "source": "CNP 454",
            "target": "CNP 519"
        }
    }
]