[
    {
        "data": {
            "description": "Foundational knowledge of the retail industry including the retail process, the evolution of the industry, key drivers and trends to provide a framework and set of concepts that will support the remainder of the core retail courses.",
            "id": "CNSRSCI 257",
            "parent": "CNSRSCI",
            "title": "INTRODUCTION TO RETAIL"
        }
    },
    {
        "data": {
            "description": "Examines generally accepted accounting principles for measurement and reporting of financial information in a balance sheet, income statement, and statement of cash flows; introduction to analysis and interpretation of financial accounting data for decision-making purposes.",
            "id": "ACCTIS 100",
            "parent": "ACCTIS",
            "title": "INTRODUCTORY FINANCIAL ACCOUNTING"
        }
    },
    {
        "data": {
            "id": "CNSRSCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Part of a two course sequence introducing non-business students to basic concepts, practices and analytical methods that are part of the market enterprise system. This course is a basic overview on: accounting, finance, and business law.",
            "id": "GENBUS 310",
            "parent": "GENBUS",
            "title": "FUNDAMENTALS OF ACCOUNTING AND FINANCE FOR NON-BUSINESS MAJORS"
        }
    },
    {
        "data": {
            "source": "ACCTIS 300",
            "target": "ACCTIS 100"
        }
    },
    {
        "data": {
            "source": "CNSRSCI 257",
            "target": "CNSRSCI 564"
        }
    },
    {
        "data": {
            "source": "ACCTIS 300",
            "target": "CNSRSCI 564"
        }
    },
    {
        "data": {
            "source": "ACCTIS 100",
            "target": "ACCTIS 300"
        }
    },
    {
        "data": {
            "id": "ACCTIS",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Examines both financial and managerial accounting for business decisions. Emphasizes preparation and interpretation of financial statements, analysis of financial information, determination of costs for products and services, and use of accounting information for planning and control of business operations.",
            "id": "ACCTIS 300",
            "parent": "ACCTIS",
            "title": "ACCOUNTING PRINCIPLES"
        }
    },
    {
        "data": {
            "source": "GENBUS 310",
            "target": "CNSRSCI 564"
        }
    },
    {
        "data": {
            "description": "Provides tools for planning and analyzing retail financial performance. Includes elements of retail financial statements, pricing, purchasing terms and conditions, merchandise planning, inventory control, and economic factors that impact retail businesses.",
            "id": "CNSRSCI 564",
            "parent": "CNSRSCI",
            "title": "RETAIL FINANCIAL ANALYSIS"
        }
    },
    {
        "data": {
            "id": "GENBUS",
            "type": "compound"
        }
    }
]