[
    {
        "data": {
            "id": "GEN&WS",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "A humanities-oriented analysis of cultural representations of women and men within the social and historical contexts of race, class, gender and sexuality; engages with a range of traditions and modes of representation including literature, mass media and popular culture.",
            "id": "GEN&WS 101",
            "parent": "GEN&WS",
            "title": "GENDER, WOMEN, AND CULTURAL REPRESENTATION"
        }
    },
    {
        "data": {
            "source": "COMARTS 250",
            "target": "COMARTS/GEN&WS 418"
        }
    },
    {
        "data": {
            "description": "Key concepts for the critical analysis of television, film, radio, and digital media. Focusing primarily on meanings, aesthetics, technology, media industries, representations, and audiences.",
            "id": "COMARTS 250",
            "parent": "COMARTS",
            "title": "SURVEY OF CONTEMPORARY MEDIA"
        }
    },
    {
        "data": {
            "description": "Examines images of gender and sexuality in the media, with a focus on contemporary media in the U.S. Using theories from cultural studies, film and media studies, gender studies, and communication explore different processes and practices of gender and sexuality. Look at the way that gender and sexuality are constructed through social, cultural, and economic forces, and the way that these identities intersect with other social identities such as race, ethnicity, and class. Consider the way that media impact our understanding of feminism and post-feminism, violence, celebrity, consumer culture, subcultures and activism.",
            "id": "COMARTS/GEN&WS 418",
            "title": "GENDER, SEXUALITY, AND THE MEDIA"
        }
    },
    {
        "data": {
            "source": "GEN&WS 101",
            "target": "COMARTS/GEN&WS 418"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "COMARTS",
            "type": "compound"
        }
    }
]