[
    {
        "data": {
            "description": "Explains how films work using classics such as \"Citizen Kane,\" \"Vertigo,\" \"Battleship Potemkin,\" and \"Do The Right Thing.\" Study film as an art form and a medium, cover all the major film types (silent, classical, and contemporary narrative cinema, art cinema, animation, documentary, and experimental film), and get introduced to two basic approaches to film criticism: authorship criticism and genre criticism. Learn to recognize film techniques--mise-en-scène, cinematography, editing, and sound--and to analyze how filmmakers make us watch, think, and feel.",
            "id": "COMARTS 350",
            "parent": "COMARTS",
            "title": "INTRODUCTION TO FILM"
        }
    },
    {
        "data": {
            "description": "Key concepts for the critical analysis of television, film, radio, and digital media. Focusing primarily on meanings, aesthetics, technology, media industries, representations, and audiences.",
            "id": "COMARTS 250",
            "parent": "COMARTS",
            "title": "SURVEY OF CONTEMPORARY MEDIA"
        }
    },
    {
        "data": {
            "description": "Survey of significant trends within both classical and contemporary film theory. Designed for those interested in reading, analyzing, and evaluating the central concepts and intellectual history of writings about film, particularly with respect to film as a medium presenting an array of aesthetic, psychological, and social potentialities. Whereas classical film theory attempts to treat cinema as a unique art form, contemporary film theory addresses issues related to cinema as a mode of communication, a source of visual pleasure, and as an ideological tool. Much contemporary theory attempts to incorporate the insights of other critical and analytical paradigms, such as semiotics, psychoanalysis, feminism, queer theory, critical race theory, postmodernism, and cognitive science. Questions regarding the ontology of cinema, its relation to existing theories of art, its effects on spectators, and the various ways in which its formal properties create meaning are considered.",
            "id": "COMARTS 669",
            "parent": "COMARTS",
            "title": "FILM THEORY"
        }
    },
    {
        "data": {
            "id": "COMARTS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "COMARTS 250",
            "target": "COMARTS 350"
        }
    },
    {
        "data": {
            "source": "COMARTS 350",
            "target": "COMARTS 669"
        }
    }
]