[
    {
        "data": {
            "description": "Learn the fundamentals of short-film production, including cinematography, lighting, and sound recording. With an emphasis on dramatic storytelling, produce scenes from existing scripts, rotating through crew positions. Directing, editing, and color grading will be covered, with casting, location scouting, and production design incorporated to successfully produce each scene. Gain an understanding of the inner-workings of a film crew, the operation of digital cinema technologies, and visual and aural storytelling aesthetics and techniques.",
            "id": "COMARTS 467",
            "parent": "COMARTS",
            "title": "CINEMATOGRAPHY AND SOUND RECORDING"
        }
    },
    {
        "data": {
            "description": "Provides an immersive experience in the art of cinematic storytelling. This capstone workshop is structured around the creation of a half-hour finished film, planned and completed as a group, with roles matching those of a professional crew. Working with an existing script and using state-of-the-art digital tools, students gain knowledge in a wide variety of motion-picture production skills. Most importantly, explore the meanings and nuances of a script, making the artistic choices necessary to bring the story to the screen. Present a completed film in a public, campus screening.",
            "id": "COMARTS 659",
            "parent": "COMARTS",
            "title": "ADVANCED MOTION PICTURE PRODUCTION WORKSHOP"
        }
    },
    {
        "data": {
            "description": "Teaches the skills needed to produce, engage with, and understand new and emerging technologies within the context of communication and creative expression. Become a more critical consumer and producer of digital media.",
            "id": "COMARTS 155",
            "parent": "COMARTS",
            "title": "INTRODUCTION TO DIGITAL MEDIA PRODUCTION"
        }
    },
    {
        "data": {
            "description": "Theory and practice of media production and screenwriting.",
            "id": "COMARTS 355",
            "parent": "COMARTS",
            "title": "INTRODUCTION TO MEDIA PRODUCTION"
        }
    },
    {
        "data": {
            "id": "COMARTS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "COMARTS 155",
            "target": "COMARTS 355"
        }
    },
    {
        "data": {
            "source": "COMARTS 355",
            "target": "COMARTS 467"
        }
    },
    {
        "data": {
            "source": "COMARTS 467",
            "target": "COMARTS 659"
        }
    }
]