[
    {
        "data": {
            "description": "An introduction to fundamental structures of computer systems and the C programming language with a focus on the low-level interrelationships and impacts on performance. Topics include the virtual address space and virtual memory, the heap and dynamic memory management, the memory hierarchy and caching, assembly language and the stack, communication and interrupts/signals, compiling and assemblers/linkers.",
            "id": "COMPSCI/ECE 354",
            "title": "MACHINE ORGANIZATION AND PROGRAMMING"
        }
    },
    {
        "data": {
            "description": "Input-output hardware, interrupt handling, properties of magnetic tapes, discs and drums, associative memories and virtual address translation techniques. Batch processing, time sharing and real-time systems, scheduling resource allocation, modular software systems, performance measurement and system evaluation.",
            "id": "COMPSCI 537",
            "parent": "COMPSCI",
            "title": "INTRODUCTION TO OPERATING SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Introduction to Object-Oriented Programming using classes and objects to solve more complex problems. Introduces array-based and linked data structures: including lists, stacks, and queues. Programming assignments require writing and developing multi-class (file) programs using interfaces, generics, and exception handling to solve challenging real world problems. Topics reviewed include reading/writing data and objects from/to files and exception handling, and command line arguments. Topics introduced: object-oriented design; class vs. object; create and define interfaces and iterators; searching and sorting; abstract data types (List,Stack,Queue,PriorityQueue(Heap),Binary Search Tree); generic interfaces (parametric polymorphism); how to design and write test methods and classes; array based vs. linked node implementations; introduction to complexity analysis; recursion.",
            "id": "COMPSCI 300",
            "parent": "COMPSCI",
            "title": "PROGRAMMING II"
        }
    },
    {
        "data": {
            "description": "Learn the process of incrementally developing small (200-500 lines) programs along with the fundamental Computer Science topics. These topics include: problem abstraction and decomposition, the edit-compile-run cycle, using variables of primitive and more complex data types, conditional and loop-based flow control, basic testing and debugging techniques, how to define and call functions (methods), and IO processing techniques. Also teaches and reinforces good programming practices including the use of a consistent style, and meaningful documentation. Intended for students who have no prior programming experience.",
            "id": "COMPSCI 200",
            "parent": "COMPSCI",
            "title": "PROGRAMMING I"
        }
    },
    {
        "data": {
            "description": "Logic components built with transistors, rudimentary Boolean algebra, basic combinational logic design, basic synchronous sequential logic design, basic computer organization and design, introductory machine- and assembly-language programming.",
            "id": "COMPSCI/ECE 252",
            "title": "INTRODUCTION TO COMPUTER ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Senior level undergraduate course covering various topics on information security. Covers a wide range of topics, such as cryptographic primitives, security protocols, system security, and emerging topics.  Elementary knowledge of mathematical logic and discrete probability theory needed, such asMATH/​COMP SCI  240.",
            "id": "COMPSCI 642",
            "parent": "COMPSCI",
            "title": "INTRODUCTION TO INFORMATION SECURITY"
        }
    },
    {
        "data": {
            "id": "COMPSCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "COMPSCI 200",
            "target": "COMPSCI 300"
        }
    },
    {
        "data": {
            "source": "COMPSCI 300",
            "target": "COMPSCI/ECE 354"
        }
    },
    {
        "data": {
            "source": "COMPSCI 537",
            "target": "COMPSCI 642"
        }
    },
    {
        "data": {
            "source": "COMPSCI/ECE 252",
            "target": "COMPSCI/ECE 354"
        }
    },
    {
        "data": {
            "source": "COMPSCI/ECE 354",
            "target": "COMPSCI 537"
        }
    }
]