[
    {
        "data": {
            "source": "COMPSCI/ECE 252",
            "target": "COMPSCI 300"
        }
    },
    {
        "data": {
            "source": "COMPSCI 200",
            "target": "COMPSCI 300"
        }
    },
    {
        "data": {
            "description": "Logic components built with transistors, rudimentary Boolean algebra, basic combinational logic design, basic synchronous sequential logic design, basic computer organization and design, introductory machine- and assembly-language programming.",
            "id": "COMPSCI/ECE 252",
            "title": "INTRODUCTION TO COMPUTER ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Introduction to Data Science programming using Python.  No previous programming experience required.  Emphasis on analyzing real datasets in a variety of forms and visual communication.",
            "id": "COMPSCI 220",
            "parent": "COMPSCI",
            "title": "DATA SCIENCE PROGRAMMING I"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 213"
        }
    },
    {
        "data": {
            "source": "COMPSCI 310",
            "target": "COMPSCI 300"
        }
    },
    {
        "data": {
            "description": "Intermediate approach to Data Science programming using Python. Experience with basic tabular analysis in Python is assumed. Learn to implement data structures (e.g., graphs) to efficiently represent datasets. Software-engineering tools such as version control and Python virtual environments will be introduced, with an emphasis on reproducibility of analysis. Tracing and A/B testing will be introduced as techniques for generating meaningful datasets. Introduces basic classification, clustering, optimization, and simulation techniques. Plotting and visual communication will be emphasized throughout the course.",
            "id": "COMPSCI 320",
            "parent": "COMPSCI",
            "title": "DATA SCIENCE PROGRAMMING II"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "COMPSCI 540"
        }
    },
    {
        "data": {
            "source": "COMPSCI 300",
            "target": "COMPSCI 540"
        }
    },
    {
        "data": {
            "description": "Learn the process of incrementally developing small (200-500 lines) programs along with the fundamental Computer Science topics. These topics include: problem abstraction and decomposition, the edit-compile-run cycle, using variables of primitive and more complex data types, conditional and loop-based flow control, basic testing and debugging techniques, how to define and call functions (methods), and IO processing techniques. Also teaches and reinforces good programming practices including the use of a consistent style, and meaningful documentation. Intended for students who have no prior programming experience.",
            "id": "COMPSCI 200",
            "parent": "COMPSCI",
            "title": "PROGRAMMING I"
        }
    },
    {
        "data": {
            "source": "COMPSCI 220",
            "target": "COMPSCI 320"
        }
    },
    {
        "data": {
            "description": "Gives students an introduction to computer and analytical skills to use in their subsequent course work and professional development. Discusses several methods of using computers to solve problems, including elementary programming techniques, symbolic manipulation languages, and software packages. Techniques will be illustrated using sample problems drawn from elementary engineering. Emphasis is on introduction of algorithms with the use of specific tools to illustrate the methods.",
            "id": "COMPSCI 310",
            "parent": "COMPSCI",
            "title": "PROBLEM SOLVING USING COMPUTERS"
        }
    },
    {
        "data": {
            "description": "Principles of knowledge-based search techniques, automatic deduction, knowledge representation using predicate logic, machine learning, probabilistic reasoning. Applications in tasks such as problem solving, data mining, game playing, natural language understanding, computer vision, speech recognition, and robotics.",
            "id": "COMPSCI 540",
            "parent": "COMPSCI",
            "title": "INTRODUCTION TO ARTIFICIAL INTELLIGENCE"
        }
    },
    {
        "data": {
            "description": "Techniques of integration, improper integrals, first order ordinary differential equations, sequences and series, Taylor series, vector geometry in two and three dimensions.",
            "id": "MATH 222",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 2"
        }
    },
    {
        "data": {
            "source": "COMPSCI 220",
            "target": "COMPSCI 300"
        }
    },
    {
        "data": {
            "description": "First order differential equations, introduction to multivariable calculus and constrained optimization, infinite sequences and series, methods of approximation, and a brief introduction to probability. Models and applications from business and the social sciences.",
            "id": "MATH 213",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 2"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "COMPSCI 310"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 222"
        }
    },
    {
        "data": {
            "description": "Introduction to Object-Oriented Programming using classes and objects to solve more complex problems. Introduces array-based and linked data structures: including lists, stacks, and queues. Programming assignments require writing and developing multi-class (file) programs using interfaces, generics, and exception handling to solve challenging real world problems. Topics reviewed include reading/writing data and objects from/to files and exception handling, and command line arguments. Topics introduced: object-oriented design; class vs. object; create and define interfaces and iterators; searching and sorting; abstract data types (List,Stack,Queue,PriorityQueue(Heap),Binary Search Tree); generic interfaces (parametric polymorphism); how to design and write test methods and classes; array based vs. linked node implementations; introduction to complexity analysis; recursion.",
            "id": "COMPSCI 300",
            "parent": "COMPSCI",
            "title": "PROGRAMMING II"
        }
    },
    {
        "data": {
            "source": "COMPSCI 320",
            "target": "COMPSCI 540"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Introduction to Data Science programming using Python. In addition to a survey of programming basics (control flow and data structures), web scraping, database queries, and tabular analysis will be introduced. Projects will emphasize analyzing real datasets in a variety of forms and visual communication using plotting tools. Similar toCOMP SCI 220but the pedagogical style of the projects will be adapted to graduate students in fields other than computer science and data science. No previous programming experience required.",
            "id": "COMPSCI 319",
            "parent": "COMPSCI",
            "title": "DATA SCIENCE PROGRAMMING I FOR RESEARCH"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "source": "MATH 213",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "id": "COMPSCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "COMPSCI 319",
            "target": "COMPSCI 320"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    }
]