[
    {
        "data": {
            "source": "STAT 240",
            "target": "STAT 340"
        }
    },
    {
        "data": {
            "source": "COMPSCI 220",
            "target": "COMPSCI 541"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "STAT 340"
        }
    },
    {
        "data": {
            "description": "Introduces reproducible data management, modeling, analysis, and statistical inference through a practical, hands-on case studies approach. Topics include the use of an integrated statistical computing environment, data wrangling, the R programming language, data graphics and visualization, random variables and concepts of probability including the binomial and normal distributions, data modeling, statistical inference in one- and two- sample settings for proportions and means, simple linear regression, and report generation using R Markdown with applications to a wide variety of data to address open-ended questions.",
            "id": "STAT 240",
            "parent": "STAT",
            "title": "DATA SCIENCE MODELING I"
        }
    },
    {
        "data": {
            "description": "Introduction to Data Science programming using Python.  No previous programming experience required.  Emphasis on analyzing real datasets in a variety of forms and visual communication.",
            "id": "COMPSCI 220",
            "parent": "COMPSCI",
            "title": "DATA SCIENCE PROGRAMMING I"
        }
    },
    {
        "data": {
            "description": "Introduction to calculus of functions of several variables; calculus on parameterized curves, derivatives of functions of several variables, multiple integrals, vector calculus.",
            "id": "MATH 234",
            "parent": "MATH",
            "title": "CALCULUS--FUNCTIONS OF SEVERAL VARIABLES"
        }
    },
    {
        "data": {
            "description": "Elements of probability, important discrete distributions, acceptance sampling by attributes, sample characteristics, probability distributions and population characteristics, the normal distribution, acceptance sampling plans based on sample means and variances, sampling from the normal, the central limit theorem, point and interval estimation.",
            "id": "STAT 311",
            "parent": "STAT",
            "title": "INTRODUCTION TO THEORY AND METHODS OF MATHEMATICAL STATISTICS I"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 213"
        }
    },
    {
        "data": {
            "description": "Probability and combinatorial methods, discrete and continuous, univariate and multivariate distributions, expected values, moments, normal distribution and derived distributions, estimation.",
            "id": "MATH/STAT 309",
            "title": "INTRODUCTION TO PROBABILITY AND MATHEMATICAL STATISTICS I"
        }
    },
    {
        "data": {
            "source": "STAT 340",
            "target": "COMPSCI 541"
        }
    },
    {
        "data": {
            "description": "Theoretical methods for data science. Topics include: review of probability background, concentration inequalities, geometry of high dimensional random variables, parametric and non-parametric estimation, selected topics from optimization (optimality conditions; deterministic and stochastic gradient descent), PAC learning, sample complexity and algorithms for linear classification and regression, and property/distribution testing. Uses Python programming language.",
            "id": "COMPSCI 541",
            "parent": "COMPSCI",
            "title": "THEORY & ALGORITHMS FOR DATA SCIENCE"
        }
    },
    {
        "data": {
            "source": "MATH/STAT 431",
            "target": "MATH/STAT 309"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 234"
        }
    },
    {
        "data": {
            "description": "Techniques of integration, improper integrals, first order ordinary differential equations, sequences and series, Taylor series, vector geometry in two and three dimensions.",
            "id": "MATH 222",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 2"
        }
    },
    {
        "data": {
            "source": "MATH/STAT 431",
            "target": "STAT 311"
        }
    },
    {
        "data": {
            "description": "First order differential equations, introduction to multivariable calculus and constrained optimization, infinite sequences and series, methods of approximation, and a brief introduction to probability. Models and applications from business and the social sciences.",
            "id": "MATH 213",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 2"
        }
    },
    {
        "data": {
            "source": "STAT 311",
            "target": "COMPSCI 541"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 222"
        }
    },
    {
        "data": {
            "source": "MATH 375",
            "target": "MATH 376"
        }
    },
    {
        "data": {
            "description": "Teaches how to explore, model, and analyze data using R. Topics include basic probability models; the central limit theorem; Monte Carlo simulation; one- and two-sample hypothesis testing; Bayesian inference; linear and logistic regression; ANOVA; the bootstrap; random forests and cross-validation. Features the analysis of real-world data sets and the communication of findings in a clear and reproducible manner within a project setting.",
            "id": "STAT 340",
            "parent": "STAT",
            "title": "DATA SCIENCE MODELING II"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "MATH/STAT 431"
        }
    },
    {
        "data": {
            "source": "MATH/STAT 309",
            "target": "STAT 311"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "source": "MATH 376",
            "target": "MATH/STAT 431"
        }
    },
    {
        "data": {
            "source": "MATH 213",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "description": "Vector spaces and linear transformations, differential calculus of scalar and vector fields, determinants, eigenvalues and eigenvectors, multiple integrals, line integrals, and surface integrals. Freshmen students are invited to enroll by the Department of Mathematics.",
            "id": "MATH 375",
            "parent": "MATH",
            "title": "TOPICS IN MULTI-VARIABLE CALCULUS AND LINEAR ALGEBRA"
        }
    },
    {
        "data": {
            "id": "STAT",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Topics in multi-variable calculus and introduction to differential equations.",
            "id": "MATH 376",
            "parent": "MATH",
            "title": "TOPICS IN MULTI-VARIABLE CALCULUS AND DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "description": "Topics covered include axioms of probability, random variables, the most important discrete and continuous probability distributions, expectation and variance, moment generating functions, conditional probability and conditional expectations, multivariate distributions, Markov's and Chebyshev's inequalities, laws of large numbers, and the central limit theorem.",
            "id": "MATH/STAT 431",
            "title": "INTRODUCTION TO THE THEORY OF PROBABILITY"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "id": "COMPSCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    }
]