[
    {
        "data": {
            "description": "An academic and experiential introduction to mindfulness meditation framed within the perspective of psychology is provided. Scientific research and modern meditation instructions that have formed the basis of a variety of secular mindfulness-based interventions are reviewed. Readings will adopt a variety of perspectives and methodologies, including conceptual/theoretical work, clinical trials, review articles including meta-analyses (i.e., aggregating findings across studies), and measurement-oriented studies. Key topics include: Buddhist and historical underpinnings of secular mindfulness-based stress reduction (MBSR) and similar interventions (e.g., lovingkindness and compassion-based meditation), and empirical literature pertaining to neuroscientific and clinical effects of mindfulness training and related interventions.",
            "id": "COUNPSY 372",
            "parent": "COUNPSY",
            "title": "PSYCHOLOGY OF MINDFULNESS"
        }
    },
    {
        "data": {
            "description": "Designed to increase knowledge, awareness, and skills of students interested in working on mental health matters within diverse identity groups and communities. Conceptualize mental health and well-being across communities in terms of (a) intersectional identities (individual and groups), (b) mental health and access and utilization of services, and (c) social determinants of health in different contexts and settings. Engage in reflective exercises to understand how their social identities influence their work in different types of communities.",
            "id": "COUNPSY 237",
            "parent": "COUNPSY",
            "title": "MENTAL HEALTH, SELF-AWARENESS, AND SOCIAL JUSTICE: WORKING IN DIVERSE COMMUNITIES"
        }
    },
    {
        "data": {
            "source": "COUNPSY 237",
            "target": "COUNPSY 372"
        }
    },
    {
        "data": {
            "id": "COUNPSY",
            "type": "compound"
        }
    }
]