[
    {
        "data": {
            "description": "Critically approaches a range of complexities entailed in teaching abroad. Power-knowledge relations in pedagogical acts of planning, implementation and reflection will be identified and analyzed. Several basic formats for lesson preparation will be introduced. A variety of teaching techniques for implementing lesson plans will be practiced with peers. Approaches for critically reflecting in verbal and written ways upon teaching/learning and power-knowledge relations integral to curriculum and instruction, student inclusion/exclusion, and cultural responsiveness will be surveyed.",
            "id": "CURRIC 418",
            "parent": "CURRIC",
            "title": "PREPARING TO TEACH ABROAD"
        }
    },
    {
        "data": {
            "id": "CURRIC",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "CURRIC 366",
            "target": "CURRIC 419"
        }
    },
    {
        "data": {
            "description": "Internationalizing education means both internationalizing our thinking and the ways we perceive the world, and internationalizing the field of curriculum and instruction. An introduction to various educational systems around the world, focusing on similarities and dissimilarities in what is taught. Discussions center on curriculum across cultures, and its relation to political systems and religions to build an understanding of diversity in societies and schools. Explores local and indigenous knowledge; the role of international agencies in comparing nation's school systems; the rise of private schools and universities; immigration and the changing borders of society and cultures in the curriculum; questions of sexuality and gender diversity; diversity of families and social exclusions and inequalities in elementary and secondary schools; as well as international opportunities for study with international and local speakers from multiple perspectives.",
            "id": "CURRIC 366",
            "parent": "CURRIC",
            "title": "INTERNATIONALIZING EDUCATIONAL KNOWLEDGE"
        }
    },
    {
        "data": {
            "source": "CURRIC 418",
            "target": "CURRIC 419"
        }
    },
    {
        "data": {
            "description": "Formulate and reflect on the obligations and responsibilities of teaching in contexts different from the US. Capstone provides field experiences with virtual, community, and campus organizations relevant to planning curriculum, teaching, and cross-cultural comparison of educational contexts. Addresses colonization and power, assumptions of difference, and cross-cultural awareness in teaching and learning.",
            "id": "CURRIC 419",
            "parent": "CURRIC",
            "title": "PREPARING TO TEACH ABROAD CAPSTONE"
        }
    }
]