[
    {
        "data": {
            "description": "Develop safe, skilled hip-hop dance execution. Emphasis is placed on applying technique in the improvisational space of the cypher-a sacred circle for exchanging movement knowledge. This space embodies the theory of ritual and play, where ritual is the structure and play is the expressive exchange, ranging from collaborative to competitive. Focuses on cypher training and choreographic retention while exploring hip-hop dance as a cultural and artistic expression. Examine the historical, philosophical, and improvisational roots of Hip-Hop, tracing its lineage through African, Caribbean, and Afro-Latin cultures, as well as its connections to ragtime, swing, and rock n' roll in 20th- and 21st-century America.",
            "id": "DANCE 215",
            "parent": "DANCE",
            "title": "HIP HOP TECHNIQUE AND THEORY II"
        }
    },
    {
        "data": {
            "description": "Provides an introduction to foundational movement technical knowledge necessary to perform Hip-Hop dance safely with form and skill. Introduces the theory, practice, aesthetics, and historical foundations of hip-hop dance. Hip-Hop dance is an artistic manifestation of Hip-Hop culture with dances and movement activities related to histories and philosophies as well as improvisatory states of expression. Engage with the history, theory and philosophy surrounding the dance vocabulary, which directly impacts the physical intelligence of the dancer. Explore the roots of funk and Hip-Hop dance in the social fabric of African, Caribbean, and Afro-Latin cultures while examining reinventions of ragtime, swing, and rock n' roll throughout the 20th and 21st centuries in America.",
            "id": "DANCE 115",
            "parent": "DANCE",
            "title": "HIP-HOP DANCE TECHNIQUE AND THEORY 1"
        }
    },
    {
        "data": {
            "id": "DANCE",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "DANCE 115",
            "target": "DANCE 215"
        }
    }
]