[
    {
        "data": {
            "description": "Basic principles and elements of design as they apply to apparel. Emphasizing both process and product, students analyze fashion trends and practical problems while developing and executing original designs.",
            "id": "DS 225",
            "parent": "DS",
            "title": "APPAREL DESIGN I"
        }
    },
    {
        "data": {
            "description": "Elements and principles of design relevant to design of the visual environment.",
            "id": "DS 120",
            "parent": "DS",
            "title": "DESIGN: FUNDAMENTALS I"
        }
    },
    {
        "data": {
            "description": "Emphasizes specialty fabrics, finishes and complex construction such as matching plaids and working with pile fabrics. Introduces pattern manipulation through basic flat patternmaking principles. Design and fabricate an original collection of garments for a target customer and will develop and construct two of the garments.",
            "id": "DS 154",
            "parent": "DS",
            "title": "SEWN CONSTRUCTION II"
        }
    },
    {
        "data": {
            "description": "Introduces the principles of sewn construction and addresses the physical and aesthetic properties of fiber and fabrics in the context of apparel design. The studios address skills necessary to plan and construct basic garments. Lectures, hands-on studios, and critiques explore the fundamentals of apparel structure and emphasize the interrelationship of fabric, design and apparel construction as well as the creative, expressive potential of materials and making.",
            "id": "DS 153",
            "parent": "DS",
            "title": "SEWN CONSTRUCTION I"
        }
    },
    {
        "data": {
            "description": "Introduction to visual communication of apparel design concepts using selected media. Focus is on drawing the fashion figure, using special techniques, with emphasis on the relationship of figure, garment, fabric, texture, and pattern.",
            "id": "DS 210",
            "parent": "DS",
            "title": "FASHION ILLUSTRATION"
        }
    },
    {
        "data": {
            "description": "The theory and principles of pattern making through flat pattern and draping techniques.",
            "id": "DS 253",
            "parent": "DS",
            "title": "PATTERNMAKING FOR APPAREL DESIGN"
        }
    },
    {
        "data": {
            "id": "DS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "DS 120",
            "target": "DS 210"
        }
    },
    {
        "data": {
            "source": "DS 153",
            "target": "DS 154"
        }
    },
    {
        "data": {
            "source": "DS 154",
            "target": "DS 210"
        }
    },
    {
        "data": {
            "source": "DS 154",
            "target": "DS 253"
        }
    },
    {
        "data": {
            "source": "DS 210",
            "target": "DS 225"
        }
    },
    {
        "data": {
            "source": "DS 253",
            "target": "DS 225"
        }
    }
]