[
    {
        "data": {
            "description": "Emphasizes specialty fabrics, finishes and complex construction such as matching plaids and working with pile fabrics. Introduces pattern manipulation through basic flat patternmaking principles. Design and fabricate an original collection of garments for a target customer and will develop and construct two of the garments.",
            "id": "DS 154",
            "parent": "DS",
            "title": "SEWN CONSTRUCTION II"
        }
    },
    {
        "data": {
            "description": "Explore specific dye and manipulation techniques that directly relate to integrated textile and garment design. Working with color, composition and fabric movement discuss simple garment shapes and how they can be used in conjunction with expressive textiles.",
            "id": "DS 319",
            "parent": "DS",
            "title": "CLOTH TO CLOTHING"
        }
    },
    {
        "data": {
            "description": "Introduces the principles of sewn construction and addresses the physical and aesthetic properties of fiber and fabrics in the context of apparel design. The studios address skills necessary to plan and construct basic garments. Lectures, hands-on studios, and critiques explore the fundamentals of apparel structure and emphasize the interrelationship of fabric, design and apparel construction as well as the creative, expressive potential of materials and making.",
            "id": "DS 153",
            "parent": "DS",
            "title": "SEWN CONSTRUCTION I"
        }
    },
    {
        "data": {
            "description": "This survey class will be an introduction to the technical and conceptual ways of working in Textile Design. Students will participate in three five week modules: one module introducing print and dye concerns, one module introducing off-loom processes, and one module introducing structural enrichment techniques and concepts. Each module will include a series of introductory exercises leading to a final larger project. The work in each module will be supported by short readings and slide lectures highlighting historical and contemporary work. Course fee: yes.",
            "id": "DS 101",
            "parent": "DS",
            "title": "INTRODUCTION TO TEXTILE DESIGN"
        }
    },
    {
        "data": {
            "id": "DS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "DS 101",
            "target": "DS 319"
        }
    },
    {
        "data": {
            "source": "DS 153",
            "target": "DS 154"
        }
    },
    {
        "data": {
            "source": "DS 154",
            "target": "DS 319"
        }
    }
]