[
    {
        "data": {
            "description": "Expanding upon foundational patternmaking techniques through introduction of complex pattern manipulations, tailored garment construction, zero waste patternmaking, sustainable designs, and multi-piece garment development. Emphasis is placed on precision, fit modifications, structured garment design, and problem-solving in pattern development. Development of skills to create original, industry-standard patterns for diverse silhouettes and styles.",
            "id": "DS 353",
            "parent": "DS",
            "title": "PATTERNMAKING FOR FASHION DESIGN II"
        }
    },
    {
        "data": {
            "description": "Explore the digital dimension of patternmaking through industry-standard computer-aided design (CAD) software. Examines the advantages of computer-assisted patternmaking, and considers the potential impact of emerging and future technologies. Emphasis is placed on digitizing patterns, manipulating basic blocks, creating garment models, and developing original garment designs.",
            "id": "DS 453",
            "parent": "DS",
            "title": "DIGITAL PATTERNMAKING I"
        }
    },
    {
        "data": {
            "description": "Introduces core principles of fashion design with a focus on creativity, sustainability, critical thinking, and concept development. Emphasizes silhouette, proportion, scale, and materiality as foundational elements in developing design aesthetics. Includes research and sketching as part of the design process, from initial inspiration to presentation of garment concepts. Explores historical and contemporary fashion to inform original work. Develops skills in trend forecasting, market analysis, and flat sketching.",
            "id": "DS 152",
            "parent": "DS",
            "title": "FASHION DESIGN I"
        }
    },
    {
        "data": {
            "description": "Introduces flat patternmaking as a fundamental technique in apparel design. Explore foundational concepts and principles through manipulation of pattern blocks and the typology of garment styles and silhouettes to execute original designs. Develop pattern drafts for simple garments by applying fundamental patternmaking techniques (dart manipulation, adding fullness, contouring). Emphasis is placed on understanding garment construction in translating design concepts into accurate pattern drafts.",
            "id": "DS 253",
            "parent": "DS",
            "title": "PATTERNMAKING FOR FASHION DESIGN I"
        }
    },
    {
        "data": {
            "description": "Introduces the principles of sewn construction, fabric cutting/layout, and finishing techniques for creating garment prototypes as they relate to the design process. Develop foundational garment construction skills through a combination of demonstrations, hands-on studio work, and critiques. Emphasis is placed on mastering fundamental sewing techniques, and structural analysis to create well-constructed garments that integrate technical precision.",
            "id": "DS 151",
            "parent": "DS",
            "title": "CRAFT & CONSTRUCTION FOR GARMENTS"
        }
    },
    {
        "data": {
            "id": "DS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "DS 151",
            "target": "DS 152"
        }
    },
    {
        "data": {
            "source": "DS 152",
            "target": "DS 253"
        }
    },
    {
        "data": {
            "source": "DS 253",
            "target": "DS 353"
        }
    },
    {
        "data": {
            "source": "DS 353",
            "target": "DS 453"
        }
    }
]