[
    {
        "data": {
            "description": "Focuses on silkscreen printing. Discharge, burnout, and chemical resist processes, specific to screen printing. Develop conceptual ideas and explore alternative ways of producing images.",
            "id": "DS 427",
            "parent": "DS",
            "title": "TEXTILE DESIGN: PRINTING AND DYEING II"
        }
    },
    {
        "data": {
            "description": "Pattern design for textiles, wallpaper and other applications  (motif, layout, repeats, colorways, coordinates), using various manual and digital creation methods. Development of imagery, design concepts, collaboration and presentation.",
            "id": "DS 327",
            "parent": "DS",
            "title": "TEXTILE DESIGN: MANUAL/COMPUTER GENERATED IMAGERY AND PATTERN"
        }
    },
    {
        "data": {
            "description": "Surface design developed in print and resist techniques using historic and contemporary methods.",
            "id": "DS 227",
            "parent": "DS",
            "title": "TEXTILE DESIGN: PRINTING AND DYEING I"
        }
    },
    {
        "data": {
            "description": "This survey class will be an introduction to the technical and conceptual ways of working in Textile Design. Students will participate in three five week modules: one module introducing print and dye concerns, one module introducing off-loom processes, and one module introducing structural enrichment techniques and concepts. Each module will include a series of introductory exercises leading to a final larger project. The work in each module will be supported by short readings and slide lectures highlighting historical and contemporary work. Course fee: yes.",
            "id": "DS 101",
            "parent": "DS",
            "title": "INTRODUCTION TO TEXTILE DESIGN"
        }
    },
    {
        "data": {
            "id": "DS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "DS 101",
            "target": "DS 227"
        }
    },
    {
        "data": {
            "source": "DS 227",
            "target": "DS 427"
        }
    },
    {
        "data": {
            "source": "DS 327",
            "target": "DS 427"
        }
    }
]