[
    {
        "data": {
            "source": "DS 421",
            "target": "DS 422"
        }
    },
    {
        "data": {
            "description": "Examines the arts and cultures of Europe and the Mediterranean basin before the Renaissance. Explores canonical works such as the pyramids at Giza, the Parthenon in Athens, the Venus di Milo, Hagia Sophia in Constantinople, the Book of Kells, the Great Mosque at Córdoba, Chartres cathedral, and Giotto's Arena Chapel. Define art broadly, to encompass the material culture of everyday life, including jewelry, ceramics, and textiles. Considers the social and historical contexts of art and artistic production - art and imperialism, ethnicity, technology, religious ritual and belief, and myth and storytelling, and its relationships to basic human concerns: death and the afterlife, desire and the body, self-definition and portraiture, power and propaganda, monstrosity and the supernatural, the divine and the sacred. Develops crucial skill sets: critical visual analysis, contextual interpretation, research methods and resources, historiography, and oral, written and digital communication.",
            "id": "ARTHIST 201",
            "parent": "ARTHIST",
            "title": "HISTORY OF WESTERN ART I: FROM PYRAMIDS TO CATHEDRALS"
        }
    },
    {
        "data": {
            "id": "ARTHIST",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "DS 120",
            "target": "DS 421"
        }
    },
    {
        "data": {
            "source": "ARTHIST 202",
            "target": "DS 422"
        }
    },
    {
        "data": {
            "description": "Surveys the history of architecture, interiors, furnishings and decorative arts from the mid-19th to the mid-20th century. Introduction to major design cultures and movements, emphasizing the role of social, economic, political, technological, and aesthetic factors in the shaping design.",
            "id": "DS 422",
            "parent": "DS",
            "title": "HISTORY OF ARCHITECTURE & INTERIORS II: 19TH AND 20TH CENTURIES"
        }
    },
    {
        "data": {
            "description": "Elements and principles of design relevant to design of the visual environment.",
            "id": "DS 120",
            "parent": "DS",
            "title": "DESIGN: FUNDAMENTALS I"
        }
    },
    {
        "data": {
            "source": "ARTHIST 201",
            "target": "DS 421"
        }
    },
    {
        "data": {
            "description": "Surveys the history of architecture, interiors, furnishings and decorative arts from antiquity to the mid-19th century. Introduction to major design cultures and movements, emphasizing the role of social, economic, political, technological, and aesthetic factors in the shaping design.",
            "id": "DS 421",
            "parent": "DS",
            "title": "HISTORY OF ARCHITECTURE AND INTERIORS I: ANTIQUITY THROUGH 18TH CENTURY"
        }
    },
    {
        "data": {
            "id": "DS",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Examine the arts and culture of Europe and North America from the Renaissance through the present. Explore important fine art, architecture, decorative arts, and photographic masterpieces by artists like Leonardo da Vinci, Rembrandt van Rijn, Claude Monet, Paul Cézanne, Pablo Picasso, Frida Kahlo, and Frank Lloyd Wright. Learn how works of art were valued from the moment of their making, fought over by different nations, bought, sold, stolen, or ignored for centuries and revived only recently for study through the political, historical, social and cultural contexts of their making. Critically examine the concept of artistic genius; the influence of colonialism and imperialism on artistic production and consumption; the role of the patron and the art market in art's production and circulation; the relationship of fine art and popular culture; and the idea of globalization as it relates to \"western\" artistic traditions. Develop skills in visual analysis to understand artistic production.",
            "id": "ARTHIST 202",
            "parent": "ARTHIST",
            "title": "HISTORY OF WESTERN ART II: FROM RENAISSANCE TO CONTEMPORARY"
        }
    }
]