[
    {
        "data": {
            "description": "Culminates design education through real-world challenges. Develops critical thinking, creativity, innovation for effective solutions. Emphasizes collaborative teamwork within multidisciplinary groups. Guides portfolio development, underscoring growth and versatility as a designer. Topics include defining problems through research, conceptualizing solutions, designing prototypes and interfaces, conducting user testing, and implementing designs.",
            "id": "DS 650",
            "parent": "DS",
            "title": "COLLABORATIVE DESIGN CAPSTONE"
        }
    },
    {
        "data": {
            "description": "Design is a key component of our daily lives and can profoundly affect all people. But how? And to what end? What does design mean and what can it do for us? Interrogate those questions by looking broadly at the place of design in everyday life, and how design intersects with society, economics, politics, the environment, and culture. Study the form, function, and philosophy of design, from what we wear on our bodies to how we move through the world. Ground discussions in close observation and analysis of previous design solutions, leading to innovative approaches to the roles, and responsibilities, of design for the future.",
            "id": "DS 123",
            "parent": "DS",
            "title": "WHAT IS DESIGN?"
        }
    },
    {
        "data": {
            "description": "Design thinking is an iterative problem-solving process geared toward producing innovative solutions for complex and persistent problems in various fields and organizations. Its process, culture, and value system from both design and business point of views will be covered: Empathetic understanding of the end users, problem definition rooted in systems thinking, ideation with a strong emphasis on creativity, visualization and prototyping, testing rooted in a set of research methods, and finally, the importance of iteration in bringing about innovative solutions. The path from project to market will also be explored, with an understanding of how one might balance desirability, feasibility and viability.",
            "id": "DS/GENBUS 240",
            "title": "HUMAN-CENTERED DESIGN AND BUSINESS"
        }
    },
    {
        "data": {
            "description": "Effects of building and outdoor spaces on people over the life course.",
            "id": "DS 221",
            "parent": "DS",
            "title": "PERSON AND ENVIRONMENT INTERACTIONS"
        }
    },
    {
        "data": {
            "description": "Elements and principles of design relevant to design of the visual environment.",
            "id": "DS 120",
            "parent": "DS",
            "title": "DESIGN: FUNDAMENTALS I"
        }
    },
    {
        "data": {
            "description": "Elements and principles of three-dimensional design relevant to design and analysis of the spatial environment.",
            "id": "DS 220",
            "parent": "DS",
            "title": "DESIGN: FUNDAMENTALS II"
        }
    },
    {
        "data": {
            "description": "Manual and digital techniques for idea exploration, concept development, and design presentation using a variety of media. Projects in hand drawing techniques and professional design software. Gain heightened attention to detail;  understand the relationship of two-dimensional drawings and three-dimensional objects; explore multiple design solutions visually; convey technical information, and professionally communicate design concepts. Introduce visual communication, visual thinking, visual inspiration and visual representation",
            "id": "DS 140",
            "parent": "DS",
            "title": "VISUAL THINKING - FORM AND SPACE"
        }
    },
    {
        "data": {
            "description": "This course introduces students to the interdisciplinary field of material culture studies. It is intended for students interested in any professional endeavor related to material culture, including careers in museums, galleries, historical societies, historic preservation organizations, and academic institutions. During the semester, students have varied opportunities to engage with and contemplate the material world to which people give meaning and which, in turn, influences their lives. Sessions combine in some way the following: presentations from faculty members and professionals who lecture on a phase of material culture related to his/her own scholarship or other professional work; discussion of foundational readings in the field; visits to collections and sites on campus and around Madison; discussion of readings assigned by visiting presenters or the professors; and exams and short papers that engage material culture topics.",
            "id": "ANTHRO/ARTHIST/DS/HISTORY/LANDARC 264",
            "title": "DIMENSIONS OF MATERIAL CULTURE"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "DS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ANTHRO/ARTHIST/DS/HISTORY/LANDARC 264",
            "target": "DS 650"
        }
    },
    {
        "data": {
            "source": "DS 120",
            "target": "DS 220"
        }
    },
    {
        "data": {
            "source": "DS 123",
            "target": "DS 650"
        }
    },
    {
        "data": {
            "source": "DS 140",
            "target": "DS 650"
        }
    },
    {
        "data": {
            "source": "DS 220",
            "target": "DS 650"
        }
    },
    {
        "data": {
            "source": "DS 221",
            "target": "DS 650"
        }
    },
    {
        "data": {
            "source": "DS/GENBUS 240",
            "target": "DS 650"
        }
    }
]