[
    {
        "data": {
            "description": "Culminates design education through real-world challenges. Develops critical thinking, creativity, innovation for effective solutions. Emphasizes collaborative teamwork within multidisciplinary groups. Guides portfolio development, underscoring growth and versatility as a designer. Topics include defining problems through research, conceptualizing solutions, designing prototypes and interfaces, conducting user testing, and implementing designs.",
            "id": "DS 650",
            "parent": "DS",
            "title": "COLLABORATIVE DESIGN CAPSTONE"
        }
    },
    {
        "data": {
            "description": "Design is a key component of our daily lives and can profoundly affect all people. But how? And to what end? What does design mean and what can it do for us? Interrogate those questions by looking broadly at the place of design in everyday life, and how design intersects with society, economics, politics, the environment, and culture. Study the form, function, and philosophy of design, from what we wear on our bodies to how we move through the world. Ground discussions in close observation and analysis of previous design solutions, leading to innovative approaches to the roles, and responsibilities, of design for the future.",
            "id": "DS 123",
            "parent": "DS",
            "title": "WHAT IS DESIGN?"
        }
    },
    {
        "data": {
            "description": "Manual and digital techniques for idea exploration, concept development, and design presentation using a variety of media. Projects in hand drawing techniques and professional design software. Gain heightened attention to detail;  understand the relationship of two-dimensional drawings and three-dimensional objects; explore multiple design solutions visually; convey technical information, and professionally communicate design concepts. Introduce visual communication, visual thinking, visual inspiration and visual representation",
            "id": "DS 140",
            "parent": "DS",
            "title": "VISUAL THINKING - FORM AND SPACE"
        }
    },
    {
        "data": {
            "id": "DS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "DS 123",
            "target": "DS 650"
        }
    },
    {
        "data": {
            "source": "DS 140",
            "target": "DS 650"
        }
    }
]