[
    {
        "data": {
            "description": "Sampling continuous-time signals and reconstruction of continuous-time signals from samples; spectral analysis of signals using the discrete Fourier transform; the fast Fourier transform and fast convolution methods; z-transforms; finite and infinite impulse response filter design techniques; signal flow graphs and introduction to filter implementation.",
            "id": "ECE 431",
            "parent": "ECE",
            "title": "DIGITAL SIGNAL PROCESSING"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "description": "Time-domain response and convolution; frequency-domain response using Fourier series, Fourier transform, Laplace transform; discrete Fourier series and transform; sampling; z-transform; relationships between time and frequency descriptions of discrete and continuous signals and systems.",
            "id": "ECE 330",
            "parent": "ECE",
            "title": "SIGNALS AND SYSTEMS"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "ECE 203"
        }
    },
    {
        "data": {
            "source": "ECE 330",
            "target": "ECE 431"
        }
    },
    {
        "data": {
            "id": "ECE",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ECE 203",
            "target": "ECE 330"
        }
    },
    {
        "data": {
            "description": "Introduction to the signals, information, and computational techniques in electrical engineering.",
            "id": "ECE 203",
            "parent": "ECE",
            "title": "SIGNALS, INFORMATION, AND COMPUTATION"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "First order differential equations, introduction to multivariable calculus and constrained optimization, infinite sequences and series, methods of approximation, and a brief introduction to probability. Models and applications from business and the social sciences.",
            "id": "MATH 213",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 2"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 213"
        }
    },
    {
        "data": {
            "source": "MATH 213",
            "target": "MATH 221"
        }
    }
]