[
    {
        "data": {
            "description": "Covers the graphs, properties and geometric significance of trigonometric functions of a real variable. Other topics include trigonometric equations and identities, application, trigonometric form of complex numbers, DeMoivre's theorem, and polar and parametric equations. The course also has a significant number of applications, especially related to other disciplines.",
            "id": "MATH 113",
            "parent": "MATH",
            "title": "TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "Electrostatic fields, capacitance, multi-pole expansion, dielectric theory; magnetostatics; electromagnetic induction; magnetic properties of matter; Maxwell's equations and electromagnetic waves; relativity and electromagmetism. Experiments for this course are covered in PHYSICS 308.",
            "id": "PHYSICS 322",
            "parent": "PHYSICS",
            "title": "ELECTROMAGNETIC FIELDS"
        }
    },
    {
        "data": {
            "description": "An introduction to linear algebra and differential equations with emphasis on the relationship between the theory of linear algebra and analytical and numerical techniques for solving differential equations. Linear algebra topics include linear systems, matrices and their algebra, vector spaces and linear transformations, eigenvalues and eigenvectors. Topics from differential equations include first order ODE, homogeneous and nonhomogeneous linear systems, and numerical methods.",
            "id": "MATH 320",
            "parent": "MATH",
            "title": "LINEAR ALGEBRA AND DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "description": "Basic description of plasmas: collective phenomena and sheaths, collisional processes, single particle motions, fluid models, equilibria, waves, electromagnetic properties, instabilities, and introduction to kinetic theory and nonlinear processes. Examples from fusion, astrophysical and materials processing processing plasmas.",
            "id": "ECE/NE/PHYSICS 525",
            "title": "INTRODUCTION TO PLASMAS"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for Physics, AMEP, and Astronomy-Physics majors. Mechanics, waves, thermodynamics and statistical mechanics, topics in modern physics; with computation.  A more mathematically rigorous and in-depth introduction to physics than the other introductory physics sequences.",
            "id": "PHYSICS 247",
            "parent": "PHYSICS",
            "title": "A MODERN INTRODUCTION TO PHYSICS"
        }
    },
    {
        "data": {
            "description": "Continuation ofPHYSICS 247. Electromagnetism, circuits, optics, additional topics in modern physics; with computation.",
            "id": "PHYSICS 248",
            "parent": "PHYSICS",
            "title": "A MODERN INTRODUCTION TO PHYSICS"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Introduction to calculus of functions of several variables; calculus on parameterized curves, derivatives of functions of several variables, multiple integrals, vector calculus.",
            "id": "MATH 234",
            "parent": "MATH",
            "title": "CALCULUS--FUNCTIONS OF SEVERAL VARIABLES"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Principles of magnetic confinement and heating of plasmas for controlled thermonuclear fusion: magnetic field structures, single particle orbits, equilibrium, stability, collisions, transport, heating, modeling and diagnostics. Discussion of current leading confinement concepts: tokamaks, tandem mirrors, stellarators, reversed field pinches, etc.",
            "id": "ECE/NE/PHYSICS 527",
            "title": "PLASMA CONFINEMENT AND HEATING"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Techniques of integration, improper integrals, first order ordinary differential equations, sequences and series, Taylor series, vector geometry in two and three dimensions.",
            "id": "MATH 222",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 2"
        }
    },
    {
        "data": {
            "description": "Vector analysis: algebra and geometry of vectors, vector differential and integral calculus, theorems of Green, Gauss, and Stokes; complex analysis: analytic functions, complex integrals and residues, Taylor and Laurent series.",
            "id": "MATH 321",
            "parent": "MATH",
            "title": "APPLIED MATHEMATICAL ANALYSIS"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "PHYSICS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ECE/NE/PHYSICS 525",
            "target": "ECE/NE/PHYSICS 527"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 113"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 113",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 222"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 234"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 320"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "PHYSICS 247"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "MATH 321"
        }
    },
    {
        "data": {
            "source": "MATH 320",
            "target": "MATH 321"
        }
    },
    {
        "data": {
            "source": "MATH 321",
            "target": "PHYSICS 322"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "PHYSICS 247",
            "target": "PHYSICS 248"
        }
    },
    {
        "data": {
            "source": "PHYSICS 248",
            "target": "PHYSICS 322"
        }
    },
    {
        "data": {
            "source": "PHYSICS 322",
            "target": "ECE/NE/PHYSICS 525"
        }
    }
]