[
    {
        "data": {
            "description": "Covers the graphs, properties and geometric significance of trigonometric functions of a real variable. Other topics include trigonometric equations and identities, application, trigonometric form of complex numbers, DeMoivre's theorem, and polar and parametric equations. The course also has a significant number of applications, especially related to other disciplines.",
            "id": "MATH 113",
            "parent": "MATH",
            "title": "TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "Ohm's law, Kirchhoff's laws, resistive circuits, nodal and mesh analysis, superposition, equivalent circuits using Thevenin and Norton Theorems, op amps and op amp circuits, capacitors and inductors in first-order circuits, sinusoidal steady state, phasors, RMS value, complex power, power factor, mutual inductance, linear and ideal transformers.",
            "id": "ECE 376",
            "parent": "ECE",
            "title": "ELECTRICAL AND ELECTRONIC CIRCUITS"
        }
    },
    {
        "data": {
            "description": "The idealized three phase synchronous machine time domain model including saliency, time invariant form using Park's transformation, sudden short circuits and other transient conditions, reduced order models, excitation system and turbine/governor control, dynamics of multiple machine systems, transient stability and subsynchronous resonance.",
            "id": "ECE 511",
            "parent": "ECE",
            "title": "THEORY AND CONTROL OF SYNCHRONOUS MACHINES"
        }
    },
    {
        "data": {
            "description": "Basic concepts of electric drive systems. Emphasis on system analysis and application. Topics include: dc machine control, variable frequency operation of induction and synchronous machines, unbalanced operation, scaling laws, adjustable speed drives, adjustable torque drives, coupled circuit modeling of ac machines.",
            "id": "ECE 411",
            "parent": "ECE",
            "title": "INTRODUCTION TO ELECTRIC DRIVE SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for Physics, AMEP, and Astronomy-Physics majors. Mechanics, waves, thermodynamics and statistical mechanics, topics in modern physics; with computation.  A more mathematically rigorous and in-depth introduction to physics than the other introductory physics sequences.",
            "id": "PHYSICS 247",
            "parent": "PHYSICS",
            "title": "A MODERN INTRODUCTION TO PHYSICS"
        }
    },
    {
        "data": {
            "description": "Continuation ofMATH 171. Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Completion ofMATH 217implies completion ofMATH 221and114.",
            "id": "MATH 217",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY II"
        }
    },
    {
        "data": {
            "description": "Continuation ofPHYSICS 247. Electromagnetism, circuits, optics, additional topics in modern physics; with computation.",
            "id": "PHYSICS 248",
            "parent": "PHYSICS",
            "title": "A MODERN INTRODUCTION TO PHYSICS"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Introduction to electrical power processing technologies that are necessary to convert energy from alternative sources into useful electrical forms. Several specific alternative energy sources are examined, providing platforms for introducing basic concepts in power electronics, electric machines, and adjustable-speed drives.",
            "id": "ECE 356",
            "parent": "ECE",
            "title": "ELECTRIC POWER PROCESSING FOR ALTERNATIVE ENERGY SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Introduction to the signals, information, and computational techniques in electrical engineering.",
            "id": "ECE 203",
            "parent": "ECE",
            "title": "SIGNALS, INFORMATION, AND COMPUTATION"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Techniques of integration, improper integrals, first order ordinary differential equations, sequences and series, Taylor series, vector geometry in two and three dimensions.",
            "id": "MATH 222",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 2"
        }
    },
    {
        "data": {
            "description": "The electric power industry, operation of power systems, load flow, fault calculations, economic dispatch, general technical problems of electric power networks.",
            "id": "ECE 427",
            "parent": "ECE",
            "title": "ELECTRIC POWER SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Time-domain response and convolution; frequency-domain response using Fourier series, Fourier transform, Laplace transform; discrete Fourier series and transform; sampling; z-transform; relationships between time and frequency descriptions of discrete and continuous signals and systems.",
            "id": "ECE 330",
            "parent": "ECE",
            "title": "SIGNALS AND SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Part of a 2-semester sequence withMATH 217; these two courses together are equivalent toMATH 114and221.",
            "id": "MATH 171",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY I"
        }
    },
    {
        "data": {
            "id": "ECE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "PHYSICS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ECE 203",
            "target": "ECE 330"
        }
    },
    {
        "data": {
            "source": "ECE 330",
            "target": "ECE 427"
        }
    },
    {
        "data": {
            "source": "ECE 356",
            "target": "ECE 411"
        }
    },
    {
        "data": {
            "source": "ECE 376",
            "target": "ECE 356"
        }
    },
    {
        "data": {
            "source": "ECE 411",
            "target": "ECE 511"
        }
    },
    {
        "data": {
            "source": "ECE 427",
            "target": "ECE 511"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 113"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 113",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "MATH 217"
        }
    },
    {
        "data": {
            "source": "MATH 217",
            "target": "ECE 203"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 222"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "ECE 376"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "PHYSICS 247"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "PHYSICS 247",
            "target": "PHYSICS 248"
        }
    },
    {
        "data": {
            "source": "PHYSICS 248",
            "target": "ECE 376"
        }
    }
]