[
    {
        "data": {
            "description": "A preparation and introductory math course for students enrolled in the Summer Collegiate Experience program. Includes material from precalculus and calculus and related topics depending on students' results on the math placement exam.",
            "id": "MATH 118",
            "parent": "MATH",
            "title": "SUMMER COLLEGIATE EXPERIENCE MATHEMATICS COURSE"
        }
    },
    {
        "data": {
            "description": "Covers the graphs, properties and geometric significance of trigonometric functions of a real variable. Other topics include trigonometric equations and identities, application, trigonometric form of complex numbers, DeMoivre's theorem, and polar and parametric equations. The course also has a significant number of applications, especially related to other disciplines.",
            "id": "MATH 113",
            "parent": "MATH",
            "title": "TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "Ohm's law, Kirchhoff's laws, resistive circuits, nodal and mesh analysis, superposition, equivalent circuits using Thevenin and Norton Theorems, op amps and op amp circuits, capacitors and inductors in first-order circuits, sinusoidal steady state, phasors, RMS value, complex power, power factor, mutual inductance, linear and ideal transformers.",
            "id": "ECE 376",
            "parent": "ECE",
            "title": "ELECTRICAL AND ELECTRONIC CIRCUITS"
        }
    },
    {
        "data": {
            "description": "Ohm's law, Kirchhoff's laws, resistive circuits, nodal and mesh analysis, superposition, equivalent circuits using Thevenin-Norton theories, op amps and op amp circuits, first-order circuits, second-order circuits, sinusoidal steady state, phasors, RMS value, complex power, power factor, mutual inductance, linear and ideal transformers, ideal filters and transfer functions.",
            "id": "ECE 230",
            "parent": "ECE",
            "title": "CIRCUIT ANALYSIS"
        }
    },
    {
        "data": {
            "description": "A first course in modeling, characterization, and application of semiconductor devices and integrated circuits. Development of appropriate models for circuit-level behavior of diodes, bi-polar and field effect transistors, and non-ideal op-amps. Application in analysis and design of linear amplifiers. Frequency domain characterization of transistor circuits.",
            "id": "ECE 340",
            "parent": "ECE",
            "title": "ELECTRONIC CIRCUITS I"
        }
    },
    {
        "data": {
            "description": "An introduction to fundamental structures of computer systems and the C programming language with a focus on the low-level interrelationships and impacts on performance. Topics include the virtual address space and virtual memory, the heap and dynamic memory management, the memory hierarchy and caching, assembly language and the stack, communication and interrupts/signals, compiling and assemblers/linkers.",
            "id": "COMPSCI/ECE 354",
            "title": "MACHINE ORGANIZATION AND PROGRAMMING"
        }
    },
    {
        "data": {
            "description": "Apply electrical and computer engineering knowledge and skills acquired to real-world electrical and computer engineering design projects.",
            "id": "ECE 455",
            "parent": "ECE",
            "title": "CAPSTONE DESIGN IN ELECTRICAL AND COMPUTER ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for Physics, AMEP, and Astronomy-Physics majors. Mechanics, waves, thermodynamics and statistical mechanics, topics in modern physics; with computation.  A more mathematically rigorous and in-depth introduction to physics than the other introductory physics sequences.",
            "id": "PHYSICS 247",
            "parent": "PHYSICS",
            "title": "A MODERN INTRODUCTION TO PHYSICS"
        }
    },
    {
        "data": {
            "description": "Continuation ofMATH 171. Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Completion ofMATH 217implies completion ofMATH 221and114.",
            "id": "MATH 217",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY II"
        }
    },
    {
        "data": {
            "description": "Continuation ofPHYSICS 247. Electromagnetism, circuits, optics, additional topics in modern physics; with computation.",
            "id": "PHYSICS 248",
            "parent": "PHYSICS",
            "title": "A MODERN INTRODUCTION TO PHYSICS"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Energy storage and conversion, force and emf production, coupled circuit analysis of systems with both electrical and mechanical inputs. Applications to electric motors and generators and other electromechanical transducers.",
            "id": "ECE 355",
            "parent": "ECE",
            "title": "ELECTROMECHANICAL ENERGY CONVERSION"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "First order differential equations, introduction to multivariable calculus and constrained optimization, infinite sequences and series, methods of approximation, and a brief introduction to probability. Models and applications from business and the social sciences.",
            "id": "MATH 213",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 2"
        }
    },
    {
        "data": {
            "description": "Hardware and software design for modern microprocessor-based embedded systems; study of the design process; emphasis on major team design project.",
            "id": "ECE 453",
            "parent": "ECE",
            "title": "EMBEDDED MICROPROCESSOR SYSTEM DESIGN"
        }
    },
    {
        "data": {
            "description": "Introduction to Object-Oriented Programming using classes and objects to solve more complex problems. Introduces array-based and linked data structures: including lists, stacks, and queues. Programming assignments require writing and developing multi-class (file) programs using interfaces, generics, and exception handling to solve challenging real world problems. Topics reviewed include reading/writing data and objects from/to files and exception handling, and command line arguments. Topics introduced: object-oriented design; class vs. object; create and define interfaces and iterators; searching and sorting; abstract data types (List,Stack,Queue,PriorityQueue(Heap),Binary Search Tree); generic interfaces (parametric polymorphism); how to design and write test methods and classes; array based vs. linked node implementations; introduction to complexity analysis; recursion.",
            "id": "COMPSCI 300",
            "parent": "COMPSCI",
            "title": "PROGRAMMING II"
        }
    },
    {
        "data": {
            "description": "Introduction to architecture, operation, and application of microprocessors; microprocessor programming; address decoding; system timing; parallel, serial, and analog I/O; interrupts and direct memory access; interfacing to static and dynamic RAM; microcontrollers.",
            "id": "ECE 353",
            "parent": "ECE",
            "title": "INTRODUCTION TO MICROPROCESSOR SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Introduction to the signals, information, and computational techniques in electrical engineering.",
            "id": "ECE 203",
            "parent": "ECE",
            "title": "SIGNALS, INFORMATION, AND COMPUTATION"
        }
    },
    {
        "data": {
            "description": "Introduction to the use of hardware description languages and automated synthesis in design. Advanced design principles. Verilog and VHDL description languages. Synthesis from hardware description languages. Timing-oriented synthesis. Relation of integrated circuit layout to timing-oriented design. Design for reuse.",
            "id": "ECE 551",
            "parent": "ECE",
            "title": "DIGITAL SYSTEM DESIGN AND SYNTHESIS"
        }
    },
    {
        "data": {
            "description": "Learn the process of incrementally developing small (200-500 lines) programs along with the fundamental Computer Science topics. These topics include: problem abstraction and decomposition, the edit-compile-run cycle, using variables of primitive and more complex data types, conditional and loop-based flow control, basic testing and debugging techniques, how to define and call functions (methods), and IO processing techniques. Also teaches and reinforces good programming practices including the use of a consistent style, and meaningful documentation. Intended for students who have no prior programming experience.",
            "id": "COMPSCI 200",
            "parent": "COMPSCI",
            "title": "PROGRAMMING I"
        }
    },
    {
        "data": {
            "description": "Logic components built with transistors, rudimentary Boolean algebra, basic combinational logic design, basic synchronous sequential logic design, basic computer organization and design, introductory machine- and assembly-language programming.",
            "id": "COMPSCI/ECE 252",
            "title": "INTRODUCTION TO COMPUTER ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Logic components, Boolean algebra, combinational logic analysis and synthesis, synchronous and asynchronous sequential logic analysis and design, digital subsystems, computer organization and design.",
            "id": "COMPSCI/ECE 352",
            "title": "DIGITAL SYSTEM FUNDAMENTALS"
        }
    },
    {
        "data": {
            "description": "Practical aspects of computer system design. Design, construction, and testing of significant digital subsystems. Design, construction, and programming of pipelined digital computers.",
            "id": "ECE 554",
            "parent": "ECE",
            "title": "DIGITAL ENGINEERING LABORATORY"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Software and hardware experiments with a microcomputer system. Assembly language programming, simple input/output interfacing, and interrupt processing in microcomputer systems.",
            "id": "ECE 315",
            "parent": "ECE",
            "title": "INTRODUCTORY MICROPROCESSOR LABORATORY"
        }
    },
    {
        "data": {
            "description": "Techniques of integration, improper integrals, first order ordinary differential equations, sequences and series, Taylor series, vector geometry in two and three dimensions.",
            "id": "MATH 222",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 2"
        }
    },
    {
        "data": {
            "description": "Terminal characteristics of electric machines, elements of speed control, voltage regulation, and applications in systems. Emphasis on the experimental approach to the solution of complex physical problems.",
            "id": "ECE 304",
            "parent": "ECE",
            "title": "ELECTRIC MACHINES LABORATORY"
        }
    },
    {
        "data": {
            "description": "The design of computer systems and components. Processor design, instruction set design, and addressing; control structures and microprogramming; memory management, caches, and memory hierarchies; and interrupts and I/O structures.E C E 551or knowledge of Verilog is recommended.",
            "id": "COMPSCI/ECE 552",
            "title": "INTRODUCTION TO COMPUTER ARCHITECTURE"
        }
    },
    {
        "data": {
            "description": "Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Part of a 2-semester sequence withMATH 217; these two courses together are equivalent toMATH 114and221.",
            "id": "MATH 171",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY I"
        }
    },
    {
        "data": {
            "id": "COMPSCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ECE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "PHYSICS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "COMPSCI 200",
            "target": "COMPSCI 300"
        }
    },
    {
        "data": {
            "source": "COMPSCI 300",
            "target": "COMPSCI/ECE 354"
        }
    },
    {
        "data": {
            "source": "COMPSCI 300",
            "target": "ECE 353"
        }
    },
    {
        "data": {
            "source": "COMPSCI 300",
            "target": "ECE 453"
        }
    },
    {
        "data": {
            "source": "COMPSCI 300",
            "target": "ECE 455"
        }
    },
    {
        "data": {
            "source": "COMPSCI/ECE 252",
            "target": "COMPSCI/ECE 352"
        }
    },
    {
        "data": {
            "source": "COMPSCI/ECE 252",
            "target": "COMPSCI/ECE 354"
        }
    },
    {
        "data": {
            "source": "COMPSCI/ECE 252",
            "target": "ECE 353"
        }
    },
    {
        "data": {
            "source": "COMPSCI/ECE 352",
            "target": "COMPSCI/ECE 552"
        }
    },
    {
        "data": {
            "source": "COMPSCI/ECE 352",
            "target": "ECE 551"
        }
    },
    {
        "data": {
            "source": "COMPSCI/ECE 354",
            "target": "COMPSCI/ECE 552"
        }
    },
    {
        "data": {
            "source": "COMPSCI/ECE 552",
            "target": "ECE 554"
        }
    },
    {
        "data": {
            "source": "ECE 203",
            "target": "ECE 340"
        }
    },
    {
        "data": {
            "source": "ECE 230",
            "target": "ECE 340"
        }
    },
    {
        "data": {
            "source": "ECE 230",
            "target": "ECE 376"
        }
    },
    {
        "data": {
            "source": "ECE 304",
            "target": "ECE 455"
        }
    },
    {
        "data": {
            "source": "ECE 315",
            "target": "ECE 453"
        }
    },
    {
        "data": {
            "source": "ECE 340",
            "target": "ECE 455"
        }
    },
    {
        "data": {
            "source": "ECE 353",
            "target": "ECE 315"
        }
    },
    {
        "data": {
            "source": "ECE 355",
            "target": "ECE 304"
        }
    },
    {
        "data": {
            "source": "ECE 376",
            "target": "ECE 355"
        }
    },
    {
        "data": {
            "source": "ECE 453",
            "target": "ECE 455"
        }
    },
    {
        "data": {
            "source": "ECE 455",
            "target": "ECE 453"
        }
    },
    {
        "data": {
            "source": "ECE 455",
            "target": "ECE 554"
        }
    },
    {
        "data": {
            "source": "ECE 551",
            "target": "ECE 554"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 113"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 113",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "MATH 217"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 213"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 213",
            "target": "MATH 222"
        }
    },
    {
        "data": {
            "source": "MATH 217",
            "target": "ECE 203"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 222"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "ECE 230"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "PHYSICS 247"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "PHYSICS 247",
            "target": "PHYSICS 248"
        }
    },
    {
        "data": {
            "source": "PHYSICS 248",
            "target": "ECE 230"
        }
    }
]