[
    {
        "data": {
            "description": "A mathematical approach to the theory of consumption, production, pricing and resource allocation.",
            "id": "ECON 311",
            "parent": "ECON",
            "title": "INTERMEDIATE MICROECONOMIC THEORY - ADVANCED TREATMENT"
        }
    },
    {
        "data": {
            "description": "An introduction to regression with emphasis on the practical aspects. Topics include: straight-line model, role of assumptions, residual analysis, transformations, multiple regression (with some use of matrix notation), multicollinearity, subset selection, and a brief introduction to mixed models.",
            "id": "STAT 333",
            "parent": "STAT",
            "title": "APPLIED REGRESSION ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Contemporary theory of consumption, production, pricing and resource allocation.",
            "id": "ECON 301",
            "parent": "ECON",
            "title": "INTERMEDIATE MICROECONOMIC THEORY"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Descriptive statistics, probability concepts and distributions, random variables. Hypothesis tests and confidence intervals for one- and two-sample problems. Linear regression, model checking, and inference. Analysis of variance and basic ideas in experimental design. Utilizes the R programming language.",
            "id": "STAT 324",
            "parent": "STAT",
            "title": "INTRODUCTORY APPLIED STATISTICS FOR ENGINEERS"
        }
    },
    {
        "data": {
            "description": "Economic problems of individuals, firms and industries with emphasis on value, price, and distribution of income.",
            "id": "ECON 101",
            "parent": "ECON",
            "title": "PRINCIPLES OF MICROECONOMICS"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "First order differential equations, introduction to multivariable calculus and constrained optimization, infinite sequences and series, methods of approximation, and a brief introduction to probability. Models and applications from business and the social sciences.",
            "id": "MATH 213",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 2"
        }
    },
    {
        "data": {
            "description": "Integrated treatment of macroeconomics and microeconomics (seeECON 101andECON 102). Accelerated approach to economics training, especially for Economics: Math Emphasis majors.",
            "id": "ECON 111",
            "parent": "ECON",
            "title": "PRINCIPLES OF ECONOMICS-ACCELERATED TREATMENT"
        }
    },
    {
        "data": {
            "description": "Introduces reproducible data management, modeling, analysis, and statistical inference through a practical, hands-on case studies approach. Topics include the use of an integrated statistical computing environment, data wrangling, the R programming language, data graphics and visualization, random variables and concepts of probability including the binomial and normal distributions, data modeling, statistical inference in one- and two- sample settings for proportions and means, simple linear regression, and report generation using R Markdown with applications to a wide variety of data to address open-ended questions.",
            "id": "STAT 240",
            "parent": "STAT",
            "title": "DATA SCIENCE MODELING I"
        }
    },
    {
        "data": {
            "description": "Introduction to analysis of economic data. The techniques of descriptive statistics and statistical inference (hypothesis testing and estimation) as directed toward application in economic research.",
            "id": "ECON 310",
            "parent": "ECON",
            "title": "STATISTICS: MEASUREMENT IN ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Introduction to modern statistical practice in the life sciences, using the R programming language. Topics include: exploratory data analysis, probability and random variables; one-sample testing and confidence intervals, role of assumptions, sample size determination, two-sample inference; basic ideas in experimental design, analysis of variance, linear regression, goodness-of fit; biological applications.",
            "id": "STAT 371",
            "parent": "STAT",
            "title": "INTRODUCTORY APPLIED STATISTICS FOR THE LIFE SCIENCES"
        }
    },
    {
        "data": {
            "description": "Introduction to the data that underlies quantitative economic analysis. Learn how to formulate a research question, access economic data sources, conduct preliminary and formal analysis, and report findings in a professional manner.",
            "id": "ECON 570",
            "parent": "ECON",
            "title": "FUNDAMENTALS OF DATA ANALYTICS FOR ECONOMISTS"
        }
    },
    {
        "data": {
            "description": "Macroeconomic measurement and models of aggregate demand and supply; fiscal and monetary policy for unemployment, inflation, and growth.",
            "id": "ECON 102",
            "parent": "ECON",
            "title": "PRINCIPLES OF MACROECONOMICS"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "id": "ECON",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "STAT",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON 301"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON 310"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON 311"
        }
    },
    {
        "data": {
            "source": "ECON 102",
            "target": "ECON 111"
        }
    },
    {
        "data": {
            "source": "ECON 102",
            "target": "ECON 310"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON 101"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON 102"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON 311"
        }
    },
    {
        "data": {
            "source": "ECON 301",
            "target": "ECON 311"
        }
    },
    {
        "data": {
            "source": "ECON 301",
            "target": "ECON 570"
        }
    },
    {
        "data": {
            "source": "ECON 310",
            "target": "ECON 570"
        }
    },
    {
        "data": {
            "source": "ECON 310",
            "target": "STAT 333"
        }
    },
    {
        "data": {
            "source": "ECON 311",
            "target": "ECON 301"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 213"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "source": "MATH 213",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "STAT 240",
            "target": "ECON 570"
        }
    },
    {
        "data": {
            "source": "STAT 324",
            "target": "STAT 333"
        }
    },
    {
        "data": {
            "source": "STAT 324",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "source": "STAT 333",
            "target": "ECON 570"
        }
    },
    {
        "data": {
            "source": "STAT 371",
            "target": "STAT 324"
        }
    }
]