[
    {
        "data": {
            "source": "ECON 310",
            "target": "ECON 355"
        }
    },
    {
        "data": {
            "description": "Introduction to analysis of economic data. The techniques of descriptive statistics and statistical inference (hypothesis testing and estimation) as directed toward application in economic research.",
            "id": "ECON 310",
            "parent": "ECON",
            "title": "STATISTICS: MEASUREMENT IN ECONOMICS"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON 310"
        }
    },
    {
        "data": {
            "source": "ECON 102",
            "target": "ECON 310"
        }
    },
    {
        "data": {
            "id": "ECON",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Integrated treatment of macroeconomics and microeconomics (seeECON 101andECON 102). Accelerated approach to economics training, especially for Economics: Math Emphasis majors.",
            "id": "ECON 111",
            "parent": "ECON",
            "title": "PRINCIPLES OF ECONOMICS-ACCELERATED TREATMENT"
        }
    },
    {
        "data": {
            "description": "Macroeconomic measurement and models of aggregate demand and supply; fiscal and monetary policy for unemployment, inflation, and growth.",
            "id": "ECON 102",
            "parent": "ECON",
            "title": "PRINCIPLES OF MACROECONOMICS"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON 102"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON 111"
        }
    },
    {
        "data": {
            "description": "What does economics have to say about how or why people decide to go to school, get married (or divorced), or have children? Use economic models to investigate these \"every day occurrences.\" Start with early childhood and trace out the life cycle from schooling to retirement, concentrating on six stages of life: early childhood; schooling; adolescence; marriage and divorce; fertility; and retirement decisions.",
            "id": "ECON 355",
            "parent": "ECON",
            "title": "THE ECONOMICS OF GROWING-UP AND GETTING OLD"
        }
    },
    {
        "data": {
            "description": "Economic problems of individuals, firms and industries with emphasis on value, price, and distribution of income.",
            "id": "ECON 101",
            "parent": "ECON",
            "title": "PRINCIPLES OF MICROECONOMICS"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON 101"
        }
    }
]