[
    {
        "data": {
            "description": "Economic problems of individuals, firms and industries with emphasis on value, price, and distribution of income.",
            "id": "ECON 101",
            "parent": "ECON",
            "title": "PRINCIPLES OF MICROECONOMICS"
        }
    },
    {
        "data": {
            "description": "Historical and contemporary sources and causes of, and potential policy responses to, racial and ethnic economic inequality in the United States. Topics covered include healthcare, education, labor markets, housing and neighborhoods, wealth, and criminal justice, with a focus on aspects of the economy where there are differences in economic outcomes for racial or racial minority groups. Questions include how these differences can result from disparities in how people, markets, or policies treat or impact different groups using economic theory as a foundation, and how economists have studied and measured these differences. In light of the history and range of economic opportunity and change in some communities, particular attention is given to the African American experience.",
            "id": "ECON 325",
            "parent": "ECON",
            "title": "ECONOMICS OF RACE IN THE UNITED STATES"
        }
    },
    {
        "data": {
            "description": "Integrated treatment of macroeconomics and microeconomics (seeECON 101andECON 102). Accelerated approach to economics training, especially for Economics: Math Emphasis majors.",
            "id": "ECON 111",
            "parent": "ECON",
            "title": "PRINCIPLES OF ECONOMICS-ACCELERATED TREATMENT"
        }
    },
    {
        "data": {
            "description": "Macroeconomic measurement and models of aggregate demand and supply; fiscal and monetary policy for unemployment, inflation, and growth.",
            "id": "ECON 102",
            "parent": "ECON",
            "title": "PRINCIPLES OF MACROECONOMICS"
        }
    },
    {
        "data": {
            "id": "ECON",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON 325"
        }
    },
    {
        "data": {
            "source": "ECON 102",
            "target": "ECON 111"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON 101"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON 102"
        }
    }
]