[
    {
        "data": {
            "description": "Focus on assessing patients with urgent medical conditions, providing acute inpatient care, and transitioning patients to other care settings or home under the care of other professionals. Provide acute care in inpatient and outpatient urgent care settings as well as on the inpatient wards, and develop acute management plans and subsequent transition of care plans. Clinical experiences in acute care settings such as the emergency department and inpatient medicine (both general and subspecialty), psychiatry, and neurology. Builds upon fundamental science concepts introduced in Body in Balance and Mind and Motion, including Ohm's Law, acid-base balance, and volume regulation. Organ system-based approach employing varied modalities. Complete an integrated patient-centered experience by participating in the care of a patient from an urgent admission through inpatient treatment and discharge.",
            "id": "MEDSC-M 812",
            "parent": "MEDSC-M",
            "title": "ACUTE CARE"
        }
    },
    {
        "data": {
            "description": "Care of adults and children undergoing an operation or procedure, including perioperative preparation, operative care, and post-operative cares for core clinical conditions in the specialties of anesthesia, neurosurgery, ophthalmology, general surgery, otolaryngology, urology, cardiothoracic surgery, peripheral vascular surgery, orthopedics, plastic and reconstructive surgery, and gynecology, as well as interventional radiology, procedural cardiology and gastroenterology. Basic science concepts include cerebral spinal fluid production and flow, fluids and electrolytes, consciousness, inflammation and wound healing, and cancer biology. Anatomic approach using case discussions, podcasts, curated independent reading, online nationally supported modules, and simulation skills. Longitudinal patient care experience integrating communication, evidence based medicine, health information technology, quality improvement  patient safety, professionalism, scientific inquiry, and public health.",
            "id": "MEDSC-M 813",
            "parent": "MEDSC-M",
            "title": "SURGICAL AND PROCEDURAL CARE"
        }
    },
    {
        "data": {
            "description": "Complete an Advanced Wilderness Life Support Course, which will cover topics such as Altitude Illnesses, Hyper- and Hypothermia, Toxicology, Envenomations, general trauma, and more, through lectures, skills sessions, and simulation. Focus on medical decision-making that can be executed early in disease or injury processes, in austere environments, with a focus on acute stabilization and evacuation to appropriate medical care. Learn foundational backcountry skills such as land navigation; fire and stove operation; water and waste management; and Leave-No-Trace principles. Technical workshops and field experiences give participants the opportunity to learn from experienced kayakers and climbers from the area, to apply backcountry skills on a self-supported backpacking trip, and to continue exploring wilderness medicine through interactive sessions.",
            "id": "EMERMED 914",
            "parent": "EMERMED",
            "title": "WILDERNESS MEDICINE"
        }
    },
    {
        "data": {
            "id": "EMERMED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MEDSC-M",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 812",
            "target": "EMERMED 914"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "EMERMED 914"
        }
    }
]