[
    {
        "data": {
            "description": "Focus on assessing patients with urgent medical conditions, providing acute inpatient care, and transitioning patients to other care settings or home under the care of other professionals. Provide acute care in inpatient and outpatient urgent care settings as well as on the inpatient wards, and develop acute management plans and subsequent transition of care plans. Clinical experiences in acute care settings such as the emergency department and inpatient medicine (both general and subspecialty), psychiatry, and neurology. Builds upon fundamental science concepts introduced in Body in Balance and Mind and Motion, including Ohm's Law, acid-base balance, and volume regulation. Organ system-based approach employing varied modalities. Complete an integrated patient-centered experience by participating in the care of a patient from an urgent admission through inpatient treatment and discharge.",
            "id": "MEDSC-M 812",
            "parent": "MEDSC-M",
            "title": "ACUTE CARE"
        }
    },
    {
        "data": {
            "description": "Designed to highlight, review, and allow practice of key concepts in Emergency Medicine. Practice with case simulation, case discussion, didactics, panel discussions, and procedural skills to prepare for success in the first few weeks of an Emergency Medicine residency. Will lead and participate in simulations. Explore critical interplay between medical care and communication. Discuss common challenges encountered early in residency and throughout an EM career, and develop individualized plans to address these challenges.",
            "id": "EMERMED 909",
            "parent": "EMERMED",
            "title": "EMERGENCY MEDICINE INTERNSHIP PREP COURSE"
        }
    },
    {
        "data": {
            "description": "Learn and gain clinical experience in the Emergency Department setting. Evaluate and care for the full spectrum of Emergency Department patients primarily and autonomously under the guidance and supervision of Emergency Medicine Attendings.",
            "id": "EMERMED 961",
            "parent": "EMERMED",
            "title": "ADVANCED EM ELECTIVE"
        }
    },
    {
        "data": {
            "id": "EMERMED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MEDSC-M",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "EMERMED 961",
            "target": "EMERMED 909"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 812",
            "target": "EMERMED 909"
        }
    }
]