[
    {
        "data": {
            "source": "ENTOM/ENVIRST 205",
            "target": "ENTOM 570"
        }
    },
    {
        "data": {
            "description": "A systems approach to examination of the multiple determinants of health and well-being.  Case studies and group projects explore complex issues including, but not limited to, the root causes of infectious and noncommunicable disease, health inequities in the context of global change, and trade-offs in addressing global and planetary health problems, particularly where information is incomplete, projections about future states are uncertain, or social equity concerns must be taken into account as scientific knowledge is applied.  Group projects emphasize systems thinking to critically assess global issues. Teamwork and communication skills are required for case study analysis and project management.",
            "id": "ENTOM 570",
            "parent": "ENTOM",
            "title": "SYSTEMS THINKING IN GLOBAL HEALTH"
        }
    },
    {
        "data": {
            "id": "ENTOM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "An introduction to the multiple determinants of health, global disease burden and disparities, foundational global health principles, and the overlap between ecosystem stability, planetary boundaries, and human health. Explore the core fundamentals of global health scholarship, including but not limited to infectious disease, sanitation, and mental health, and also consider ecological perspectives on these issues through the lens of planetary boundaries. Attention is placed on how human-mediated global change (e.g. climate change, biodiversity loss, land-use patterns, geochemical cycling, agricultural practice) impacts human health and the ecosystem services we depend on.  An overview of pertinent issues in sustainability science and planetary health discourse, including the 'Anthropocene' and resilience to understand and critically assess global trends.",
            "id": "ENTOM/ENVIRST 205",
            "title": "OUR PLANET, OUR HEALTH"
        }
    }
]