[
    {
        "data": {
            "description": "Covers the graphs, properties and geometric significance of trigonometric functions of a real variable. Other topics include trigonometric equations and identities, application, trigonometric form of complex numbers, DeMoivre's theorem, and polar and parametric equations. The course also has a significant number of applications, especially related to other disciplines.",
            "id": "MATH 113",
            "parent": "MATH",
            "title": "TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Explores the global and local nature of environmental problems, including issues of climate change, food, energy, globalization, deforestation, biodiversity loss, resource access, environmental justice, and population. Considers how we should analyze and act on environmental problems as we confront the apparently daunting scale of such issues. What appear to be single global environmental issues are actually composed of many smaller, context-specific, and place-dependent problems or conflicts. Through an interdisciplinary and geographic perspective, these issues can be understood and addressed at the scale of our lived lives.",
            "id": "ENVIRST/GEOG 139",
            "title": "GLOBAL ENVIRONMENTAL ISSUES"
        }
    },
    {
        "data": {
            "description": "Explores the impact of global environmental change on biodiversity and the subsequent consequences for ecosystem function and human well-being. Examines species response to these environmental changes, such as migration, adaptation, and extinction, and the implications for the delivery of ecosystem services and planetary health. Applies ecological principles to identify and evaluate practical solutions to pressing environmental challenges.",
            "id": "ENTOM 490",
            "parent": "ENTOM",
            "title": "BIODIVERSITY AND GLOBAL CHANGE"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ENTOM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ENVIRST/GEOG 139",
            "target": "ENTOM 490"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 113"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 113",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "ENTOM 490"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    }
]