[
    {
        "data": {
            "description": "Introduction to how the Earth system works and what makes Earth livable. Gain appreciation for how the atmosphere, oceans, life, and earth's surface interact to shape our local, regional and global landscapes.",
            "id": "ENVIRST/GEOG 120",
            "title": "INTRODUCTION TO THE EARTH SYSTEM"
        }
    },
    {
        "data": {
            "description": "An introduction to natural environmental systems, emphasizing the interconnections between the systems of the solid earth (minerals, rocks, soils), the hydrosphere (water in all its forms), the biosphere, and the atmosphere. Emphasizes connections between basic concepts and specific environmental issues through hands-on case studies, lab projects, and field trips to collect samples and observations for lab projects.",
            "id": "ENVIRST/GEOG 127",
            "title": "PHYSICAL SYSTEMS OF THE ENVIRONMENT"
        }
    },
    {
        "data": {
            "description": "Explores the global and local nature of environmental problems, including issues of climate change, food, energy, globalization, deforestation, biodiversity loss, resource access, environmental justice, and population. Considers how we should analyze and act on environmental problems as we confront the apparently daunting scale of such issues. What appear to be single global environmental issues are actually composed of many smaller, context-specific, and place-dependent problems or conflicts. Through an interdisciplinary and geographic perspective, these issues can be understood and addressed at the scale of our lived lives.",
            "id": "ENVIRST/GEOG 139",
            "title": "GLOBAL ENVIRONMENTAL ISSUES"
        }
    },
    {
        "data": {
            "description": "Explores the impact of global environmental change on biodiversity and the subsequent consequences for ecosystem function and human well-being. Examines species response to these environmental changes, such as migration, adaptation, and extinction, and the implications for the delivery of ecosystem services and planetary health. Applies ecological principles to identify and evaluate practical solutions to pressing environmental challenges.",
            "id": "ENTOM 490",
            "parent": "ENTOM",
            "title": "BIODIVERSITY AND GLOBAL CHANGE"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ENTOM",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ENVIRST/GEOG 120",
            "target": "ENTOM 490"
        }
    },
    {
        "data": {
            "source": "ENVIRST/GEOG 120",
            "target": "ENVIRST/GEOG 127"
        }
    },
    {
        "data": {
            "source": "ENVIRST/GEOG 127",
            "target": "ENTOM 490"
        }
    },
    {
        "data": {
            "source": "ENVIRST/GEOG 127",
            "target": "ENVIRST/GEOG 120"
        }
    },
    {
        "data": {
            "source": "ENVIRST/GEOG 139",
            "target": "ENTOM 490"
        }
    }
]