[
    {
        "data": {
            "source": "ENVIRST/GEOG 337",
            "target": "ENVIRST 112"
        }
    },
    {
        "data": {
            "source": "ENVIRST/GEOG 337",
            "target": "ENVIRST/GEOG 537"
        }
    },
    {
        "data": {
            "id": "ENVIRST",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Explores the links between nature, power and society in today's world. Considers the complex relationships between humans and the earth's resources, including food, energy, physical materials, water, biota, and landscapes. Examines issues linked to population and scarcity, resource tenure, green consumerism, political economy, environmental ethics, risks and hazards, political ecology, and environmental justice.",
            "id": "ENVIRST/GEOG 337",
            "title": "NATURE, POWER AND SOCIETY"
        }
    },
    {
        "data": {
            "description": "Geographic approaches to culture-nature relationships, including human perception of, use of, and adaptation to the physical environment, with emphasis on traditional subsistence systems; selected topics from contemporary and historical sources.",
            "id": "ENVIRST/GEOG 537",
            "title": "CULTURE AND ENVIRONMENT"
        }
    },
    {
        "data": {
            "description": "Explores different social science approaches to interpreting the relationship between environment and society at various scales, from the local to the global. Traces the social origins of environmental concerns, their social impacts, and the different responses they engender.",
            "id": "ENVIRST 112",
            "parent": "ENVIRST",
            "title": "ENVIRONMENTAL STUDIES: SOCIAL SCIENCE PERSPECTIVES"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ENVIRST 112",
            "target": "ENVIRST/GEOG 337"
        }
    },
    {
        "data": {
            "description": "Examines major environmental conservation approaches in the U.S. and developing countries and how they are influenced by sociopolitical factors, cultural values and scientific understandings of nature. Historical and contemporary cases are explored with emphasis on biodiversity and climate change issues.",
            "id": "ENVIRST/GEOG 339",
            "title": "ENVIRONMENTAL CONSERVATION"
        }
    },
    {
        "data": {
            "source": "ENVIRST/GEOG 339",
            "target": "ENVIRST/GEOG 537"
        }
    }
]