[
    {
        "data": {
            "description": "A preparation and introductory math course for students enrolled in the Summer Collegiate Experience program. Includes material from precalculus and calculus and related topics depending on students' results on the math placement exam.",
            "id": "MATH 118",
            "parent": "MATH",
            "title": "SUMMER COLLEGIATE EXPERIENCE MATHEMATICS COURSE"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Introduction to the Earth as viewed from above, focusing on use of aerial photography and satellite imagery to study the environment. Includes physical processes of electromagnetic radiation, data types and sensing capabilities, methods for interpretation, analysis and mapping, and applications.",
            "id": "ENVIRST/F&WECOL/GEOG/GEOSCI/GLE/LANDARC 371",
            "title": "INTRODUCTION TO ENVIRONMENTAL REMOTE SENSING"
        }
    },
    {
        "data": {
            "description": "Many diverse technologies for monitoring the environment have become available in recent years, including traditional remote sensing data sources: aerial photography and satellite imagery, hyper-spectral data, imagery on demand, RADAR and LiDAR.  Other new data sources are quite unconventional, with many emerging relatively recently: unmanned aerial vehicles (UAVs or drones), social media, smartphones as sources of crowd-sourced data, and more.  Sophisticated data management, analytics, and presentation technology are required to effectively leverage both the spatial (including 3D) and temporal dimensions of these often untapped data sources. Intended to survey and explore these newly developing technologies, and provide direct experience to the student to understand and interact with the data and methods (geocomputing, coding, cloud-based platforms), and to learn to plan, manage, and utilize them effectively.",
            "id": "ENVIRST 971",
            "parent": "ENVIRST",
            "title": "ENVIRONMENTAL SENSING TECHNOLOGIES"
        }
    },
    {
        "data": {
            "description": "Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Part of a 2-semester sequence withMATH 217; these two courses together are equivalent toMATH 114and221.",
            "id": "MATH 171",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY I"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ENVIRST",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ENVIRST/F&WECOL/GEOG/GEOSCI/GLE/LANDARC 371",
            "target": "ENVIRST 971"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "ENVIRST/F&WECOL/GEOG/GEOSCI/GLE/LANDARC 371"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 171"
        }
    }
]