[
    {
        "data": {
            "source": "EPD 640",
            "target": "EPD 650"
        }
    },
    {
        "data": {
            "id": "EPD",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Introduction to the chemistry and physics of polymeric materials. Concepts of polymer synthesis as well as physical properties are introduced, including molecular weight, chain conformation, step growth and chain growth kinetics, basic rheology and viscoelasticity as well as glass transition and crystallinity.",
            "id": "EPD 636",
            "parent": "EPD",
            "title": "INTRODUCTION TO POLYMERS"
        }
    },
    {
        "data": {
            "description": "Introduction to the principles of polymer processing. Review of the basic techniques primarily in use by industry as well as foundational principles of polymer physics, viscoelasticity and rheology. Focus on understanding how design of process is used to achieve desired structure and properties. Includes introduction to topics such as 3-d printing and recycling of polymer waste in the context of reprocessing such materials.",
            "id": "EPD 650",
            "parent": "EPD",
            "title": "INTRODUCTION TO POLYMERS PROCESSING"
        }
    },
    {
        "data": {
            "description": "Introduction to polymer rheology. Concepts of continuum mechanics are introduced, specifically the fluid dynamics of non-Newtonian and linear viscoelastic fluids. Material functions, constitutive equations and rheometry and experimental methods for measuring material functions (rheometry) are discussed. Knowledge of linear differential equations [such asMATH 319or320] and fluid mechanics [such asM E 363] or momentum transfer [such asCBE 320] required.",
            "id": "EPD 640",
            "parent": "EPD",
            "title": "INTRODUCTORY POLYMER RHEOLOGY"
        }
    },
    {
        "data": {
            "source": "EPD 636",
            "target": "EPD 650"
        }
    }
]