[
    {
        "data": {
            "id": "BIOCORE",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Introduction to the basic principles and concepts of the biology of plants. an integrative approach stressing evolutionary sequences and the relationship between structure and function at succeeding levels of organization: molecule, cell, organism, population, community. Correlated lectures, laboratories, and discussions.",
            "id": "BIOLOGY/BOTANY 130",
            "title": "GENERAL BOTANY"
        }
    },
    {
        "data": {
            "id": "F&WECOL",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Explores natural and anthropogenic disturbances occurring in forest ecosystems through hands on learning experiences. Emphasis on the role of herbivores and fire with examination of management strategies. Applies basic ecological laboratory and field techniques to understanding disturbances that change the physical environment and disrupt ecosystem structure.",
            "id": "F&WECOL 449",
            "parent": "F&WECOL",
            "title": "DISTURBANCE ECOLOGY LAB (I): HERBIVORES AND FIRE"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "F&WECOL 449"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "F&WECOL 449"
        }
    },
    {
        "data": {
            "description": "Basic principles of ecology and interrelations between individuals, populations, communities, ecosystems and their environment; transmission genetics and introduction to population genetics; origin of life, evolutionary mechanisms, ancestral relationships among species, and the diversity of life.",
            "id": "BIOCORE 381",
            "parent": "BIOCORE",
            "title": "EVOLUTION, ECOLOGY, AND GENETICS"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    }
]