[
    {
        "data": {
            "description": "Focus on assessing patients with urgent medical conditions, providing acute inpatient care, and transitioning patients to other care settings or home under the care of other professionals. Provide acute care in inpatient and outpatient urgent care settings as well as on the inpatient wards, and develop acute management plans and subsequent transition of care plans. Clinical experiences in acute care settings such as the emergency department and inpatient medicine (both general and subspecialty), psychiatry, and neurology. Builds upon fundamental science concepts introduced in Body in Balance and Mind and Motion, including Ohm's Law, acid-base balance, and volume regulation. Organ system-based approach employing varied modalities. Complete an integrated patient-centered experience by participating in the care of a patient from an urgent admission through inpatient treatment and discharge.",
            "id": "MEDSC-M 812",
            "parent": "MEDSC-M",
            "title": "ACUTE CARE"
        }
    },
    {
        "data": {
            "description": "Gain a basic understanding of the pharmacology, mechanism of action, phytochemistry and botany (plant identification) of common plants used for healing in the United States. Analyze herbalpharmaceutical interactions and liver detoxification systems, extremely important skills in the practice of clinical medicine for any specialty. Prepare simple herbal treatments in the Learning Kitchen at the American Center and discuss practical applications in the clinical setting.",
            "id": "FAMMED 911",
            "parent": "FAMMED",
            "title": "EVIDENCE-BASED HERBAL MEDICINE SAFETY AND EFFICACY SELECTIVE IN FAMILY MEDICINE"
        }
    },
    {
        "data": {
            "description": "Identify the roles of physicians, interdisciplinary providers, health care systems, and communities in screening, treating, and preventing common, chronic conditions. Activities are centered on health promotion, outpatient-based chronic disease management, and community health. Clinical experiences will occur in primary care, behavioral health, and other ambulatory and community-based settings that focus on chronic disease management.",
            "id": "MEDSC-M 811",
            "parent": "MEDSC-M",
            "title": "CHRONIC AND PREVENTIVE CARE"
        }
    },
    {
        "data": {
            "id": "FAMMED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MEDSC-M",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 811",
            "target": "FAMMED 911"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 812",
            "target": "FAMMED 911"
        }
    }
]