[
    {
        "data": {
            "description": "Examines generally accepted accounting principles for measurement and reporting of financial information in a balance sheet, income statement, and statement of cash flows; introduction to analysis and interpretation of financial accounting data for decision-making purposes.",
            "id": "ACCTIS 100",
            "parent": "ACCTIS",
            "title": "INTRODUCTORY FINANCIAL ACCOUNTING"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON/FINANCE 300"
        }
    },
    {
        "data": {
            "id": "FINANCE",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ACCTIS 100",
            "target": "ACCTIS 300"
        }
    },
    {
        "data": {
            "source": "ACCTIS 100",
            "target": "ECON/FINANCE 300"
        }
    },
    {
        "data": {
            "source": "ACCTIS 300",
            "target": "ECON/FINANCE 300"
        }
    },
    {
        "data": {
            "description": "Introduces and broadens understanding of the intricacies surrounding wealth preservation, intergenerational wealth transfer, and trust financial services. Delves into the legal, tax, and financial aspects of estate planning, business succession strategies, and efficient wealth transfer techniques. Explore cutting-edge approaches for mitigating tax liabilities, navigating complex family dynamics, and structuring customized solutions for diverse client needs while highlighting career opportunities within the trust financial services industry and preparing students for a range of professional paths. Gain the expertise needed to effectively advise clients and guide them through the process of safeguarding and transferring their wealth, ensuring a lasting financial legacy.",
            "id": "FINANCE 601",
            "parent": "FINANCE",
            "title": "STRATEGIC PLANNING FOR ESTATES AND BUSINESS TRANSITIONS"
        }
    },
    {
        "data": {
            "description": "Examines both financial and managerial accounting for business decisions. Emphasizes preparation and interpretation of financial statements, analysis of financial information, determination of costs for products and services, and use of accounting information for planning and control of business operations.",
            "id": "ACCTIS 300",
            "parent": "ACCTIS",
            "title": "ACCOUNTING PRINCIPLES"
        }
    },
    {
        "data": {
            "source": "ECON/FINANCE 300",
            "target": "FINANCE 601"
        }
    },
    {
        "data": {
            "id": "ECON",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Integrated treatment of macroeconomics and microeconomics (seeECON 101andECON 102). Accelerated approach to economics training, especially for Economics: Math Emphasis majors.",
            "id": "ECON 111",
            "parent": "ECON",
            "title": "PRINCIPLES OF ECONOMICS-ACCELERATED TREATMENT"
        }
    },
    {
        "data": {
            "id": "ACCTIS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON 111"
        }
    },
    {
        "data": {
            "description": "Economic problems of individuals, firms and industries with emphasis on value, price, and distribution of income.",
            "id": "ECON 101",
            "parent": "ECON",
            "title": "PRINCIPLES OF MICROECONOMICS"
        }
    },
    {
        "data": {
            "source": "ACCTIS 300",
            "target": "ACCTIS 100"
        }
    },
    {
        "data": {
            "description": "Concepts and techniques in corporate finance and investments. Topics include the financial environment, securities markets, financial markets, financial statements and analysis, working capital management, capital budgeting, cost of capital, dividend policy, asset valuation, investments, decision-making under uncertainty, mergers, options, and futures.",
            "id": "ECON/FINANCE 300",
            "title": "INTRODUCTION TO FINANCE"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON 101"
        }
    }
]