[
    {
        "data": {
            "description": "Examines generally accepted accounting principles for measurement and reporting of financial information in a balance sheet, income statement, and statement of cash flows; introduction to analysis and interpretation of financial accounting data for decision-making purposes.",
            "id": "ACCTIS 100",
            "parent": "ACCTIS",
            "title": "INTRODUCTORY FINANCIAL ACCOUNTING"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON/FINANCE 300"
        }
    },
    {
        "data": {
            "id": "FINANCE",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ACCTIS 100",
            "target": "ACCTIS 300"
        }
    },
    {
        "data": {
            "source": "ACCTIS 100",
            "target": "ECON/FINANCE 300"
        }
    },
    {
        "data": {
            "source": "ACCTIS 300",
            "target": "ECON/FINANCE 300"
        }
    },
    {
        "data": {
            "source": "FINANCE 410",
            "target": "FINANCE 610"
        }
    },
    {
        "data": {
            "source": "ECON/FINANCE 300",
            "target": "FINANCE 410"
        }
    },
    {
        "data": {
            "description": "Examines both financial and managerial accounting for business decisions. Emphasizes preparation and interpretation of financial statements, analysis of financial information, determination of costs for products and services, and use of accounting information for planning and control of business operations.",
            "id": "ACCTIS 300",
            "parent": "ACCTIS",
            "title": "ACCOUNTING PRINCIPLES"
        }
    },
    {
        "data": {
            "description": "Covers advanced asset-liability, hedging, tax minimization, merger/acquisitions and economic value added strategies for depository financial institutions. Students practice these strategies by managing their own bank in a computer simulation model, merging with or acquiring other student's banks using MA software, and by playing a foreign exchange trading simulation.",
            "id": "FINANCE 610",
            "parent": "FINANCE",
            "title": "BANK SIMULATION AND STRATEGY"
        }
    },
    {
        "data": {
            "description": "Management of depository financial intermediaries with primary emphasis on commercial banks. Topics include bank regulation, liquidity and reserve position management, loan pricing and analysis, investment portfolio problems and overall asset liability management.",
            "id": "FINANCE 410",
            "parent": "FINANCE",
            "title": "BANK MANAGEMENT"
        }
    },
    {
        "data": {
            "id": "ECON",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Integrated treatment of macroeconomics and microeconomics (seeECON 101andECON 102). Accelerated approach to economics training, especially for Economics: Math Emphasis majors.",
            "id": "ECON 111",
            "parent": "ECON",
            "title": "PRINCIPLES OF ECONOMICS-ACCELERATED TREATMENT"
        }
    },
    {
        "data": {
            "id": "ACCTIS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON 111"
        }
    },
    {
        "data": {
            "description": "Economic problems of individuals, firms and industries with emphasis on value, price, and distribution of income.",
            "id": "ECON 101",
            "parent": "ECON",
            "title": "PRINCIPLES OF MICROECONOMICS"
        }
    },
    {
        "data": {
            "source": "ACCTIS 300",
            "target": "ACCTIS 100"
        }
    },
    {
        "data": {
            "description": "Concepts and techniques in corporate finance and investments. Topics include the financial environment, securities markets, financial markets, financial statements and analysis, working capital management, capital budgeting, cost of capital, dividend policy, asset valuation, investments, decision-making under uncertainty, mergers, options, and futures.",
            "id": "ECON/FINANCE 300",
            "title": "INTRODUCTION TO FINANCE"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON 101"
        }
    }
]