[
    {
        "data": {
            "id": "MICROBIO",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics and selected topics in Animal Physiology.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 102",
            "target": "FOODSCI 301"
        }
    },
    {
        "data": {
            "description": "General biological principles. Topics include: evolution, ecology, animal behavior, cell structure and function, genetics and molecular genetics and the physiology of a variety of organ systems emphasizing function in humans.",
            "id": "BIOLOGY/ZOOLOGY 101",
            "title": "ANIMAL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Principles of food preservation, epidemiology of foodborne illness, agents of foodborne illness, food fermentations and biotechnology.",
            "id": "FOODSCI/MICROBIO 325",
            "title": "FOOD MICROBIOLOGY"
        }
    },
    {
        "data": {
            "source": "PHYSICS 207",
            "target": "FOODSCI 440"
        }
    },
    {
        "data": {
            "source": "FOODSCI 440",
            "target": "FOODSCI 432"
        }
    },
    {
        "data": {
            "description": "Survey of microorganisms and their activities; emphasis on structure, function, ecology, nutrition, physiology, genetics. Survey of applied microbiology--medical, agricultural, food and industrial microbiology. Intended to satisfy any curriculum which requires introductory level microbiology.",
            "id": "MICROBIO 101",
            "parent": "MICROBIO",
            "title": "GENERAL MICROBIOLOGY"
        }
    },
    {
        "data": {
            "description": "Procedures used to process and preserve foods on a commercial basis, with emphasis on concentration, dehydration and fractionation process, plant sanitation/GMP, statistical process control, and environmental impacts..",
            "id": "FOODSCI 532",
            "parent": "FOODSCI",
            "title": "INTEGRATED FOOD MANUFACTURING"
        }
    },
    {
        "data": {
            "description": "Basic biology of microorganisms, including structure, function, physiology, genetics, ecology, diversity, and evolution.",
            "id": "MICROBIO 303",
            "parent": "MICROBIO",
            "title": "BIOLOGY OF MICROORGANISMS"
        }
    },
    {
        "data": {
            "description": "General concepts of animal biology at an introductory level emphasizing the evolutionary relationships between animals. Learn about general body plans and strategies used to accomplish the basic tasks of staying alive in major animal groups using preserved and live animals. Study the diversity within each group of animals by integrating the body plans with the lifestyle and ecology of animals. Dissections of earthworm, freshwater mussel, squid, sea star, and rat aid the study of these general principles.",
            "id": "BIOLOGY/ZOOLOGY 102",
            "title": "ANIMAL BIOLOGY LABORATORY"
        }
    },
    {
        "data": {
            "source": "MICROBIO 303",
            "target": "MICROBIO 101"
        }
    },
    {
        "data": {
            "source": "MICROBIO 303",
            "target": "FOODSCI/MICROBIO 325"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "FOODSCI 301"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 102"
        }
    },
    {
        "data": {
            "source": "FOODSCI 301",
            "target": "FOODSCI 440"
        }
    },
    {
        "data": {
            "source": "MICROBIO 101",
            "target": "FOODSCI/MICROBIO 325"
        }
    },
    {
        "data": {
            "source": "PHYSICS 207",
            "target": "PHYSICS 201"
        }
    },
    {
        "data": {
            "source": "PHYSICS 201",
            "target": "PHYSICS 207"
        }
    },
    {
        "data": {
            "id": "FOODSCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 151"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for students majoring in biological sciences. Mechanics: kinematics, statics, dynamics; energy and momentum. Heat and sound.",
            "id": "PHYSICS 207",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Introduction to the basic principles and concepts of the biology of plants. an integrative approach stressing evolutionary sequences and the relationship between structure and function at succeeding levels of organization: molecule, cell, organism, population, community. Correlated lectures, laboratories, and discussions.",
            "id": "BIOLOGY/BOTANY 130",
            "title": "GENERAL BOTANY"
        }
    },
    {
        "data": {
            "description": "Application of engineering principles in the analysis of food process operations: properties of gases and vapors, psychrometrics, material and energy balances, fluid flow, heat transfer, microwave heating, mass transfer, packaging film permeability, dehydration.",
            "id": "FOODSCI 440",
            "parent": "FOODSCI",
            "title": "PRINCIPLES OF FOOD ENGINEERING"
        }
    },
    {
        "data": {
            "id": "PHYSICS",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for engineering students. Mechanics: kinematics, statics, dynamics; energy and momentum.",
            "id": "PHYSICS 201",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "source": "FOODSCI 432",
            "target": "FOODSCI 532"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "FOODSCI 301"
        }
    },
    {
        "data": {
            "source": "FOODSCI/MICROBIO 325",
            "target": "FOODSCI 432"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 101"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "MICROBIO 303"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "MICROBIO 303"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "MICROBIO 303"
        }
    },
    {
        "data": {
            "description": "Fundamentals of food preservation methods: post-harvest, thermal processing, refrigeration and freezing, control of water activity, chemical preservation, nonthermal methods and control of food packaging.",
            "id": "FOODSCI 432",
            "parent": "FOODSCI",
            "title": "PRINCIPLES OF FOOD PRESERVATION"
        }
    },
    {
        "data": {
            "description": "Introduction to the science and the technology of food manufacture. Covers the basic chemical, physical and microbiological properties of food and manipulation of these properties in the manufacture of food products.",
            "id": "FOODSCI 301",
            "parent": "FOODSCI",
            "title": "INTRODUCTION TO THE SCIENCE AND TECHNOLOGY OF FOOD"
        }
    }
]