[
    {
        "data": {
            "description": "Critically examines important issues, questions, and debates regarding intersectionality or the notion that race, gender, and sexuality, and other terrains of difference gain meaning from each other. Materials include texts, films, and other multimedia resources drawn from an array of disciplines including sociology, critical race theory, history, political theory, and cultural studies.",
            "id": "GEN&WS 547",
            "parent": "GEN&WS",
            "title": "THEORIZING INTERSECTIONALITY"
        }
    },
    {
        "data": {
            "id": "GEN&WS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "GEN&WS 446",
            "target": "GEN&WS 547"
        }
    },
    {
        "data": {
            "source": "GEN&WS 445",
            "target": "GEN&WS 547"
        }
    },
    {
        "data": {
            "description": "An examination of the emergent theoretical field of queer of color critique, a mode of analysis grounded in the struggles and world-making of LGBTQ people of color. Activists, artists, and theorists have mobilized queer of color critique to interrogate the intersections of race, gender, sexuality, class, nation, and diaspora as a response to the inherent whiteness of mainstream queer theory and persistent heterosexism in ethnic studies. Examines the development of queer of color critique (primarily in the United States) through both academic and activist domains; consider what queer theory has to say about empire, citizenship, prisons, welfare, neoliberalism, and terrorism; and articulate the role of queer of color analysis in a vision for racial, gender, sexual, and economic justice.",
            "id": "GEN&WS 446",
            "parent": "GEN&WS",
            "title": "QUEER OF COLOR CRITIQUE"
        }
    },
    {
        "data": {
            "description": "Explores a broad range of contemporary theories concerned with bodies and power.  Intersections with gender, race, class, dis / ability, sexuality and nation.",
            "id": "GEN&WS 445",
            "parent": "GEN&WS",
            "title": "THE BODY IN THEORY"
        }
    }
]