[
    {
        "data": {
            "source": "GEN&WS 102",
            "target": "GEN&WS/PSYCH 522"
        }
    },
    {
        "data": {
            "description": "Global, interdisciplinary, social science-oriented analysis of gender, race, class and sexuality in relationship to social institutions and movements for social change. Focus on gender and women in institutions such as education, the economy, the family, law, media, medicine, and politics.",
            "id": "GEN&WS 102",
            "parent": "GEN&WS",
            "title": "GENDER, WOMEN, AND SOCIETY IN GLOBAL PERSPECTIVE"
        }
    },
    {
        "data": {
            "id": "GEN&WS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "GEN&WS 103",
            "target": "GEN&WS/PSYCH 522"
        }
    },
    {
        "data": {
            "description": "Examines both physiological and social processes relating to gender and health across the lifespan among cisgender, transgender, and non-binary individuals. Examples of topics include hormonal processes, reproductive anatomy  physiology, sexuality, sexual pleasure, chronic illness, depression, and sexual violence. A primary course objective is for students to connect information about their bodies and personal health to larger social and political contexts. In particular, considers how health and health disparities are shaped by multiple kind of social inequalities, particularly inequalities based on gender.",
            "id": "GEN&WS 103",
            "parent": "GEN&WS",
            "title": "GENDER, WOMEN, BODIES, AND HEALTH"
        }
    },
    {
        "data": {
            "description": "Examination of theories and research on the psychology of women and gender. Explores topics such as sex bias in psychological research; psychological aspects of female sexuality and reproduction; gender-based violence; female achievement and power; lifestyle choices of women; women and mental health; and psychological research with transgender individuals.",
            "id": "GEN&WS/PSYCH 522",
            "title": "PSYCHOLOGY OF WOMEN AND GENDER"
        }
    }
]