[
    {
        "data": {
            "source": "LEGALST/SOC 131",
            "target": "GEN&WS/LEGALST/SOC 425"
        }
    },
    {
        "data": {
            "description": "Global, interdisciplinary, social science-oriented analysis of gender, race, class and sexuality in relationship to social institutions and movements for social change. Focus on gender and women in institutions such as education, the economy, the family, law, media, medicine, and politics.",
            "id": "GEN&WS 102",
            "parent": "GEN&WS",
            "title": "GENDER, WOMEN, AND SOCIETY IN GLOBAL PERSPECTIVE"
        }
    },
    {
        "data": {
            "id": "GEN&WS",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Focuses on the intersection between gender, crime and justice from a cross-cultural perspective. The gendered nature of the criminal justice system, female experiences of crime, prosecution and incarceration as well as the extent to which women are victims, offenders, and participants in the criminal justice system will be explored. Special emphasis will be placed on the theoretical implications of offending behavior and the intersection of gender with sexuality, race, ethnicity and class. The goal of this course is to provide a foundation for critically assessing the often controversial issues surrounding race, gender, crime, and criminal justice in society.",
            "id": "GEN&WS/LEGALST/SOC 425",
            "title": "CRIME, GENDER AND JUSTICE"
        }
    },
    {
        "data": {
            "source": "GEN&WS 102",
            "target": "GEN&WS/LEGALST/SOC 425"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Day-to-day functioning of the elements of the criminal justice system in the U.S. Nature of crime in the U.S., ideas about causes and solutions. Emphasis on the sociology of the components of criminal justice system--organization and roles of police, lawyers, court and correctional personnel.",
            "id": "LEGALST/SOC 131",
            "title": "CRIMINAL JUSTICE IN AMERICA"
        }
    }
]