[
    {
        "data": {
            "description": "Explores central assumptions, questions, and debates regarding the relationship between feminist theory, pro-feminist theory, and the practice and performance of multiple masculinities. Explores feminist-informed definitions of and debates about masculinity including whether masculinity is primarily a gender-role and/or a form of sexual expression. Further, key tensions related to men's status, or their lack thereof, as subjects of feminist theory will be examined. Examine the practice and performance of specific masculinities including but not limited to African American masculinities, trans masculinities, and faith-informed masculinities.",
            "id": "GEN&WS 546",
            "parent": "GEN&WS",
            "title": "FEMINIST THEORIES AND MASCULINITIES"
        }
    },
    {
        "data": {
            "description": "Contemporary theoretical positions and debates about feminisms in the humanities and social sciences.",
            "id": "GEN&WS 441",
            "parent": "GEN&WS",
            "title": "CONTEMPORARY FEMINIST THEORIES"
        }
    },
    {
        "data": {
            "description": "Critically examines important issues, questions, and debates regarding intersectionality or the notion that race, gender, and sexuality, and other terrains of difference gain meaning from each other. Materials include texts, films, and other multimedia resources drawn from an array of disciplines including sociology, critical race theory, history, political theory, and cultural studies.",
            "id": "GEN&WS 547",
            "parent": "GEN&WS",
            "title": "THEORIZING INTERSECTIONALITY"
        }
    },
    {
        "data": {
            "description": "Uses an interdisciplinary framework to interrogate core assumptions, arguments, and silences in past and present black feminist thought.",
            "id": "AFROAMER/GEN&WS 333",
            "title": "BLACK FEMINISMS"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "GEN&WS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "AFROAMER/GEN&WS 333",
            "target": "GEN&WS 547"
        }
    },
    {
        "data": {
            "source": "GEN&WS 441",
            "target": "GEN&WS 546"
        }
    },
    {
        "data": {
            "source": "GEN&WS 546",
            "target": "GEN&WS 547"
        }
    },
    {
        "data": {
            "source": "GEN&WS 547",
            "target": "GEN&WS 546"
        }
    }
]