[
    {
        "data": {
            "description": "Exploration of statistical inference and data analytics tools. Review of relevant foundations of statistics, machine learning and probability theory. Emphasis on applying the resulting concepts to canonical business examples, using both Excel and R.",
            "id": "GENBUS 704",
            "parent": "GENBUS",
            "title": "DATA TO DECISIONS"
        }
    },
    {
        "data": {
            "description": "Introduce students to principles of data visualization and provide hands-on experience using data visualization tools and techniques for business applications. Develop proficiency in current visualization software tools, and leverage these tools for data exploration, insight into decision-making, and data presentation. Recommended for students to have general computing skills and familiarity with MS Word, MS Excel and MS PowerPoint; introductory-level exposure to coding in any language; some R experience; basic statistical literacy, equivalent to at least one semester of statistics.",
            "id": "GENBUS 720",
            "parent": "GENBUS",
            "title": "DATA VISUALIZATION FOR BUSINESS ANALYTICS"
        }
    },
    {
        "data": {
            "description": "Provides an introduction to experimental and causal methods for driving business insights. Topics include: (1) Review and distinction of correlation vs. causation; (2) design and analysis of randomized-controlled experiments; and (3) identification of \"natural experiments\" in business data and corresponding empirical strategies.",
            "id": "GENBUS 740",
            "parent": "GENBUS",
            "title": "EXPERIMENTS AND CAUSAL METHODS FOR BUSINESS INSIGHTS"
        }
    },
    {
        "data": {
            "id": "GENBUS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "GENBUS 704",
            "target": "GENBUS 740"
        }
    },
    {
        "data": {
            "source": "GENBUS 720",
            "target": "GENBUS 740"
        }
    }
]