[
    {
        "data": {
            "source": "GENBUS 317",
            "target": "GENBUS 656"
        }
    },
    {
        "data": {
            "description": "Introduction to calculus of functions of several variables; calculus on parameterized curves, derivatives of functions of several variables, multiple integrals, vector calculus.",
            "id": "MATH 234",
            "parent": "MATH",
            "title": "CALCULUS--FUNCTIONS OF SEVERAL VARIABLES"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 213"
        }
    },
    {
        "data": {
            "description": "Probability and combinatorial methods, discrete and continuous, univariate and multivariate distributions, expected values, moments, normal distribution and derived distributions, estimation.",
            "id": "MATH/STAT 309",
            "title": "INTRODUCTION TO PROBABILITY AND MATHEMATICAL STATISTICS I"
        }
    },
    {
        "data": {
            "description": "Introduction to machine learning techniques in business. Focus on applications for solving business problems, including hands-on practice in the context of various real-world data sets. Materials covered include machine learning foundations, different methodological approaches, and implementation tools for machine learning for business applications. Methods include both supervised learning techniques (linear regression and classification, non-linear regression, CARTs, random forests, SVMs, artificial neural nets, etc.) as well as unsupervised learning techniques (clustering, principal components, etc.).",
            "id": "GENBUS 656",
            "parent": "GENBUS",
            "title": "MACHINE LEARNING FOR BUSINESS ANALYTICS"
        }
    },
    {
        "data": {
            "source": "MATH/STAT 431",
            "target": "MATH/STAT 309"
        }
    },
    {
        "data": {
            "source": "MATH/STAT 309",
            "target": "GENBUS 317"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 234"
        }
    },
    {
        "data": {
            "description": "Techniques of integration, improper integrals, first order ordinary differential equations, sequences and series, Taylor series, vector geometry in two and three dimensions.",
            "id": "MATH 222",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 2"
        }
    },
    {
        "data": {
            "description": "First order differential equations, introduction to multivariable calculus and constrained optimization, infinite sequences and series, methods of approximation, and a brief introduction to probability. Models and applications from business and the social sciences.",
            "id": "MATH 213",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 2"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 222"
        }
    },
    {
        "data": {
            "source": "MATH 375",
            "target": "MATH 376"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "MATH/STAT 431"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "source": "MATH 376",
            "target": "MATH/STAT 431"
        }
    },
    {
        "data": {
            "source": "MATH 213",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "description": "Vector spaces and linear transformations, differential calculus of scalar and vector fields, determinants, eigenvalues and eigenvectors, multiple integrals, line integrals, and surface integrals. Freshmen students are invited to enroll by the Department of Mathematics.",
            "id": "MATH 375",
            "parent": "MATH",
            "title": "TOPICS IN MULTI-VARIABLE CALCULUS AND LINEAR ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Topics in multi-variable calculus and introduction to differential equations.",
            "id": "MATH 376",
            "parent": "MATH",
            "title": "TOPICS IN MULTI-VARIABLE CALCULUS AND DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "description": "Topics covered include axioms of probability, random variables, the most important discrete and continuous probability distributions, expectation and variance, moment generating functions, conditional probability and conditional expectations, multivariate distributions, Markov's and Chebyshev's inequalities, laws of large numbers, and the central limit theorem.",
            "id": "MATH/STAT 431",
            "title": "INTRODUCTION TO THE THEORY OF PROBABILITY"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "GENBUS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "description": "Statistical inference and analyses based on models will be introduced and applied in a business context using a calculus-based focus. Topics covered include point estimation, confidence intervals, hypothesis testing, regression models, and time series models. Various methods for fitting a model to data will be explored, and uncertainty about parameter estimates will be quantified so decision makers have information about the quality of the estimates. Regression and time series models are commonly used in business analytics applications and will be used to analyze business data and make inferences and predictions.",
            "id": "GENBUS 317",
            "parent": "GENBUS",
            "title": "MATHEMATICAL FOUNDATIONS OF BUSINESS ANALYTICS"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    }
]