[
    {
        "data": {
            "description": "The management of people and organizations: diversity, attitude and job satisfaction, emotions, personality and value, individual and group decision making, motivation, teams, leadership, influence, strategy, organizational structure and culture, and change management.",
            "id": "MHR 300",
            "parent": "MHR",
            "title": "MANAGING ORGANIZATIONS"
        }
    },
    {
        "data": {
            "description": "Examines generally accepted accounting principles for measurement and reporting of financial information in a balance sheet, income statement, and statement of cash flows; introduction to analysis and interpretation of financial accounting data for decision-making purposes.",
            "id": "ACCTIS 100",
            "parent": "ACCTIS",
            "title": "INTRODUCTORY FINANCIAL ACCOUNTING"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON/FINANCE 300"
        }
    },
    {
        "data": {
            "source": "ACCTIS 100",
            "target": "ACCTIS 300"
        }
    },
    {
        "data": {
            "source": "ACCTIS 100",
            "target": "ECON/FINANCE 300"
        }
    },
    {
        "data": {
            "source": "ACCTIS 300",
            "target": "ECON/FINANCE 300"
        }
    },
    {
        "data": {
            "source": "GENBUS 360",
            "target": "GENBUS 400"
        }
    },
    {
        "data": {
            "description": "Develop and practice workplace communication skills: writing, speaking, and listening. A theoretical foundation provides a method of deep audience analysis; apply that analysis when producing a variety of written genres and when preparing content for formal presentations. Research communication and information sources specific to future careers. Strengthen information literacy by developing professional research skills and analyzing sources. Revise written work through a workshop process that requires giving, receiving, and implementing feedback.",
            "id": "GENBUS 360",
            "parent": "GENBUS",
            "title": "WORKPLACE WRITING AND COMMUNICATION"
        }
    },
    {
        "data": {
            "description": "Examines both financial and managerial accounting for business decisions. Emphasizes preparation and interpretation of financial statements, analysis of financial information, determination of costs for products and services, and use of accounting information for planning and control of business operations.",
            "id": "ACCTIS 300",
            "parent": "ACCTIS",
            "title": "ACCOUNTING PRINCIPLES"
        }
    },
    {
        "data": {
            "source": "ECON/FINANCE 300",
            "target": "GENBUS 400"
        }
    },
    {
        "data": {
            "description": "An introduction for new business students covering academic exploration and planning, career development, self-assessment for personal development, leadership, and diversity and inclusion.",
            "id": "GENBUS 110",
            "parent": "GENBUS",
            "title": "PERSONAL AND PROFESSIONAL FOUNDATIONS IN BUSINESS"
        }
    },
    {
        "data": {
            "id": "MHR",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "MHR 300",
            "target": "GENBUS 400"
        }
    },
    {
        "data": {
            "id": "ECON",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Integrated treatment of macroeconomics and microeconomics (seeECON 101andECON 102). Accelerated approach to economics training, especially for Economics: Math Emphasis majors.",
            "id": "ECON 111",
            "parent": "ECON",
            "title": "PRINCIPLES OF ECONOMICS-ACCELERATED TREATMENT"
        }
    },
    {
        "data": {
            "id": "ACCTIS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON 111"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Capstone integrating the curriculum through the application of business strategy to business problems in cross-functional teams. Develops and refines key skills introduced in core courses, including professional communications, inclusive leadership, and quantitative analysis.",
            "id": "GENBUS 400",
            "parent": "GENBUS",
            "title": "INTEGRATED STRATEGIC LEADERSHIP"
        }
    },
    {
        "data": {
            "description": "Economic problems of individuals, firms and industries with emphasis on value, price, and distribution of income.",
            "id": "ECON 101",
            "parent": "ECON",
            "title": "PRINCIPLES OF MICROECONOMICS"
        }
    },
    {
        "data": {
            "source": "ACCTIS 300",
            "target": "ACCTIS 100"
        }
    },
    {
        "data": {
            "description": "Concepts and techniques in corporate finance and investments. Topics include the financial environment, securities markets, financial markets, financial statements and analysis, working capital management, capital budgeting, cost of capital, dividend policy, asset valuation, investments, decision-making under uncertainty, mergers, options, and futures.",
            "id": "ECON/FINANCE 300",
            "title": "INTRODUCTION TO FINANCE"
        }
    },
    {
        "data": {
            "source": "GENBUS 110",
            "target": "GENBUS 360"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON 101"
        }
    },
    {
        "data": {
            "id": "GENBUS",
            "type": "compound"
        }
    }
]