[
    {
        "data": {
            "description": "A compact primer in statistics as a foundation for data-driven business analysis. A selection of concepts include probability, estimation, inference, correlation, and regression.",
            "id": "GENBUS 881",
            "parent": "GENBUS",
            "title": "BUSINESS STATISTICS USING PYTHON"
        }
    },
    {
        "data": {
            "description": "An introduction to machine learning models for business applications. Builds on the predictive modeling basics by developing general algorithmic prediction models for supervised machine learning. Covers additive models, CARTs, bagging/boosting, and basic deep learning approaches. Discussion of unsupervised learning techniques, including clustering and dimensionality reduction approaches.",
            "id": "GENBUS 888",
            "parent": "GENBUS",
            "title": "APPLIED MACHINE LEARNING FOR BUSINESS ANALYTICS"
        }
    },
    {
        "data": {
            "description": "An introduction to predictive modeling for business applications beginning with some of the foundations, including a primer in matrix algebra and numerical optimization. Leads to development of linear regression and classification models, and discussion of building models for prediction. Topics include selection, regularization, and the bias-variance tradeoff.",
            "id": "GENBUS 886",
            "parent": "GENBUS",
            "title": "FOUNDATIONS OF PREDICTIVE MODELING FOR BUSINESS ANALYTICS"
        }
    },
    {
        "data": {
            "description": "An introduction to text mining and generation for business applications. Includes an overview of text data and approaches for making text data useful for descriptive and predictive analytics. Also, includes key applications of natural language processing, such as chatbots and recommender systems.",
            "id": "GENBUS 891",
            "parent": "GENBUS",
            "title": "TEXT MINING AND GENERATION FOR BUSINESS ANALYTICS"
        }
    },
    {
        "data": {
            "description": "Introduce students to principles of data visualization and provide hands-on experience using data visualization tools and techniques for business applications. Develop proficiency in current visualization software tools, and leverage these tools for data exploration, insight into decision-making, and data presentation. Recommended for students to have general computing skills and familiarity with MS Word, MS Excel and MS PowerPoint; introductory-level exposure to coding in any language; some R experience; basic statistical literacy, equivalent to at least one semester of statistics.",
            "id": "GENBUS 720",
            "parent": "GENBUS",
            "title": "DATA VISUALIZATION FOR BUSINESS ANALYTICS"
        }
    },
    {
        "data": {
            "description": "Provides an overview of cloud services that support business analytics. Load and analyze data, build and deploy machine learning models, and develop data pipelines through hands-on, in-class activities working in cloud environments.",
            "id": "GENBUS 780",
            "parent": "GENBUS",
            "title": "CLOUD TECHNOLOGY FOR BUSINESS ANALYTICS"
        }
    },
    {
        "data": {
            "description": "Provides experience in data visualization and cloud technologies to support business analytics.  Create and share compelling data visualizations to enhance decision making.  Use cloud technologies to build scalable data warehouses, analyze big data, and develop and deploy machine learning models.",
            "id": "GENBUS 883",
            "parent": "GENBUS",
            "title": "DATA VISUALIZATION & CLOUD TECHNOLOGIES"
        }
    },
    {
        "data": {
            "id": "GENBUS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "GENBUS 720",
            "target": "GENBUS 883"
        }
    },
    {
        "data": {
            "source": "GENBUS 780",
            "target": "GENBUS 883"
        }
    },
    {
        "data": {
            "source": "GENBUS 881",
            "target": "GENBUS 886"
        }
    },
    {
        "data": {
            "source": "GENBUS 883",
            "target": "GENBUS 891"
        }
    },
    {
        "data": {
            "source": "GENBUS 886",
            "target": "GENBUS 888"
        }
    },
    {
        "data": {
            "source": "GENBUS 888",
            "target": "GENBUS 891"
        }
    }
]