[
    {
        "data": {
            "description": "Build fundamental skills and processes to develop a strong foundation in business analysis utilizing Excel. Learn the fundamentals of data construction, manipulation, summarization, analysis and presentation.",
            "id": "GENBUS 106",
            "parent": "GENBUS",
            "title": "FOUNDATIONAL SKILLS FOR BUSINESS ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Enables you to understand and apply useful approaches to analyzing and presenting data to support business decision making. Emphasis on applications of predictive and prescriptive analytics. Predictive approaches use historical data to infer relationships and forecast future outcomes. Prescriptive methods formulate decision models to identify choices that are optimal with respect to a desired, measurable outcome. Provides experience integrating diverse data sources, modelling uncertainty, and visualizing key insights.",
            "id": "GENBUS 207",
            "parent": "GENBUS",
            "title": "INTERMEDIATE DATA ANALYSIS FOR BUSINESS"
        }
    },
    {
        "data": {
            "description": "Learn basic business statistical skills to comprehend business reports, and to calculate statistical findings from business data using Excel. Understand simple probability calculations and how to apply probability to specific business uncertainties. Build capability to use simple statistical models and tests to estimate business variables of interest, and learn about predictive relationships between variables. Become comfortable using Excel for data manipulation, data analytics, and data visualization. Apply statistical analysis to address business issues.",
            "id": "GENBUS 206",
            "parent": "GENBUS",
            "title": "BEGINNING DATA ANALYSIS FOR BUSINESS"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "id": "GENBUS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "GENBUS 106",
            "target": "GENBUS 206"
        }
    },
    {
        "data": {
            "source": "GENBUS 206",
            "target": "GENBUS 207"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "GENBUS 206"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    }
]