[
    {
        "data": {
            "description": "Elements of probability, important discrete distributions, acceptance sampling by attributes, sample characteristics, probability distributions and population characteristics, the normal distribution, acceptance sampling plans based on sample means and variances, sampling from the normal, the central limit theorem, point and interval estimation.",
            "id": "STAT 311",
            "parent": "STAT",
            "title": "INTRODUCTION TO THEORY AND METHODS OF MATHEMATICAL STATISTICS I"
        }
    },
    {
        "data": {
            "description": "Probability and combinatorial methods, discrete and continuous, univariate and multivariate distributions, expected values, moments, normal distribution and derived distributions, estimation.",
            "id": "MATH/STAT 309",
            "title": "INTRODUCTION TO PROBABILITY AND MATHEMATICAL STATISTICS I"
        }
    },
    {
        "data": {
            "description": "Statistical inference and analyses based on models will be introduced and applied in a business context using a calculus-based focus. Topics covered include point estimation, confidence intervals, hypothesis testing, regression models, and time series models. Various methods for fitting a model to data will be explored, and uncertainty about parameter estimates will be quantified so decision makers have information about the quality of the estimates. Regression and time series models are commonly used in business analytics applications and will be used to analyze business data and make inferences and predictions.",
            "id": "GENBUS 317",
            "parent": "GENBUS",
            "title": "MATHEMATICAL FOUNDATIONS OF BUSINESS ANALYTICS"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "GENBUS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "STAT",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "MATH/STAT 309",
            "target": "GENBUS 317"
        }
    },
    {
        "data": {
            "source": "MATH/STAT 309",
            "target": "STAT 311"
        }
    },
    {
        "data": {
            "source": "STAT 311",
            "target": "MATH/STAT 309"
        }
    }
]