[
    {
        "data": {
            "id": "BIOCORE",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Study the physiology of and consider how plants and animals interact with their environments to survive, obtain nutrients, exchange gases, and reproduce, also how the complex systems of neural and endocrine regulation in animals and hormonal and environmental regulation in plants allow cells and organs to communicate.",
            "id": "BIOCORE 485",
            "parent": "BIOCORE",
            "title": "PRINCIPLES OF PHYSIOLOGY"
        }
    },
    {
        "data": {
            "source": "BIOCORE 383",
            "target": "BIOCORE 485"
        }
    },
    {
        "data": {
            "description": "The basic principles of genomics, proteomics and bioinformatics will be taught through a semester-long project of the students choosing. Creative problem solving in science skills will be learned through a variety of active-learning techniques that include: reading of primary literature, group presentations, peer review, bioinformatic lab exercises, science communication skills (writing  visualization), and creating a website. Emphasis will be placed upon how to effectively communicate science (written, oral and written). Topics include: genomic sequencing, phylogeny, domain analysis, transcriptomics, CRISPR screens, chemical genomics, quantitative proteomics and protein networks. Capstone course.",
            "id": "GENETICS 564",
            "parent": "GENETICS",
            "title": "GENOMICS AND PROTEOMICS"
        }
    },
    {
        "data": {
            "description": "A capstone course to build on and integrate the knowledge and skills gained in previous Biocore coursework through readings and analysis of primary scientific literature. Work in small groups to analyze current and emerging topics through the lens of scientific research. Topics include signaling pathways, systems biology, genetic disease, and cancer.",
            "id": "BIOCORE 587",
            "parent": "BIOCORE",
            "title": "BIOLOGICAL INTERACTIONS"
        }
    },
    {
        "data": {
            "source": "BIOCORE 485",
            "target": "BIOCORE 587"
        }
    },
    {
        "data": {
            "description": "Cellular and molecular basis of life. The main themes are the structure and function of cells and organelles, the flow of energy in cells, and the storage, expression, and regulation of genetic information.",
            "id": "BIOCORE 383",
            "parent": "BIOCORE",
            "title": "CELLULAR BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Basic principles of ecology and interrelations between individuals, populations, communities, ecosystems and their environment; transmission genetics and introduction to population genetics; origin of life, evolutionary mechanisms, ancestral relationships among species, and the diversity of life.",
            "id": "BIOCORE 381",
            "parent": "BIOCORE",
            "title": "EVOLUTION, ECOLOGY, AND GENETICS"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "BIOCORE 383"
        }
    },
    {
        "data": {
            "source": "BIOCORE 587",
            "target": "GENETICS 564"
        }
    },
    {
        "data": {
            "id": "GENETICS",
            "type": "compound"
        }
    }
]