[
    {
        "data": {
            "description": "Basic principles of ecology and interrelations between individuals, populations, communities, ecosystems and their environment; transmission genetics and introduction to population genetics; origin of life, evolutionary mechanisms, ancestral relationships among species, and the diversity of life.",
            "id": "BIOCORE 381",
            "parent": "BIOCORE",
            "title": "EVOLUTION, ECOLOGY, AND GENETICS"
        }
    },
    {
        "data": {
            "description": "Explores a detailed atomic and molecular view of matter and its interactions, with a specific focus on quantum theory, molecular structure, and chemical bonding. Application required for enrollment.",
            "id": "CHEM 115",
            "parent": "CHEM",
            "title": "CHEMICAL PRINCIPLES I"
        }
    },
    {
        "data": {
            "description": "Genetics in eukaryotes and prokaryotes.  Includes transmission genetics, molecular genetics, evolutionary genetics, genetic engineering, and societal issues associated with genetics.  Illustrative material includes bacteria, plants, insects, and vertebrates.",
            "id": "GENETICS 466",
            "parent": "GENETICS",
            "title": "PRINCIPLES OF GENETICS"
        }
    },
    {
        "data": {
            "description": "Human-induced factors such as changes in land use and global climate are causing rapid worldwide biodiversity loss. Can modern molecular genetics contribute to species preservation? In this course, we will first explore the challenges and potential of molecular genetic methods based on biobanking, gene editing and nuclear transfer for animal biodiversity preservation. Topics covered will include: i) maternal factors and early animal development, ii) interspecies somatic cell nuclear transfer (isSCNT) and oocyte-mediated reprogramming in animal cloning, iii) developmental, phylogenetic and ecological considerations for biobanking, iv) gene editing and synthetic biology as potential tools to recapture biodiversity. Use knowledge in animal population status, developmental genetics and phylogeny to address real-life problems involving the conservation of threatened animal populations.",
            "id": "GENETICS 527",
            "parent": "GENETICS",
            "title": "DEVELOPMENTAL GENETICS FOR CONSERVATION AND REGENERATION"
        }
    },
    {
        "data": {
            "id": "BIOCORE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "GENETICS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "GENETICS 466"
        }
    },
    {
        "data": {
            "source": "CHEM 115",
            "target": "GENETICS 466"
        }
    },
    {
        "data": {
            "source": "GENETICS 466",
            "target": "GENETICS 527"
        }
    }
]