[
    {
        "data": {
            "description": "Introductory course in epigenetics - the layer of chemical information that sits on top of the genome - that switch genes 'on' or 'off'. Will introduce how the epigenome, in collaboration with the genome, controls versatile biological processes and cell fates. Will also cover the latest advances of how humans can control their own epigenetic destiny by lifestyle, diet, and other environmental factors.",
            "id": "GENETICS 525",
            "parent": "GENETICS",
            "title": "EPIGENETICS"
        }
    },
    {
        "data": {
            "description": "Basic principles of ecology and interrelations between individuals, populations, communities, ecosystems and their environment; transmission genetics and introduction to population genetics; origin of life, evolutionary mechanisms, ancestral relationships among species, and the diversity of life.",
            "id": "BIOCORE 381",
            "parent": "BIOCORE",
            "title": "EVOLUTION, ECOLOGY, AND GENETICS"
        }
    },
    {
        "data": {
            "description": "Explores a detailed atomic and molecular view of matter and its interactions, with a specific focus on quantum theory, molecular structure, and chemical bonding. Application required for enrollment.",
            "id": "CHEM 115",
            "parent": "CHEM",
            "title": "CHEMICAL PRINCIPLES I"
        }
    },
    {
        "data": {
            "description": "Genetics in eukaryotes and prokaryotes.  Includes transmission genetics, molecular genetics, evolutionary genetics, genetic engineering, and societal issues associated with genetics.  Illustrative material includes bacteria, plants, insects, and vertebrates.",
            "id": "GENETICS 466",
            "parent": "GENETICS",
            "title": "PRINCIPLES OF GENETICS"
        }
    },
    {
        "data": {
            "id": "BIOCORE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "GENETICS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "GENETICS 466"
        }
    },
    {
        "data": {
            "source": "CHEM 115",
            "target": "GENETICS 466"
        }
    },
    {
        "data": {
            "source": "GENETICS 466",
            "target": "GENETICS 525"
        }
    }
]