[
    {
        "data": {
            "description": "Design, implementation and use of automated procedures for storage, analysis and display of spatial information. Covers data bases, information manipulation and display techniques, software systems and management issues. Case studies.",
            "id": "CIVENGR/ENVIRST/GEOG 377",
            "title": "AN INTRODUCTION TO GEOGRAPHIC INFORMATION SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Introduces the basic concepts, techniques and methodologies for designing and implementing a spatial database to prepare for professional work as a GIS designer, analyst, specialist or researcher. Design conceptual spatial database models and  implement them within specific spatial data management systems (DBMS). Covers basic SQL database language and the latest developments in database systems (e.g. NoSQL database) for managing and mining spatial big data such as social media datasets and GPS trajectories.",
            "id": "GEOG 574",
            "parent": "GEOG",
            "title": "GEOSPATIAL DATABASE DESIGN AND DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Introduction to the collection, representation and use of geospatial data.  Introduction to geospatial technologies like GPS, Google Earth, satellite imagery, and GIS, and provides a critical understanding of the strengths and limitations of spatial representations (e.g., maps, images).",
            "id": "GEOG 170",
            "parent": "GEOG",
            "title": "OUR DIGITAL GLOBE: AN OVERVIEW OF GISCIENCE AND ITS TECHNOLOGY"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "GEOG",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "CIVENGR/ENVIRST/GEOG 377",
            "target": "GEOG 574"
        }
    },
    {
        "data": {
            "source": "GEOG 170",
            "target": "GEOG 574"
        }
    }
]