[
    {
        "data": {
            "description": "Introduction to how the Earth system works and what makes Earth livable. Gain appreciation for how the atmosphere, oceans, life, and earth's surface interact to shape our local, regional and global landscapes.",
            "id": "ENVIRST/GEOG 120",
            "title": "INTRODUCTION TO THE EARTH SYSTEM"
        }
    },
    {
        "data": {
            "description": "Takes an earth systems approach to explore the role of human societies in shaping earth surface processes from local to global scales. We address how alterations to our landscapes and waterways affect biological, physical and chemical interactions among our biosphere, geosphere, hydrosphere and atmosphere. We discuss methods used to distinguish the \"human impact\" from background variability.",
            "id": "GEOG/SOILSCI 526",
            "title": "HUMAN TRANSFORMATIONS OF EARTH SURFACE PROCESSES"
        }
    },
    {
        "data": {
            "source": "ENVIRST/GEOG 120",
            "target": "GEOG/SOILSCI 526"
        }
    },
    {
        "data": {
            "source": "ENVIRST/GEOG 120",
            "target": "ENVIRST/GEOG 127"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ENVIRST/GEOG 127",
            "target": "ENVIRST/GEOG 120"
        }
    },
    {
        "data": {
            "description": "An introduction to natural environmental systems, emphasizing the interconnections between the systems of the solid earth (minerals, rocks, soils), the hydrosphere (water in all its forms), the biosphere, and the atmosphere. Emphasizes connections between basic concepts and specific environmental issues through hands-on case studies, lab projects, and field trips to collect samples and observations for lab projects.",
            "id": "ENVIRST/GEOG 127",
            "title": "PHYSICAL SYSTEMS OF THE ENVIRONMENT"
        }
    }
]