[
    {
        "data": {
            "description": "Design, implementation and use of automated procedures for storage, analysis and display of spatial information. Covers data bases, information manipulation and display techniques, software systems and management issues. Case studies.",
            "id": "CIVENGR/ENVIRST/GEOG 377",
            "title": "AN INTRODUCTION TO GEOGRAPHIC INFORMATION SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Geospatial big data is an extension of big data with an emphasis on the geospatial component. It is used to describe large volumes of georeferenced data about various aspects of the environment and society captured by millions of environmental and human sensors. An introduction to the theory, techniques, and analytical methods for geospatial big data. Methods for storing, processing, analyzing, and visualizing various types of geospatial big data using advanced Python programming will be introduced. Designed for students who have programming experience and want to reinforce their programming skills and learn AI and machine learning methods for solving geospatial big data problems.",
            "id": "GEOG 573",
            "parent": "GEOG",
            "title": "ADVANCED GEOCOMPUTING AND GEOSPATIAL BIG DATA ANALYTICS"
        }
    },
    {
        "data": {
            "description": "Introduction to Data Science programming using Python.  No previous programming experience required.  Emphasis on analyzing real datasets in a variety of forms and visual communication.",
            "id": "COMPSCI 220",
            "parent": "COMPSCI",
            "title": "DATA SCIENCE PROGRAMMING I"
        }
    },
    {
        "data": {
            "description": "Introduction to scripting for Geographic Information Science. Geoprocessing with open-source GIS utilities. Python scripting with ArcGIS and open-source libraries.",
            "id": "GEOG 378",
            "parent": "GEOG",
            "title": "INTRODUCTION TO GEOCOMPUTING"
        }
    },
    {
        "data": {
            "id": "COMPSCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "GEOG",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "CIVENGR/ENVIRST/GEOG 377",
            "target": "GEOG 378"
        }
    },
    {
        "data": {
            "source": "COMPSCI 220",
            "target": "GEOG 573"
        }
    },
    {
        "data": {
            "source": "GEOG 378",
            "target": "GEOG 573"
        }
    }
]