[
    {
        "data": {
            "source": "GEOG 170",
            "target": "GEOG 576"
        }
    },
    {
        "data": {
            "source": "GEOG 378",
            "target": "GEOG 576"
        }
    },
    {
        "data": {
            "source": "GEOG 579",
            "target": "GEOG 777"
        }
    },
    {
        "data": {
            "description": "Principles and algorithms for spatial analysis in geographic imformation systems. A theoretical and practical examination of analytical methods used in GIS, including point, line and polygon processing, interpolation, smoothing, spatial overlay and query, network analysis, terrain analysis, and classification.",
            "id": "GEOG 579",
            "parent": "GEOG",
            "title": "GIS AND SPATIAL ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Design, implementation and use of automated procedures for storage, analysis and display of spatial information. Covers data bases, information manipulation and display techniques, software systems and management issues. Case studies.",
            "id": "CIVENGR/ENVIRST/GEOG 377",
            "title": "AN INTRODUCTION TO GEOGRAPHIC INFORMATION SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Introduces the basic concepts, techniques and methodologies for designing and implementing a spatial database to prepare for professional work as a GIS designer, analyst, specialist or researcher. Design conceptual spatial database models and  implement them within specific spatial data management systems (DBMS). Covers basic SQL database language and the latest developments in database systems (e.g. NoSQL database) for managing and mining spatial big data such as social media datasets and GPS trajectories.",
            "id": "GEOG 574",
            "parent": "GEOG",
            "title": "GEOSPATIAL DATABASE DESIGN AND DEVELOPMENT"
        }
    },
    {
        "data": {
            "source": "CIVENGR/ENVIRST/GEOG 377",
            "target": "GEOG 574"
        }
    },
    {
        "data": {
            "description": "Introduction to the collection, representation and use of geospatial data.  Introduction to geospatial technologies like GPS, Google Earth, satellite imagery, and GIS, and provides a critical understanding of the strengths and limitations of spatial representations (e.g., maps, images).",
            "id": "GEOG 170",
            "parent": "GEOG",
            "title": "OUR DIGITAL GLOBE: AN OVERVIEW OF GISCIENCE AND ITS TECHNOLOGY"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Introduction to scripting for Geographic Information Science. Geoprocessing with open-source GIS utilities. Python scripting with ArcGIS and open-source libraries.",
            "id": "GEOG 378",
            "parent": "GEOG",
            "title": "INTRODUCTION TO GEOCOMPUTING"
        }
    },
    {
        "data": {
            "source": "GEOG 170",
            "target": "GEOG 574"
        }
    },
    {
        "data": {
            "id": "GEOG",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Covers practical and challenging cases in GIS which require programming and other GIS development skills (such as geospatial algorithm development and implementation). Cases cover the wide spectrum of GIS development projects in the GIS professions ranging from GIS data management, advanced spatial analysis, spatial database development and web/mobile programming, to cartography/geovisualization. Focuses on integration of skills from other courses into a GIS development project.",
            "id": "GEOG 777",
            "parent": "GEOG",
            "title": "CAPSTONE IN GIS DEVELOPMENT"
        }
    },
    {
        "data": {
            "source": "CIVENGR/ENVIRST/GEOG 377",
            "target": "GEOG 579"
        }
    },
    {
        "data": {
            "source": "CIVENGR/ENVIRST/GEOG 377",
            "target": "GEOG 576"
        }
    },
    {
        "data": {
            "source": "CIVENGR/ENVIRST/GEOG 377",
            "target": "GEOG 378"
        }
    },
    {
        "data": {
            "source": "GEOG 574",
            "target": "GEOG 777"
        }
    },
    {
        "data": {
            "source": "GEOG 576",
            "target": "GEOG 777"
        }
    },
    {
        "data": {
            "description": "Covers the programming concepts and skills for understanding construction and implementation of high quality spatial web portal and mobile Apps to support geospatial data access, analysis, sharing, and synthesis over the internet. Builds on basic programming experience.",
            "id": "GEOG 576",
            "parent": "GEOG",
            "title": "GEOSPATIAL WEB AND MOBILE PROGRAMMING"
        }
    }
]