[
    {
        "data": {
            "description": "Continues the study of the Kazakh language with an emphasis on four language skills: listening, reading, writing, and speaking in order to develop proficiency at the intermediate level. The primary goal is to improve communication in Kazakh. Instruction will emphasize the language that is relevant to situations that students are likely to encounter if they travel to or live in Kazakhstan. The secondary goal of the course is to improve students' understanding of Kazakh society and culture.",
            "id": "GNS 431",
            "parent": "GNS",
            "title": "THIRD SEMESTER KAZAKH"
        }
    },
    {
        "data": {
            "description": "Building on skills learned in first semester Kazakh, learn to communicate in more extended situations. Information on holidays, traditions and colloquial phrases will be introduced. Pays special attention to reading and writing and to vocabulary expansion.",
            "id": "GNS 332",
            "parent": "GNS",
            "title": "SECOND SEMESTER KAZAKH"
        }
    },
    {
        "data": {
            "description": "Continue to learn more about the Kazakh language through history, literature and art, in order to better understand its cultural codes.",
            "id": "GNS 432",
            "parent": "GNS",
            "title": "FOURTH SEMESTER KAZAKH"
        }
    },
    {
        "data": {
            "description": "Enhance speaking, listening, writing and reading skills. Build confidence in speaking about issues related to daily life.",
            "id": "GNS 531",
            "parent": "GNS",
            "title": "FIFTH SEMESTER KAZAKH"
        }
    },
    {
        "data": {
            "description": "Provides an introduction to the Kazakh language, which is a Turkic language spoken by about 11 million people in Kazakhstan, China, Mongolia, Turkey, Uzbekistan, Tajikistan, Turkmenistan, Russia, and Iran. Work within four language skills: listening, reading, writing, and speaking. Learn to communicate in Kazakh in authentic situations. Kazakh will be used as the primary language in classroom instructions, with minimal use of English for explanations of grammar.",
            "id": "GNS 331",
            "parent": "GNS",
            "title": "FIRST SEMESTER KAZAKH"
        }
    },
    {
        "data": {
            "id": "GNS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "GNS 331",
            "target": "GNS 332"
        }
    },
    {
        "data": {
            "source": "GNS 332",
            "target": "GNS 431"
        }
    },
    {
        "data": {
            "source": "GNS 431",
            "target": "GNS 432"
        }
    },
    {
        "data": {
            "source": "GNS 432",
            "target": "GNS 531"
        }
    }
]