[
    {
        "data": {
            "source": "GNS 329",
            "target": "GNS 429"
        }
    },
    {
        "data": {
            "source": "GNS 340",
            "target": "GNS 429"
        }
    },
    {
        "data": {
            "id": "GNS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "GNS 339",
            "target": "GNS 340"
        }
    },
    {
        "data": {
            "description": "Continues the study of the Turkish language with an emphasis on four language skills: listening, reading, writing, and speaking in order to develop proficiency at the intermediate level. Improve communication in Turkish. Instruction will emphasize the language that is relevant to situations that students are likely to encounter if they travel to or live in Turkey. The secondary goal of the course is to improve students' understanding of Turkish  society and culture. Students  are deeply engaged in Turkish culture through history, literature, art and politics.",
            "id": "GNS 429",
            "parent": "GNS",
            "title": "INTERMEDIATE SUMMER IMMERSION TURKISH"
        }
    },
    {
        "data": {
            "description": "Provides students with an introduction to the Turkish language, which is  spoken by more than 80 million people in Turkey and Europe. Work within four language skills: listening, reading, writing, and speaking. Provides to communicate in more extended situations in Turkish. Information on holidays, traditions and colloquial phrases will be introduced. Besides everyday Turkish, learn written Turkish such as formal letters, orders and messages. Pays special attention to reading and writing and to vocabulary expansion.",
            "id": "GNS 329",
            "parent": "GNS",
            "title": "ELEMENTARY SUMMER IMMERSION TURKISH"
        }
    },
    {
        "data": {
            "description": "Building on skills learned in first semester Turkish, learn to communicate in more extended situations. Information on holidays, traditions and colloquial phrases will be introduced. Besides everyday Turkish, learn written Turkish such as formal letters, orders and messages. Pays special attention to reading and writing and to vocabulary expansion.",
            "id": "GNS 340",
            "parent": "GNS",
            "title": "SECOND SEMESTER TURKISH"
        }
    },
    {
        "data": {
            "description": "Provides an introduction to the Turkish language, which is spoken by more than 80 million people in Turkey and Europe. Work within four language skills: listening, reading, writing, and speaking. Learn to communicate in Turkish in authentic situations. Turkish will be used as the primary language in classroom instructions, with minimal use of English.",
            "id": "GNS 339",
            "parent": "GNS",
            "title": "FIRST SEMESTER TURKISH"
        }
    }
]