[
    {
        "data": {
            "description": "Conduct original historical research and convey the results to others. Through engagement with archival materials, become historical detectives; practice defining important historical questions, collecting and analyzing evidence, presenting original conclusions, and contributing to ongoing discussions. Confer individually with and receive feedback from instructors to improve skills of historical analysis and communication in both written and spoken formats. May not be repeated for credit.",
            "id": "HISTORY 201",
            "parent": "HISTORY",
            "title": "THE HISTORIAN'S CRAFT"
        }
    },
    {
        "data": {
            "description": "Conduct original historical research in the fields of history of science, medicine, or technology and convey the results to others. Become historical detectives through engagement with archival materials and disciplinary methodologies in the histories of science, medicine and technology; practice defining important historical questions, collecting and analyzing evidence, presenting original conclusions, and contributing to ongoing discussions. Confer individually with and receive feedback from instructors to improve skills of historical analysis and communication in written and other formats. May not be repeated for credit.",
            "id": "HISTSCI 211",
            "parent": "HISTSCI",
            "title": "THE HISTORIAN'S CRAFT: SCIENCE, MEDICINE, AND TECHNOLOGY"
        }
    },
    {
        "data": {
            "description": "Introduction to the practice of public history. Public historians ground their work in rigorous, academic research with the goal of presenting history in a collaborative and publicly focused manner. These projects come in many forms including exhibits, walking tours, podcasts, documentaries, web projects, and place-based interpretation, to name a few. Learn how academic history gets presented to the public, not only by reading about public history, but by doing it.",
            "id": "HISTORY 401",
            "parent": "HISTORY",
            "title": "PUBLIC HISTORY WORKSHOP"
        }
    },
    {
        "data": {
            "id": "HISTORY",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "HISTSCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "HISTORY 201",
            "target": "HISTORY 401"
        }
    },
    {
        "data": {
            "source": "HISTORY 201",
            "target": "HISTSCI 211"
        }
    },
    {
        "data": {
            "source": "HISTSCI 211",
            "target": "HISTORY 201"
        }
    }
]