[
    {
        "data": {
            "id": "HORT",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "This international field study will meet during the winter intercession in a tropical country in Central America. Reflect on the role of plants in our daily lives and the effects that our daily choices have on the environment, human health, conflicts, poverty, and development. Provides an opportunity to develop a holistic appreciation of horticulture by highlighting the interactions between plants and society. Discuss some of the social, scientific and environmental challenges that conventional, sustainable and organic horticulture practices face in the production, marketing, and use of tropical crops. The field study will provide an opportunity to contextualize what was learned during \"Tropical Horticultural Systems\" (HORT/​AGRONOMY  376). Visit diverse agricultural systems, such as small farms, large-scale operations, market growers, and industrial export businesses. In addition, we will visit agronomic centers, botanical gardens, herbaria, germplasm banks, and nature preserves.",
            "id": "HORT 378",
            "parent": "HORT",
            "title": "TROPICAL HORTICULTURAL SYSTEMS INTERNATIONAL FIELD STUDY"
        }
    },
    {
        "data": {
            "description": "Highlights the connections between tropical plants and society. Topics include multidisciplinary reflections on the biology of tropical plants, as well as an overview of different production systems and some of the social and environmental problems associated with the utilization of tropical plants in the context of local and global markets. Provides the opportunity to demonstrate comparative skills with respect to local and international challenges posed by the topics we address in class. Illustrates connections between horticulture and conservation, food security, nutrition, and global health.",
            "id": "AGRONOMY/HORT 376",
            "title": "TROPICAL HORTICULTURAL SYSTEMS"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "AGRONOMY/HORT 376",
            "target": "HORT 378"
        }
    }
]