[
    {
        "data": {
            "description": "Discusses the fundamentals of public service and civic engagement in the STEM (science, technology, engineering, and math) disciplines grounded in evidence-based knowledge and research.  Provides an overview of the core pathways of public service, the knowledge required to effectively initiate and cultivate community partnerships, and the skills necessary to reflect upon personal experiences with community engagement activities.  Fosters understanding of the broader impacts in STEM fields and prepares students to begin specializing in a specific pathway and develop relationships with a community partner.",
            "id": "INTEGSCI 640",
            "parent": "INTEGSCI",
            "title": "PUBLIC SERVICE IN STEM"
        }
    },
    {
        "data": {
            "description": "Develops community-engagement in STEM (science, technology, engineering, and math) through a mentored public service experience. Provides opportunities to refine and implement skills necessary to work with a community partner to implement and evaluate a project that is mutually beneficial in process and product.  Places emphasis on professional development within a selected pathway (direct service, community engaged teaching, policy and governance, or social entrepreneurship/corporate social responsibility). Includes time to meet within specialized pathways and as a full cohort throughout the implementation of the practicum experience.",
            "id": "INTEGSCI 840",
            "parent": "INTEGSCI",
            "title": "MENTORED PRACTICUM IN STEM PUBLIC SERVICE"
        }
    },
    {
        "data": {
            "source": "INTEGSCI 640",
            "target": "INTEGSCI 740"
        }
    },
    {
        "data": {
            "source": "INTEGSCI 740",
            "target": "INTEGSCI 840"
        }
    },
    {
        "data": {
            "id": "INTEGSCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Provides opportunities for practical application of public service knowledge. Discusses development of a workplan for long-term projects, provides strategies to initiate community partnerships, and fosters development of materials for use in a community-based practicum.  Includes time to work intensively on acquiring pathway-specific knowledge and skills and opportunities to practice, problem-solve, and support cohort members within and across public service pathways.",
            "id": "INTEGSCI 740",
            "parent": "INTEGSCI",
            "title": "COMMUNITY RELATIONSHIPS AND MATERIALS DEVELOPMENT IN STEM PUBLIC SERVICE"
        }
    }
]