[
    {
        "data": {
            "description": "Applies communication skills and social awareness issues in ways that enable students to work with increasing levels of independence in building and maintaining community relationships compared toINTEGSCI 240. Includes a lab section applied to lecture experiences to prepare for work with children in elementary after-school science clubs and to focus on different styles of communication. The multi-disciplinary focus of the after-school lessons develops connections between students' field of study and others within STEM. In the service learning component, students apply academic knowledge through science education and outreach experiences in a community-focused and culturally sensitive way. Students work with underrepresented students in the Madison metropolitan area in elementary after-school science clubs, and are expected to critically reflect on the ties between their academic and community partnerships, and differences between campus and community culture.",
            "id": "INTEGSCI 340",
            "parent": "INTEGSCI",
            "title": "SERVICE WITH YOUTH IN STEM II"
        }
    },
    {
        "data": {
            "description": "Apply communication, cultural competency, and leadership skills to work with community partners in a service learning practicum. Work with underrepresented students in the Madison metropolitan area in elementary after-school science clubs, and critically reflect on the ties between their academic and community partnerships, and differences between campus and community culture. Work with different community partners than they did in previous Service with Youth in STEM courses. This practicum combines the service experience with an in-class component to prepare to provide opportunities to critically reflect upon the ties between academic preparation and community partnerships, and on their experiences in varied community settings.",
            "id": "INTEGSCI 341",
            "parent": "INTEGSCI",
            "title": "SERVICE WITH YOUTH IN STEM PRACTICUM"
        }
    },
    {
        "data": {
            "description": "Teaches students about community engagement experiences, focusing on building community partnerships, understanding organizational missions and community needs, assessment of informal science outreach experiences, and issues related to scientific literacy and access to science.",
            "id": "INTEGSCI 240",
            "parent": "INTEGSCI",
            "title": "SERVICE WITH YOUTH IN STEM"
        }
    },
    {
        "data": {
            "id": "INTEGSCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "INTEGSCI 240",
            "target": "INTEGSCI 340"
        }
    },
    {
        "data": {
            "source": "INTEGSCI 340",
            "target": "INTEGSCI 341"
        }
    }
]