[
    {
        "data": {
            "id": "POLISCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "INTLST",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "INTLST 101",
            "target": "INTLST/POLISCI 325"
        }
    },
    {
        "data": {
            "source": "POLISCI 120",
            "target": "POLISCI 182"
        }
    },
    {
        "data": {
            "description": "Covers the major issues in international relations since the end of World War II including: the causes of war; civil wars and ethnic conflict; economic development; international trade; exchange rates and international monetary relations; international capital flows and financial crises; foreign direct investment; globalization and the environment; the UN, the IMF, World Bank, WTO, and other international organizations; and international law and human rights. The focus is on states' relations with each other and the factors determining the nature and outcomes of these international interactions. The course seeks to develop analytical tools for thinking about important questions in world politics regardless of the countries or issues involved, to examine international affairs in a systematic way. Students who have taken POLI SCI 103 prior to Fall 2017 may not enroll in this course.",
            "id": "POLISCI 140",
            "parent": "POLISCI",
            "title": "INTRODUCTION TO INTERNATIONAL RELATIONS"
        }
    },
    {
        "data": {
            "source": "POLISCI 182",
            "target": "POLISCI 120"
        }
    },
    {
        "data": {
            "description": "Introduces the field of international studies, and performs an interdisciplinary examination of the cultural, political, economic, and social patterns that have defined the modern world.",
            "id": "INTLST 101",
            "parent": "INTLST",
            "title": "INTRODUCTION TO INTERNATIONAL STUDIES"
        }
    },
    {
        "data": {
            "source": "POLISCI 120",
            "target": "INTLST/POLISCI 325"
        }
    },
    {
        "data": {
            "source": "POLISCI 140",
            "target": "INTLST/POLISCI 325"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "An introduction to the major empirical and theoretical themes in the study of social movements and politics in Latin America. While it is impossible to cover every theoretical approach or Latin American case during the semester, the course should give students the tools to begin to think critically about where and why people engage in collective action. We will develop and hone these tools through thinking about Latin American cases, paying specific attention to revolutions, social movements, and riots. The course is designed in three parts. It begins by exposing students to the dominant theoretical paradigms in the study of contentious politics as well as some prominent critiques. The course then turns to empirical themes in Latin American revolutions, challenging students to use and question the theoretical tools to which they have already been exposed. The final part of the course looks to social movements in Latin America. Cases will focus on challenges to dictatorships, identity-based movements, and resistance to globalization.",
            "id": "INTLST/POLISCI 325",
            "title": "SOCIAL MOVEMENTS AND REVOLUTIONS IN LATIN AMERICA"
        }
    },
    {
        "data": {
            "description": "Introduction to Comparative Politics, one of the four sub-fields in Political Science, which involves the comparative analysis of political institutions, processes, and outcomes at the national level. Examines how to usefully compare politics in a variety of countries and makes comparisons explicit and systematic in order to determine how governments work, how power is organized and contested at the national level, and how regular people can participate and pursue their interests in different political settings. Includes key concepts, theories, methods, issues, and language.",
            "id": "POLISCI 120",
            "parent": "POLISCI",
            "title": "INTRODUCTION TO COMPARATIVE POLITICS"
        }
    },
    {
        "data": {
            "description": "Introduction to Comparative Politics, one of the four sub-fields in Political Science, which involves the comparative analysis of political institutions, processes, and outcomes at the national level. Examines how to usefully compare politics in a variety of countries and makes comparisons explicit and systematic in order to determine how governments work, how power is organized and contested at the national level, and how people can participate and pursue their interests in different political settings. Includes key concepts, theories, methods, and country case studies.",
            "id": "POLISCI 182",
            "parent": "POLISCI",
            "title": "INTRODUCTION TO COMPARATIVE POLITICS (HONORS)"
        }
    }
]