[
    {
        "data": {
            "source": "STAT 371",
            "target": "STAT 324"
        }
    },
    {
        "data": {
            "source": "ISYE 210",
            "target": "ISYE 350"
        }
    },
    {
        "data": {
            "description": "Introduction to the tools needed for advanced design courses through experiential learning and hands-on opportunities to conduct experiments, take relevant measurements, analyze real-world data, design systems, and to make and test prototypes of designs.",
            "id": "ISYE 350",
            "parent": "ISYE",
            "title": "INDUSTRIAL ENGINEERING DESIGN I"
        }
    },
    {
        "data": {
            "description": "Conveys the importance of considering human capabilities and limits in system design and operation. This includes understanding human characteristics from the cognitive, physical, and psychosocial perspectives. Implications of these characteristics are explored through understanding the needs of people, designing to support these needs, and evaluating systems to ensure they serve the intended purpose. Case studies are used to identify the human role in accidents and to identify design improvements. Application domains include consumer product design, human-computer interaction, workplace safety, and complex systems such as healthcare delivery.",
            "id": "ISYE/PSYCH 349",
            "title": "INTRODUCTION TO HUMAN FACTORS"
        }
    },
    {
        "data": {
            "id": "PSYCH",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "STAT 324",
            "target": "ISYE 315"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "MATH 217"
        }
    },
    {
        "data": {
            "source": "ISYE/PSYCH 349",
            "target": "ISYE 450"
        }
    },
    {
        "data": {
            "source": "ISYE 210",
            "target": "ISYE/PSYCH 349"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Team-based project experience to address a real-world design challenge posed by an external organization. Collaboration with the project client to design a new system or process, or redesign an existing one, by integrating and applying appropriate Industrial and Systems Engineering knowledge, methodologies and tools for problem definition and analysis; idea generation; solution development, evaluation and justification; and implementation planning and impact assessment.",
            "id": "ISYE 450",
            "parent": "ISYE",
            "title": "INDUSTRIAL ENGINEERING DESIGN II"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 213"
        }
    },
    {
        "data": {
            "description": "Financial accounting principles and cost systems, interpretation and use of accounting reports and supplemental information for engineering economic analyses, consideration of cost-volume-profit analyses, use of discounted cash flow techniques, flexible budgeting, transfer pricing, and capital budgeting.",
            "id": "ISYE 313",
            "parent": "ISYE",
            "title": "ENGINEERING ECONOMIC ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Techniques and applications of control concepts in the design of inventory, production, quality, and project-planning systems; use of the computer as a component in such systems.",
            "id": "ISYE 315",
            "parent": "ISYE",
            "title": "PRODUCTION PLANNING AND CONTROL"
        }
    },
    {
        "data": {
            "source": "MATH 217",
            "target": "ISYE 313"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "description": "Introduction to basic probability and statistical tools and methods from an industrial application perspective. Random variables and probability distributions; descriptive statistics; point estimates. Perform hypothesis testing, construct confidence intervals, and understand design of experiments in the context of motivating case studies. Regression and correlation analysis. Focus on applying statistical methods and tools to solve engineering problems. Use of Microsoft Excel to interpret and analyze data.",
            "id": "ISYE 210",
            "parent": "ISYE",
            "title": "INTRODUCTION TO INDUSTRIAL STATISTICS"
        }
    },
    {
        "data": {
            "description": "First order differential equations, introduction to multivariable calculus and constrained optimization, infinite sequences and series, methods of approximation, and a brief introduction to probability. Models and applications from business and the social sciences.",
            "id": "MATH 213",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 2"
        }
    },
    {
        "data": {
            "description": "Introduction to modern statistical practice in the life sciences, using the R programming language. Topics include: exploratory data analysis, probability and random variables; one-sample testing and confidence intervals, role of assumptions, sample size determination, two-sample inference; basic ideas in experimental design, analysis of variance, linear regression, goodness-of fit; biological applications.",
            "id": "STAT 371",
            "parent": "STAT",
            "title": "INTRODUCTORY APPLIED STATISTICS FOR THE LIFE SCIENCES"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "ISYE 313"
        }
    },
    {
        "data": {
            "source": "ISYE 315",
            "target": "ISYE 350"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "ISYE 210"
        }
    },
    {
        "data": {
            "source": "ISYE 313",
            "target": "ISYE 450"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "PSYCH 210",
            "target": "ISYE/PSYCH 349"
        }
    },
    {
        "data": {
            "description": "Measures of central tendency, variability; probability, sampling distributions; hypothesis testing, confidence intervals; t-tests; Chi-square; regression and correlation (linear) and introduction to analysis of variance (1-way).",
            "id": "PSYCH 210",
            "parent": "PSYCH",
            "title": "BASIC STATISTICS FOR PSYCHOLOGY"
        }
    },
    {
        "data": {
            "description": "Behavior, including its development, motivation, frustrations, emotion, intelligence, learning, forgetting, personality, language, thinking, and social behavior.",
            "id": "PSYCH 202",
            "parent": "PSYCH",
            "title": "INTRODUCTION TO PSYCHOLOGY"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Part of a 2-semester sequence withMATH 217; these two courses together are equivalent toMATH 114and221.",
            "id": "MATH 171",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY I"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "source": "STAT 324",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "source": "PSYCH 202",
            "target": "PSYCH 210"
        }
    },
    {
        "data": {
            "source": "ISYE 350",
            "target": "ISYE 450"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "source": "MATH 213",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "description": "Descriptive statistics, probability concepts and distributions, random variables. Hypothesis tests and confidence intervals for one- and two-sample problems. Linear regression, model checking, and inference. Analysis of variance and basic ideas in experimental design. Utilizes the R programming language.",
            "id": "STAT 324",
            "parent": "STAT",
            "title": "INTRODUCTORY APPLIED STATISTICS FOR ENGINEERS"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "source": "ISYE 210",
            "target": "ISYE 315"
        }
    },
    {
        "data": {
            "id": "STAT",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "description": "Continuation ofMATH 171. Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Completion ofMATH 217implies completion ofMATH 221and114.",
            "id": "MATH 217",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY II"
        }
    },
    {
        "data": {
            "id": "ISYE",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    }
]