[
    {
        "data": {
            "description": "Basic ideas and tools of cost effectiveness analysis as applied in evaluating medical technologies. Addresses special problems and methods in assessing diagnostic technologies, including ROC analysis, and in measuring health for technology assessment. Uses \"classical\" and current journal literature.",
            "id": "ISYE/POPHLTH 875",
            "title": "COST EFFECTIVENESS ANALYSIS IN HEALTH AND HEALTHCARE"
        }
    },
    {
        "data": {
            "description": "Design, implementation and interpretation of epidemiologic studies; emphasis on methodologic problems in the measurement of disease frequency, natural history and risk factors.",
            "id": "POPHLTH/SOC 797",
            "title": "INTRODUCTION TO EPIDEMIOLOGY"
        }
    },
    {
        "data": {
            "description": "Designed for population health researcher. Topics include descriptive statistics, elementary probability, probability distributions, one- and two-sample normal inference (point estimation, hypothesis testing, confidence intervals), power and sample size calculations, one- and two-sample binomial inference, underlying assumptions and diagnostic work.",
            "id": "BMI/POPHLTH 551",
            "title": "INTRODUCTION TO BIOSTATISTICS FOR POPULATION HEALTH"
        }
    },
    {
        "data": {
            "description": "Introduction to the primary statistical tools used in epidemiology and health services research; multiple linear regression, logistic regression and survival analysis.",
            "id": "BMI/POPHLTH 552",
            "title": "REGRESSION METHODS FOR POPULATION HEALTH"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "BMI/POPHLTH 551",
            "target": "BMI/POPHLTH 552"
        }
    },
    {
        "data": {
            "source": "BMI/POPHLTH 552",
            "target": "ISYE/POPHLTH 875"
        }
    },
    {
        "data": {
            "source": "POPHLTH/SOC 797",
            "target": "ISYE/POPHLTH 875"
        }
    }
]