[
    {
        "data": {
            "description": "Basic reporting for print and electronic media. Bring together technical and conceptual skills by creating a variety of print, audio, and web-based news stories on a current public issue.",
            "id": "JOURN 335",
            "parent": "JOURN",
            "title": "PRINCIPLES AND PRACTICES OF REPORTING"
        }
    },
    {
        "data": {
            "description": "Build increasingly sophisticated communication skills, including writing, editing, gathering information, working with data, and presenting stories through varying media forms. Develop an appreciation of how different media influence message design by communicators and reception by audiences. Develop a complex toolkit of conceptual and practical skills for media work in journalism, strategic communication, and hybrids. Build writing skills and critical thinking abilities, two elements common to success in any field.",
            "id": "JOURN 202",
            "parent": "JOURN",
            "title": "MASS COMMUNICATION PRACTICES"
        }
    },
    {
        "data": {
            "description": "Develop information skills - information collection, information verification, information analysis, and information presentation (the CVAP approach) - that are used by professionals in journalism and strategic communication. Includes practical techniques that enhance basic skills related to the collection, evaluation, analysis and presentation of information. These skills will provide a foundation for the major and in journalism and mass communication careers.",
            "id": "JOURN 203",
            "parent": "JOURN",
            "title": "INFORMATION FOR COMMUNICATION"
        }
    },
    {
        "data": {
            "description": "How the mass media are organized and how they function in modern society; their technological basis, economic and political foundations, and social implications.",
            "id": "JOURN 201",
            "parent": "JOURN",
            "title": "INTRODUCTION TO MASS COMMUNICATION"
        }
    },
    {
        "data": {
            "id": "JOURN",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "JOURN 201",
            "target": "JOURN 202"
        }
    },
    {
        "data": {
            "source": "JOURN 202",
            "target": "JOURN 203"
        }
    },
    {
        "data": {
            "source": "JOURN 202",
            "target": "JOURN 335"
        }
    },
    {
        "data": {
            "source": "JOURN 203",
            "target": "JOURN 202"
        }
    }
]