[
    {
        "data": {
            "description": "Provides extensive patient encounters and advanced skills-oriented instruction under the supervision of a skilled clinical preceptor, working towards independent athletic training practice. Immersive experience provides exposure to a large volume and variety of patient encounters in authentic clinical settings. Provides extensive opportunities for supervised autonomy to develop clinical decision-making skills progressing toward independent clinical-decision making.",
            "id": "KINES 624",
            "parent": "KINES",
            "title": "ATHLETIC TRAINING PRECEPTORSHIP I"
        }
    },
    {
        "data": {
            "description": "Clinical field experience that provides practical and skills-oriented instruction under the supervision of a skilled clinical preceptor as a precursor to clinical immersion placement. Provides exposure to a large volume and variety of clinical experiences in authentic clinical settings. Increased patient encounters concurrent with skill acquisition.",
            "id": "KINES 623",
            "parent": "KINES",
            "title": "CLINICAL FIELD EXPERIENCE IN ATHLETIC TRAINING II"
        }
    },
    {
        "data": {
            "source": "KINES 622",
            "target": "KINES 623"
        }
    },
    {
        "data": {
            "source": "KINES 624",
            "target": "KINES 625"
        }
    },
    {
        "data": {
            "source": "KINES 620",
            "target": "KINES 621"
        }
    },
    {
        "data": {
            "description": "Provides extensive patient encounters and advanced skills-oriented instruction under the supervision of a skilled clinical preceptor, working towards independent athletic training practice.  Final immersive clinical experience will provide exposure to a large volume and variety of patient encounters in authentic clinical settings. Provides extensive opportunities for supervised autonomy moving to independent clinical decision-making.",
            "id": "KINES 625",
            "parent": "KINES",
            "title": "ATHLETIC TRAINING PRECEPTORSHIP II"
        }
    },
    {
        "data": {
            "description": "Clinical practicum that provides practical and skills-oriented instruction under the supervision of a skilled clinical preceptor. Exposure to a large volume and variety of clinical experiences to facilitate learning in authentic clinical settings.",
            "id": "KINES 621",
            "parent": "KINES",
            "title": "CLINICAL PRACTICUM IN ATHLETIC TRAINING II"
        }
    },
    {
        "data": {
            "description": "Provides a clinical field experience allowing for practical and skills-oriented instruction under the supervision of a skilled clinical preceptor.  Exposure to a large volume and variety of athletic training clinical experiences to facilitate learning in authentic clinical settings. Increased patient interactions concurrent with skill acquisition and Athletic Training program progression.",
            "id": "KINES 622",
            "parent": "KINES",
            "title": "CLINICAL FIELD EXPERIENCE IN ATHLETIC TRAINING I"
        }
    },
    {
        "data": {
            "source": "KINES 621",
            "target": "KINES 622"
        }
    },
    {
        "data": {
            "source": "KINES 623",
            "target": "KINES 624"
        }
    },
    {
        "data": {
            "description": "Clinical practicum that provides practical and skills-oriented instruction under the supervision of a skilled clinical preceptor. Provides an opportunity for exposure will be to a large volume and variety of clinical experiences to facilitate learning in authentic clinical settings.",
            "id": "KINES 620",
            "parent": "KINES",
            "title": "CLINICAL PRACTICUM IN ATHLETIC TRAINING I"
        }
    },
    {
        "data": {
            "id": "KINES",
            "type": "compound"
        }
    }
]