[
    {
        "data": {
            "description": "Learn and practice assessment strategies in Adapted Physical Education. Experiences in the gymnasium and pool.",
            "id": "KINES 364",
            "parent": "KINES",
            "title": "ASSESSMENT AND PROGRAMMING IN ADAPTED PHYSICAL EDUCATION"
        }
    },
    {
        "data": {
            "source": "ANAT&PHY 337",
            "target": "KINES 316"
        }
    },
    {
        "data": {
            "description": "Uses a regional approach to provide a foundation of knowledge in human anatomy. Units cover an introduction to anatomical systems; back and limbs; thorax, abdomen, and pelvis; and head and neck.",
            "id": "ANAT&PHY 337",
            "parent": "ANAT&PHY",
            "title": "HUMAN ANATOMY"
        }
    },
    {
        "data": {
            "source": "KINES 362",
            "target": "KINES 364"
        }
    },
    {
        "data": {
            "source": "KINES 316",
            "target": "KINES 362"
        }
    },
    {
        "data": {
            "description": "An understanding of foundations, assessment and pedagogy for individuals with disabilities in a variety of physical activity settings. Emphasis on individual differences, life-span, and self-actualization.",
            "id": "KINES 316",
            "parent": "KINES",
            "title": "ADAPTED PHYSICAL ACTIVITY"
        }
    },
    {
        "data": {
            "description": "Topics and laboratory experiences will focus on parameters that are measured in physical activity pedagogy; instruments for measuring physical activity, health related fitness, knowledge, and psychological characteristics; concepts of assessment and research, basic statistical methods; and action research.",
            "id": "KINES 315",
            "parent": "KINES",
            "title": "ASSESSMENT AND RESEARCH IN PHYSICAL ACTIVITY PEDAGOGY"
        }
    },
    {
        "data": {
            "source": "KINES 315",
            "target": "KINES 364"
        }
    },
    {
        "data": {
            "id": "ANAT&PHY",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "KINES",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "A community-based experience in the Adapted Physical Education. Assist, lead, and teach participants in a physical activity program, community recreation activity, or other events that are specific to individuals with disability. Emphasis placed on the adaptation of physical education and physical activities to the needs of individuals with physical, intellectual, emotional, or sensory disabilities.",
            "id": "KINES 362",
            "parent": "KINES",
            "title": "ADAPTED PHYSICAL EDUCATION COMMUNITY ENGAGEMENT"
        }
    }
]