[
    {
        "data": {
            "description": "An understanding of foundations, assessment and pedagogy for individuals with disabilities in a variety of physical activity settings. Emphasis on individual differences, life-span, and self-actualization.",
            "id": "KINES 316",
            "parent": "KINES",
            "title": "ADAPTED PHYSICAL ACTIVITY"
        }
    },
    {
        "data": {
            "description": "Provides comprehensive understanding of behavior management strategies for working with diverse populations in schools, including individuals with disabilities. Explore various topics such as preventative strategies, applied behavior analysis principles, behavior management strategies, developing positive behavioral interventions and support (PBIS), and specific approaches for different conditions, including emotional behavioral disabilities, ADHD, autism, and students in crisis. Learn how to assess behaviors and develop effective behavior intervention plans. Incorporates real-life case studies and presentations to enhance practical application.",
            "id": "KINES 363",
            "parent": "KINES",
            "title": "MANAGEMENT STRATEGIES IN ADAPTED PHYSICAL EDUCATION"
        }
    },
    {
        "data": {
            "description": "Uses a regional approach to provide a foundation of knowledge in human anatomy. Units cover an introduction to anatomical systems; back and limbs; thorax, abdomen, and pelvis; and head and neck.",
            "id": "ANAT&PHY 337",
            "parent": "ANAT&PHY",
            "title": "HUMAN ANATOMY"
        }
    },
    {
        "data": {
            "id": "ANAT&PHY",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "KINES",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ANAT&PHY 337",
            "target": "KINES 316"
        }
    },
    {
        "data": {
            "source": "KINES 316",
            "target": "KINES 363"
        }
    }
]