[
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics and selected topics in Animal Physiology.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "General biological principles. Topics include: evolution, ecology, animal behavior, cell structure and function, genetics and molecular genetics and the physiology of a variety of organ systems emphasizing function in humans.",
            "id": "BIOLOGY/ZOOLOGY 101",
            "title": "ANIMAL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Writing-intensive with opportunities to make observations and generate and test questions. Includes ecology field trips and research projects that focus on genetics and evolution.",
            "id": "BIOCORE 382",
            "parent": "BIOCORE",
            "title": "EVOLUTION, ECOLOGY, AND GENETICS LABORATORY"
        }
    },
    {
        "data": {
            "id": "BOTANY",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 152"
        }
    },
    {
        "data": {
            "description": "Plants as the basis for ecological landscape design in urban and rural settings in late summer, fall, and early winter and their role in creating beautiful, resilient, and high performing outdoor spaces that enhance human health and well-being and provide a number of global ecosystem services.  Study plants in their native and designed habitats to understand the relationships between and among plants and their environment. Identify the aesthetic, structural, functional, and cultural characteristics of key Wisconsin native plants and a variety of non-invasive horticultural species as well as the composition, structure, and functions of  forest, wetland, and grassland communities. Express the essence and cultural meaning of plants and plant communities through hand and digital graphics and writing.",
            "id": "LANDARC 380",
            "parent": "LANDARC",
            "title": "PLANTS FOR ECOLOGICAL DESIGN I"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "target": "LANDARC 380"
        }
    },
    {
        "data": {
            "description": "Basic principles of ecology and interrelations between individuals, populations, communities, ecosystems and their environment; transmission genetics and introduction to population genetics; origin of life, evolutionary mechanisms, ancestral relationships among species, and the diversity of life.",
            "id": "BIOCORE 381",
            "parent": "BIOCORE",
            "title": "EVOLUTION, ECOLOGY, AND GENETICS"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "LANDARC 380"
        }
    },
    {
        "data": {
            "id": "LANDARC",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Principles of landscape and environmental design; incorporates elements of landscape planning and management. Provides background to the ideas and personalities shaping landscape architecture in America. Establishes design basics with a focus on the processes used by landscape architects to create meaningful site and context-sensitive designs in the built and natural environment.",
            "id": "LANDARC 250",
            "parent": "LANDARC",
            "title": "SURVEY OF LANDSCAPE ARCHITECTURE DESIGN"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "BIOCORE 382"
        }
    },
    {
        "data": {
            "source": "BOTANY 100",
            "target": "LANDARC 380"
        }
    },
    {
        "data": {
            "description": "Topics include: selected topics in plant physiology, a survey of the five major kingdoms of organisms, speciation and evolutionary theory, and ecology at multiple levels of the biological hierarchy.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 151"
        }
    },
    {
        "data": {
            "source": "LANDARC 250",
            "target": "LANDARC 380"
        }
    },
    {
        "data": {
            "id": "BIOCORE",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Introduction to the basic principles and concepts of the biology of plants. an integrative approach stressing evolutionary sequences and the relationship between structure and function at succeeding levels of organization: molecule, cell, organism, population, community. Correlated lectures, laboratories, and discussions.",
            "id": "BIOLOGY/BOTANY 130",
            "title": "GENERAL BOTANY"
        }
    },
    {
        "data": {
            "description": "Major emphasis on the roles of plants and microbes in past and present global ecology, and the past and present uses of plants and microbes by humans, including emerging applications of biotechnology.",
            "id": "BOTANY 100",
            "parent": "BOTANY",
            "title": "SURVEY OF BOTANY"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 101"
        }
    },
    {
        "data": {
            "source": "BIOCORE 382",
            "target": "LANDARC 380"
        }
    }
]