[
    {
        "data": {
            "description": "Design studio with an emphasis on the application of design principles aimed at promoting people's health and wellbeing in the built environment.",
            "id": "LANDARC 321",
            "parent": "LANDARC",
            "title": "ENVIRONMENT AND BEHAVIOR STUDIO - DESIGNING HEALTH PROMOTING ENVIRONMENTS"
        }
    },
    {
        "data": {
            "description": "Basic principles in the design of landscapes to aid in developing individual capacities and approaches to designing. Principles of graphic communication media and development of practical graphic skills.",
            "id": "LANDARC 261",
            "parent": "LANDARC",
            "title": "PRINCIPLES OF LANDSCAPE ARCHITECTURE DESIGN AND GRAPHICS"
        }
    },
    {
        "data": {
            "description": "Effects of building and outdoor spaces on people over the life course.",
            "id": "DS 221",
            "parent": "DS",
            "title": "PERSON AND ENVIRONMENT INTERACTIONS"
        }
    },
    {
        "data": {
            "description": "Explores the process of plant selection and placement in the landscape. The desired landscape will be ecologically appropriate to the setting, sustainable, functional in response to goals, and aesthetically pleasing. Acquire an awareness and understanding of the physical characteristics of plant materials and a sensitivity to their needs based on past and present. Emphasis on the recognition of the philosophy of planting design as a dynamic and changing spatial art and science, the relationship between environment and plants, application of design composition principles to plant selection and placement, and functional and utilitarian uses of plants; i.e., the opportunities and constraints for plants in the designed landscape.",
            "id": "LANDARC 560",
            "parent": "LANDARC",
            "title": "PLANTS AND ECOLOGY IN DESIGN"
        }
    },
    {
        "data": {
            "description": "Field identification, landscape characteristics, uses, environmental requirements, adaptability of woody ornamental plants; their autumn and winter character.",
            "id": "HORT/LANDARC 263",
            "title": "LANDSCAPE PLANTS I"
        }
    },
    {
        "data": {
            "description": "General biological principles. Topics include: evolution, ecology, animal behavior, cell structure and function, genetics and molecular genetics and the physiology of a variety of organ systems emphasizing function in humans.",
            "id": "BIOLOGY/ZOOLOGY 101",
            "title": "ANIMAL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Introduction to the basic principles and concepts of the biology of plants. an integrative approach stressing evolutionary sequences and the relationship between structure and function at succeeding levels of organization: molecule, cell, organism, population, community. Correlated lectures, laboratories, and discussions.",
            "id": "BIOLOGY/BOTANY 130",
            "title": "GENERAL BOTANY"
        }
    },
    {
        "data": {
            "description": "Major emphasis on the roles of plants and microbes in past and present global ecology, and the past and present uses of plants and microbes by humans, including emerging applications of biotechnology.",
            "id": "BOTANY 100",
            "parent": "BOTANY",
            "title": "SURVEY OF BOTANY"
        }
    },
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics and selected topics in Animal Physiology.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Topics include: selected topics in plant physiology, a survey of the five major kingdoms of organisms, speciation and evolutionary theory, and ecology at multiple levels of the biological hierarchy.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "With a focus on public open spaces as shared social places, emphasizes the social dimensions and connectedness of urban design and open space systems through perspectives from allied disciplines, such as landscape architecture, architecture, urban planning, real estate development, urban ecology, civil engineering, and the visual arts. Integrates human activity requirements and experiences with physical (or built) and natural site features. Builds upon technical design skills developed in prior studio work, paying close attention to form-giving, place-making, and sustainability at the site and neighborhood scale.",
            "id": "LANDARC 562",
            "parent": "LANDARC",
            "title": "URBAN DESIGN AND OPEN SPACE SYSTEMS"
        }
    },
    {
        "data": {
            "id": "BOTANY",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "DS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "LANDARC",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "HORT/LANDARC 263"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 152"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 101"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "target": "HORT/LANDARC 263"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 151"
        }
    },
    {
        "data": {
            "source": "BOTANY 100",
            "target": "HORT/LANDARC 263"
        }
    },
    {
        "data": {
            "source": "DS 221",
            "target": "LANDARC 321"
        }
    },
    {
        "data": {
            "source": "HORT/LANDARC 263",
            "target": "LANDARC 560"
        }
    },
    {
        "data": {
            "source": "LANDARC 261",
            "target": "LANDARC 321"
        }
    },
    {
        "data": {
            "source": "LANDARC 321",
            "target": "LANDARC 562"
        }
    },
    {
        "data": {
            "source": "LANDARC 560",
            "target": "LANDARC 562"
        }
    }
]