[
    {
        "data": {
            "description": "Design studio with an emphasis on the application of design principles aimed at promoting people's health and wellbeing in the built environment.",
            "id": "LANDARC 321",
            "parent": "LANDARC",
            "title": "ENVIRONMENT AND BEHAVIOR STUDIO - DESIGNING HEALTH PROMOTING ENVIRONMENTS"
        }
    },
    {
        "data": {
            "description": "An application of landscape design principles and problem-solving methods to housing and urban issues with attention to physical site design, land-use controls, and the relationship between housing and associated land uses. The built environment is continuously changing through multiple land development-and redevelopment-decisions. Public policies on housing, transportation, mortgage financing, and taxation, in conjunction with changing demographics and lifestyle preferences, are just some of the factors that influence the evolving structure and function of the built environment. Landscape architects can play important roles--through design, civic engagement, and policy advocacy--in making our cities and suburbs healthier and more sustainable. Studio projects focus on the central city and/or suburbs.",
            "id": "LANDARC 561",
            "parent": "LANDARC",
            "title": "HOUSING AND URBAN DESIGN"
        }
    },
    {
        "data": {
            "description": "Basic principles in the design of landscapes to aid in developing individual capacities and approaches to designing. Principles of graphic communication media and development of practical graphic skills.",
            "id": "LANDARC 261",
            "parent": "LANDARC",
            "title": "PRINCIPLES OF LANDSCAPE ARCHITECTURE DESIGN AND GRAPHICS"
        }
    },
    {
        "data": {
            "description": "Effects of building and outdoor spaces on people over the life course.",
            "id": "DS 221",
            "parent": "DS",
            "title": "PERSON AND ENVIRONMENT INTERACTIONS"
        }
    },
    {
        "data": {
            "id": "DS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "LANDARC",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "DS 221",
            "target": "LANDARC 321"
        }
    },
    {
        "data": {
            "source": "LANDARC 261",
            "target": "LANDARC 321"
        }
    },
    {
        "data": {
            "source": "LANDARC 321",
            "target": "LANDARC 561"
        }
    }
]