[
    {
        "data": {
            "description": "Examines fundamental questions about the nature and content of law, addressing both analytic and normative jurisprudence. Questions in analytic jurisprudence include: What does it mean for something to be the law? Why are some things a matter of law, while others are not? What is the relationship between law and morality? Is the law exhausted by the meaning of words in constitutions and statutes? Questions of normative jurisprudence concern the proper content of law, such as, what should the law permit, prohibit, and promote? These questions are examined by looking at a number of topics that are at issue in U.S. (and other nations') laws. These will include interpreting criminal law statutes, policies promoting public welfare, and the justifications for property, especially intellectual property rights.",
            "id": "LEGALST 407",
            "parent": "LEGALST",
            "title": "JURISPRUDENCE AND SOCIAL ISSUES"
        }
    },
    {
        "data": {
            "description": "Day-to-day functioning of the elements of the criminal justice system in the U.S. Nature of crime in the U.S., ideas about causes and solutions. Emphasis on the sociology of the components of criminal justice system--organization and roles of police, lawyers, court and correctional personnel.",
            "id": "LEGALST/SOC 131",
            "title": "CRIMINAL JUSTICE IN AMERICA"
        }
    },
    {
        "data": {
            "description": "Introduction to the legal process. Examination of the various concepts of law, the perennial problems of the law, legal reasoning, and the nature and function of law and the courts.",
            "id": "LEGALST/POLISCI 217",
            "title": "LAW, POLITICS AND SOCIETY"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "LEGALST",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "LEGALST/POLISCI 217",
            "target": "LEGALST 407"
        }
    },
    {
        "data": {
            "source": "LEGALST/SOC 131",
            "target": "LEGALST 407"
        }
    }
]