[
    {
        "data": {
            "description": "Planning and controlling the elements of the marketing program; marketing organization, product and service, packaging, pricing, promotion and physical distribution.",
            "id": "MARKETNG 300",
            "parent": "MARKETNG",
            "title": "MARKETING MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Explores marketing, promotion, and strategic communication specific to the consumer marketplace. Analyze communication strategies for science products and industries synthesized from business goals and objectives to specific audiences. Coursework includes a variety of readings from a class textbook as well as peer-reviewed papers published in life science, marketing, communication, and general business journals.",
            "id": "LSC 270",
            "parent": "LSC",
            "title": "MARKETING COMMUNICATION FOR THE SCIENCES"
        }
    },
    {
        "data": {
            "id": "MARKETNG",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "LSC",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "MARKETNG 300"
        }
    },
    {
        "data": {
            "id": "ECON",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Integrated treatment of macroeconomics and microeconomics (seeECON 101andECON 102). Accelerated approach to economics training, especially for Economics: Math Emphasis majors.",
            "id": "ECON 111",
            "parent": "ECON",
            "title": "PRINCIPLES OF ECONOMICS-ACCELERATED TREATMENT"
        }
    },
    {
        "data": {
            "source": "LSC 270",
            "target": "LSC 435"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON 111"
        }
    },
    {
        "data": {
            "description": "Explores strategic marketing, branding, and communication planning specific to science, technology, and environmental industries. Examines the sociological and psychological processes shaping audiences' perceptions of various brands, and discusses how to apply various strategies and frameworks to reinforce these perceptions and guide marketing and communication efforts. Combines portfolio-building writing as well as in-class presentations and discussion on contemporary marketing, branding issues, including strategic marketing plans.",
            "id": "LSC 435",
            "parent": "LSC",
            "title": "BRAND STRATEGY FOR THE SCIENCES"
        }
    },
    {
        "data": {
            "description": "Economic problems of individuals, firms and industries with emphasis on value, price, and distribution of income.",
            "id": "ECON 101",
            "parent": "ECON",
            "title": "PRINCIPLES OF MICROECONOMICS"
        }
    },
    {
        "data": {
            "source": "MARKETNG 300",
            "target": "LSC 435"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON 101"
        }
    }
]