[
    {
        "data": {
            "source": "MARKETNG 300",
            "target": "MARKETNG 305"
        }
    },
    {
        "data": {
            "description": "Analyses from social and psychological perspectives. Motivation, perception, learning and attitude formation. Effects of social class, family structure, cultural backgrounds and reference groups.",
            "id": "CNSRSCI 657",
            "parent": "CNSRSCI",
            "title": "CONSUMER BEHAVIOR"
        }
    },
    {
        "data": {
            "id": "CNSRSCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "MARKETNG 300",
            "target": "MARKETNG 310"
        }
    },
    {
        "data": {
            "description": "Systematic and objective search for and analysis of information relevant to the identification and solution of problems in marketing.",
            "id": "MARKETNG 310",
            "parent": "MARKETNG",
            "title": "MARKETING RESEARCH"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 213"
        }
    },
    {
        "data": {
            "source": "GENBUS 306",
            "target": "MARKETNG 310"
        }
    },
    {
        "data": {
            "description": "Capstone marketing decision-making course emphasizing analysis of the external environment. The coordination of tactical and strategic marketing plans with the goals and objectives of the firm.",
            "id": "MARKETNG 460",
            "parent": "MARKETNG",
            "title": "MARKETING STRATEGY"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "GENBUS 306"
        }
    },
    {
        "data": {
            "source": "MARKETNG 300",
            "target": "MARKETNG 460"
        }
    },
    {
        "data": {
            "source": "GENBUS 106",
            "target": "GENBUS 306"
        }
    },
    {
        "data": {
            "description": "First order differential equations, introduction to multivariable calculus and constrained optimization, infinite sequences and series, methods of approximation, and a brief introduction to probability. Models and applications from business and the social sciences.",
            "id": "MATH 213",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 2"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Development of quantitative intuition through practical applications and use of analysis tools. Specifically, emphasis will be on how to manage, summarize, explore, and visualize databases. The essentials of probability will be introduced and applied to decision problems where there is uncertainty. Emphasis on hypothesis testing and regression analysis and include an introduction to simulation methods. Throughout, attention will be paid to effective communication of data analysis. The use of business cases will connect the course material to both real world settings and recent advances in data analysis, including big data and data mining.",
            "id": "GENBUS 306",
            "parent": "GENBUS",
            "title": "BUSINESS ANALYTICS I"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "id": "MARKETNG",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Consumer behavior is a broad field that studies how individuals, families and groups acquire, consume, and dispose of goods, services, ideas and experiences. Provides an integrated view of consumer behavior that draws on psychological, economic, anthropological and sociological perspectives to enhance understanding of consumer acquisition processes.",
            "id": "MARKETNG 305",
            "parent": "MARKETNG",
            "title": "CONSUMER BEHAVIOR"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "MARKETNG 300"
        }
    },
    {
        "data": {
            "id": "ECON",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Integrated treatment of macroeconomics and microeconomics (seeECON 101andECON 102). Accelerated approach to economics training, especially for Economics: Math Emphasis majors.",
            "id": "ECON 111",
            "parent": "ECON",
            "title": "PRINCIPLES OF ECONOMICS-ACCELERATED TREATMENT"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON 111"
        }
    },
    {
        "data": {
            "description": "Build fundamental skills and processes to develop a strong foundation in business analysis utilizing Excel. Learn the fundamentals of data construction, manipulation, summarization, analysis and presentation.",
            "id": "GENBUS 106",
            "parent": "GENBUS",
            "title": "FOUNDATIONAL SKILLS FOR BUSINESS ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "source": "MARKETNG 305",
            "target": "MARKETNG 460"
        }
    },
    {
        "data": {
            "description": "Economic problems of individuals, firms and industries with emphasis on value, price, and distribution of income.",
            "id": "ECON 101",
            "parent": "ECON",
            "title": "PRINCIPLES OF MICROECONOMICS"
        }
    },
    {
        "data": {
            "source": "MATH 213",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "description": "Planning and controlling the elements of the marketing program; marketing organization, product and service, packaging, pricing, promotion and physical distribution.",
            "id": "MARKETNG 300",
            "parent": "MARKETNG",
            "title": "MARKETING MANAGEMENT"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "CNSRSCI 657",
            "target": "MARKETNG 305"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON 101"
        }
    },
    {
        "data": {
            "id": "GENBUS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "MARKETNG 310",
            "target": "MARKETNG 460"
        }
    }
]