[
    {
        "data": {
            "description": "An introduction to proof writing techniques through a study of classical topics in elementary number theory. Topics include the divisibility, basic properties of primes, congruences, Fermat's theorem.",
            "id": "MATH 467",
            "parent": "MATH",
            "title": "INTRODUCTION TO NUMBER THEORY"
        }
    },
    {
        "data": {
            "description": "Covers the graphs, properties and geometric significance of trigonometric functions of a real variable. Other topics include trigonometric equations and identities, application, trigonometric form of complex numbers, DeMoivre's theorem, and polar and parametric equations. The course also has a significant number of applications, especially related to other disciplines.",
            "id": "MATH 113",
            "parent": "MATH",
            "title": "TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "Groups, normal subgroups, Cayley's theorem, rings, ideals, homomorphisms, polynomial rings, abstract vector spaces.",
            "id": "MATH 541",
            "parent": "MATH",
            "title": "MODERN ALGEBRA"
        }
    },
    {
        "data": {
            "description": "An introduction to linear algebra. Topics include matrix algebra, linear systems of equations, vector spaces, sub-spaces, linear dependence, span, basis, rank of matrices, determinants, linear transformations, coordinate representations, kernel, range, eigenvalues and eigenvectors, diagonalization, inner products and orthogonal vectors, symmetric matrices. Covers linear algebra topics in greater depth and detail thanMATH 320. Formal techniques in mathematical argument [MATH 341] not covered.",
            "id": "MATH 340",
            "parent": "MATH",
            "title": "ELEMENTARY MATRIX AND LINEAR ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Basic concepts of logic, sets, partial order and other relations, and functions. Basic concepts of mathematics (definitions, proofs, sets, functions, and relations) with a focus on discrete structures: integers, bits, strings, trees, and graphs.  Propositional logic, Boolean algebra, and predicate logic. Mathematical induction and recursion. Invariants and algorithmic correctness. Recurrences and asymptotic growth analysis. Fundamentals of counting.",
            "id": "COMPSCI/MATH 240",
            "title": "INTRODUCTION TO DISCRETE MATHEMATICS"
        }
    },
    {
        "data": {
            "description": "Continuation ofMATH 171. Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Completion ofMATH 217implies completion ofMATH 221and114.",
            "id": "MATH 217",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY II"
        }
    },
    {
        "data": {
            "description": "Covers material in first and second semester calculus but it is intended to teach math majors to write and understand proofs in mathematics in general and in calculus in particular.",
            "id": "MATH 421",
            "parent": "MATH",
            "title": "THE THEORY OF SINGLE VARIABLE CALCULUS"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Introduction to algebraic topology. Emphasis on geometric aspects, including two-dimensional manifolds, the fundamental group, covering spaces, basic simplicial homology theory, the Euler-Poincare formula, and homotopy classes of mappings.",
            "id": "MATH 552",
            "parent": "MATH",
            "title": "ELEMENTARY GEOMETRIC AND ALGEBRAIC TOPOLOGY"
        }
    },
    {
        "data": {
            "description": "Introduction to calculus of functions of several variables; calculus on parameterized curves, derivatives of functions of several variables, multiple integrals, vector calculus.",
            "id": "MATH 234",
            "parent": "MATH",
            "title": "CALCULUS--FUNCTIONS OF SEVERAL VARIABLES"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Techniques of integration, improper integrals, first order ordinary differential equations, sequences and series, Taylor series, vector geometry in two and three dimensions.",
            "id": "MATH 222",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 2"
        }
    },
    {
        "data": {
            "description": "The real numbers, elements of set theory, metric spaces and basic topology, sequences and series, limits, continuity, differentiation, integration, sequences and series of functions, uniform convergence.",
            "id": "MATH 521",
            "parent": "MATH",
            "title": "ANALYSIS I"
        }
    },
    {
        "data": {
            "description": "The theory of linear algebra with an introduction to proofs and proof writing. Topics include vector spaces, linear dependence, span, basis, linear transformations, kernel, image, inner products and inner product spaces, geometry, eigenvalues, eigenvectors, standard matrix factorizations. Other content includes basic set theory, logical operations, quantifiers, direct and indirect arguments, and induction. Differential equations [MATH 320] not covered.",
            "id": "MATH 341",
            "parent": "MATH",
            "title": "LINEAR ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Part of a 2-semester sequence withMATH 217; these two courses together are equivalent toMATH 114and221.",
            "id": "MATH 171",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY I"
        }
    },
    {
        "data": {
            "description": "Topological spaces, connectedness, compactness, separation axioms, metric spaces.",
            "id": "MATH 551",
            "parent": "MATH",
            "title": "ELEMENTARY TOPOLOGY"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "COMPSCI/MATH 240",
            "target": "MATH 467"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 113"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 113",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "MATH 217"
        }
    },
    {
        "data": {
            "source": "MATH 217",
            "target": "COMPSCI/MATH 240"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 222"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 234"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 340"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 467"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "MATH 341"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "MATH 421"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "MATH 541"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "MATH 551"
        }
    },
    {
        "data": {
            "source": "MATH 340",
            "target": "MATH 551"
        }
    },
    {
        "data": {
            "source": "MATH 341",
            "target": "MATH 541"
        }
    },
    {
        "data": {
            "source": "MATH 421",
            "target": "MATH 521"
        }
    },
    {
        "data": {
            "source": "MATH 467",
            "target": "MATH 541"
        }
    },
    {
        "data": {
            "source": "MATH 521",
            "target": "MATH 551"
        }
    },
    {
        "data": {
            "source": "MATH 541",
            "target": "MATH 552"
        }
    },
    {
        "data": {
            "source": "MATH 551",
            "target": "MATH 552"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 171"
        }
    }
]