[
    {
        "data": {
            "description": "A preparation and introductory math course for students enrolled in the Summer Collegiate Experience program. Includes material from precalculus and calculus and related topics depending on students' results on the math placement exam.",
            "id": "MATH 118",
            "parent": "MATH",
            "title": "SUMMER COLLEGIATE EXPERIENCE MATHEMATICS COURSE"
        }
    },
    {
        "data": {
            "description": "Covers the graphs, properties and geometric significance of trigonometric functions of a real variable. Other topics include trigonometric equations and identities, application, trigonometric form of complex numbers, DeMoivre's theorem, and polar and parametric equations. The course also has a significant number of applications, especially related to other disciplines.",
            "id": "MATH 113",
            "parent": "MATH",
            "title": "TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "An introduction to linear algebra and differential equations with emphasis on the relationship between the theory of linear algebra and analytical and numerical techniques for solving differential equations. Linear algebra topics include linear systems, matrices and their algebra, vector spaces and linear transformations, eigenvalues and eigenvectors. Topics from differential equations include first order ODE, homogeneous and nonhomogeneous linear systems, and numerical methods.",
            "id": "MATH 320",
            "parent": "MATH",
            "title": "LINEAR ALGEBRA AND DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "description": "Covers material in first and second semester calculus but it is intended to teach math majors to write and understand proofs in mathematics in general and in calculus in particular.",
            "id": "MATH 421",
            "parent": "MATH",
            "title": "THE THEORY OF SINGLE VARIABLE CALCULUS"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "First order differential equations, introduction to multivariable calculus and constrained optimization, infinite sequences and series, methods of approximation, and a brief introduction to probability. Models and applications from business and the social sciences.",
            "id": "MATH 213",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 2"
        }
    },
    {
        "data": {
            "description": "Integration in Euclidean spaces, change of variables, multilinear algebra, vector fields and differential forms, manifolds and tangent spaces, integration on manifolds, Stokes theorem. Classical vector analysis. Cauchy integral theorem.",
            "id": "MATH 621",
            "parent": "MATH",
            "title": "INTRODUCTION TO MANIFOLDS"
        }
    },
    {
        "data": {
            "description": "Introduction to calculus of functions of several variables; calculus on parameterized curves, derivatives of functions of several variables, multiple integrals, vector calculus.",
            "id": "MATH 234",
            "parent": "MATH",
            "title": "CALCULUS--FUNCTIONS OF SEVERAL VARIABLES"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Techniques of integration, improper integrals, first order ordinary differential equations, sequences and series, Taylor series, vector geometry in two and three dimensions.",
            "id": "MATH 222",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 2"
        }
    },
    {
        "data": {
            "description": "The real numbers, elements of set theory, metric spaces and basic topology, sequences and series, limits, continuity, differentiation, integration, sequences and series of functions, uniform convergence.",
            "id": "MATH 521",
            "parent": "MATH",
            "title": "ANALYSIS I"
        }
    },
    {
        "data": {
            "description": "Theory of curves and surfaces by differential methods.",
            "id": "MATH 561",
            "parent": "MATH",
            "title": "DIFFERENTIAL GEOMETRY"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 113"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 113",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 213"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 213",
            "target": "MATH 222"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 222"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 234"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 320"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "MATH 421"
        }
    },
    {
        "data": {
            "source": "MATH 320",
            "target": "MATH 561"
        }
    },
    {
        "data": {
            "source": "MATH 421",
            "target": "MATH 521"
        }
    },
    {
        "data": {
            "source": "MATH 421",
            "target": "MATH 561"
        }
    },
    {
        "data": {
            "source": "MATH 521",
            "target": "MATH 621"
        }
    },
    {
        "data": {
            "source": "MATH 561",
            "target": "MATH 621"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    }
]