[
    {
        "data": {
            "description": "A rigorous introduction to probability theory at an advanced undergraduate level. Only a minimal amount of measure theory is used, in particular, the theory of Lebesgue integrals is not needed. It is aimed at math majors and Master's degree students, or students in other fields who will need probability in their future careers. Gives an introduction to the basics (Kolmogorov axioms, conditional probability and independence, random variables, expectation) and discusses some classical results with proofs (DeMoivre-Laplace limit theorems, the study of simple random walk on the one dimensional lattice, applications of generating functions).",
            "id": "MATH 531",
            "parent": "MATH",
            "title": "PROBABILITY THEORY"
        }
    },
    {
        "data": {
            "description": "Topics covered include axioms of probability, random variables, the most important discrete and continuous probability distributions, expectation and variance, moment generating functions, conditional probability and conditional expectations, multivariate distributions, Markov's and Chebyshev's inequalities, laws of large numbers, and the central limit theorem.",
            "id": "MATH/STAT 431",
            "title": "INTRODUCTION TO THE THEORY OF PROBABILITY"
        }
    },
    {
        "data": {
            "description": "A rigorous introduction to mathematical concepts important for modern data science.   Topics include: matrix factorizations,  optimization theory and algorithms, probabilistic models, finite Markov chains.  Mathematical techniques are motivated by and illustrated on a range of applied problems from machine learning and statistics.",
            "id": "MATH 535",
            "parent": "MATH",
            "title": "MATHEMATICAL METHODS IN DATA SCIENCE"
        }
    },
    {
        "data": {
            "description": "An introduction to linear algebra and differential equations with emphasis on the relationship between the theory of linear algebra and analytical and numerical techniques for solving differential equations. Linear algebra topics include linear systems, matrices and their algebra, vector spaces and linear transformations, eigenvalues and eigenvectors. Topics from differential equations include first order ODE, homogeneous and nonhomogeneous linear systems, and numerical methods.",
            "id": "MATH 320",
            "parent": "MATH",
            "title": "LINEAR ALGEBRA AND DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "description": "An introduction to linear algebra. Topics include matrix algebra, linear systems of equations, vector spaces, sub-spaces, linear dependence, span, basis, rank of matrices, determinants, linear transformations, coordinate representations, kernel, range, eigenvalues and eigenvectors, diagonalization, inner products and orthogonal vectors, symmetric matrices. Covers linear algebra topics in greater depth and detail thanMATH 320. Formal techniques in mathematical argument [MATH 341] not covered.",
            "id": "MATH 340",
            "parent": "MATH",
            "title": "ELEMENTARY MATRIX AND LINEAR ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Covers material in first and second semester calculus but it is intended to teach math majors to write and understand proofs in mathematics in general and in calculus in particular.",
            "id": "MATH 421",
            "parent": "MATH",
            "title": "THE THEORY OF SINGLE VARIABLE CALCULUS"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "First order differential equations, introduction to multivariable calculus and constrained optimization, infinite sequences and series, methods of approximation, and a brief introduction to probability. Models and applications from business and the social sciences.",
            "id": "MATH 213",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 2"
        }
    },
    {
        "data": {
            "description": "Introduction to calculus of functions of several variables; calculus on parameterized curves, derivatives of functions of several variables, multiple integrals, vector calculus.",
            "id": "MATH 234",
            "parent": "MATH",
            "title": "CALCULUS--FUNCTIONS OF SEVERAL VARIABLES"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Linear algebraic foundations of machine learning featuring real-world applications of matrix methods from classification and clustering to denoising and data analysis. Mathematical topics include: linear equations, regression, regularization, the singular value decomposition, and iterative algorithms. Machine learning topics include: the lasso, support vector machines, kernel methods, clustering, dictionary learning, neural networks, and deep learning. Previous exposure to numerical computing (e.g. Matlab, Python, Julia, R) required.",
            "id": "COMPSCI/ECE/ME 532",
            "title": "MATRIX METHODS IN MACHINE LEARNING"
        }
    },
    {
        "data": {
            "description": "Probability and combinatorial methods, discrete and continuous, univariate and multivariate distributions, expected values, moments, normal distribution and derived distributions, estimation.",
            "id": "MATH/STAT 309",
            "title": "INTRODUCTION TO PROBABILITY AND MATHEMATICAL STATISTICS I"
        }
    },
    {
        "data": {
            "description": "Review of linear differential equations; series solution of linear differential equations; boundary value problems; Laplace transforms; possibly numerical methods and two dimensional autonomous systems.",
            "id": "MATH 319",
            "parent": "MATH",
            "title": "TECHNIQUES IN ORDINARY DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "description": "Sturm-Liouville theory; Fourier series, including mean convergence; boundary value problems for linear second order partial differential equations, including separation of variables and eigenfunction expansions.",
            "id": "MATH 322",
            "parent": "MATH",
            "title": "APPLIED MATHEMATICAL ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Techniques of integration, improper integrals, first order ordinary differential equations, sequences and series, Taylor series, vector geometry in two and three dimensions.",
            "id": "MATH 222",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 2"
        }
    },
    {
        "data": {
            "description": "The real numbers, elements of set theory, metric spaces and basic topology, sequences and series, limits, continuity, differentiation, integration, sequences and series of functions, uniform convergence.",
            "id": "MATH 521",
            "parent": "MATH",
            "title": "ANALYSIS I"
        }
    },
    {
        "data": {
            "description": "The theory of linear algebra with an introduction to proofs and proof writing. Topics include vector spaces, linear dependence, span, basis, linear transformations, kernel, image, inner products and inner product spaces, geometry, eigenvalues, eigenvectors, standard matrix factorizations. Other content includes basic set theory, logical operations, quantifiers, direct and indirect arguments, and induction. Differential equations [MATH 320] not covered.",
            "id": "MATH 341",
            "parent": "MATH",
            "title": "LINEAR ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Topics in multi-variable calculus and introduction to differential equations.",
            "id": "MATH 376",
            "parent": "MATH",
            "title": "TOPICS IN MULTI-VARIABLE CALCULUS AND DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "description": "Vector analysis: algebra and geometry of vectors, vector differential and integral calculus, theorems of Green, Gauss, and Stokes; complex analysis: analytic functions, complex integrals and residues, Taylor and Laurent series.",
            "id": "MATH 321",
            "parent": "MATH",
            "title": "APPLIED MATHEMATICAL ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Vector spaces and linear transformations, differential calculus of scalar and vector fields, determinants, eigenvalues and eigenvectors, multiple integrals, line integrals, and surface integrals. Freshmen students are invited to enroll by the Department of Mathematics.",
            "id": "MATH 375",
            "parent": "MATH",
            "title": "TOPICS IN MULTI-VARIABLE CALCULUS AND LINEAR ALGEBRA"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "COMPSCI/ECE/ME 532",
            "target": "MATH 535"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 213"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 213",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 222"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 234"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 319"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 320"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 340"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "MATH 321"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "MATH 341"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "MATH 421"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "MATH 521"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "MATH/STAT 431"
        }
    },
    {
        "data": {
            "source": "MATH 319",
            "target": "MATH 321"
        }
    },
    {
        "data": {
            "source": "MATH 320",
            "target": "COMPSCI/ECE/ME 532"
        }
    },
    {
        "data": {
            "source": "MATH 320",
            "target": "MATH 321"
        }
    },
    {
        "data": {
            "source": "MATH 321",
            "target": "MATH 322"
        }
    },
    {
        "data": {
            "source": "MATH 322",
            "target": "MATH 521"
        }
    },
    {
        "data": {
            "source": "MATH 340",
            "target": "COMPSCI/ECE/ME 532"
        }
    },
    {
        "data": {
            "source": "MATH 340",
            "target": "MATH 321"
        }
    },
    {
        "data": {
            "source": "MATH 341",
            "target": "COMPSCI/ECE/ME 532"
        }
    },
    {
        "data": {
            "source": "MATH 341",
            "target": "MATH 321"
        }
    },
    {
        "data": {
            "source": "MATH 375",
            "target": "MATH 321"
        }
    },
    {
        "data": {
            "source": "MATH 375",
            "target": "MATH 376"
        }
    },
    {
        "data": {
            "source": "MATH 376",
            "target": "MATH 321"
        }
    },
    {
        "data": {
            "source": "MATH 376",
            "target": "MATH 322"
        }
    },
    {
        "data": {
            "source": "MATH 376",
            "target": "MATH/STAT 431"
        }
    },
    {
        "data": {
            "source": "MATH 421",
            "target": "MATH 521"
        }
    },
    {
        "data": {
            "source": "MATH 421",
            "target": "MATH 531"
        }
    },
    {
        "data": {
            "source": "MATH 521",
            "target": "MATH 531"
        }
    },
    {
        "data": {
            "source": "MATH 531",
            "target": "MATH 535"
        }
    },
    {
        "data": {
            "source": "MATH/STAT 309",
            "target": "MATH 535"
        }
    },
    {
        "data": {
            "source": "MATH/STAT 431",
            "target": "MATH 535"
        }
    },
    {
        "data": {
            "source": "MATH/STAT 431",
            "target": "MATH/STAT 309"
        }
    }
]