[
    {
        "data": {
            "description": "A quantitative and qualitative study of manufacturing processes including machining, extrusion, sheet metal forming, welding, and casting for metals; and additive manufacturing, extrusion, injection molding, thermoforming and blow molding for plastics. Emphasis on process selection for optimum design. Laboratory experiments and demonstrations. Quality, strength, and economic evaluations.",
            "id": "ME 313",
            "parent": "ME",
            "title": "MANUFACTURING PROCESSES"
        }
    },
    {
        "data": {
            "description": "An introduction to techniques for modeling in materials processing and improving decision making in increasing the productivity of design and manufacturing processes.  Quality improvement and engineering simulation tools are presented as well as the methods of engineering economy and the role of manufacturing automation and systems, through lectures and laboratories.",
            "id": "ME 314",
            "parent": "ME",
            "title": "MANUFACTURING FUNDAMENTALS"
        }
    },
    {
        "data": {
            "description": "Introduction to: atomic, electronic, and defect structures in materials; diffusional, mechanical and electrical properties of materials; and the role of structure and defects in diffusional, mechanical, and electrical properties.",
            "id": "MS&E 351",
            "parent": "MS&E",
            "title": "MATERIALS SCIENCE-STRUCTURE AND PROPERTY RELATIONS IN SOLIDS"
        }
    },
    {
        "data": {
            "description": "The basic structures and resulting properties of solid materials, including phase equilibria, meta-stability, mechanical properties, failure, corrosion, and materials selection.",
            "id": "MS&E 350",
            "parent": "MS&E",
            "title": "INTRODUCTION TO MATERIALS SCIENCE"
        }
    },
    {
        "data": {
            "id": "ME",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MS&E",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ME 313",
            "target": "ME 314"
        }
    },
    {
        "data": {
            "source": "MS&E 350",
            "target": "ME 313"
        }
    },
    {
        "data": {
            "source": "MS&E 350",
            "target": "MS&E 351"
        }
    },
    {
        "data": {
            "source": "MS&E 351",
            "target": "MS&E 350"
        }
    },
    {
        "data": {
            "source": "MS&E 351",
            "target": "MS&E 351"
        }
    }
]