[
    {
        "data": {
            "description": "A quantitative and qualitative study of manufacturing processes including machining, extrusion, sheet metal forming, welding, and casting for metals; and additive manufacturing, extrusion, injection molding, thermoforming and blow molding for plastics. Emphasis on process selection for optimum design. Laboratory experiments and demonstrations. Quality, strength, and economic evaluations.",
            "id": "ME 313",
            "parent": "ME",
            "title": "MANUFACTURING PROCESSES"
        }
    },
    {
        "data": {
            "description": "Accelerated coverage of topics in general chemistry, including introduction to laboratory techniques. Topics include atomic and molecular structure, chemical equilibrium, acid-base chemistry, thermodynamics, kinetics, and electrochemistry.",
            "id": "CHEM 109",
            "parent": "CHEM",
            "title": "ADVANCED GENERAL CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "An introduction to processes for manufacturing metal parts, designing parts to make them easier to manufacture with these methods, and approaches for increasing productivity. Manufacturing automation, control, and metrology for increased safety, productivity, and part quality. Engineering economics for determining the cost of manufacturing a part.",
            "id": "ME 311",
            "parent": "ME",
            "title": "MANUFACTURING: METALS AND AUTOMATION"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "Explores a detailed atomic and molecular view of matter and its interactions, with a specific focus on quantum theory, molecular structure, and chemical bonding. Application required for enrollment.",
            "id": "CHEM 115",
            "parent": "CHEM",
            "title": "CHEMICAL PRINCIPLES I"
        }
    },
    {
        "data": {
            "description": "First order differential equations, introduction to multivariable calculus and constrained optimization, infinite sequences and series, methods of approximation, and a brief introduction to probability. Models and applications from business and the social sciences.",
            "id": "MATH 213",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 2"
        }
    },
    {
        "data": {
            "description": "Gives students an introduction to computer and analytical skills to use in their subsequent course work and professional development. Discusses several methods of using computers to solve problems, including elementary programming techniques, symbolic manipulation languages, and software packages. Techniques will be illustrated using sample problems drawn from elementary engineering. Emphasis is on introduction of algorithms with the use of specific tools to illustrate the methods.",
            "id": "COMPSCI 310",
            "parent": "COMPSCI",
            "title": "PROBLEM SOLVING USING COMPUTERS"
        }
    },
    {
        "data": {
            "description": "Introduction to basic methods and fundamental concepts in geometric description and modeling of mechanical form, components, and assemblies. Topics include elements of descriptive geometry, engineering drawing standards, introduction to computer modeling, and geometric dimensioning and tolerancing (GDT). Lectures are reinforced by the laboratory experience where students operate modern commercial computer-aided design systems to model and to learn the basics of engineering communication, specification, and annotation.",
            "id": "ME 231",
            "parent": "ME",
            "title": "GEOMETRIC MODELING FOR DESIGN AND MANUFACTURING"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Introduction to the fundamentals of Computer Aided Engineering. Topics include mathematical and programmable methods for modeling and design of mechanical shapes and assemblies; shape processing for manufacturing, including NC machining and 3D printing; and computer-aided analysis of structural, thermal and other physical properties.",
            "id": "ME 331",
            "parent": "ME",
            "title": "COMPUTER-AIDED ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Introduction to: atomic, electronic, and defect structures in materials; diffusional, mechanical and electrical properties of materials; and the role of structure and defects in diffusional, mechanical, and electrical properties.",
            "id": "MS&E 351",
            "parent": "MS&E",
            "title": "MATERIALS SCIENCE-STRUCTURE AND PROPERTY RELATIONS IN SOLIDS"
        }
    },
    {
        "data": {
            "description": "Principles and application of chemical equilibrium, coordination chemistry, oxidation-reduction and electrochemistry, kinetics, nuclear chemistry, introduction to organic chemistry, and chemistry laboratory skills.",
            "id": "CHEM 104",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Principles of design, manufacturing, and prototype evaluation.  A semester long project provides the opportunity to redesign of a thermo-mechanical device (Stirling Engine) using knowledge/skills acquired both through this course and previous course offerings in thermal sciences, mechanics and dynamics, manufacturing, and design.  Instruction and hands-on experience using the manufacturing tools/processes available in the CoE.  Design, dimensioning and tolerancing, manufacturing, and quantitative analysis are all covered in a structured semester project.",
            "id": "ME 449",
            "parent": "ME",
            "title": "REDESIGN AND PROTOTYPE FABRICATION"
        }
    },
    {
        "data": {
            "description": "Principles of mechanics, force systems, equilibrium, structures, distributed forces, moments of inertia of areas, and friction.",
            "id": "EMA 201",
            "parent": "EMA",
            "title": "STATICS"
        }
    },
    {
        "data": {
            "description": "Stoichiometry and the mole concept, the behavior of gases, liquids and solids, thermochemistry, electronic structure of atoms and chemical bonding, descriptive chemistry of selected elements and compounds, intermolecular forces, and chemistry laboratory skills.",
            "id": "CHEM 103",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Stress and strain, torsion, bending of beams, shearing stresses in beams, compound stresses, principal stresses, deflections of beams, statically indeterminate members, columns. For civil engineers.",
            "id": "EMA 303",
            "parent": "EMA",
            "title": "MECHANICS OF MATERIALS"
        }
    },
    {
        "data": {
            "description": "Stress and strain, torsion, bending of beams, shearing stresses in beams, compound stresses, principal stresses, deflections of beams, statically indeterminate members, columns.",
            "id": "ME 306",
            "parent": "ME",
            "title": "MECHANICS OF MATERIALS"
        }
    },
    {
        "data": {
            "description": "Techniques of integration, improper integrals, first order ordinary differential equations, sequences and series, Taylor series, vector geometry in two and three dimensions.",
            "id": "MATH 222",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 2"
        }
    },
    {
        "data": {
            "description": "The basic factors that determine phase equilibria, structural and transformation characteristics of solids. Principles governing the thermodynamics and kinetics of phase transformations and microstructure evolution. Nucleation and growth processes in precipitation, recrystallization, solidification, oxidation, martensitic, ordering and spinodal reactions. Transformation behavior in polymers, biomaterials and nanomaterials.",
            "id": "MS&E 352",
            "parent": "MS&E",
            "title": "MATERIALS SCIENCE-TRANSFORMATION OF SOLIDS"
        }
    },
    {
        "data": {
            "description": "The basic structures and resulting properties of solid materials, including phase equilibria, meta-stability, mechanical properties, failure, corrosion, and materials selection.",
            "id": "MS&E 350",
            "parent": "MS&E",
            "title": "INTRODUCTION TO MATERIALS SCIENCE"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "COMPSCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "EMA",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ME",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MS&E",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "MS&E 350"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 109"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 115",
            "target": "MS&E 351"
        }
    },
    {
        "data": {
            "source": "COMPSCI 310",
            "target": "ME 331"
        }
    },
    {
        "data": {
            "source": "EMA 201",
            "target": "EMA 303"
        }
    },
    {
        "data": {
            "source": "EMA 201",
            "target": "ME 306"
        }
    },
    {
        "data": {
            "source": "EMA 303",
            "target": "ME 449"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 213"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 213",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 222"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "COMPSCI 310"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "EMA 201"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "EMA 303"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "ME 306"
        }
    },
    {
        "data": {
            "source": "ME 231",
            "target": "ME 311"
        }
    },
    {
        "data": {
            "source": "ME 231",
            "target": "ME 331"
        }
    },
    {
        "data": {
            "source": "ME 306",
            "target": "ME 449"
        }
    },
    {
        "data": {
            "source": "ME 311",
            "target": "ME 449"
        }
    },
    {
        "data": {
            "source": "ME 313",
            "target": "ME 449"
        }
    },
    {
        "data": {
            "source": "ME 331",
            "target": "ME 449"
        }
    },
    {
        "data": {
            "source": "MS&E 350",
            "target": "ME 311"
        }
    },
    {
        "data": {
            "source": "MS&E 350",
            "target": "ME 313"
        }
    },
    {
        "data": {
            "source": "MS&E 350",
            "target": "MS&E 351"
        }
    },
    {
        "data": {
            "source": "MS&E 350",
            "target": "MS&E 352"
        }
    },
    {
        "data": {
            "source": "MS&E 351",
            "target": "MS&E 350"
        }
    },
    {
        "data": {
            "source": "MS&E 352",
            "target": "ME 313"
        }
    }
]