[
    {
        "data": {
            "description": "A quantitative and qualitative study of manufacturing processes including machining, extrusion, sheet metal forming, welding, and casting for metals; and additive manufacturing, extrusion, injection molding, thermoforming and blow molding for plastics. Emphasis on process selection for optimum design. Laboratory experiments and demonstrations. Quality, strength, and economic evaluations.",
            "id": "ME 313",
            "parent": "ME",
            "title": "MANUFACTURING PROCESSES"
        }
    },
    {
        "data": {
            "source": "EMA 201",
            "target": "ME 306"
        }
    },
    {
        "data": {
            "source": "ME 310",
            "target": "ME 514"
        }
    },
    {
        "data": {
            "description": "Stress and strain, torsion, bending of beams, shearing stresses in beams, compound stresses, principal stresses, deflections of beams, statically indeterminate members, columns.",
            "id": "ME 306",
            "parent": "ME",
            "title": "MECHANICS OF MATERIALS"
        }
    },
    {
        "data": {
            "source": "MS&E 350",
            "target": "ME 313"
        }
    },
    {
        "data": {
            "description": "The basic structures and resulting properties of solid materials, including phase equilibria, meta-stability, mechanical properties, failure, corrosion, and materials selection.",
            "id": "MS&E 350",
            "parent": "MS&E",
            "title": "INTRODUCTION TO MATERIALS SCIENCE"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "EMA 201"
        }
    },
    {
        "data": {
            "description": "Principles of mechanics, force systems, equilibrium, structures, distributed forces, moments of inertia of areas, and friction.",
            "id": "EMA 201",
            "parent": "EMA",
            "title": "STATICS"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 213"
        }
    },
    {
        "data": {
            "source": "ME 313",
            "target": "ME 514"
        }
    },
    {
        "data": {
            "source": "CHEM 115",
            "target": "MS&E 351"
        }
    },
    {
        "data": {
            "source": "ME 306",
            "target": "ME 313"
        }
    },
    {
        "data": {
            "source": "ME 306",
            "target": "ME 310"
        }
    },
    {
        "data": {
            "description": "Introduction to all important aspects of polymer processing and engineering including polymeric materials, material properties, design and manufacturing considerations, processing methods, part performance, post-consumer recycling and upcycling, societal responsibilities and ethics, and various techniques for modeling in materials processing like dimensional analysis, design of experiments, analytical solutions, and computer simulation.",
            "id": "ME 310",
            "parent": "ME",
            "title": "MANUFACTURING: POLYMER PROCESSING AND ENGINEERING"
        }
    },
    {
        "data": {
            "source": "ME 231",
            "target": "ME 310"
        }
    },
    {
        "data": {
            "source": "MS&E 351",
            "target": "MS&E 350"
        }
    },
    {
        "data": {
            "description": "Explores a detailed atomic and molecular view of matter and its interactions, with a specific focus on quantum theory, molecular structure, and chemical bonding. Application required for enrollment.",
            "id": "CHEM 115",
            "parent": "CHEM",
            "title": "CHEMICAL PRINCIPLES I"
        }
    },
    {
        "data": {
            "source": "CHEM 115",
            "target": "MS&E 350"
        }
    },
    {
        "data": {
            "description": "Techniques of integration, improper integrals, first order ordinary differential equations, sequences and series, Taylor series, vector geometry in two and three dimensions.",
            "id": "MATH 222",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 2"
        }
    },
    {
        "data": {
            "id": "EMA",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MS&E",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "First order differential equations, introduction to multivariable calculus and constrained optimization, infinite sequences and series, methods of approximation, and a brief introduction to probability. Models and applications from business and the social sciences.",
            "id": "MATH 213",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 2"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "MS&E 350",
            "target": "MS&E 351"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "ME 306"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 222"
        }
    },
    {
        "data": {
            "description": "Introduction to: atomic, electronic, and defect structures in materials; diffusional, mechanical and electrical properties of materials; and the role of structure and defects in diffusional, mechanical, and electrical properties.",
            "id": "MS&E 351",
            "parent": "MS&E",
            "title": "MATERIALS SCIENCE-STRUCTURE AND PROPERTY RELATIONS IN SOLIDS"
        }
    },
    {
        "data": {
            "description": "A quantitative and qualitative study of additive manufacturing processes. Emphasis on proper additive manufacturing technique selection for optimized final product design and properties, as well as presentation of emerging additive manufacturing techniques.",
            "id": "ME 514",
            "parent": "ME",
            "title": "POLYMER ADDITIVE MANUFACTURING"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "source": "MATH 213",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "description": "Introduction to basic methods and fundamental concepts in geometric description and modeling of mechanical form, components, and assemblies. Topics include elements of descriptive geometry, engineering drawing standards, introduction to computer modeling, and geometric dimensioning and tolerancing (GDT). Lectures are reinforced by the laboratory experience where students operate modern commercial computer-aided design systems to model and to learn the basics of engineering communication, specification, and annotation.",
            "id": "ME 231",
            "parent": "ME",
            "title": "GEOMETRIC MODELING FOR DESIGN AND MANUFACTURING"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "id": "ME",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    }
]