[
    {
        "data": {
            "id": "MEDSC-M",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Identify the roles of physicians, interdisciplinary providers, health care systems, and communities in screening, treating, and preventing common, chronic conditions. Activities are centered on health promotion, outpatient-based chronic disease management, and community health. Clinical experiences will occur in primary care, behavioral health, and other ambulatory and community-based settings that focus on chronic disease management.",
            "id": "MEDSC-M 811",
            "parent": "MEDSC-M",
            "title": "CHRONIC AND PREVENTIVE CARE"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "MEDHIST 742"
        }
    },
    {
        "data": {
            "id": "MEDHIST",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 811",
            "target": "MEDHIST 742"
        }
    },
    {
        "data": {
            "description": "Care of adults and children undergoing an operation or procedure, including perioperative preparation, operative care, and post-operative cares for core clinical conditions in the specialties of anesthesia, neurosurgery, ophthalmology, general surgery, otolaryngology, urology, cardiothoracic surgery, peripheral vascular surgery, orthopedics, plastic and reconstructive surgery, and gynecology, as well as interventional radiology, procedural cardiology and gastroenterology. Basic science concepts include cerebral spinal fluid production and flow, fluids and electrolytes, consciousness, inflammation and wound healing, and cancer biology. Anatomic approach using case discussions, podcasts, curated independent reading, online nationally supported modules, and simulation skills. Longitudinal patient care experience integrating communication, evidence based medicine, health information technology, quality improvement  patient safety, professionalism, scientific inquiry, and public health.",
            "id": "MEDSC-M 813",
            "parent": "MEDSC-M",
            "title": "SURGICAL AND PROCEDURAL CARE"
        }
    },
    {
        "data": {
            "description": "Understand and analyze the U.S. health care system through the lens of ethical criticisms made by and on behalf of the diverse populations it serves. Gain understanding of philosophical debates over universal health insurance coverage, fair health care financing, effective cost-containment, and rationing. Hone the craft of constructing ethical arguments, and foreseeing and responding to potential objections.",
            "id": "MEDHIST 742",
            "parent": "MEDHIST",
            "title": "ETHICS AND U.S. HEALTH CARE POLICY"
        }
    }
]