[
    {
        "data": {
            "description": "Focus on assessing patients with urgent medical conditions, providing acute inpatient care, and transitioning patients to other care settings or home under the care of other professionals. Provide acute care in inpatient and outpatient urgent care settings as well as on the inpatient wards, and develop acute management plans and subsequent transition of care plans. Clinical experiences in acute care settings such as the emergency department and inpatient medicine (both general and subspecialty), psychiatry, and neurology. Builds upon fundamental science concepts introduced in Body in Balance and Mind and Motion, including Ohm's Law, acid-base balance, and volume regulation. Organ system-based approach employing varied modalities. Complete an integrated patient-centered experience by participating in the care of a patient from an urgent admission through inpatient treatment and discharge.",
            "id": "MEDSC-M 812",
            "parent": "MEDSC-M",
            "title": "ACUTE CARE"
        }
    },
    {
        "data": {
            "description": "As an inpatient medicine acting intern (AI), you will have primary responsibility for patients actionable in four domains: 1. Management: As an AI, you will develop actionable management and treatment plans based on your history, physical exam and targeted data. 2. Communication: AIs will communicate with colleagues, primary care providers and consultants. AIs will demonstrate thorough patient hand-offs and write concise discharge summaries that will be integral to patient care. 3. Learning: Patient care issues will be the central guide for learning, directing reading, consultation and research. AIs will formulate questions based upon clinical dilemmas, research the appropriate literature and databases to find the answers, and apply findings to the care of individual patients. 4. Organization: As the primary inpatient provider for patients, AIs will develop efficiency in accomplishing the day to day tasks necessary for the coordination and management of patient care.",
            "id": "MEDICINE 938",
            "parent": "MEDICINE",
            "title": "INPATIENT ACTING INTERNSHIP-INTERNAL MEDICINE"
        }
    },
    {
        "data": {
            "description": "Care of adults and children undergoing an operation or procedure, including perioperative preparation, operative care, and post-operative cares for core clinical conditions in the specialties of anesthesia, neurosurgery, ophthalmology, general surgery, otolaryngology, urology, cardiothoracic surgery, peripheral vascular surgery, orthopedics, plastic and reconstructive surgery, and gynecology, as well as interventional radiology, procedural cardiology and gastroenterology. Basic science concepts include cerebral spinal fluid production and flow, fluids and electrolytes, consciousness, inflammation and wound healing, and cancer biology. Anatomic approach using case discussions, podcasts, curated independent reading, online nationally supported modules, and simulation skills. Longitudinal patient care experience integrating communication, evidence based medicine, health information technology, quality improvement  patient safety, professionalism, scientific inquiry, and public health.",
            "id": "MEDSC-M 813",
            "parent": "MEDSC-M",
            "title": "SURGICAL AND PROCEDURAL CARE"
        }
    },
    {
        "data": {
            "id": "MEDICINE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MEDSC-M",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 812",
            "target": "MEDICINE 938"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "MEDICINE 938"
        }
    }
]