[
    {
        "data": {
            "source": "POPHLTH/SOC 797",
            "target": "MEDICINE/NURSING/POPHLTH 705"
        }
    },
    {
        "data": {
            "source": "BMI/STAT 542",
            "target": "MEDICINE/NURSING/POPHLTH 705"
        }
    },
    {
        "data": {
            "description": "Designed for population health researcher. Topics include descriptive statistics, elementary probability, probability distributions, one- and two-sample normal inference (point estimation, hypothesis testing, confidence intervals), power and sample size calculations, one- and two-sample binomial inference, underlying assumptions and diagnostic work.",
            "id": "BMI/POPHLTH 551",
            "title": "INTRODUCTION TO BIOSTATISTICS FOR POPULATION HEALTH"
        }
    },
    {
        "data": {
            "source": "BMI/POPHLTH 551",
            "target": "BMI/STAT 541"
        }
    },
    {
        "data": {
            "description": "Exploration of interdisciplinary clinical research questions including strategies for assessing the evidence and methodology for conducting various types of literature reviews. Emphasizes an interdisciplinary perspective.",
            "id": "MEDICINE/NURSING/POPHLTH 705",
            "title": "SEMINAR IN INTERDISCIPLINARY CLINICAL RESEARCH EVIDENCE"
        }
    },
    {
        "data": {
            "description": "Design, implementation and interpretation of epidemiologic studies; emphasis on methodologic problems in the measurement of disease frequency, natural history and risk factors.",
            "id": "POPHLTH/SOC 797",
            "title": "INTRODUCTION TO EPIDEMIOLOGY"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "BMI/STAT 541",
            "target": "BMI/STAT 542"
        }
    },
    {
        "data": {
            "description": "Course designed for the biomedical researcher. Topics include: descriptive statistics, hypothesis testing, estimation, confidence intervals, t-tests, chi-squared tests, analysis of variance, linear regression, correlation, nonparametric tests, survival analysis and odds ratio. Biomedical applications used for each topic.",
            "id": "BMI/STAT 541",
            "title": "INTRODUCTION TO BIOSTATISTICS"
        }
    },
    {
        "data": {
            "description": "Intended for biomedical researchers interested in the design and analysis of clinical trials. Topics include definition of hypotheses, measures of effectiveness, sample size, randomization, data collection and monitoring, and issues in statistical analysis.",
            "id": "BMI/STAT 542",
            "title": "INTRODUCTION TO CLINICAL TRIALS I"
        }
    }
]