[
    {
        "data": {
            "id": "MEDICINE",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 811",
            "target": "MEDICINE 914"
        }
    },
    {
        "data": {
            "id": "MEDSC-M",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Identify the roles of physicians, interdisciplinary providers, health care systems, and communities in screening, treating, and preventing common, chronic conditions. Activities are centered on health promotion, outpatient-based chronic disease management, and community health. Clinical experiences will occur in primary care, behavioral health, and other ambulatory and community-based settings that focus on chronic disease management.",
            "id": "MEDSC-M 811",
            "parent": "MEDSC-M",
            "title": "CHRONIC AND PREVENTIVE CARE"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 812",
            "target": "MEDICINE 914"
        }
    },
    {
        "data": {
            "description": "The main concepts and challenges in medical data gathering and analysis. Identification of aspects of data gathering and measurement, including emerging data sources. Informatics concepts used in population health. Use of a self-reporting tools in an electronic health record to answer population health questions, including those surrounding health equity. Formulation of a population medicine-based clinical question, and development of a reporting strategy to answer the question. Communication of a population medicine issue, including a potential path for improvement and a description of the measurement of any impact of proposed change.",
            "id": "MEDICINE 914",
            "parent": "MEDICINE",
            "title": "DATA ANALYTICS FOR POPULATION HEALTH"
        }
    },
    {
        "data": {
            "description": "Focus on assessing patients with urgent medical conditions, providing acute inpatient care, and transitioning patients to other care settings or home under the care of other professionals. Provide acute care in inpatient and outpatient urgent care settings as well as on the inpatient wards, and develop acute management plans and subsequent transition of care plans. Clinical experiences in acute care settings such as the emergency department and inpatient medicine (both general and subspecialty), psychiatry, and neurology. Builds upon fundamental science concepts introduced in Body in Balance and Mind and Motion, including Ohm's Law, acid-base balance, and volume regulation. Organ system-based approach employing varied modalities. Complete an integrated patient-centered experience by participating in the care of a patient from an urgent admission through inpatient treatment and discharge.",
            "id": "MEDSC-M 812",
            "parent": "MEDSC-M",
            "title": "ACUTE CARE"
        }
    }
]