[
    {
        "data": {
            "description": "Solve critical business challenges. Drawing on and integrating the MBA core curriculum, conduct an in-depth analysis and make recommendations on a strategic problem posed by the sponsor company.",
            "id": "GENBUS 725",
            "parent": "GENBUS",
            "title": "CONSULTING PRACTICUM"
        }
    },
    {
        "data": {
            "id": "FINANCE",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "MHR 705",
            "target": "MHR 776"
        }
    },
    {
        "data": {
            "source": "GENBUS 704",
            "target": "GENBUS 725"
        }
    },
    {
        "data": {
            "id": "MHR",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "FINANCE 700",
            "target": "GENBUS 725"
        }
    },
    {
        "data": {
            "description": "Conduct research, apply strategic human resources knowledge, and complete a capstone project for a local client organization, addressing a human resources business challenge or need.",
            "id": "MHR 776",
            "parent": "MHR",
            "title": "STRATEGIC HUMAN RESOURCE MANAGEMENT CAPSTONE"
        }
    },
    {
        "data": {
            "description": "Exploration of statistical inference and data analytics tools. Review of relevant foundations of statistics, machine learning and probability theory. Emphasis on applying the resulting concepts to canonical business examples, using both Excel and R.",
            "id": "GENBUS 704",
            "parent": "GENBUS",
            "title": "DATA TO DECISIONS"
        }
    },
    {
        "data": {
            "description": "Two broad substantive areas are covered. (1) Evidence (theoretical and empirical) reviewed on the determinants of employee job attitudes and behavior. For example, the impact of compensation on employee satisfaction and performance. (2) Functional activities of personnel management and their impact on employee behavior evaluated. Sample topics: Selection, development, evaluation and compensation. Knowledge of Statistics strongly encouraged such asSTAT 301.",
            "id": "MHR 705",
            "parent": "MHR",
            "title": "HUMAN RESOURCE MANAGEMENT"
        }
    },
    {
        "data": {
            "source": "GENBUS 725",
            "target": "MHR 776"
        }
    },
    {
        "data": {
            "id": "GENBUS",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Introduction to financial management of firms and investment decision making; both theory and practice are emphasized. Topics covered include the financial environment and securities markets, financial statements and analysis, working capital management and capital budgeting, cost of capital, dividend policy, asset valuation, investments, decision making under uncertainty and selected topics such as mergers, options, futures.",
            "id": "FINANCE 700",
            "parent": "FINANCE",
            "title": "INTRODUCTION TO FINANCIAL MANAGEMENT"
        }
    }
]