[
    {
        "data": {
            "description": "Conduct research, apply strategic human resources knowledge, and complete a capstone project for a local client organization, addressing a human resources business challenge or need.",
            "id": "MHR 776",
            "parent": "MHR",
            "title": "STRATEGIC HUMAN RESOURCE MANAGEMENT CAPSTONE"
        }
    },
    {
        "data": {
            "description": "Exploration of statistical inference and data analytics tools. Review of relevant foundations of statistics, machine learning and probability theory. Emphasis on applying the resulting concepts to canonical business examples, using both Excel and R.",
            "id": "GENBUS 704",
            "parent": "GENBUS",
            "title": "DATA TO DECISIONS"
        }
    },
    {
        "data": {
            "description": "Provides a framework for evaluating marketing problems and developing a marketing strategy. Customer, competitor, and collaborator factors are emphasized as foundations for marketing decision-making. Examines the key aspects of product, pricing, distribution, and promotion strategy.",
            "id": "MARKETNG 700",
            "parent": "MARKETNG",
            "title": "MARKETING MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Solve critical business challenges. Drawing on and integrating the MBA core curriculum, conduct an in-depth analysis and make recommendations on a strategic problem posed by the sponsor company.",
            "id": "GENBUS 725",
            "parent": "GENBUS",
            "title": "CONSULTING PRACTICUM"
        }
    },
    {
        "data": {
            "description": "Two broad substantive areas are covered. (1) Evidence (theoretical and empirical) reviewed on the determinants of employee job attitudes and behavior. For example, the impact of compensation on employee satisfaction and performance. (2) Functional activities of personnel management and their impact on employee behavior evaluated. Sample topics: Selection, development, evaluation and compensation. Knowledge of Statistics strongly encouraged such asSTAT 301.",
            "id": "MHR 705",
            "parent": "MHR",
            "title": "HUMAN RESOURCE MANAGEMENT"
        }
    },
    {
        "data": {
            "id": "GENBUS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MARKETNG",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MHR",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "GENBUS 704",
            "target": "GENBUS 725"
        }
    },
    {
        "data": {
            "source": "GENBUS 725",
            "target": "MHR 776"
        }
    },
    {
        "data": {
            "source": "MARKETNG 700",
            "target": "GENBUS 725"
        }
    },
    {
        "data": {
            "source": "MHR 705",
            "target": "MHR 776"
        }
    }
]