[
    {
        "data": {
            "description": "Advanced concepts and methods for the use of x-ray scattering, diffraction, and spectroscopy in materials science and engineering. Underpinning fundamental mathematical and scattering concepts, including kinematic and dynamical diffraction, diffuse scattering, and optical coherence in x-ray scattering. Practical aspects of experiments at synchrotron light sources and free electron lasers. Applications, including structure of metals and ceramics, polymeric materials, thin films and nanostructures, and magnetic materials.",
            "id": "MS&E 648",
            "parent": "MS&E",
            "title": "ADVANCED X-RAY SCATTERING METHODS IN MATERIALS SCIENCE AND ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Crystal symmetry, projection methods, X-ray studies of structural problems in the solid state.",
            "id": "MS&E 448",
            "parent": "MS&E",
            "title": "CRYSTALLOGRAPHY AND X-RAY DIFFRACTION"
        }
    },
    {
        "data": {
            "description": "Introduction to: atomic, electronic, and defect structures in materials; diffusional, mechanical and electrical properties of materials; and the role of structure and defects in diffusional, mechanical, and electrical properties.",
            "id": "MS&E 351",
            "parent": "MS&E",
            "title": "MATERIALS SCIENCE-STRUCTURE AND PROPERTY RELATIONS IN SOLIDS"
        }
    },
    {
        "data": {
            "description": "The basic structures and resulting properties of solid materials, including phase equilibria, meta-stability, mechanical properties, failure, corrosion, and materials selection.",
            "id": "MS&E 350",
            "parent": "MS&E",
            "title": "INTRODUCTION TO MATERIALS SCIENCE"
        }
    },
    {
        "data": {
            "id": "MS&E",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "MS&E 350",
            "target": "MS&E 351"
        }
    },
    {
        "data": {
            "source": "MS&E 350",
            "target": "MS&E 448"
        }
    },
    {
        "data": {
            "source": "MS&E 351",
            "target": "MS&E 350"
        }
    },
    {
        "data": {
            "source": "MS&E 351",
            "target": "MS&E 351"
        }
    },
    {
        "data": {
            "source": "MS&E 448",
            "target": "MS&E 648"
        }
    }
]