[
    {
        "data": {
            "source": "MS&E 351",
            "target": "MS&E 360"
        }
    },
    {
        "data": {
            "source": "MS&E 361",
            "target": "MS&E 362"
        }
    },
    {
        "data": {
            "source": "MS&E 360",
            "target": "MS&E 361"
        }
    },
    {
        "data": {
            "description": "The basic structures and resulting properties of solid materials, including phase equilibria, meta-stability, mechanical properties, failure, corrosion, and materials selection.",
            "id": "MS&E 350",
            "parent": "MS&E",
            "title": "INTRODUCTION TO MATERIALS SCIENCE"
        }
    },
    {
        "data": {
            "description": "Experimental principles of materials science. Thermal, kinetic, structural, and materials synthesis experiments and associated concepts, data analysis, and presentation.",
            "id": "MS&E 361",
            "parent": "MS&E",
            "title": "KINETICS & THERMODYNAMICS LAB"
        }
    },
    {
        "data": {
            "source": "MS&E 362",
            "target": "MS&E 470"
        }
    },
    {
        "data": {
            "source": "CHEM 115",
            "target": "MS&E 351"
        }
    },
    {
        "data": {
            "source": "MS&E 351",
            "target": "MS&E 350"
        }
    },
    {
        "data": {
            "source": "MS&E 352",
            "target": "MS&E 470"
        }
    },
    {
        "data": {
            "description": "Explores a detailed atomic and molecular view of matter and its interactions, with a specific focus on quantum theory, molecular structure, and chemical bonding. Application required for enrollment.",
            "id": "CHEM 115",
            "parent": "CHEM",
            "title": "CHEMICAL PRINCIPLES I"
        }
    },
    {
        "data": {
            "description": "Laboratory instruction in sample preparation for and applications of quantitative microscopy, x-ray diffraction, and properties measurement in the context of structure-property relationships in materials.",
            "id": "MS&E 360",
            "parent": "MS&E",
            "title": "STRUCTURES & PHASES LAB"
        }
    },
    {
        "data": {
            "source": "CHEM 115",
            "target": "MS&E 350"
        }
    },
    {
        "data": {
            "description": "The basic factors that determine phase equilibria, structural and transformation characteristics of solids. Principles governing the thermodynamics and kinetics of phase transformations and microstructure evolution. Nucleation and growth processes in precipitation, recrystallization, solidification, oxidation, martensitic, ordering and spinodal reactions. Transformation behavior in polymers, biomaterials and nanomaterials.",
            "id": "MS&E 352",
            "parent": "MS&E",
            "title": "MATERIALS SCIENCE-TRANSFORMATION OF SOLIDS"
        }
    },
    {
        "data": {
            "id": "MS&E",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "MS&E 350",
            "target": "MS&E 351"
        }
    },
    {
        "data": {
            "description": "Introduction to: atomic, electronic, and defect structures in materials; diffusional, mechanical and electrical properties of materials; and the role of structure and defects in diffusional, mechanical, and electrical properties.",
            "id": "MS&E 351",
            "parent": "MS&E",
            "title": "MATERIALS SCIENCE-STRUCTURE AND PROPERTY RELATIONS IN SOLIDS"
        }
    },
    {
        "data": {
            "description": "Experiments in the mechanical and electronic properties of matter in bulk and thin films; computer instrument control; and data analysis.",
            "id": "MS&E 362",
            "parent": "MS&E",
            "title": "SYNTHESIS & CHARACTERIZATION LAB"
        }
    },
    {
        "data": {
            "source": "MS&E 350",
            "target": "MS&E 360"
        }
    },
    {
        "data": {
            "description": "Capstone experiences in materials design, selection, and application.  Emphasis on creativity and application of fundamental principles of public identification, experimental design, data acquisition and analysis, and presentation of results.",
            "id": "MS&E 470",
            "parent": "MS&E",
            "title": "CAPSTONE PROJECT I"
        }
    },
    {
        "data": {
            "source": "MS&E 351",
            "target": "MS&E 361"
        }
    },
    {
        "data": {
            "source": "MS&E 350",
            "target": "MS&E 352"
        }
    }
]