[
    {
        "data": {
            "source": "MUSIC 122",
            "target": "MUSIC 172"
        }
    },
    {
        "data": {
            "source": "MUSIC 121",
            "target": "MUSIC 122"
        }
    },
    {
        "data": {
            "id": "MUSIC",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Intoductory istruction in aural skills.",
            "id": "MUSIC 171",
            "parent": "MUSIC",
            "title": "MUSICA PRACTICA: AURAL SKILLS 1"
        }
    },
    {
        "data": {
            "description": "Introduction to the applied theory of functional tonal and modal jazz harmony; analysis of song forms from the standard jazz repertoire; study of reharmonization techniques, chord substitution, and types of chord voicings; principles of melodic writing and motivic development, jazz counterpoint, and voice-leading considerations; and writing for common instruments in jazz ensembles. Students will analyze compositions from the standard jazz repertoire and apply the principles studied to create their own compositions for small jazz ensemble.",
            "id": "MUSIC 229",
            "parent": "MUSIC",
            "title": "JAZZ THEORY & COMPOSITION"
        }
    },
    {
        "data": {
            "source": "MUSIC 121",
            "target": "MUSIC 171"
        }
    },
    {
        "data": {
            "source": "MUSIC 172",
            "target": "MUSIC 122"
        }
    },
    {
        "data": {
            "source": "MUSIC 171",
            "target": "MUSIC 122"
        }
    },
    {
        "data": {
            "source": "MUSIC 229",
            "target": "MUSIC 329"
        }
    },
    {
        "data": {
            "description": "Survey of standard musical techniques and devices for arranging lead-sheet-based jazz compositions for medium and large jazz ensembles through score study, musical exercises, and arranging projects for live ensembles. Topics include jazz counterpoint and melody writing; preparing arrangements through outlines and condensed scores; chord substitutions and reharmonization; ranges, timbres, notational and technical considerations of standard jazz instruments; motivic development; voicing techniques, including mechanical, spreads, upper structure triads, and voicings in 4ths, 5ths and clusters; and orchestration techniques, including couplings and concerted writing.",
            "id": "MUSIC 329",
            "parent": "MUSIC",
            "title": "JAZZ ARRANGING"
        }
    },
    {
        "data": {
            "description": "Strategies for composing, understanding, and writing about music.",
            "id": "MUSIC 121",
            "parent": "MUSIC",
            "title": "MUSICA PRACTICA 1"
        }
    },
    {
        "data": {
            "source": "MUSIC 122",
            "target": "MUSIC 229"
        }
    },
    {
        "data": {
            "source": "MUSIC 172",
            "target": "MUSIC 229"
        }
    },
    {
        "data": {
            "description": "Continuation of introductory instruction in aural skills.",
            "id": "MUSIC 172",
            "parent": "MUSIC",
            "title": "MUSICA PRACTICA: AURAL SKILLS 2"
        }
    },
    {
        "data": {
            "source": "MUSIC 171",
            "target": "MUSIC 172"
        }
    },
    {
        "data": {
            "description": "Continuation of strategies for composing, understanding, and writing about music.",
            "id": "MUSIC 122",
            "parent": "MUSIC",
            "title": "MUSICA PRACTICA 2"
        }
    }
]