[
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics and selected topics in Animal Physiology.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "PSYCH 454"
        }
    },
    {
        "data": {
            "description": "General biological principles. Topics include: evolution, ecology, animal behavior, cell structure and function, genetics and molecular genetics and the physiology of a variety of organ systems emphasizing function in humans.",
            "id": "BIOLOGY/ZOOLOGY 101",
            "title": "ANIMAL BIOLOGY"
        }
    },
    {
        "data": {
            "id": "PSYCH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "NTP",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Sleep occupies a third of our life, is found in all animal species carefully studied so far, and loss of sleep has both acute and long- term negative consequences on the brain and the body. Still, why we sleep remains unclear, and hypotheses on the role of sleep for synaptic homeostasis, learning and memory are being tested. Focuses on the neurobiology of sleep, with detailed review of the brain structures involved in controlling wake and sleep, as well as the circadian and homeostatic regulation of sleep. Other topics include changes in sleep need with age, animal models to study sleep, sleep disorders, and genetics of sleep.",
            "id": "NTP 677",
            "parent": "NTP",
            "title": "BASIC SLEEP MECHANISMS AND SLEEP DISORDERS: FROM NEUROBIOLOGY TO SLEEP MEDICINE"
        }
    },
    {
        "data": {
            "source": "PSYCH 202",
            "target": "PSYCH 454"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "PSYCH 454"
        }
    },
    {
        "data": {
            "description": "Basic mechanisms in cellular neurophysiology: electrophysiology and chemistry of nerve signals, mechanisms in integration, simple nervous pathways and their behavioral correlates.",
            "id": "PSYCH/ZOOLOGY 523",
            "title": "NEUROBIOLOGY"
        }
    },
    {
        "data": {
            "description": "Biological basis of human and animal behaviors, including perception, action, cognition, social interaction and disease. Weekly themes from \"Cracking the Neural Code\" to \"Love and War\". Learn, develop and use neural mechanisms to explain and (attempt to) predict what they and others think and do in all facets of life.",
            "id": "PSYCH 454",
            "parent": "PSYCH",
            "title": "BEHAVIORAL NEUROSCIENCE"
        }
    },
    {
        "data": {
            "source": "PSYCH 454",
            "target": "NTP 677"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "PSYCH/ZOOLOGY 523"
        }
    },
    {
        "data": {
            "description": "Behavior, including its development, motivation, frustrations, emotion, intelligence, learning, forgetting, personality, language, thinking, and social behavior.",
            "id": "PSYCH 202",
            "parent": "PSYCH",
            "title": "INTRODUCTION TO PSYCHOLOGY"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 151"
        }
    },
    {
        "data": {
            "source": "PSYCH/ZOOLOGY 523",
            "target": "NTP 677"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "PSYCH/ZOOLOGY 523"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 101"
        }
    }
]