[
    {
        "data": {
            "description": "Focuses on advancing knowledge of professional attributes and core competencies in the role of a nurse and how they are used in complex care settings. Gain an understanding of concepts of leadership, ethics, and advocacy. Broaden your understanding of nursing's role in the health care delivery system regarding quality improvement, care coordination, and palliation.",
            "id": "NURSING 325",
            "parent": "NURSING",
            "title": "PROFESSIONALISM IN HEALTH CARE SETTINGS"
        }
    },
    {
        "data": {
            "description": "Builds on health and illness concepts by focusing on individuals, families, and communities recognizing their unique attributes. Concepts included: acid-base balance, cellular regulation, intracranial regulation, genomics, sexuality and reproduction, and an introduction to the organization of the community/public health system. Other core nursing concepts are revisited as they apply to the community as client or in complex care situations. The nursing process frames learning activities that foster understanding the nursing role in providing evidence-based care to individuals, families across the lifespan, and to communities experiencing related health and illness concerns in collaboration with an interprofessional team.",
            "id": "NURSING 434",
            "parent": "NURSING",
            "title": "HEALTH AND ILLNESS CONCEPTS WITH INDIVIDUALS, FAMILIES, AND COMMUNITIES"
        }
    },
    {
        "data": {
            "description": "Designed to develop skills in using evidence to improve nursing practice. Learn strategies to evaluate the quality of evidence and effectively integrate evidence into nursing practice. Learn how practice guidelines are developed, interpreted, and implemented in complex care settings. Learn the significance of engaging partners in evidence-based practice and identify processes to partner with others.",
            "id": "NURSING 435",
            "parent": "NURSING",
            "title": "EVIDENCE-BASED PRACTICE"
        }
    },
    {
        "data": {
            "description": "Focuses on foundational concepts necessary to provide person-centered, evidence-based nursing care, including the nursing process and health and illness concepts. Active learning is emphasized by gaining confidence with applying the nursing processes and begin to develop clinical judgment and assessment skills. Complements a companion experiential course [NURSING 316].",
            "id": "NURSING 313",
            "parent": "NURSING",
            "title": "FOUNDATIONS OF NURSING PRACTICE"
        }
    },
    {
        "data": {
            "description": "Focuses on health and illness concepts emphasizing care to individuals and families across the lifespan. Gain a fundamental understanding of allostasis, oxygenation and hemostasis, and protection and movement. Gain knowledge of these concepts through exemplars that illustrate common health processes and/or alterations. Frames learning activities that foster understanding of the nursing role in providing care to individuals and families experiencing related health and illness concerns.",
            "id": "NURSING 323",
            "parent": "NURSING",
            "title": "HEALTH AND ILLNESS CONCEPTS WITH INDIVIDUALS AND FAMILIES"
        }
    },
    {
        "data": {
            "description": "Focuses on professional nursing attributes and interactions essential to professional competence. Study concepts that allow for providing care unique to an individual, family, community, and systems, and to the context in which they live. Concepts related to the health care delivery system are included to provide a foundation for beginning nursing practice. Knowledge from sciences, social studies, and humanities education is integrated into nursing practice and builds foundational knowledge of the science of nursing.",
            "id": "NURSING 315",
            "parent": "NURSING",
            "title": "PROFESSIONALISM IN NURSING PRACTICE"
        }
    },
    {
        "data": {
            "description": "Focuses on the role of the baccalaureate generalist nurse in health promotion and disease prevention across the lifespan. Learn about factors that impact health of individuals and families. Active learning is emphasized through applying the nursing process to concepts such as health determinants, health education, self- management, and innate psychological needs related to well-being.",
            "id": "NURSING 314",
            "parent": "NURSING",
            "title": "HEALTH PROMOTION AND DISEASE PREVENTION ACROSS THE LIFESPAN"
        }
    },
    {
        "data": {
            "description": "Integration of learning acquired throughout the nursing program. Learning outcomes integrate concepts associated with five nursing program meta concepts (professionalism; person, family, community, and systems-centered care; health and illness; health care context; and scholarship for evidence-based practice). Using processes of analysis, synthesis, reflection, and application, advance in your transition to becoming a professional nurse. Includes mentoring through co- facilitation by faculty, academic staff, and practice professionals.",
            "id": "NURSING 445",
            "parent": "NURSING",
            "title": "TRANSFORMATIVE NURSING CAPSTONE"
        }
    },
    {
        "data": {
            "description": "Learn principles and practices of social justice related to nursing and health in local and global settings. Concepts include health determinants, diverse populations in complex care settings, health outcomes, and interventions for racial and other underrepresented minorities. Expand the understanding of global health by examining global health systems, health and illness concepts on a global level, partnerships enacted in global settings, and the scope of nursing practice in global health. Provides a facilitated forum to critically reflect on their socially constructed identities and the impact these identities have on health care systems. Designed to develop perspective related to global health and nurses as global health actors invested in improving health of the global population as a whole.",
            "id": "NURSING 437",
            "parent": "NURSING",
            "title": "SOCIAL JUSTICE IN LOCAL AND GLOBAL SETTINGS"
        }
    },
    {
        "data": {
            "description": "Prepares to meet the psychosocial health needs of individuals, families, and communities across the lifespan. Explore psychosocial concepts of stress, coping, mood, cognition, and behavior across the health-illness continuum and across practice settings. The human experience of psychosocial health needs is explored in the context of personal attributes, such as genetics, and interpersonal dynamics, such as family and community. Acquire the knowledge, attitudes, and skills needed to collaborate in the treatment and care of client psychosocial health needs.",
            "id": "NURSING 324",
            "parent": "NURSING",
            "title": "MEETING THE PSYCHOSOCIAL HEALTH NEEDS OF INDIVIDUALS, FAMILIES, AND COMMUNITIES"
        }
    },
    {
        "data": {
            "description": "Spend concentrated time in two settings focusing on care to individuals across the lifespan, families, and communities. The concept-based learning activities are aligned with those taught in the companion didactic courses and build on previous learning and experiences. Provide direct care from an evidenced-based perspective, at an increasingly independent level. The learning activities are guided by nursing preceptors in practice settings and by School of Nursing faculty in simulation and seminar settings.",
            "id": "NURSING 436",
            "parent": "NURSING",
            "title": "HEALTH AND ILLNESS CONCEPTS WITH INDIVIDUALS, FAMILIES, AND COMMUNITIES: EXPERIENTIAL LEARNING"
        }
    },
    {
        "data": {
            "id": "NURSING",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "NURSING 313",
            "target": "NURSING 323"
        }
    },
    {
        "data": {
            "source": "NURSING 314",
            "target": "NURSING 324"
        }
    },
    {
        "data": {
            "source": "NURSING 315",
            "target": "NURSING 325"
        }
    },
    {
        "data": {
            "source": "NURSING 315",
            "target": "NURSING 435"
        }
    },
    {
        "data": {
            "source": "NURSING 323",
            "target": "NURSING 434"
        }
    },
    {
        "data": {
            "source": "NURSING 323",
            "target": "NURSING 436"
        }
    },
    {
        "data": {
            "source": "NURSING 323",
            "target": "NURSING 437"
        }
    },
    {
        "data": {
            "source": "NURSING 324",
            "target": "NURSING 436"
        }
    },
    {
        "data": {
            "source": "NURSING 325",
            "target": "NURSING 435"
        }
    },
    {
        "data": {
            "source": "NURSING 434",
            "target": "NURSING 445"
        }
    },
    {
        "data": {
            "source": "NURSING 435",
            "target": "NURSING 445"
        }
    },
    {
        "data": {
            "source": "NURSING 436",
            "target": "NURSING 445"
        }
    },
    {
        "data": {
            "source": "NURSING 437",
            "target": "NURSING 445"
        }
    }
]