[
    {
        "data": {
            "description": "Advance students' knowledge of pediatric development to enhance clinical decision-making with emphasis on applying advanced assessment skills to the child and adolescent population.",
            "id": "NURSING 736",
            "parent": "NURSING",
            "title": "PEDIATRIC ASSESSMENT FOR MENTAL HEALTH ADVANCED PRACTICE NURSES"
        }
    },
    {
        "data": {
            "description": "Focuses on developing advanced practice competencies in health assessment as relevant to a selected specialty and practice setting. Become grounded in the theoretical perspectives, empirical documentation, and practice skills necessary for advanced biopsychosocial and physical assessment, critical diagnostic reasoning, clinical decision-making, and communication. Interactions of developmental, biopsychosocial, and cultural contexts resulting in health effects. Demonstrate capacity to provide a full spectrum of healthcare services including health promotion, disease prevention, health protection, anticipatory guidance, counseling, and disease management. Provides a foundation for the advanced practice nurse to evaluate and address the health of individuals.",
            "id": "NURSING 601",
            "parent": "NURSING",
            "title": "ADVANCED HEALTH ASSESSMENT"
        }
    },
    {
        "data": {
            "description": "Pharmacotherapeutics content and application for advanced practice nursing. Emphasis on selection of appropriate therapeutics, development of clinical decision-making skills, and examination of legal, ethical, and safety issues in prescribing medications.",
            "id": "NURSING/PHMPRAC 605",
            "title": "PHARMACOTHERAPEUTICS FOR ADVANCED PRACTICE NURSES"
        }
    },
    {
        "data": {
            "description": "Transition and expansion of leadership role for advanced practice.  Emphasis on the development of effective, ethical leadership styles; interpretation of legal and professional requirements and regulations; examination of the ethics, values, beliefs, and norms of decision-making in interdisciplinary, collaborative practice.",
            "id": "NURSING 704",
            "parent": "NURSING",
            "title": "LEADERSHIP IN ADVANCED PRACTICE NURSING I"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "NURSING",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "NURSING 601",
            "target": "NURSING 736"
        }
    },
    {
        "data": {
            "source": "NURSING 704",
            "target": "NURSING 601"
        }
    },
    {
        "data": {
            "source": "NURSING/PHMPRAC 605",
            "target": "NURSING 736"
        }
    }
]