[
    {
        "data": {
            "description": "Learn about complex health or health alterations and their management in regard to sexuality, reproduction, protection and movement, cognitive function, and maladaptive behavior. Emphasizes the nurse's role in management of complex health alterations within the health system, the community, and for transitions to home. The nursing process will frame learning activities that foster understanding the nursing role in providing evidence-based care to individuals, families, and communities experiencing related health and illness concerns in collaboration with an interprofessional team.",
            "id": "NURSING 443",
            "parent": "NURSING",
            "title": "ADVANCED CONCEPTS IN COMPLEX NURSING PRACTICE"
        }
    },
    {
        "data": {
            "description": "Builds on health and illness concepts by focusing on individuals, families, and communities recognizing their unique attributes. Concepts included: acid-base balance, cellular regulation, intracranial regulation, genomics, sexuality and reproduction, and an introduction to the organization of the community/public health system. Other core nursing concepts are revisited as they apply to the community as client or in complex care situations. The nursing process frames learning activities that foster understanding the nursing role in providing evidence-based care to individuals, families across the lifespan, and to communities experiencing related health and illness concerns in collaboration with an interprofessional team.",
            "id": "NURSING 434",
            "parent": "NURSING",
            "title": "HEALTH AND ILLNESS CONCEPTS WITH INDIVIDUALS, FAMILIES, AND COMMUNITIES"
        }
    },
    {
        "data": {
            "description": "Builds on psychomotor and assessment skills necessary to provide direct care to individuals and families across the lifespan. Develop clinical judgment, knowledge, communication skills, and professional behavior while providing nursing care that is safe, evidence-based, and patient centered. Experiential learning takes place in simulated and clinical settings.",
            "id": "NURSING 326",
            "parent": "NURSING",
            "title": "HEALTH AND ILLNESS CONCEPTS WITH INDIVIDUALS AND FAMILIES: EXPERIENTIAL LEARNING"
        }
    },
    {
        "data": {
            "description": "Focuses on foundational concepts necessary to provide person-centered, evidence-based nursing care, including the nursing process and health and illness concepts. Active learning is emphasized by gaining confidence with applying the nursing processes and begin to develop clinical judgment and assessment skills. Complements a companion experiential course [NURSING 316].",
            "id": "NURSING 313",
            "parent": "NURSING",
            "title": "FOUNDATIONS OF NURSING PRACTICE"
        }
    },
    {
        "data": {
            "description": "Focuses on health and illness concepts emphasizing care to individuals and families across the lifespan. Gain a fundamental understanding of allostasis, oxygenation and hemostasis, and protection and movement. Gain knowledge of these concepts through exemplars that illustrate common health processes and/or alterations. Frames learning activities that foster understanding of the nursing role in providing care to individuals and families experiencing related health and illness concerns.",
            "id": "NURSING 323",
            "parent": "NURSING",
            "title": "HEALTH AND ILLNESS CONCEPTS WITH INDIVIDUALS AND FAMILIES"
        }
    },
    {
        "data": {
            "description": "Focuses on the role of the baccalaureate generalist nurse in health promotion and disease prevention across the lifespan. Learn about factors that impact health of individuals and families. Active learning is emphasized through applying the nursing process to concepts such as health determinants, health education, self- management, and innate psychological needs related to well-being.",
            "id": "NURSING 314",
            "parent": "NURSING",
            "title": "HEALTH PROMOTION AND DISEASE PREVENTION ACROSS THE LIFESPAN"
        }
    },
    {
        "data": {
            "description": "Introduces psychomotor and assessment skills necessary to provide person-centered, evidence-based nursing care. Experience opportunities to promote wellness and respond to health problems by participating in direct client care in community and acute-care settings. Develop confidence with the application of skills and clinical judgment in a simulation lab and through concept-based learning experiences in care settings.",
            "id": "NURSING 316",
            "parent": "NURSING",
            "title": "FOUNDATIONS OF NURSING PRACTICE: EXPERIENTIAL LEARNING"
        }
    },
    {
        "data": {
            "description": "Prepares to meet the psychosocial health needs of individuals, families, and communities across the lifespan. Explore psychosocial concepts of stress, coping, mood, cognition, and behavior across the health-illness continuum and across practice settings. The human experience of psychosocial health needs is explored in the context of personal attributes, such as genetics, and interpersonal dynamics, such as family and community. Acquire the knowledge, attitudes, and skills needed to collaborate in the treatment and care of client psychosocial health needs.",
            "id": "NURSING 324",
            "parent": "NURSING",
            "title": "MEETING THE PSYCHOSOCIAL HEALTH NEEDS OF INDIVIDUALS, FAMILIES, AND COMMUNITIES"
        }
    },
    {
        "data": {
            "description": "Spend concentrated time in two settings focusing on care to individuals across the lifespan, families, and communities. The concept-based learning activities are aligned with those taught in the companion didactic courses and build on previous learning and experiences. Provide direct care from an evidenced-based perspective, at an increasingly independent level. The learning activities are guided by nursing preceptors in practice settings and by School of Nursing faculty in simulation and seminar settings.",
            "id": "NURSING 436",
            "parent": "NURSING",
            "title": "HEALTH AND ILLNESS CONCEPTS WITH INDIVIDUALS, FAMILIES, AND COMMUNITIES: EXPERIENTIAL LEARNING"
        }
    },
    {
        "data": {
            "id": "NURSING",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "NURSING 313",
            "target": "NURSING 323"
        }
    },
    {
        "data": {
            "source": "NURSING 313",
            "target": "NURSING 326"
        }
    },
    {
        "data": {
            "source": "NURSING 314",
            "target": "NURSING 324"
        }
    },
    {
        "data": {
            "source": "NURSING 316",
            "target": "NURSING 326"
        }
    },
    {
        "data": {
            "source": "NURSING 323",
            "target": "NURSING 434"
        }
    },
    {
        "data": {
            "source": "NURSING 323",
            "target": "NURSING 436"
        }
    },
    {
        "data": {
            "source": "NURSING 324",
            "target": "NURSING 436"
        }
    },
    {
        "data": {
            "source": "NURSING 326",
            "target": "NURSING 434"
        }
    },
    {
        "data": {
            "source": "NURSING 434",
            "target": "NURSING 443"
        }
    },
    {
        "data": {
            "source": "NURSING 436",
            "target": "NURSING 443"
        }
    }
]