[
    {
        "data": {
            "id": "NURSING",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Fosters advanced practice competencies and deeper understandings of collaborative practice in population health. Employ structured systems thinking, stakeholder engagement, and interdisciplinary leadership to investigate and address complex issues in population health. Advanced practice competencies to be developed include: structured approaches to systems thinking, community engagement, collaborative leadership, responsive communication, teamwork, multidisciplinary program planning, cross-sector collaboration, and collective impact.",
            "id": "NURSING 721",
            "parent": "NURSING",
            "title": "POPULATION HEALTH PRACTICUM II: COMMUNITY ACTION AND COLLECTIVE IMPACT"
        }
    },
    {
        "data": {
            "source": "NURSING 720",
            "target": "NURSING 721"
        }
    },
    {
        "data": {
            "description": "Builds on existing practice knowledge and skills with concepts from systems thinking, complex problem-solving, interdisciplinary collaboration, community engagement, coalition-building, and collective impact. Explorations of \"wicked\" problems in population health will challenge you to consider novel partnerships, shared decision-making, and innovative, multifaceted approaches to practice.",
            "id": "NURSING 724",
            "parent": "NURSING",
            "title": "POP HEALTH THEORY & METHODS SEMINAR II: INTERDIS PRACTICE, COLLECTIVE IMPACT & COALITION BUILDING"
        }
    },
    {
        "data": {
            "source": "NURSING 721",
            "target": "NURSING 724"
        }
    },
    {
        "data": {
            "source": "NURSING 724",
            "target": "NURSING 725"
        }
    },
    {
        "data": {
            "source": "NURSING 723",
            "target": "NURSING 721"
        }
    },
    {
        "data": {
            "source": "NURSING 702",
            "target": "NURSING 720"
        }
    },
    {
        "data": {
            "description": "Best practice approaches to health promotion and disease prevention are explored from their theoretical foundations to clinical applications in diverse populations. Content focuses on the study and synthesis of epidemiologic evidence with emerging social, psychological, and biological science to critically examine and propose evidence-based strategies to improve health outcomes, mitigate risk, and reduce disparities at the population level. Epidemiological principles, levels of prevention, population health theory, infectious disease control, and considerations specific to health equity and ethical health promotion practice in populations will be addressed.",
            "id": "NURSING 702",
            "parent": "NURSING",
            "title": "HEALTH PROMOTION AND DISEASE PREVENTION IN DIVERSE COMMUNITIES"
        }
    },
    {
        "data": {
            "description": "Explore specialized roles, emerging issues, and current priorities in advanced population health nursing. Analyze novel and emergent population health challenges within context, and consider the unique knowledge, skills, and philosophies that prepared nurses can bring to solution-seeking and interdisciplinary efforts to promote or safeguard population health.",
            "id": "NURSING 725",
            "parent": "NURSING",
            "title": "POPULATION HEALTH THEORY AND METHODS SEMINAR III: EMERGING ISSUES AND SPECIALIZED ROLES"
        }
    },
    {
        "data": {
            "description": "Experiential learning focused on the application of foundational skills and perspectives of advanced population health nursing practice. Provides an opportunity to synthesize, integrate, and apply new knowledge and skills and gain professional experience in population health. Emphasis is on aggregate assessment and evidence-based planning, including critical appraisal of existent data, generation of primary data, community engagement, participatory solution-finding, and the identification of evidence-based strategies to promote and protect health and well-being.",
            "id": "NURSING 720",
            "parent": "NURSING",
            "title": "POPULATION HEALTH PRACTICUM I: WORKING IN THE AGGREGATE"
        }
    },
    {
        "data": {
            "source": "NURSING 702",
            "target": "NURSING 723"
        }
    },
    {
        "data": {
            "description": "Introduction to the foundational concepts, core functions, and professional values of advanced population health nursing. Contemporary issues in population health will be used to explore and integrate the epidemiological science, theoretical constructs, ethical considerations, and best practice strategies that underlie sound practice.",
            "id": "NURSING 723",
            "parent": "NURSING",
            "title": "POPULATION HEALTH THEORY AND METHODS SEMINAR I: CONTEMPORARY ISSUES & POPULATION HEALTH ETHICS"
        }
    }
]