[
    {
        "data": {
            "description": "Focuses on professional nursing attributes and interactions essential to professional competence. Study concepts that allow for providing care unique to an individual, family, community, and systems, and to the context in which they live. Concepts related to the health care delivery system are included to provide a foundation for beginning nursing practice. Knowledge from sciences, social studies, and humanities education is integrated into nursing practice and builds foundational knowledge of the science of nursing.",
            "id": "NURSING 315",
            "parent": "NURSING",
            "title": "PROFESSIONALISM IN NURSING PRACTICE"
        }
    },
    {
        "data": {
            "id": "NURSING",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "NURSING 315",
            "target": "NURSING 325"
        }
    },
    {
        "data": {
            "description": "Designed to develop skills in using evidence to improve nursing practice. Learn strategies to evaluate the quality of evidence and effectively integrate evidence into nursing practice. Learn how practice guidelines are developed, interpreted, and implemented in complex care settings. Learn the significance of engaging partners in evidence-based practice and identify processes to partner with others.",
            "id": "NURSING 435",
            "parent": "NURSING",
            "title": "EVIDENCE-BASED PRACTICE"
        }
    },
    {
        "data": {
            "source": "NURSING 325",
            "target": "NURSING 435"
        }
    },
    {
        "data": {
            "source": "NURSING 315",
            "target": "NURSING 435"
        }
    },
    {
        "data": {
            "description": "Focuses on advancing knowledge of professional attributes and core competencies in the role of a nurse and how they are used in complex care settings. Gain an understanding of concepts of leadership, ethics, and advocacy. Broaden your understanding of nursing's role in the health care delivery system regarding quality improvement, care coordination, and palliation.",
            "id": "NURSING 325",
            "parent": "NURSING",
            "title": "PROFESSIONALISM IN HEALTH CARE SETTINGS"
        }
    }
]