[
    {
        "data": {
            "description": "Builds on health and illness concepts by focusing on individuals, families, and communities recognizing their unique attributes. Concepts included: acid-base balance, cellular regulation, intracranial regulation, genomics, sexuality and reproduction, and an introduction to the organization of the community/public health system. Other core nursing concepts are revisited as they apply to the community as client or in complex care situations. The nursing process frames learning activities that foster understanding the nursing role in providing evidence-based care to individuals, families across the lifespan, and to communities experiencing related health and illness concerns in collaboration with an interprofessional team.",
            "id": "NURSING 434",
            "parent": "NURSING",
            "title": "HEALTH AND ILLNESS CONCEPTS WITH INDIVIDUALS, FAMILIES, AND COMMUNITIES"
        }
    },
    {
        "data": {
            "id": "NURSING",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "NURSING 323",
            "target": "NURSING 437"
        }
    },
    {
        "data": {
            "source": "NURSING 313",
            "target": "NURSING 326"
        }
    },
    {
        "data": {
            "description": "Learn principles and practices of social justice related to nursing and health in local and global settings. Concepts include health determinants, diverse populations in complex care settings, health outcomes, and interventions for racial and other underrepresented minorities. Expand the understanding of global health by examining global health systems, health and illness concepts on a global level, partnerships enacted in global settings, and the scope of nursing practice in global health. Provides a facilitated forum to critically reflect on their socially constructed identities and the impact these identities have on health care systems. Designed to develop perspective related to global health and nurses as global health actors invested in improving health of the global population as a whole.",
            "id": "NURSING 437",
            "parent": "NURSING",
            "title": "SOCIAL JUSTICE IN LOCAL AND GLOBAL SETTINGS"
        }
    },
    {
        "data": {
            "source": "NURSING 437",
            "target": "NURSING 442"
        }
    },
    {
        "data": {
            "description": "Focuses on health and illness concepts emphasizing care to individuals and families across the lifespan. Gain a fundamental understanding of allostasis, oxygenation and hemostasis, and protection and movement. Gain knowledge of these concepts through exemplars that illustrate common health processes and/or alterations. Frames learning activities that foster understanding of the nursing role in providing care to individuals and families experiencing related health and illness concerns.",
            "id": "NURSING 323",
            "parent": "NURSING",
            "title": "HEALTH AND ILLNESS CONCEPTS WITH INDIVIDUALS AND FAMILIES"
        }
    },
    {
        "data": {
            "source": "NURSING 313",
            "target": "NURSING 323"
        }
    },
    {
        "data": {
            "source": "NURSING 434",
            "target": "NURSING 442"
        }
    },
    {
        "data": {
            "source": "NURSING 326",
            "target": "NURSING 434"
        }
    },
    {
        "data": {
            "description": "Learning is centered on health systems, policy, and economics. Expand understanding of core nursing competencies such as safe therapeutic care, and health informatics by examining how these concepts operate at a systems-level to influence care and outcomes. Focus is given to emergency preparedness as enacted in a variety of systems. Key conceptual elements of the healthcare system, organization, policy, financing and law and quality improvement and their impact on care and outcomes are examined.",
            "id": "NURSING 442",
            "parent": "NURSING",
            "title": "HEALTH SYSTEMS, POLICY, AND ECONOMICS"
        }
    },
    {
        "data": {
            "source": "NURSING 323",
            "target": "NURSING 434"
        }
    },
    {
        "data": {
            "source": "NURSING 316",
            "target": "NURSING 326"
        }
    },
    {
        "data": {
            "description": "Introduces psychomotor and assessment skills necessary to provide person-centered, evidence-based nursing care. Experience opportunities to promote wellness and respond to health problems by participating in direct client care in community and acute-care settings. Develop confidence with the application of skills and clinical judgment in a simulation lab and through concept-based learning experiences in care settings.",
            "id": "NURSING 316",
            "parent": "NURSING",
            "title": "FOUNDATIONS OF NURSING PRACTICE: EXPERIENTIAL LEARNING"
        }
    },
    {
        "data": {
            "description": "Builds on psychomotor and assessment skills necessary to provide direct care to individuals and families across the lifespan. Develop clinical judgment, knowledge, communication skills, and professional behavior while providing nursing care that is safe, evidence-based, and patient centered. Experiential learning takes place in simulated and clinical settings.",
            "id": "NURSING 326",
            "parent": "NURSING",
            "title": "HEALTH AND ILLNESS CONCEPTS WITH INDIVIDUALS AND FAMILIES: EXPERIENTIAL LEARNING"
        }
    },
    {
        "data": {
            "description": "Focuses on foundational concepts necessary to provide person-centered, evidence-based nursing care, including the nursing process and health and illness concepts. Active learning is emphasized by gaining confidence with applying the nursing processes and begin to develop clinical judgment and assessment skills. Complements a companion experiential course [NURSING 316].",
            "id": "NURSING 313",
            "parent": "NURSING",
            "title": "FOUNDATIONS OF NURSING PRACTICE"
        }
    }
]