[
    {
        "data": {
            "description": "Introduces the foundational concepts of pharmacology, drug therapy, actions and interactions, and their therapeutic and adverse effects. Major drug classes are paired with health and illness concepts while considering the appropriate client-centered nursing interventions for disease states as they relate to retaining, attaining, or maintaining patients' health status across the lifespan.",
            "id": "NURSING 317",
            "parent": "NURSING",
            "title": "PHARMACOLOGY ESSENTIALS FOR NURSING PRACTICE"
        }
    },
    {
        "data": {
            "description": "Builds on psychomotor and assessment skills necessary to provide direct care to individuals and families across the lifespan. Develop clinical judgment, knowledge, communication skills, and professional behavior while providing nursing care that is safe, evidence-based, and patient centered. Experiential learning takes place in simulated and clinical settings.",
            "id": "NURSING 326",
            "parent": "NURSING",
            "title": "HEALTH AND ILLNESS CONCEPTS WITH INDIVIDUALS AND FAMILIES: EXPERIENTIAL LEARNING"
        }
    },
    {
        "data": {
            "description": "Focuses on foundational concepts necessary to provide person-centered, evidence-based nursing care, including the nursing process and health and illness concepts. Active learning is emphasized by gaining confidence with applying the nursing processes and begin to develop clinical judgment and assessment skills. Complements a companion experiential course [NURSING 316].",
            "id": "NURSING 313",
            "parent": "NURSING",
            "title": "FOUNDATIONS OF NURSING PRACTICE"
        }
    },
    {
        "data": {
            "description": "Focuses on health and illness concepts emphasizing care to individuals and families across the lifespan. Gain a fundamental understanding of allostasis, oxygenation and hemostasis, and protection and movement. Gain knowledge of these concepts through exemplars that illustrate common health processes and/or alterations. Frames learning activities that foster understanding of the nursing role in providing care to individuals and families experiencing related health and illness concerns.",
            "id": "NURSING 323",
            "parent": "NURSING",
            "title": "HEALTH AND ILLNESS CONCEPTS WITH INDIVIDUALS AND FAMILIES"
        }
    },
    {
        "data": {
            "description": "Focuses on professional nursing attributes and interactions essential to professional competence. Study concepts that allow for providing care unique to an individual, family, community, and systems, and to the context in which they live. Concepts related to the health care delivery system are included to provide a foundation for beginning nursing practice. Knowledge from sciences, social studies, and humanities education is integrated into nursing practice and builds foundational knowledge of the science of nursing.",
            "id": "NURSING 315",
            "parent": "NURSING",
            "title": "PROFESSIONALISM IN NURSING PRACTICE"
        }
    },
    {
        "data": {
            "description": "Focuses on the role of the baccalaureate generalist nurse in health promotion and disease prevention across the lifespan. Learn about factors that impact health of individuals and families. Active learning is emphasized through applying the nursing process to concepts such as health determinants, health education, self- management, and innate psychological needs related to well-being.",
            "id": "NURSING 314",
            "parent": "NURSING",
            "title": "HEALTH PROMOTION AND DISEASE PREVENTION ACROSS THE LIFESPAN"
        }
    },
    {
        "data": {
            "description": "Foundational knowledge needed to provide equitable, evidence-based nursing care for diverse children and their families. For each developmental level, holistically integrate health promotion, illness and injury prevention, health education, and anticipatory guidance and examines potential disparities, as key components of the nursing role. Emphasis on the application of the nursing process, the clinical judgment model, and related core competencies associated with understanding the pathophysiology of altered health patterns affecting children and the related management of nursing care.",
            "id": "NURSING 431",
            "parent": "NURSING",
            "title": "NURSING CARE OF CHILDREN & THEIR FAMILIES"
        }
    },
    {
        "data": {
            "description": "Introduces psychomotor and assessment skills necessary to provide person-centered, evidence-based nursing care. Experience opportunities to promote wellness and respond to health problems by participating in direct client care in community and acute-care settings. Develop confidence with the application of skills and clinical judgment in a simulation lab and through concept-based learning experiences in care settings.",
            "id": "NURSING 316",
            "parent": "NURSING",
            "title": "FOUNDATIONS OF NURSING PRACTICE: EXPERIENTIAL LEARNING"
        }
    },
    {
        "data": {
            "id": "NURSING",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "NURSING 313",
            "target": "NURSING 323"
        }
    },
    {
        "data": {
            "source": "NURSING 313",
            "target": "NURSING 326"
        }
    },
    {
        "data": {
            "source": "NURSING 314",
            "target": "NURSING 326"
        }
    },
    {
        "data": {
            "source": "NURSING 315",
            "target": "NURSING 326"
        }
    },
    {
        "data": {
            "source": "NURSING 316",
            "target": "NURSING 326"
        }
    },
    {
        "data": {
            "source": "NURSING 317",
            "target": "NURSING 326"
        }
    },
    {
        "data": {
            "source": "NURSING 323",
            "target": "NURSING 431"
        }
    },
    {
        "data": {
            "source": "NURSING 326",
            "target": "NURSING 431"
        }
    }
]