[
    {
        "data": {
            "description": "Focuses on advancing knowledge of professional attributes and core competencies in the role of a nurse and how they are used in complex care settings. Gain an understanding of concepts of leadership, ethics, and advocacy. Broaden your understanding of nursing's role in the health care delivery system regarding quality improvement, care coordination, and palliation.",
            "id": "NURSING 325",
            "parent": "NURSING",
            "title": "PROFESSIONALISM IN HEALTH CARE SETTINGS"
        }
    },
    {
        "data": {
            "description": "Builds on health and illness concepts by focusing on individuals, families, and communities recognizing their unique attributes. Concepts included: acid-base balance, cellular regulation, intracranial regulation, genomics, sexuality and reproduction, and an introduction to the organization of the community/public health system. Other core nursing concepts are revisited as they apply to the community as client or in complex care situations. The nursing process frames learning activities that foster understanding the nursing role in providing evidence-based care to individuals, families across the lifespan, and to communities experiencing related health and illness concerns in collaboration with an interprofessional team.",
            "id": "NURSING 434",
            "parent": "NURSING",
            "title": "HEALTH AND ILLNESS CONCEPTS WITH INDIVIDUALS, FAMILIES, AND COMMUNITIES"
        }
    },
    {
        "data": {
            "description": "Builds on psychomotor and assessment skills necessary to provide direct care to individuals and families across the lifespan. Develop clinical judgment, knowledge, communication skills, and professional behavior while providing nursing care that is safe, evidence-based, and patient centered. Experiential learning takes place in simulated and clinical settings.",
            "id": "NURSING 326",
            "parent": "NURSING",
            "title": "HEALTH AND ILLNESS CONCEPTS WITH INDIVIDUALS AND FAMILIES: EXPERIENTIAL LEARNING"
        }
    },
    {
        "data": {
            "description": "Designed to develop skills in using evidence to improve nursing practice. Learn strategies to evaluate the quality of evidence and effectively integrate evidence into nursing practice. Learn how practice guidelines are developed, interpreted, and implemented in complex care settings. Learn the significance of engaging partners in evidence-based practice and identify processes to partner with others.",
            "id": "NURSING 435",
            "parent": "NURSING",
            "title": "EVIDENCE-BASED PRACTICE"
        }
    },
    {
        "data": {
            "description": "Expand understanding of core nursing competencies such as safe therapeutic care and health informatics by examining how these concepts operate at a systems-level to influence care and outcomes. Focus is given to emergency preparedness as enacted in a variety of systems. Key conceptual elements of the healthcare system, organization, policy, financing and law, and quality improvement and their impact on care and outcomes are examined. Expand your understanding of scholarship and evidence-based practice by delving into the process of nursing research.",
            "id": "NURSING 444",
            "parent": "NURSING",
            "title": "HEALTH SYSTEMS, POLICY, ECONOMICS, AND RESEARCH"
        }
    },
    {
        "data": {
            "description": "Focuses on foundational concepts necessary to provide person-centered, evidence-based nursing care, including the nursing process and health and illness concepts. Active learning is emphasized by gaining confidence with applying the nursing processes and begin to develop clinical judgment and assessment skills. Complements a companion experiential course [NURSING 316].",
            "id": "NURSING 313",
            "parent": "NURSING",
            "title": "FOUNDATIONS OF NURSING PRACTICE"
        }
    },
    {
        "data": {
            "description": "Focuses on health and illness concepts emphasizing care to individuals and families across the lifespan. Gain a fundamental understanding of allostasis, oxygenation and hemostasis, and protection and movement. Gain knowledge of these concepts through exemplars that illustrate common health processes and/or alterations. Frames learning activities that foster understanding of the nursing role in providing care to individuals and families experiencing related health and illness concerns.",
            "id": "NURSING 323",
            "parent": "NURSING",
            "title": "HEALTH AND ILLNESS CONCEPTS WITH INDIVIDUALS AND FAMILIES"
        }
    },
    {
        "data": {
            "description": "Focuses on professional nursing attributes and interactions essential to professional competence. Study concepts that allow for providing care unique to an individual, family, community, and systems, and to the context in which they live. Concepts related to the health care delivery system are included to provide a foundation for beginning nursing practice. Knowledge from sciences, social studies, and humanities education is integrated into nursing practice and builds foundational knowledge of the science of nursing.",
            "id": "NURSING 315",
            "parent": "NURSING",
            "title": "PROFESSIONALISM IN NURSING PRACTICE"
        }
    },
    {
        "data": {
            "description": "Introduces psychomotor and assessment skills necessary to provide person-centered, evidence-based nursing care. Experience opportunities to promote wellness and respond to health problems by participating in direct client care in community and acute-care settings. Develop confidence with the application of skills and clinical judgment in a simulation lab and through concept-based learning experiences in care settings.",
            "id": "NURSING 316",
            "parent": "NURSING",
            "title": "FOUNDATIONS OF NURSING PRACTICE: EXPERIENTIAL LEARNING"
        }
    },
    {
        "data": {
            "id": "NURSING",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "NURSING 313",
            "target": "NURSING 323"
        }
    },
    {
        "data": {
            "source": "NURSING 313",
            "target": "NURSING 326"
        }
    },
    {
        "data": {
            "source": "NURSING 315",
            "target": "NURSING 325"
        }
    },
    {
        "data": {
            "source": "NURSING 315",
            "target": "NURSING 435"
        }
    },
    {
        "data": {
            "source": "NURSING 316",
            "target": "NURSING 326"
        }
    },
    {
        "data": {
            "source": "NURSING 323",
            "target": "NURSING 434"
        }
    },
    {
        "data": {
            "source": "NURSING 325",
            "target": "NURSING 435"
        }
    },
    {
        "data": {
            "source": "NURSING 326",
            "target": "NURSING 434"
        }
    },
    {
        "data": {
            "source": "NURSING 434",
            "target": "NURSING 444"
        }
    },
    {
        "data": {
            "source": "NURSING 435",
            "target": "NURSING 444"
        }
    }
]