[
    {
        "data": {
            "description": "Focuses on foundational concepts necessary to provide person-centered, evidence-based nursing care, including the nursing process and health and illness concepts. Active learning is emphasized by gaining confidence with applying the nursing processes and begin to develop clinical judgment and assessment skills. Complements a companion experiential course [NURSING 316].",
            "id": "NURSING 313",
            "parent": "NURSING",
            "title": "FOUNDATIONS OF NURSING PRACTICE"
        }
    },
    {
        "data": {
            "description": "Focuses on health and illness concepts emphasizing care to individuals and families across the lifespan. Gain a fundamental understanding of allostasis, oxygenation and hemostasis, and protection and movement. Gain knowledge of these concepts through exemplars that illustrate common health processes and/or alterations. Frames learning activities that foster understanding of the nursing role in providing care to individuals and families experiencing related health and illness concerns.",
            "id": "NURSING 323",
            "parent": "NURSING",
            "title": "HEALTH AND ILLNESS CONCEPTS WITH INDIVIDUALS AND FAMILIES"
        }
    },
    {
        "data": {
            "description": "Learn principles and practices of social justice related to nursing and health in local and global settings. Concepts include health determinants, diverse populations in complex care settings, health outcomes, and interventions for racial and other underrepresented minorities. Expand the understanding of global health by examining global health systems, health and illness concepts on a global level, partnerships enacted in global settings, and the scope of nursing practice in global health. Provides a facilitated forum to critically reflect on their socially constructed identities and the impact these identities have on health care systems. Designed to develop perspective related to global health and nurses as global health actors invested in improving health of the global population as a whole.",
            "id": "NURSING 437",
            "parent": "NURSING",
            "title": "SOCIAL JUSTICE IN LOCAL AND GLOBAL SETTINGS"
        }
    },
    {
        "data": {
            "id": "NURSING",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "NURSING 313",
            "target": "NURSING 323"
        }
    },
    {
        "data": {
            "source": "NURSING 323",
            "target": "NURSING 437"
        }
    }
]