[
    {
        "data": {
            "description": "Advance practice skills across the continuum of care among adult clients. Focus on clinical assessment, therapeutic intervention, and discharge planning to promote occupational participation and health. Application of skills learned in real-world settings.",
            "id": "OCCTHER 723",
            "parent": "OCCTHER",
            "title": "ENABLING OCCUPATIONS 2: ADULT FOCUS"
        }
    },
    {
        "data": {
            "description": "Exposure to clinical occupational therapy practice through observation, participation in guided evaluation and treatment procedures, data collection and organization, and communication with clients and other professionals while working in clinical setting under supervision of licensed occupational therapist.",
            "id": "OCCTHER 726",
            "parent": "OCCTHER",
            "title": "LEVEL 1 FIELDWORK A: ADULT PHYSICAL DISABILITIES"
        }
    },
    {
        "data": {
            "description": "Exposure to community-based mental health OT practice through observation, participation in guided evaluation and treatment procedures, data collection and organization, and communication with clients and other professionals.",
            "id": "OCCTHER 727",
            "parent": "OCCTHER",
            "title": "LEVEL 1 FIELDWORK B: COMMUNITY-BASED MENTAL HEALTH"
        }
    },
    {
        "data": {
            "description": "Exposure to pediatric OT practice through observation, participation in guided evaluation and treatment procedures, data collection and organization, and communication with clients and other professionals.",
            "id": "OCCTHER 728",
            "parent": "OCCTHER",
            "title": "LEVEL 1 FIELDWORK C: PEDIATRICS"
        }
    },
    {
        "data": {
            "description": "Foundations of pediatric occupational therapy practice including theory and core concepts; models of practice and service delivery; the assessment and treatment process; and alterations in performance components, skills, and participation for children and adolescents with various conditions will be discussed",
            "id": "OCCTHER 725",
            "parent": "OCCTHER",
            "title": "ENABLING OCCUPATIONS 4: PEDIATRICS"
        }
    },
    {
        "data": {
            "description": "Introduce clinical assessment and therapeutic intervention strategies to promote occupational participation and health among adult clients with a focus on orthopedics and medical considerations. Application of skills learned in real-world settings.",
            "id": "OCCTHER 722",
            "parent": "OCCTHER",
            "title": "ENABLING OCCUPATIONS 1: ADULT FOCUS"
        }
    },
    {
        "data": {
            "description": "Learn foundational skills necessary to promote, prevent and treat the mental health and psychosocial needs of clients, groups and populations. Topics include: Recovery, mental health and psychosocial assessments and treatments of common mental health disorders and health and wellness promotion.",
            "id": "OCCTHER 724",
            "parent": "OCCTHER",
            "title": "ENABLING OCCUPATIONS 3: MENTAL HEALTH ACROSS THE LIFE SPAN"
        }
    },
    {
        "data": {
            "id": "OCCTHER",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "OCCTHER 722",
            "target": "OCCTHER 723"
        }
    },
    {
        "data": {
            "source": "OCCTHER 723",
            "target": "OCCTHER 724"
        }
    },
    {
        "data": {
            "source": "OCCTHER 723",
            "target": "OCCTHER 726"
        }
    },
    {
        "data": {
            "source": "OCCTHER 724",
            "target": "OCCTHER 725"
        }
    },
    {
        "data": {
            "source": "OCCTHER 724",
            "target": "OCCTHER 727"
        }
    },
    {
        "data": {
            "source": "OCCTHER 725",
            "target": "OCCTHER 728"
        }
    },
    {
        "data": {
            "source": "OCCTHER 726",
            "target": "OCCTHER 727"
        }
    },
    {
        "data": {
            "source": "OCCTHER 727",
            "target": "OCCTHER 728"
        }
    }
]