[
    {
        "data": {
            "description": "Basic principles of ecology and interrelations between individuals, populations, communities, ecosystems and their environment; transmission genetics and introduction to population genetics; origin of life, evolutionary mechanisms, ancestral relationships among species, and the diversity of life.",
            "id": "BIOCORE 381",
            "parent": "BIOCORE",
            "title": "EVOLUTION, ECOLOGY, AND GENETICS"
        }
    },
    {
        "data": {
            "description": "Explore the methods for environmental pathogen surveillance used in research and public health. Includes an advanced discussion of molecular genetics, genomics, and sequencing technologies. Explores the implications for public health and pandemic preparedness.",
            "id": "PATH 501",
            "parent": "PATH",
            "title": "TOPICS IN ENVIRONMENTAL VIRAL PATHOGEN SURVEILLANCE"
        }
    },
    {
        "data": {
            "description": "Explores a detailed atomic and molecular view of matter and its interactions, with a specific focus on quantum theory, molecular structure, and chemical bonding. Application required for enrollment.",
            "id": "CHEM 115",
            "parent": "CHEM",
            "title": "CHEMICAL PRINCIPLES I"
        }
    },
    {
        "data": {
            "description": "General biological principles. Topics include: evolution, ecology, animal behavior, cell structure and function, genetics and molecular genetics and the physiology of a variety of organ systems emphasizing function in humans.",
            "id": "BIOLOGY/ZOOLOGY 101",
            "title": "ANIMAL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Genetics in eukaryotes and prokaryotes.  Includes transmission genetics, molecular genetics, evolutionary genetics, genetic engineering, and societal issues associated with genetics.  Illustrative material includes bacteria, plants, insects, and vertebrates.",
            "id": "GENETICS 466",
            "parent": "GENETICS",
            "title": "PRINCIPLES OF GENETICS"
        }
    },
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics and selected topics in Animal Physiology.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Topics include: selected topics in plant physiology, a survey of the five major kingdoms of organisms, speciation and evolutionary theory, and ecology at multiple levels of the biological hierarchy.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "id": "BIOCORE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "GENETICS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "PATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "GENETICS 466"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 152"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 101"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "target": "PATH 501"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 151"
        }
    },
    {
        "data": {
            "source": "CHEM 115",
            "target": "GENETICS 466"
        }
    },
    {
        "data": {
            "source": "GENETICS 466",
            "target": "PATH 501"
        }
    }
]