[
    {
        "data": {
            "description": "Become more engaged with the pharmacy profession through further development and refinement of professional identity and continuing professional development. Use appropriate published evidence to answer clinical questions and complete orientations to understand expectations and prepare for advanced pharmacy practice field experiences.",
            "id": "PHARMACY 662",
            "parent": "PHARMACY",
            "title": "PROFESSIONAL DEVELOPMENT AND ENGAGEMENT 3: EMBRACING CONTINUING PROFESSIONAL DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Continue to develop professional identity and engage with the pharmacy profession through leadership and professional advocacy. Explore wellness; personal values, skills, and strengths; and identify their implications for leadership and professional advocacy within pharmacy practice. Engage in career, continuing professional, and interprofessional development to promote quality patient care.",
            "id": "PHARMACY 562",
            "parent": "PHARMACY",
            "title": "PROFESSIONAL DEVELOPMENT & ENGAGEMENT 2: CULTIVATING LEADERSHIP AND ADVOCACY WITHIN THE PROFESSION"
        }
    },
    {
        "data": {
            "description": "Explore aspects of professional identity and how to become more engaged with the pharmacy profession. Explore personal values, skills, and strengths and identify their implications for patient care and professional practice. Engage in continuing professional and interprofessional development to promote quality patient care and advocacy.",
            "id": "PHARMACY 462",
            "parent": "PHARMACY",
            "title": "PROFESSIONAL DEVELOPMENT AND ENGAGEMENT 1: DEVELOPING YOUR PROFESSIONAL IDENTITY"
        }
    },
    {
        "data": {
            "id": "PHARMACY",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "PHARMACY 462",
            "target": "PHARMACY 562"
        }
    },
    {
        "data": {
            "source": "PHARMACY 562",
            "target": "PHARMACY 662"
        }
    }
]