[
    {
        "data": {
            "source": "PHMPRAC 426",
            "target": "PHMPRAC 526"
        }
    },
    {
        "data": {
            "id": "PHARMACY",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "PHARMACY 423",
            "target": "PHMPRAC 426"
        }
    },
    {
        "data": {
            "description": "Designed to introduce student pharmacists to many aspects of pharmacy practice. Participate in a wide-variety of activities to expose them to the role of the pharmacist and the many patient care opportunities that exist in and out of the community pharmacy practice setting. Observe pharmacists in a community pharmacy. Gain a broad understanding of the pharmacist's public health role. Actively participate in assigned teams in a longitudinal experience with an assigned older adult in the community. All of these experiences will be guided by a modified continuing professional development framework (prepare, plan, do, reflect).",
            "id": "PHMPRAC 426",
            "parent": "PHMPRAC",
            "title": "PHARMACY PRACTICE EXPERIENCE I"
        }
    },
    {
        "data": {
            "description": "Integrates didactic learning with active participation in a wide-variety of patient-care activities under the supervision of a pharmacist preceptor including medication reconciliation, patient consultation, complex medication reviews, documentation, therapeutic drug monitoring and calculations. Continued exposure to the Pharmacist Patient Care Process (PPCP), which is a framework for providing patient care in a pharmacy practice setting.",
            "id": "PHMPRAC 625",
            "parent": "PHMPRAC",
            "title": "PHARMACY PRACTICE EXPERIENCES III"
        }
    },
    {
        "data": {
            "description": "Provides an interdivisional foundation for pharmacy students to understand many aspects of pharmacy through a wide variety of activities. Delivers a broad understanding of the pharmacist's public health and patient advocacy role with opportunities to practice basic calculations related to drug formulations in the context of safety, drug stability, and patient care. Fosters development of communication skills with peers and patients and be introduced to patient counseling principles.  Includes active participation in a longitudinal group experience with an assigned senior in the community to apply course content.",
            "id": "PHARMACY 423",
            "parent": "PHARMACY",
            "title": "PHARMACY INTEGRATED LEARNING LABORATORY"
        }
    },
    {
        "data": {
            "id": "PHMPRAC",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 526",
            "target": "PHMPRAC 625"
        }
    },
    {
        "data": {
            "description": "The second experience of a three-year Introductory Pharmacy Practice Experiences (IPPEs) sequence. Provides opportunities to integrate learning from prior didactic courses such as The Role of the Pharmacist in the Public Health System, Managing Pharmacy Systems for Patient Care, current pharmacotherapy courses, and a previous community IPPE, into observation and discussion of the provision of patient care. Participate in a wide-variety of activities to expose them to the role of the pharmacist and patient care opportunities that exist in and out of the pharmacy practice setting. Focus on the provision of care in an institutional setting along with a variety of pharmacy practice settings which fall under an elective category. Continued exposure to the Pharmacist Patient Care Process (PPCP), which is a framework for providing patient care in a pharmacy practice setting.",
            "id": "PHMPRAC 526",
            "parent": "PHMPRAC",
            "title": "PHARMACY PRACTICE EXPERIENCES II"
        }
    }
]