[
    {
        "data": {
            "description": "Develop professional identity and become more engaged with the profession of pharmacy.  Demonstrate behaviors that regulate personal emotions and support well-being.  Engage in continuous professional and interprofessional development to provide patient care that is safe and equitable.  Prepare for future introductory pharmacy practice experiences.",
            "id": "PHMPRAC 464",
            "parent": "PHMPRAC",
            "title": "PROFESSIONAL DEVELOPMENT AND ENGAGEMENT III:  PROMOTING PROFESSIONAL ENGAGEMENT"
        }
    },
    {
        "data": {
            "description": "Develop professional identity and demonstrate behaviors that regulate personal emotions and support well-being.  Identify personal strengths and communicate these strengths to others.  Engage in continuous professional and interprofessional development to provide patient care that is safe and equitable.",
            "id": "PHMPRAC 463",
            "parent": "PHMPRAC",
            "title": "PROFESSIONAL DEVELOPMENT AND ENGAGEMENT II- CULTIVATING SELF- AWARENESS"
        }
    },
    {
        "data": {
            "description": "Introduction to, and exploration of, contemporary pharmacy practice settings and interprofessional practice, including opportunities for career advancement.",
            "id": "PHMPRAC 461",
            "parent": "PHMPRAC",
            "title": "PATHWAYS IN PHARMACY PRACTICE"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 461",
            "target": "PHMPRAC 462"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 462",
            "target": "PHMPRAC 463"
        }
    },
    {
        "data": {
            "id": "PHMPRAC",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 463",
            "target": "PHMPRAC 464"
        }
    },
    {
        "data": {
            "description": "Develop professional identity and become more engaged with the profession of pharmacy.  Explore personal values, skills, and strengths and identify their implications for patient care and professional practice.  Engage in continuous professional and interprofessional development to provide patient care that is safe and equitable.  Prepare for future introductory pharmacy practice experiences.",
            "id": "PHMPRAC 462",
            "parent": "PHMPRAC",
            "title": "PROFESSIONAL DEVELOPMENT AND ENGAGEMENT I- DEVELOPING YOUR PROFESSIONAL IDENTITY"
        }
    }
]