[
    {
        "data": {
            "description": "Clinical application of medications in the management of various disease states. Assessment and therapeutic monitoring of disease states and drug therapy using the concepts of pharmacokinetics/dynamics, drug interactions, pharmacy practice and patient counseling. Topics include cardiovascular and pulmonary therapeutics.",
            "id": "PHMPRAC 556",
            "parent": "PHMPRAC",
            "title": "PHARMACOTHERAPY II"
        }
    },
    {
        "data": {
            "description": "Clinical application of medications in the management of various disease states. Assessment and therapeutic monitoring of disease states and drug therapy using the concepts of pharmacokinetics/dynamics, drug interactions, pharmacy practice and patient counseling. Topics include various oncology and infectious disease therapeutics. A one credit elective option will be offered to students and involves academic leadership skill development. Student leaders will lead discussion activities which involve clinical cases, scientific literature review, oncology literature discussions.",
            "id": "PHMPRAC 656",
            "parent": "PHMPRAC",
            "title": "PHARMACOTHERAPY IV"
        }
    },
    {
        "data": {
            "description": "Clinical application of medications in the management of various disease states. Assessment and therapeutic monitoring of disease states and drug therapy using the concepts of pharmacokinetics/dynamics, drug interactions, pharmacy practice and patient counseling. Topics include various renal, endocrine, gastrointestinal, rheumatologic and immunologic disease therapeutics.",
            "id": "PHMPRAC 655",
            "parent": "PHMPRAC",
            "title": "PHARMACOTHERAPY III"
        }
    },
    {
        "data": {
            "description": "Clinical application of medications in the management of various neurologic and psychiatric disease states. Assessment and therapeutic monitoring of drug therapy with emphasis on the concepts of drug selection, monitoring of drug effect and titration of regimen. Also incorporates issues regarding pharmacokinetics/dynamics, drug interactions, pharmacy practice, and patient education.",
            "id": "PHMPRAC 555",
            "parent": "PHMPRAC",
            "title": "PHARMACOTHERAPY I"
        }
    },
    {
        "data": {
            "description": "Learn and build upon pharmacotherapeutic skills necessary to develop competence as a pharmacist to assume the responsibility to improve therapeutic patient outcomes related to medication use. Skills will include patient and healthcare provider communication, identification and resolution of drug related problems, documentation, and complex problem solving skills.",
            "id": "PHMPRAC 653",
            "parent": "PHMPRAC",
            "title": "INTEGRATED PHARMACOTHERAPY SKILLS III"
        }
    },
    {
        "data": {
            "description": "Learn pharmacotherapeutic skills necessary to develop competence as a pharmacist to assume the responsibility to improve therapeutic patient outcomes related to medication use. Skills will include patient and provider communication, identification and resolution of drug related problems, and documentation.",
            "id": "PHMPRAC 554",
            "parent": "PHMPRAC",
            "title": "INTEGRATED PHARMACOTHERAPY SKILLS II"
        }
    },
    {
        "data": {
            "description": "Learn pharmacotherapeutic skills necessary to develop competence as a pharmacist to assume the responsibility to improve therapeutic patient outcomes related to medication use. Skills will include patient communication, identification and resolution of drug related problems, and documentation.",
            "id": "PHMPRAC 553",
            "parent": "PHMPRAC",
            "title": "INTEGRATED PHARMACOTHERAPY SKILLS I"
        }
    },
    {
        "data": {
            "id": "PHMPRAC",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 553",
            "target": "PHMPRAC 554"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 553",
            "target": "PHMPRAC 556"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 554",
            "target": "PHMPRAC 655"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 555",
            "target": "PHMPRAC 554"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 555",
            "target": "PHMPRAC 556"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 556",
            "target": "PHMPRAC 655"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 653",
            "target": "PHMPRAC 656"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 655",
            "target": "PHMPRAC 656"
        }
    }
]