[
    {
        "data": {
            "description": "Clinical application of medications in the management of various disease states. Assessment and therapeutic monitoring of disease states and drug therapy using the concepts of pharmacokinetics/dynamics, drug interactions, pharmacy practice and patient counseling. Topics include cardiovascular and pulmonary therapeutics.",
            "id": "PHMPRAC 556",
            "parent": "PHMPRAC",
            "title": "PHARMACOTHERAPY II"
        }
    },
    {
        "data": {
            "description": "Clinical application of medications in the management of various neurologic and psychiatric disease states. Assessment and therapeutic monitoring of drug therapy with emphasis on the concepts of drug selection, monitoring of drug effect and titration of regimen. Also incorporates issues regarding pharmacokinetics/dynamics, drug interactions, pharmacy practice, and patient education.",
            "id": "PHMPRAC 555",
            "parent": "PHMPRAC",
            "title": "PHARMACOTHERAPY I"
        }
    },
    {
        "data": {
            "description": "Learn pharmacotherapeutic skills necessary to develop competence as a pharmacist to assume the responsibility to improve therapeutic patient outcomes related to medication use. Skills will include patient and provider communication, identification and resolution of drug related problems, and documentation.",
            "id": "PHMPRAC 554",
            "parent": "PHMPRAC",
            "title": "INTEGRATED PHARMACOTHERAPY SKILLS II"
        }
    },
    {
        "data": {
            "description": "Learn pharmacotherapeutic skills necessary to develop competence as a pharmacist to assume the responsibility to improve therapeutic patient outcomes related to medication use. Skills will include patient communication, identification and resolution of drug related problems, and documentation.",
            "id": "PHMPRAC 553",
            "parent": "PHMPRAC",
            "title": "INTEGRATED PHARMACOTHERAPY SKILLS I"
        }
    },
    {
        "data": {
            "description": "Provides students with knowledge and skills needed to perform triage and make self-care and therapeutic recommendations for self-limiting health conditions commonly encountered in pharmacy practice.",
            "id": "PHMPRAC 638",
            "parent": "PHMPRAC",
            "title": "NONPRESCRIPTION PRODUCTS & SELF-CARE"
        }
    },
    {
        "data": {
            "id": "PHMPRAC",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 553",
            "target": "PHMPRAC 554"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 553",
            "target": "PHMPRAC 556"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 554",
            "target": "PHMPRAC 638"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 555",
            "target": "PHMPRAC 554"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 555",
            "target": "PHMPRAC 556"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 556",
            "target": "PHMPRAC 638"
        }
    }
]