[
    {
        "data": {
            "source": "PHMPRAC 555",
            "target": "PHMPRAC 556"
        }
    },
    {
        "data": {
            "description": "Clinical application of medications in the management of various disease states. Assessment and therapeutic monitoring of disease states and drug therapy using the concepts of pharmacokinetics/dynamics, drug interactions, pharmacy practice and patient counseling. Topics include cardiovascular and pulmonary therapeutics.",
            "id": "PHMPRAC 556",
            "parent": "PHMPRAC",
            "title": "PHARMACOTHERAPY II"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 655",
            "target": "PHMPRAC 679"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 556",
            "target": "PHMPRAC 655"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 553",
            "target": "PHMPRAC 554"
        }
    },
    {
        "data": {
            "description": "Enhanced education on diabetes topics; current approaches to the medical management of patients with diabetes including the pharmacist's role in diabetes education and coaching/case management.",
            "id": "PHMPRAC 679",
            "parent": "PHMPRAC",
            "title": "ADVANCED DIABETES MANAGEMENT"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 554",
            "target": "PHMPRAC 655"
        }
    },
    {
        "data": {
            "description": "Learn pharmacotherapeutic skills necessary to develop competence as a pharmacist to assume the responsibility to improve therapeutic patient outcomes related to medication use. Skills will include patient and provider communication, identification and resolution of drug related problems, and documentation.",
            "id": "PHMPRAC 554",
            "parent": "PHMPRAC",
            "title": "INTEGRATED PHARMACOTHERAPY SKILLS II"
        }
    },
    {
        "data": {
            "description": "Clinical application of medications in the management of various neurologic and psychiatric disease states. Assessment and therapeutic monitoring of drug therapy with emphasis on the concepts of drug selection, monitoring of drug effect and titration of regimen. Also incorporates issues regarding pharmacokinetics/dynamics, drug interactions, pharmacy practice, and patient education.",
            "id": "PHMPRAC 555",
            "parent": "PHMPRAC",
            "title": "PHARMACOTHERAPY I"
        }
    },
    {
        "data": {
            "description": "Learn pharmacotherapeutic skills necessary to develop competence as a pharmacist to assume the responsibility to improve therapeutic patient outcomes related to medication use. Skills will include patient communication, identification and resolution of drug related problems, and documentation.",
            "id": "PHMPRAC 553",
            "parent": "PHMPRAC",
            "title": "INTEGRATED PHARMACOTHERAPY SKILLS I"
        }
    },
    {
        "data": {
            "id": "PHMPRAC",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 553",
            "target": "PHMPRAC 556"
        }
    },
    {
        "data": {
            "description": "Clinical application of medications in the management of various disease states. Assessment and therapeutic monitoring of disease states and drug therapy using the concepts of pharmacokinetics/dynamics, drug interactions, pharmacy practice and patient counseling. Topics include various renal, endocrine, gastrointestinal, rheumatologic and immunologic disease therapeutics.",
            "id": "PHMPRAC 655",
            "parent": "PHMPRAC",
            "title": "PHARMACOTHERAPY III"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 555",
            "target": "PHMPRAC 554"
        }
    }
]