[
    {
        "data": {
            "description": "A series of lectures by experts covering: i) introductory drug development and delivery system development processes; ii) various drug delivery routes (oral, topical, rectal, vaginal, urethral, nasal, and pulmonary); iii) various delivery systems (conventional, ophthalmic, CNS, and recent advances); iv) delivery systems related to biofilms, infection, and vaccines.",
            "id": "PHMSCI 540",
            "parent": "PHMSCI",
            "title": "DRUG DELIVERY SYSTEMS FOR PHARMACOTHERAPY"
        }
    },
    {
        "data": {
            "description": "An introduction to parenteral therapy and nutrition focusing on the fundamental properties, calculations involved and the methods to prepare safe and reliable injectable medications for patients.",
            "id": "PHMSCI 542",
            "parent": "PHMSCI",
            "title": "PARENTERAL THERAPY AND NUTRITION"
        }
    },
    {
        "data": {
            "description": "Applications of physicochemical principles to pharmaceutical systems.",
            "id": "PHMSCI 420",
            "parent": "PHMSCI",
            "title": "PHYSICOCHEMICAL PRINCIPLES OF DRUG FORMULATION AND DELIVERY"
        }
    },
    {
        "data": {
            "description": "Introductory laboratory course in compounding and dispensing of pharmaceutical dosage forms, including sterile products. Includes practice in interpretation of prescription orders, pharmaceutical calculations, compounding procedures, physical manipulation of drugs and dosage form components, and product packaging and labeling.",
            "id": "PHMSCI 541",
            "parent": "PHMSCI",
            "title": "PHARMACEUTICAL CALCULATIONS, DISPENSING AND COMPOUNDING"
        }
    },
    {
        "data": {
            "id": "PHMSCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "PHMSCI 420",
            "target": "PHMSCI 541"
        }
    },
    {
        "data": {
            "source": "PHMSCI 540",
            "target": "PHMSCI 542"
        }
    },
    {
        "data": {
            "source": "PHMSCI 541",
            "target": "PHMSCI 542"
        }
    }
]