[
    {
        "data": {
            "id": "PHYSICS",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Statistical foundations, Liouville's theorem, ensembles, classical and quantum distribution functions, entropy and temperature, connection with thermodynamics, partition functions, quantum gases, non-ideal gases, phase transitions and critical phenomena, non-equilibrium problems, Boltzmann equation and the H-theorem, transport properties, connections with quantum field theory, applications of statistical mechanics to selected problems.",
            "id": "PHYSICS 715",
            "parent": "PHYSICS",
            "title": "STATISTICAL MECHANICS"
        }
    },
    {
        "data": {
            "description": "Schrodinger equation, operator theory, matrix mechanics, transformation theory, Heisenberg representation, orbital angular momentum, bound-state problems, scattering theory, stationary perturbation theory, degenerate systems, time-dependent perturbation theory, Born approximation, other approximation methods.  Knowledge of quantum mechanics and atomic physics  (such asPHYSICS 449or531) strongly encouraged.",
            "id": "PHYSICS 731",
            "parent": "PHYSICS",
            "title": "QUANTUM MECHANICS"
        }
    },
    {
        "data": {
            "source": "PHYSICS 731",
            "target": "PHYSICS 716"
        }
    },
    {
        "data": {
            "source": "PHYSICS 715",
            "target": "PHYSICS 716"
        }
    },
    {
        "data": {
            "description": "Symmetries and symmetry breaking, phase transitions, mean field theory, critical exponents, scaling hypothesis, renormalization group, diagrammatic expansion, epsilon-expansion, exact solution of the 2d Ising model. Boltzman kinetic equation, H-theorem, Fokker-Planck and Langevin equations, Born-Markov master equation, Lindblad superoperators, classical and quantum noise, theory of amplifiers.",
            "id": "PHYSICS 716",
            "parent": "PHYSICS",
            "title": "STATISTICAL MECHANICS II"
        }
    }
]