[
    {
        "data": {
            "description": "A detailed introduction to quantum computation and quantum information processing. Basic topics of quantum mechanics that are most relevant to quantum computing, particularly measurement theory. Specialized topics such as entanglement, other measures of quantum correlation and the Bell inequalities. Classical and quantum information theory, classical and quantum complexity theory. Qubits, quantum gates, quantum circuits. Teleportation, quantum dense coding, quantum cryptography. Quantum algorithms: Deustch, Simon, Shor, Grover, and adiabatic algorithms. Basic quantum error correction: 5-qubit, Steane and Shor codes. Completion of one undergraduate course in quantum mechanics recommended, such asPHYSICS 448or531.",
            "id": "PHYSICS 709",
            "parent": "PHYSICS",
            "title": "INTRODUCTION TO QUANTUM COMPUTING"
        }
    },
    {
        "data": {
            "description": "Dive into the quantum computing stack by starting with real-world applications and progressing through the essential components needed for fault-tolerant quantum computers. Learn about key areas such as quantum algorithms, and advanced quantum error correction. Explore algorithms for scientific applications, including quantum phase estimation and the HHL algorithm, and examine the derivation, trade-offs, and implementation of sophisticated error correction techniques. Learn to analyze and estimate the full-stack quantum resources required for novel quantum algorithms by utilizing classical computational tools, in order to develop and evaluate scalable, high-utility quantum computing solutions.",
            "id": "PHYSICS 765",
            "parent": "PHYSICS",
            "title": "QUANTUM ALGORITHMS AND ERROR CORRECTION"
        }
    },
    {
        "data": {
            "id": "PHYSICS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "PHYSICS 709",
            "target": "PHYSICS 765"
        }
    }
]