[
    {
        "data": {
            "id": "PHYTHER",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Learning experiences in a clinical setting under the direct guidance of a physical therapist (Clinical Instructor). Ability to perform physical therapy examinations of body structures and functions, and other evaluations, interventions, and outcomes assessed by evaluative tools, such as the Clinical Performance Instrument (CPI).",
            "id": "PHYTHER 706",
            "parent": "PHYTHER",
            "title": "CLINICAL INTERNSHIP VII"
        }
    },
    {
        "data": {
            "source": "PHYTHER 676",
            "target": "PHYTHER 679"
        }
    },
    {
        "data": {
            "description": "Provides the physical therapy student with the cognitive, affective, and psychomotor knowledge for effective examination, evaluation, diagnosis and management of patients/clients of all ages with various musculoskeletal dysfunctions related specifically to the extremities.",
            "id": "PHYTHER 677",
            "parent": "PHYTHER",
            "title": "MUSCULOSKELETAL DYSFUNCTION : EXAMINATION, DIAGNOSIS, & MANAGEMENT II"
        }
    },
    {
        "data": {
            "source": "PHYTHER 677",
            "target": "PHYTHER 679"
        }
    },
    {
        "data": {
            "description": "Provides the cognitive, affective and psychomotor skills for efficacious examination/evaluation and treatment of patients/clients with amputation. Course topics include the management of patients/clients with congenital and/or acquired amputation and its subsequent prosthetic management. Functional training in self-care and home management including activities of daily living (ADLs) and instrumental activities of daily living (IADLs), as well as functional training in work (job/school/play) are covered in the context of patients with limb loss.",
            "id": "PHYTHER 679",
            "parent": "PHYTHER",
            "title": "PROSTHETICS: APPLICATIONS IN PHYSICAL THERAPY PRACTICE"
        }
    },
    {
        "data": {
            "source": "PHYTHER 679",
            "target": "PHYTHER 706"
        }
    },
    {
        "data": {
            "description": "Provides the physical therapy student with the cognitive, affective, and psychomotor knowledge for effective examination, evaluation, diagnosis and management of patients/clients of all ages with various musculoskeletal dysfunctions related specifically to the spine.",
            "id": "PHYTHER 676",
            "parent": "PHYTHER",
            "title": "MUSCULOSKELETAL DYSFUNCTION : EXAMINATION, DIAGNOSIS, & MANAGEMENT I"
        }
    }
]