[
    {
        "data": {
            "id": "MICROBIO",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics and selected topics in Animal Physiology.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "id": "BIOCHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "General biological principles. Topics include: evolution, ecology, animal behavior, cell structure and function, genetics and molecular genetics and the physiology of a variety of organ systems emphasizing function in humans.",
            "id": "BIOLOGY/ZOOLOGY 101",
            "title": "ANIMAL BIOLOGY"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 508",
            "target": "PLPATH 622"
        }
    },
    {
        "data": {
            "description": "Principles of molecular structure and bonding applied to predict and explain the reactivity of alkanes, alkenes, alkynes, alkyl halides, alcohols, and thiols. Emphasis placed on rationalizing the stereochemical and regiochemical outcome of chemical processes.",
            "id": "CHEM 343",
            "parent": "CHEM",
            "title": "ORGANIC CHEMISTRY I"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "GENETICS 467"
        }
    },
    {
        "data": {
            "description": "Basic biology of microorganisms, including structure, function, physiology, genetics, ecology, diversity, and evolution.",
            "id": "MICROBIO 303",
            "parent": "MICROBIO",
            "title": "BIOLOGY OF MICROORGANISMS"
        }
    },
    {
        "data": {
            "source": "GENETICS 466",
            "target": "GENETICS 467"
        }
    },
    {
        "data": {
            "source": "MICROBIO 303",
            "target": "PLPATH 622"
        }
    },
    {
        "data": {
            "description": "Principles and application of chemical equilibrium, coordination chemistry, oxidation-reduction and electrochemistry, kinetics, nuclear chemistry, introduction to organic chemistry, and chemistry laboratory skills.",
            "id": "CHEM 104",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY II"
        }
    },
    {
        "data": {
            "source": "CHEM 115",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "description": "Genetics of eukaryotes and prokaryotes. Includes transmission genetics, probability and hypothesis testing, genetic mapping, molecular genetics, gene expression, and genetic engineering. Illustrative material includes viruses, bacteria, plants, fungi, insects, and humans.",
            "id": "GENETICS 467",
            "parent": "GENETICS",
            "title": "GENERAL GENETICS 1"
        }
    },
    {
        "data": {
            "source": "CHEM 345",
            "target": "BIOCHEM 507"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 507",
            "target": "BIOCHEM 508"
        }
    },
    {
        "data": {
            "description": "Explores a detailed atomic and molecular view of matter and its interactions, with a specific focus on quantum theory, molecular structure, and chemical bonding. Application required for enrollment.",
            "id": "CHEM 115",
            "parent": "CHEM",
            "title": "CHEMICAL PRINCIPLES I"
        }
    },
    {
        "data": {
            "description": "Basic principles of ecology and interrelations between individuals, populations, communities, ecosystems and their environment; transmission genetics and introduction to population genetics; origin of life, evolutionary mechanisms, ancestral relationships among species, and the diversity of life.",
            "id": "BIOCORE 381",
            "parent": "BIOCORE",
            "title": "EVOLUTION, ECOLOGY, AND GENETICS"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "id": "GENETICS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "GENETICS 467",
            "target": "GENETICS 466"
        }
    },
    {
        "data": {
            "source": "GENETICS 468",
            "target": "GENETICS 466"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Stoichiometry and the mole concept, the behavior of gases, liquids and solids, thermochemistry, electronic structure of atoms and chemical bonding, descriptive chemistry of selected elements and compounds, intermolecular forces, and chemistry laboratory skills.",
            "id": "CHEM 103",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Genetic analysis, population genetics, evolution and quantitative genetics. Includes mutant screens, pathway analysis, mosaic analysis, reverse genetics, genomics, Hardy-Weinberg  linkage equilibrium, inbreeding, genetic drift, natural selection, population structure, inheritance of complex traits, domestication and human evolution.",
            "id": "GENETICS 468",
            "parent": "GENETICS",
            "title": "GENERAL GENETICS 2"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 343"
        }
    },
    {
        "data": {
            "description": "Accelerated coverage of topics in general chemistry, including introduction to laboratory techniques. Topics include atomic and molecular structure, chemical equilibrium, acid-base chemistry, thermodynamics, kinetics, and electrochemistry.",
            "id": "CHEM 109",
            "parent": "CHEM",
            "title": "ADVANCED GENERAL CHEMISTRY"
        }
    },
    {
        "data": {
            "source": "CHEM 343",
            "target": "CHEM 345"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "GENETICS 467"
        }
    },
    {
        "data": {
            "description": "Principles of molecular structure and bonding applied to predict and explain the reactivity of aromatic systems, benzylic and allylic systems, aryl and vinyl halides, and carbonyl-containing compounds (e.g., ketones, carboxylic acids, esters, acid chlorides, amides). Emphasis placed on rationalizing the stereochemical and regiochemical outcome of chemical processes as well as arguing reaction outcomes from spectroscopic evidence.",
            "id": "CHEM 345",
            "parent": "CHEM",
            "title": "ORGANIC CHEMISTRY II"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 151"
        }
    },
    {
        "data": {
            "description": "Genetics in eukaryotes and prokaryotes.  Includes transmission genetics, molecular genetics, evolutionary genetics, genetic engineering, and societal issues associated with genetics.  Illustrative material includes bacteria, plants, insects, and vertebrates.",
            "id": "GENETICS 466",
            "parent": "GENETICS",
            "title": "PRINCIPLES OF GENETICS"
        }
    },
    {
        "data": {
            "source": "GENETICS 467",
            "target": "GENETICS 468"
        }
    },
    {
        "data": {
            "id": "BIOCORE",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Introduction to the basic principles and concepts of the biology of plants. an integrative approach stressing evolutionary sequences and the relationship between structure and function at succeeding levels of organization: molecule, cell, organism, population, community. Correlated lectures, laboratories, and discussions.",
            "id": "BIOLOGY/BOTANY 130",
            "title": "GENERAL BOTANY"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "GENETICS 466"
        }
    },
    {
        "data": {
            "description": "Chemistry of biological materials, intermediary metabolism and protein structure.",
            "id": "BIOCHEM 507",
            "parent": "BIOCHEM",
            "title": "GENERAL BIOCHEMISTRY I"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 101"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "MICROBIO 303"
        }
    },
    {
        "data": {
            "id": "PLPATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "MICROBIO 303"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "MICROBIO 303"
        }
    },
    {
        "data": {
            "description": "Physiology, genetics, taxonomy, and ecology of bacterial pathogens, epiphytes, and symbionts of plants.",
            "id": "PLPATH 622",
            "parent": "PLPATH",
            "title": "PLANT-BACTERIAL INTERACTIONS"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 109"
        }
    },
    {
        "data": {
            "description": "Biosynthesis of biological molecules, signal transduction mechanisms, chemistry and metabolism of nucleic acids, protein synthesis, and molecular and cellular biology.",
            "id": "BIOCHEM 508",
            "parent": "BIOCHEM",
            "title": "GENERAL BIOCHEMISTRY II"
        }
    },
    {
        "data": {
            "source": "GENETICS 466",
            "target": "PLPATH 622"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "CHEM 104"
        }
    }
]