[
    {
        "data": {
            "description": "African society and culture, polity and economy in multidisciplinary perspectives from prehistory and ancient kingdoms through the colonial period to contemporary developments, including modern nationalism, economic development and changing social structure.",
            "id": "AFRICAN/AFROAMER/ANTHRO/GEOG/HISTORY/POLISCI/SOC 277",
            "title": "AFRICA: AN INTRODUCTORY SURVEY"
        }
    },
    {
        "data": {
            "description": "Introduction to Comparative Politics, one of the four sub-fields in Political Science, which involves the comparative analysis of political institutions, processes, and outcomes at the national level. Examines how to usefully compare politics in a variety of countries and makes comparisons explicit and systematic in order to determine how governments work, how power is organized and contested at the national level, and how people can participate and pursue their interests in different political settings. Includes key concepts, theories, methods, and country case studies.",
            "id": "POLISCI 182",
            "parent": "POLISCI",
            "title": "INTRODUCTION TO COMPARATIVE POLITICS (HONORS)"
        }
    },
    {
        "data": {
            "description": "Introduction to Comparative Politics, one of the four sub-fields in Political Science, which involves the comparative analysis of political institutions, processes, and outcomes at the national level. Examines how to usefully compare politics in a variety of countries and makes comparisons explicit and systematic in order to determine how governments work, how power is organized and contested at the national level, and how regular people can participate and pursue their interests in different political settings. Includes key concepts, theories, methods, issues, and language.",
            "id": "POLISCI 120",
            "parent": "POLISCI",
            "title": "INTRODUCTION TO COMPARATIVE POLITICS"
        }
    },
    {
        "data": {
            "description": "Process of rapid political change in contemporary Africa with special emphasis on the emergence of new states. Not open to students with credit for POLI SCI 660 prior to fall 2017",
            "id": "POLISCI 329",
            "parent": "POLISCI",
            "title": "AFRICAN POLITICS"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "POLISCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "AFRICAN/AFROAMER/ANTHRO/GEOG/HISTORY/POLISCI/SOC 277",
            "target": "POLISCI 329"
        }
    },
    {
        "data": {
            "source": "POLISCI 120",
            "target": "POLISCI 182"
        }
    },
    {
        "data": {
            "source": "POLISCI 120",
            "target": "POLISCI 329"
        }
    },
    {
        "data": {
            "source": "POLISCI 182",
            "target": "POLISCI 120"
        }
    },
    {
        "data": {
            "source": "POLISCI 182",
            "target": "POLISCI 329"
        }
    }
]