[
    {
        "data": {
            "description": "Covers the major issues in international relations since the end of World War II including: the causes of war; civil wars and ethnic conflict; economic development; international trade; exchange rates and international monetary relations; international capital flows and financial crises; foreign direct investment; globalization and the environment; the UN, the IMF, World Bank, WTO, and other international organizations; and international law and human rights. The focus is on states' relations with each other and the factors determining the nature and outcomes of these international interactions. The course seeks to develop analytical tools for thinking about important questions in world politics regardless of the countries or issues involved, to examine international affairs in a systematic way. Students who have taken POLI SCI 103 prior to Fall 2017 may not enroll in this course.",
            "id": "POLISCI 140",
            "parent": "POLISCI",
            "title": "INTRODUCTION TO INTERNATIONAL RELATIONS"
        }
    },
    {
        "data": {
            "description": "Focuses on how to analyze problems in international politics by the use of game theory. Examples include governments making choices about the size of their military forces, barriers to trade, or international agreements on environmental issues. Analysts study strategic interaction using both informal and mathematical methods. Provides a good introduction to the basics of game theory -- a tool useful in many different settings -- as well as an introduction to the study of world politics. From the perspective of quantitative reasoning, one of the most important set of lessons center on the logic of strategic interaction and the notion of equilibrium. Along with basic game theory students will also be introduced to the pragmatic use of mathematical tools including algebra, set theory, functions, and probability theory. Not open to students with credit for POLI SCI 376 prior to fall 2017",
            "id": "POLISCI 348",
            "parent": "POLISCI",
            "title": "ANALYSIS OF INTERNATIONAL RELATIONS"
        }
    },
    {
        "data": {
            "id": "POLISCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "POLISCI 140",
            "target": "POLISCI 348"
        }
    }
]