[
    {
        "data": {
            "id": "POLISCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "POLISCI 104",
            "target": "POLISCI 320"
        }
    },
    {
        "data": {
            "source": "POLISCI 140",
            "target": "POLISCI 320"
        }
    },
    {
        "data": {
            "description": "Covers the major issues in international relations since the end of World War II including: the causes of war; civil wars and ethnic conflict; economic development; international trade; exchange rates and international monetary relations; international capital flows and financial crises; foreign direct investment; globalization and the environment; the UN, the IMF, World Bank, WTO, and other international organizations; and international law and human rights. The focus is on states' relations with each other and the factors determining the nature and outcomes of these international interactions. The course seeks to develop analytical tools for thinking about important questions in world politics regardless of the countries or issues involved, to examine international affairs in a systematic way. Students who have taken POLI SCI 103 prior to Fall 2017 may not enroll in this course.",
            "id": "POLISCI 140",
            "parent": "POLISCI",
            "title": "INTRODUCTION TO INTERNATIONAL RELATIONS"
        }
    },
    {
        "data": {
            "description": "Basic institutions and processes of American government. The role of constitutional structures, parties, interest groups and elections in the system; policy formation and policy content.",
            "id": "POLISCI 104",
            "parent": "POLISCI",
            "title": "INTRODUCTION TO AMERICAN POLITICS AND GOVERNMENT"
        }
    },
    {
        "data": {
            "source": "POLISCI 104",
            "target": "POLISCI 184"
        }
    },
    {
        "data": {
            "description": "An introduction to the most pertinent themes to the study of politics and governance in the Middle East. Main topics to be covered: political economy of the region; link between Islam, culture and democracy; the politics of authoritarianism; and political Islam.",
            "id": "POLISCI 320",
            "parent": "POLISCI",
            "title": "GOVERNMENTS AND POLITICS OF THE MIDDLE EAST AND NORTH AFRICA"
        }
    },
    {
        "data": {
            "source": "POLISCI 184",
            "target": "POLISCI 104"
        }
    },
    {
        "data": {
            "description": "Basic institutions and processes of American government. The role of constitutional structures, parties, interest groups and elections in the system; policy formation and policy comment.",
            "id": "POLISCI 184",
            "parent": "POLISCI",
            "title": "INTRODUCTION TO AMERICAN POLITICS"
        }
    }
]