[
    {
        "data": {
            "description": "An introduction to the study of religion through the lens of health and health through the lens of religion employing approaches from the humanities and social sciences in conversation with health-related disciplines. It asks questions such as, How do religious peoples understand and live in sickness and health? How do people connect physical well-being to spiritual well-being? Medicine to meaning-making? How does looking at religion in sickness and health provide insight into its roles in a variety of cultures and contexts, globally and locally? How do health and religion connect particularly in situations of social marginalization and immigration? How does religion impact understandings of health and sickness beyond the borders of specific religious communities?",
            "id": "RELIGST 102",
            "parent": "RELIGST",
            "title": "EXPLORING RELIGION IN SICKNESS AND HEALTH"
        }
    },
    {
        "data": {
            "description": "Explores the relationships and interactions between religion and politics from a comparative perspective. Discuss the appropriate relationship between religion and state. Investigate the implications of the various ways in which the religion-state relationship have been involved in political conflict. Building on this, turn to several of the current issues in religion and politics asking: Why is religion apparently more important than ever despite an increasingly secular world? What is religious nationalism? What is fundamentalism? How can we explain the similarities and differences between religious fundamentalist movements across the globe? How should democratic states cope with the emergence of fundamentalist movements? In order to begin answering these questions,  integrate the theoretical frameworks we develop with explorations of the historical and local context of relevant case-studies from around the world.",
            "id": "POLISCI/RELIGST 433",
            "title": "RELIGION AND POLITICS"
        }
    },
    {
        "data": {
            "description": "Foundational and thematic approaches in the academic study of religion applied across global religious systems.",
            "id": "RELIGST 101",
            "parent": "RELIGST",
            "title": "RELIGION IN GLOBAL PERSPECTIVE"
        }
    },
    {
        "data": {
            "description": "Introduction to Comparative Politics, one of the four sub-fields in Political Science, which involves the comparative analysis of political institutions, processes, and outcomes at the national level. Examines how to usefully compare politics in a variety of countries and makes comparisons explicit and systematic in order to determine how governments work, how power is organized and contested at the national level, and how people can participate and pursue their interests in different political settings. Includes key concepts, theories, methods, and country case studies.",
            "id": "POLISCI 182",
            "parent": "POLISCI",
            "title": "INTRODUCTION TO COMPARATIVE POLITICS (HONORS)"
        }
    },
    {
        "data": {
            "description": "Introduction to Comparative Politics, one of the four sub-fields in Political Science, which involves the comparative analysis of political institutions, processes, and outcomes at the national level. Examines how to usefully compare politics in a variety of countries and makes comparisons explicit and systematic in order to determine how governments work, how power is organized and contested at the national level, and how regular people can participate and pursue their interests in different political settings. Includes key concepts, theories, methods, issues, and language.",
            "id": "POLISCI 120",
            "parent": "POLISCI",
            "title": "INTRODUCTION TO COMPARATIVE POLITICS"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "POLISCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "RELIGST",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "POLISCI 120",
            "target": "POLISCI 182"
        }
    },
    {
        "data": {
            "source": "POLISCI 120",
            "target": "POLISCI/RELIGST 433"
        }
    },
    {
        "data": {
            "source": "POLISCI 182",
            "target": "POLISCI 120"
        }
    },
    {
        "data": {
            "source": "RELIGST 101",
            "target": "POLISCI/RELIGST 433"
        }
    },
    {
        "data": {
            "source": "RELIGST 102",
            "target": "POLISCI/RELIGST 433"
        }
    }
]