[
    {
        "data": {
            "description": "Covers the major issues in international relations since the end of World War II including: the causes of war; civil wars and ethnic conflict; economic development; international trade; exchange rates and international monetary relations; international capital flows and financial crises; foreign direct investment; globalization and the environment; the UN, the IMF, World Bank, WTO, and other international organizations; and international law and human rights. The focus is on states' relations with each other and the factors determining the nature and outcomes of these international interactions. The course seeks to develop analytical tools for thinking about important questions in world politics regardless of the countries or issues involved, to examine international affairs in a systematic way. Students who have taken POLI SCI 103 prior to Fall 2017 may not enroll in this course.",
            "id": "POLISCI 140",
            "parent": "POLISCI",
            "title": "INTRODUCTION TO INTERNATIONAL RELATIONS"
        }
    },
    {
        "data": {
            "description": "Basic institutions and processes of American government. The role of constitutional structures, parties, interest groups and elections in the system; policy formation and policy comment.",
            "id": "POLISCI 184",
            "parent": "POLISCI",
            "title": "INTRODUCTION TO AMERICAN POLITICS"
        }
    },
    {
        "data": {
            "description": "Basic institutions and processes of American government. The role of constitutional structures, parties, interest groups and elections in the system; policy formation and policy content.",
            "id": "POLISCI 104",
            "parent": "POLISCI",
            "title": "INTRODUCTION TO AMERICAN POLITICS AND GOVERNMENT"
        }
    },
    {
        "data": {
            "description": "Examines the causes of terrorism, goals and strategies pursued by terrorist groups, the consequences of terrorism, and counterterrorism policies adopted by governments. Not open to students with credit for POLI SCI 319 prior to fall 2017",
            "id": "POLISCI 347",
            "parent": "POLISCI",
            "title": "TERRORISM"
        }
    },
    {
        "data": {
            "description": "Introduction to Comparative Politics, one of the four sub-fields in Political Science, which involves the comparative analysis of political institutions, processes, and outcomes at the national level. Examines how to usefully compare politics in a variety of countries and makes comparisons explicit and systematic in order to determine how governments work, how power is organized and contested at the national level, and how people can participate and pursue their interests in different political settings. Includes key concepts, theories, methods, and country case studies.",
            "id": "POLISCI 182",
            "parent": "POLISCI",
            "title": "INTRODUCTION TO COMPARATIVE POLITICS (HONORS)"
        }
    },
    {
        "data": {
            "description": "Introduction to Comparative Politics, one of the four sub-fields in Political Science, which involves the comparative analysis of political institutions, processes, and outcomes at the national level. Examines how to usefully compare politics in a variety of countries and makes comparisons explicit and systematic in order to determine how governments work, how power is organized and contested at the national level, and how regular people can participate and pursue their interests in different political settings. Includes key concepts, theories, methods, issues, and language.",
            "id": "POLISCI 120",
            "parent": "POLISCI",
            "title": "INTRODUCTION TO COMPARATIVE POLITICS"
        }
    },
    {
        "data": {
            "id": "POLISCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "POLISCI 104",
            "target": "POLISCI 184"
        }
    },
    {
        "data": {
            "source": "POLISCI 104",
            "target": "POLISCI 347"
        }
    },
    {
        "data": {
            "source": "POLISCI 120",
            "target": "POLISCI 182"
        }
    },
    {
        "data": {
            "source": "POLISCI 120",
            "target": "POLISCI 347"
        }
    },
    {
        "data": {
            "source": "POLISCI 140",
            "target": "POLISCI 347"
        }
    },
    {
        "data": {
            "source": "POLISCI 182",
            "target": "POLISCI 120"
        }
    },
    {
        "data": {
            "source": "POLISCI 182",
            "target": "POLISCI 347"
        }
    },
    {
        "data": {
            "source": "POLISCI 184",
            "target": "POLISCI 104"
        }
    }
]