[
    {
        "data": {
            "description": "Introduction to Comparative Politics, one of the four sub-fields in Political Science, which involves the comparative analysis of political institutions, processes, and outcomes at the national level. Examines how to usefully compare politics in a variety of countries and makes comparisons explicit and systematic in order to determine how governments work, how power is organized and contested at the national level, and how people can participate and pursue their interests in different political settings. Includes key concepts, theories, methods, and country case studies.",
            "id": "POLISCI 182",
            "parent": "POLISCI",
            "title": "INTRODUCTION TO COMPARATIVE POLITICS (HONORS)"
        }
    },
    {
        "data": {
            "description": "Introduction to Comparative Politics, one of the four sub-fields in Political Science, which involves the comparative analysis of political institutions, processes, and outcomes at the national level. Examines how to usefully compare politics in a variety of countries and makes comparisons explicit and systematic in order to determine how governments work, how power is organized and contested at the national level, and how regular people can participate and pursue their interests in different political settings. Includes key concepts, theories, methods, issues, and language.",
            "id": "POLISCI 120",
            "parent": "POLISCI",
            "title": "INTRODUCTION TO COMPARATIVE POLITICS"
        }
    },
    {
        "data": {
            "description": "Nationalist conflict and ethnic contestation remain major components of global politics. Drawing on cases from around the world, this course explores why this is the case. In the process, we will address a number of crucial questions: What are nations and ethnic groups? Where do they come from? Why do they pick particular territories? How do they define who can be part of the group? Why are they so successful in mobilizing people to kill and be killed? In the course of answering these questions, the course investigates the interactions between nations and states, religion and nationalism, globalization, citizenship and minority rights, and the causes and solutions for national and ethnic conflict.",
            "id": "POLISCI 437",
            "parent": "POLISCI",
            "title": "NATIONALISM AND ETHNIC CONFLICT"
        }
    },
    {
        "data": {
            "id": "POLISCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "POLISCI 120",
            "target": "POLISCI 182"
        }
    },
    {
        "data": {
            "source": "POLISCI 182",
            "target": "POLISCI 120"
        }
    },
    {
        "data": {
            "source": "POLISCI 182",
            "target": "POLISCI 437"
        }
    }
]