[
    {
        "data": {
            "description": "Basic institutions and processes of American government. The role of constitutional structures, parties, interest groups and elections in the system; policy formation and policy comment.",
            "id": "POLISCI 184",
            "parent": "POLISCI",
            "title": "INTRODUCTION TO AMERICAN POLITICS"
        }
    },
    {
        "data": {
            "description": "Basic institutions and processes of American government. The role of constitutional structures, parties, interest groups and elections in the system; policy formation and policy content.",
            "id": "POLISCI 104",
            "parent": "POLISCI",
            "title": "INTRODUCTION TO AMERICAN POLITICS AND GOVERNMENT"
        }
    },
    {
        "data": {
            "description": "This course undertakes an historical examination of the development of American constitutional thinking about individual rights and civil liberties from the founding era to the present day. Issue that are considered include freedoms guaranteed by the original Articles, the Bill of Rights, and the Civil War Amendments (XIII, XIV, and XV) as these issues appear in constitutional law, constitutional politics, and social and economic developments. The role of the federal courts, the nature and operation of principles of federalism, and the authority of Congress to protect constitutionally guaranteed rights are also major topics of consideration.",
            "id": "POLISCI 412",
            "parent": "POLISCI",
            "title": "THE AMERICAN CONSTITUTION: RIGHTS AND CIVIL LIBERTIES"
        }
    },
    {
        "data": {
            "id": "POLISCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "POLISCI 104",
            "target": "POLISCI 184"
        }
    },
    {
        "data": {
            "source": "POLISCI 104",
            "target": "POLISCI 412"
        }
    },
    {
        "data": {
            "source": "POLISCI 184",
            "target": "POLISCI 104"
        }
    },
    {
        "data": {
            "source": "POLISCI 184",
            "target": "POLISCI 412"
        }
    }
]