[
    {
        "data": {
            "description": "Behavior, including its development, motivation, frustrations, emotion, intelligence, learning, forgetting, personality, language, thinking, and social behavior.",
            "id": "PSYCH 202",
            "parent": "PSYCH",
            "title": "INTRODUCTION TO PSYCHOLOGY"
        }
    },
    {
        "data": {
            "description": "Emotional experience affects and defines every facet of our life, but it seems mysterious and unsuitable for scientific inquiry. Explore how and why emotion is not unsuited to scientific research and provides an in-depth examination of research from all sub-disciplines of the field of Psychology. This includes neuroscience and the biological bases of behavior, questions of the developmental curve for emotional phenomena and the relationship between feeling and thinking, and the study of social groups and culture. Readings and discussion attempt to integrate existent theory and research and apply their implications to the individual, the group, and society.",
            "id": "PSYCH 508",
            "parent": "PSYCH",
            "title": "PSYCHOLOGY OF HUMAN EMOTIONS: FROM BIOLOGY TO CULTURE"
        }
    },
    {
        "data": {
            "description": "Introduce classic and contemporary theories and research in the field, with an emphasis on experimental methodology. Examine the psychological study of the individual in the social world, including social interaction, motivation, attitudes, conformity, communication, leadership, personal relationships, and behavior in small groups.",
            "id": "PSYCH 456",
            "parent": "PSYCH",
            "title": "SOCIAL PSYCHOLOGY"
        }
    },
    {
        "data": {
            "id": "PSYCH",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "PSYCH 202",
            "target": "PSYCH 456"
        }
    },
    {
        "data": {
            "source": "PSYCH 456",
            "target": "PSYCH 508"
        }
    }
]