[
    {
        "data": {
            "description": "Introduces reproducible data management, modeling, analysis, and statistical inference through a practical, hands-on case studies approach. Topics include the use of an integrated statistical computing environment, data wrangling, the R programming language, data graphics and visualization, random variables and concepts of probability including the binomial and normal distributions, data modeling, statistical inference in one- and two- sample settings for proportions and means, simple linear regression, and report generation using R Markdown with applications to a wide variety of data to address open-ended questions.",
            "id": "STAT 240",
            "parent": "STAT",
            "title": "DATA SCIENCE MODELING I"
        }
    },
    {
        "data": {
            "description": "Introduction to economic ways of thinking about a wide range of problems and issues. Topics include consumption, production, prices, markets, finance, trade, pollution, growth, farms, taxes, and development.",
            "id": "AAE 101",
            "parent": "AAE",
            "title": "INTRODUCTION TO AGRICULTURAL AND APPLIED ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Many types of evidence can be incorporated into the policy process. Evidence is interpreted while considering quality and ethics, and effectively translated from scientific sources into useful communications and data visualizations. Evidence is examined from across a wide range of policy areas including healthcare, poverty, climate change, among others - all while considering the current reality of big data and algorithmic information environments. A broad understanding is required to translate evidence meaningfully and ethically into the design, implementation, and evaluation of public policy.",
            "id": "PUBAFFR 340",
            "parent": "PUBAFFR",
            "title": "INTERMEDIATE EVIDENCE-BASED POLICYMAKING AND COMMUNICATION"
        }
    },
    {
        "data": {
            "id": "AAE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "PUBAFFR",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "STAT",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "AAE 101",
            "target": "PUBAFFR 340"
        }
    },
    {
        "data": {
            "source": "STAT 240",
            "target": "PUBAFFR 340"
        }
    }
]