[
    {
        "data": {
            "source": "ECON 310",
            "target": "PUBAFFR 340"
        }
    },
    {
        "data": {
            "description": "Introduction to analysis of economic data. The techniques of descriptive statistics and statistical inference (hypothesis testing and estimation) as directed toward application in economic research.",
            "id": "ECON 310",
            "parent": "ECON",
            "title": "STATISTICS: MEASUREMENT IN ECONOMICS"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON 310"
        }
    },
    {
        "data": {
            "source": "ECON 102",
            "target": "ECON 310"
        }
    },
    {
        "data": {
            "description": "Presentation of sociological data; descriptive statistics; probability theory and statistical inference; estimation and tests of hypotheses; regression and correlation and the analysis of contingency tables.",
            "id": "C&ESOC/SOC 360",
            "title": "STATISTICS FOR SOCIOLOGISTS I"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 360",
            "target": "PUBAFFR 340"
        }
    },
    {
        "data": {
            "id": "ECON",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Integrated treatment of macroeconomics and microeconomics (seeECON 101andECON 102). Accelerated approach to economics training, especially for Economics: Math Emphasis majors.",
            "id": "ECON 111",
            "parent": "ECON",
            "title": "PRINCIPLES OF ECONOMICS-ACCELERATED TREATMENT"
        }
    },
    {
        "data": {
            "description": "Macroeconomic measurement and models of aggregate demand and supply; fiscal and monetary policy for unemployment, inflation, and growth.",
            "id": "ECON 102",
            "parent": "ECON",
            "title": "PRINCIPLES OF MACROECONOMICS"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON 102"
        }
    },
    {
        "data": {
            "id": "PUBAFFR",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON 111"
        }
    },
    {
        "data": {
            "description": "Many types of evidence can be incorporated into the policy process. Evidence is interpreted while considering quality and ethics, and effectively translated from scientific sources into useful communications and data visualizations. Evidence is examined from across a wide range of policy areas including healthcare, poverty, climate change, among others - all while considering the current reality of big data and algorithmic information environments. A broad understanding is required to translate evidence meaningfully and ethically into the design, implementation, and evaluation of public policy.",
            "id": "PUBAFFR 340",
            "parent": "PUBAFFR",
            "title": "INTERMEDIATE EVIDENCE-BASED POLICYMAKING AND COMMUNICATION"
        }
    },
    {
        "data": {
            "description": "Economic problems of individuals, firms and industries with emphasis on value, price, and distribution of income.",
            "id": "ECON 101",
            "parent": "ECON",
            "title": "PRINCIPLES OF MICROECONOMICS"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON 101"
        }
    }
]