[
    {
        "data": {
            "id": "RADIOL",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 810",
            "target": "RADIOL 911"
        }
    },
    {
        "data": {
            "id": "MEDSC-M",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 773",
            "target": "MEDSC-M 810"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 775",
            "target": "MEDSC-M 810"
        }
    },
    {
        "data": {
            "description": "The diagnosis and management of congenital abnormality requires an understanding of the basic principles of embryology, imaging, and genetics. Replicating how patients enter the medical system, the didactic path begins with ultrasound diagnosis of fetal abnormality. The embryological basis of the fetal malformations will be examined. From this center, exposure to advanced diagnostics, such as fetal echocardiography, fetal MRI, and genetic testing and counseling. Topics extend to early postnatal care (pediatric genetics and pediatric radiology). Participate in the Meriter Perinatal Conference, learn about genetic approaches to the diagnosis of fetal malformation syndromes, and learn the rudiments of an obstetrical sonogram.",
            "id": "RADIOL 911",
            "parent": "RADIOL",
            "title": "IMAGING AND EMBRYOLOGY: THE BASIC SCIENCE OF FETAL DYSMORPHOGENESIS"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "RADIOL 911"
        }
    },
    {
        "data": {
            "description": "Develop clinical knowledge and skills necessary to care for patients in Pediatrics and Obstetrics and Gynecology, with emphasis on unique skills such as taking care of vulnerable populations as identified in women's and child health and working with caregivers in addition to the patient themselves. Increase knowledge of fundamental science concepts introduced in Human Family Tree during Phase 1 of the curriculum, such as embryology and teratology, genetic testing, and neurodevelopment. Clinical experiences will occur in a range of representative inpatient, outpatient and surgical settings. In structured educational sessions, compare and contrast selected topics in pediatric, obstetric, and gynecologic patient populations, highlighting the relevant physiology, pathophysiology, basic science, and public health topics.",
            "id": "MEDSC-M 810",
            "parent": "MEDSC-M",
            "title": "SPECIALIZED CARE OF OBSTETRIC, GYNECOLOGIC, AND PEDIATRIC PATIENTS (SCOPE)"
        }
    },
    {
        "data": {
            "description": "Introduction to core basic science, pathophysiologic, and diagnostic principles requisite for the care and treatment of patients with musculoskeletal, neurologic, and psychiatric presentations and disorders. Basic science concepts include those from the traditional disciplines of cell biology, histology, biochemistry, anatomy, embryology, neuroscience, and behavioral science. Regular integration of these topics with their pathologic and pathophysiologic counterparts. Integration of content related to other competency domains, or \"longitudinal threads\", that include patient care  communication, evidence based medicine, health information technology, quality improvement  patient safety, professionalism, scientific inquiry and public health.",
            "id": "MEDSC-M 775",
            "parent": "MEDSC-M",
            "title": "MIND & MOTION"
        }
    },
    {
        "data": {
            "description": "Care of adults and children undergoing an operation or procedure, including perioperative preparation, operative care, and post-operative cares for core clinical conditions in the specialties of anesthesia, neurosurgery, ophthalmology, general surgery, otolaryngology, urology, cardiothoracic surgery, peripheral vascular surgery, orthopedics, plastic and reconstructive surgery, and gynecology, as well as interventional radiology, procedural cardiology and gastroenterology. Basic science concepts include cerebral spinal fluid production and flow, fluids and electrolytes, consciousness, inflammation and wound healing, and cancer biology. Anatomic approach using case discussions, podcasts, curated independent reading, online nationally supported modules, and simulation skills. Longitudinal patient care experience integrating communication, evidence based medicine, health information technology, quality improvement  patient safety, professionalism, scientific inquiry, and public health.",
            "id": "MEDSC-M 813",
            "parent": "MEDSC-M",
            "title": "SURGICAL AND PROCEDURAL CARE"
        }
    },
    {
        "data": {
            "description": "Focuses on molecular, genetic, embryologic, hormonal, anatomical and physiological factors that govern fertility, cell growth, fetal development, and pregnancy as well as the congenital anomalies that can occur when those processes are aberrant. Encompasses the full life-cycle spectrum including childhood growth and development, young adulthood/puberty, issues affecting adolescents and young adults, genetic basis of human disease, reproductive health, menopause, aging, unregulated cell growth (cancer) and end of life issues. Significant content from other competency domains, or \"longitudinal threads\", such as public health, advocacy, ethics, patient care/communication and clinical skills.",
            "id": "MEDSC-M 773",
            "parent": "MEDSC-M",
            "title": "HUMAN FAMILY TREE"
        }
    }
]