[
    {
        "data": {
            "description": "Care of adults and children undergoing an operation or procedure, including perioperative preparation, operative care, and post-operative cares for core clinical conditions in the specialties of anesthesia, neurosurgery, ophthalmology, general surgery, otolaryngology, urology, cardiothoracic surgery, peripheral vascular surgery, orthopedics, plastic and reconstructive surgery, and gynecology, as well as interventional radiology, procedural cardiology and gastroenterology. Basic science concepts include cerebral spinal fluid production and flow, fluids and electrolytes, consciousness, inflammation and wound healing, and cancer biology. Anatomic approach using case discussions, podcasts, curated independent reading, online nationally supported modules, and simulation skills. Longitudinal patient care experience integrating communication, evidence based medicine, health information technology, quality improvement  patient safety, professionalism, scientific inquiry, and public health.",
            "id": "MEDSC-M 813",
            "parent": "MEDSC-M",
            "title": "SURGICAL AND PROCEDURAL CARE"
        }
    },
    {
        "data": {
            "description": "Graduating medical students are faced with a wide array of financial planning and wellness challenges. The median medical student debt has continued to increase, and there is a corresponding proliferation of federal repayment and forgiveness options. Other financial planning needs, such as budgeting and insurance, also arise during this time of transition. A unique opportunity to learn key concepts around budgeting, investing, insurance, and negotiation through independent and group learning experiences. This format allows for better analysis on financial decisions and to understand the impact of these decisions on both current and future financial health and wellness.",
            "id": "RADIOL 914",
            "parent": "RADIOL",
            "title": "PHYSICIAN FINANCIAL WELLNESS"
        }
    },
    {
        "data": {
            "description": "Identify the roles of physicians, interdisciplinary providers, health care systems, and communities in screening, treating, and preventing common, chronic conditions. Activities are centered on health promotion, outpatient-based chronic disease management, and community health. Clinical experiences will occur in primary care, behavioral health, and other ambulatory and community-based settings that focus on chronic disease management.",
            "id": "MEDSC-M 811",
            "parent": "MEDSC-M",
            "title": "CHRONIC AND PREVENTIVE CARE"
        }
    },
    {
        "data": {
            "id": "MEDSC-M",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "RADIOL",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 811",
            "target": "RADIOL 914"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "RADIOL 914"
        }
    }
]