[
    {
        "data": {
            "description": "Basic principles and definitions of sociology. Readings and discussion of the perspectives of sociology, the individual and society, groups and social process, stratification, organizations and power, demography, and social change.",
            "id": "C&ESOC/SOC 211",
            "title": "THE SOCIOLOGICAL ENTERPRISE"
        }
    },
    {
        "data": {
            "description": "Introduction to principles and basic techniques in surveys for social research. Specific topics include the basic concepts of sampling and survey measurement. Learn how survey researchers apply the methods presented and practice applying the concepts and methods learned. The techniques used in this class are relevant for many kinds of data collection and standardized measurement. Provides a substantial experience with practical research skills that are relevant in many academic and private sector contexts.",
            "id": "SOC 351",
            "parent": "SOC",
            "title": "INTRODUCTION TO SURVEY METHODS FOR SOCIAL RESEARCH"
        }
    },
    {
        "data": {
            "description": "Introduction to the field of American sociology, its subfields and specialized areas of research, theoretical traditions and research methods.",
            "id": "C&ESOC/SOC 210",
            "title": "SURVEY OF SOCIOLOGY"
        }
    },
    {
        "data": {
            "description": "Scientific methods in the study of society; procedures for testing sociological theory: problem definition, hypothesis construction, collection and evaluation of data. Practical experience conducting small research projects.",
            "id": "C&ESOC/SOC 357",
            "title": "METHODS OF SOCIOLOGICAL INQUIRY"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "SOC",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 210",
            "target": "C&ESOC/SOC 211"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 210",
            "target": "C&ESOC/SOC 357"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 211",
            "target": "C&ESOC/SOC 210"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 357",
            "target": "SOC 351"
        }
    }
]