[
    {
        "data": {
            "description": "Examine foundational principles and processes involved in social work research to promote critical consumption of research that informs generalist social work knowledge base and practice. Evaluate empirical research to apply concepts and grasp strengths and limitations of various research designs. Gain foundational skills to engage in research activities that support evidence-based social-work practice. Address how questions are transformed into basic and applied researchable questions and the various considerations pertaining to conceptualization, measurement, sampling, and implementation of various qualitative and quantitative research designs, with particular attention to evaluation of social work practice and programs. Review social science research paradigms that shape researchers' worldview and methods, ethics and professional conduct in social work research, and the use of research as a tool to promote social work values and achieve social justice aims.",
            "id": "SOCWORK 650",
            "parent": "SOCWORK",
            "title": "METHODS OF SOCIAL WORK RESEARCH"
        }
    },
    {
        "data": {
            "description": "Historical development, formation of social welfare policies, and the role of the social work professional.",
            "id": "SOCWORK 205",
            "parent": "SOCWORK",
            "title": "INTRODUCTION TO THE FIELD OF SOCIAL WORK"
        }
    },
    {
        "data": {
            "description": "Provides an awareness of problems and concepts of the policy process in the U.S. Explores the political, economic, and institutional frameworks which structure public social welfare choices.",
            "id": "SOCWORK 206",
            "parent": "SOCWORK",
            "title": "INTRODUCTION TO SOCIAL POLICY"
        }
    },
    {
        "data": {
            "id": "SOCWORK",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "SOCWORK 205",
            "target": "SOCWORK 650"
        }
    },
    {
        "data": {
            "source": "SOCWORK 206",
            "target": "SOCWORK 650"
        }
    }
]