[
    {
        "data": {
            "description": "A preparation and introductory math course for students enrolled in the Summer Collegiate Experience program. Includes material from precalculus and calculus and related topics depending on students' results on the math placement exam.",
            "id": "MATH 118",
            "parent": "MATH",
            "title": "SUMMER COLLEGIATE EXPERIENCE MATHEMATICS COURSE"
        }
    },
    {
        "data": {
            "description": "Covers the graphs, properties and geometric significance of trigonometric functions of a real variable. Other topics include trigonometric equations and identities, application, trigonometric form of complex numbers, DeMoivre's theorem, and polar and parametric equations. The course also has a significant number of applications, especially related to other disciplines.",
            "id": "MATH 113",
            "parent": "MATH",
            "title": "TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "Accelerated coverage of topics in general chemistry, including introduction to laboratory techniques. Topics include atomic and molecular structure, chemical equilibrium, acid-base chemistry, thermodynamics, kinetics, and electrochemistry.",
            "id": "CHEM 109",
            "parent": "CHEM",
            "title": "ADVANCED GENERAL CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "Hands-on laboratory on soil analysis and interpretation of soil properties for different uses, such as food production, waste management, water quality, stormwater control, and environmental sustainability.",
            "id": "SOILSCI 302",
            "parent": "SOILSCI",
            "title": "MEET YOUR SOIL: SOIL ANALYSIS AND INTERPRETATION LABORATORY"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Physical chemical and biological properties of soils as they affect soil-plant-water relations, soil classification and suitability for agricultural and other uses.",
            "id": "SOILSCI 301",
            "parent": "SOILSCI",
            "title": "GENERAL SOIL SCIENCE"
        }
    },
    {
        "data": {
            "description": "Principles and application of chemical equilibrium, coordination chemistry, oxidation-reduction and electrochemistry, kinetics, nuclear chemistry, introduction to organic chemistry, and chemistry laboratory skills.",
            "id": "CHEM 104",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Stoichiometry and the mole concept, the behavior of gases, liquids and solids, thermochemistry, electronic structure of atoms and chemical bonding, descriptive chemistry of selected elements and compounds, intermolecular forces, and chemistry laboratory skills.",
            "id": "CHEM 103",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "The two semester sequenceMATH 112-MATH 113covers similar material asMATH 114, but in a slower pace. Not recommended for students with less than an AB inMATH 96.",
            "id": "MATH 114",
            "parent": "MATH",
            "title": "ALGEBRA AND TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Part of a 2-semester sequence withMATH 217; these two courses together are equivalent toMATH 114and221.",
            "id": "MATH 171",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY I"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "SOILSCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "SOILSCI 301"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 109"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 113"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "SOILSCI 301"
        }
    },
    {
        "data": {
            "source": "MATH 113",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 114",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 114"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "CHEM 109"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 114"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "SOILSCI 301",
            "target": "SOILSCI 302"
        }
    }
]