[
    {
        "data": {
            "description": "Advanced language practice, including intensive writing and work in pertinent areas of grammar and stylistics.",
            "id": "SPANISH 311",
            "parent": "SPANISH",
            "title": "ADVANCED LANGUAGE PRACTICE"
        }
    },
    {
        "data": {
            "description": "An introduction to audiovisual media in the Spanish-speaking world. Topics may include cinema, television, video and video gaming. Learn basic technical vocabulary, analytical concepts and industrial history for specific media and consider theoretical issues relating to the integration of those media in various local cultures. Special attention will be paid to the economic, technological, social and political conditions that have determined the differential development of the various screen arts in Spanish-speaking countries.",
            "id": "SPANISH 472",
            "parent": "SPANISH",
            "title": "HISPANIC SCREEN STUDIES"
        }
    },
    {
        "data": {
            "description": "An introduction to reading and analyzing literary works, with special emphasis on development of oral and written skills for the discussion of literature. Concentration on methods of analyzing basic literary forms, conventions, genres, and representative short texts in Spanish.",
            "id": "SPANISH 224",
            "parent": "SPANISH",
            "title": "INTRODUCTION TO HISPANIC LITERATURES"
        }
    },
    {
        "data": {
            "description": "Intensive practice in reading, writing, and grammar.",
            "id": "SPANISH 226",
            "parent": "SPANISH",
            "title": "INTERMEDIATE LANGUAGE PRACTICE WITH EMPHASIS ON WRITING AND GRAMMAR"
        }
    },
    {
        "data": {
            "description": "Introduction to the issues which shape the national cultures and the cultural practices of the Hispanic world. Emphasis on diversity, emergence of new imagined communities, cultural hybridity, and social movements within a historical framework.",
            "id": "SPANISH 223",
            "parent": "SPANISH",
            "title": "INTRODUCTION TO HISPANIC CULTURES"
        }
    },
    {
        "data": {
            "id": "SPANISH",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "SPANISH 223",
            "target": "SPANISH 472"
        }
    },
    {
        "data": {
            "source": "SPANISH 224",
            "target": "SPANISH 472"
        }
    },
    {
        "data": {
            "source": "SPANISH 226",
            "target": "SPANISH 223"
        }
    },
    {
        "data": {
            "source": "SPANISH 226",
            "target": "SPANISH 224"
        }
    },
    {
        "data": {
            "source": "SPANISH 226",
            "target": "SPANISH 311"
        }
    },
    {
        "data": {
            "source": "SPANISH 311",
            "target": "SPANISH 226"
        }
    }
]