[
    {
        "data": {
            "description": "Advanced language practice, including intensive writing and work in pertinent areas of grammar and stylistics.",
            "id": "SPANISH 311",
            "parent": "SPANISH",
            "title": "ADVANCED LANGUAGE PRACTICE"
        }
    },
    {
        "data": {
            "source": "SPANISH 311",
            "target": "SPANISH 225"
        }
    },
    {
        "data": {
            "source": "SPANISH 226",
            "target": "SPANISH 311"
        }
    },
    {
        "data": {
            "source": "SPANISH 311",
            "target": "SPANISH 226"
        }
    },
    {
        "data": {
            "source": "SPANISH 225",
            "target": "SPANISH 430"
        }
    },
    {
        "data": {
            "id": "SPANISH",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Introduction to the basic concepts of linguistics as a discipline and explore real-world Spanish use (e.g., blogs and vlogs, language corpora, press, film, recorded conversations, class visitors, etc.) and how that use varies across regions, speakers, and communicative contexts. Through examination of how different Spanish speakers deploy language in contexts such as confronting social taboos, expressing humor, being polite (or impolite), persuading particular audiences, and negotiating individual and cultural identities, students will gain a foundational understanding of several areas of linguistic study, including phonetics/ phonology, morphosyntax, pragmatics, sociolinguistics, language ideologies, and language variation and change.",
            "id": "SPANISH 225",
            "parent": "SPANISH",
            "title": "LYING, SWEARING, AND BREAKING THE RULES: AN INTRODUCTION TO THE LINGUISTIC STUDY OF SPANISH"
        }
    },
    {
        "data": {
            "description": "Intensive practice in reading, writing, and grammar.",
            "id": "SPANISH 226",
            "parent": "SPANISH",
            "title": "INTERMEDIATE LANGUAGE PRACTICE WITH EMPHASIS ON WRITING AND GRAMMAR"
        }
    },
    {
        "data": {
            "description": "Focus on the Spanish language in the United States from a sociolinguistic perspective. Comprises three goals: 1) presentation of the main linguistic characteristics represented in the Spanish of the United States (from both speakers that brought their variety from their home country, and Spanish speakers born in the United States); 2) examination of the main aspects related to the acquisition of Spanish as a minority language and phenomena related to English-Spanish language contact; and 3) understanding the socio-cultural aspects connected with the presence and vitality of Spanish in the United States (e.g., Spanish in the public, political, and educational contexts; linguistic identity, linguistic discrimination).",
            "id": "SPANISH 430",
            "parent": "SPANISH",
            "title": "SPANISH IN THE UNITED STATES"
        }
    }
]