[
    {
        "data": {
            "description": "Advanced language practice, including intensive writing and work in pertinent areas of grammar and stylistics.",
            "id": "SPANISH 311",
            "parent": "SPANISH",
            "title": "ADVANCED LANGUAGE PRACTICE"
        }
    },
    {
        "data": {
            "description": "An introduction to reading and analyzing literary works, with special emphasis on development of oral and written skills for the discussion of literature. Concentration on methods of analyzing basic literary forms, conventions, genres, and representative short texts in Spanish.",
            "id": "SPANISH 224",
            "parent": "SPANISH",
            "title": "INTRODUCTION TO HISPANIC LITERATURES"
        }
    },
    {
        "data": {
            "description": "Analysis of Latina and Latino popular culture to consider the varied make-up of Latinos, their specific histories, social dynamics and politics through their creative expressions, performances and cultural contestations. Covers key terms and concepts, cultural developments, and diverse interpretations while focusing in the analysis of Latinx music, performance art, film and media, sports, food, and car culture. Other topics include the production, circulation and reception of Latinx popular culture, the use of Spanish and English languages, issues of identity, migration and interculturality, the role of the cultural industry, and the context of globalization. Broadly explores the intersectionality of race, ethnicity, class, gender, sexuality, and nation regarding Latinos. Taught in Spanish.",
            "id": "CHICLA/SPANISH 364",
            "title": "SURVEY OF LATINO AND LATINA POPULAR CULTURE"
        }
    },
    {
        "data": {
            "description": "In-depth study of important cultural-historical issues concerning the Hispanic world.",
            "id": "SPANISH 468",
            "parent": "SPANISH",
            "title": "TOPICS IN HISPANIC CULTURE"
        }
    },
    {
        "data": {
            "description": "Intensive practice in reading, writing, and grammar.",
            "id": "SPANISH 226",
            "parent": "SPANISH",
            "title": "INTERMEDIATE LANGUAGE PRACTICE WITH EMPHASIS ON WRITING AND GRAMMAR"
        }
    },
    {
        "data": {
            "description": "Introduction to the issues which shape the national cultures and the cultural practices of the Hispanic world. Emphasis on diversity, emergence of new imagined communities, cultural hybridity, and social movements within a historical framework.",
            "id": "SPANISH 223",
            "parent": "SPANISH",
            "title": "INTRODUCTION TO HISPANIC CULTURES"
        }
    },
    {
        "data": {
            "description": "Offers an introduction to the culture and history of the Mexican and Latin American origin people in the United States. Emphasis on diversity, emergence of new imagined communities, and cultural hybridity. Focusing on key issues such as U.S. imperial expansion, colonialism, nation and community formations, migration, urban spaces, and the dynamics of race, class, gender, ethnicity, and sexuality, study a range of socio-political, historical, literary, and artistic expressions that inform the whole process of culture and reveal the way Latinos and Latinas negotiate their presence, cultural difference, and creativity in the U.S.",
            "id": "CHICLA/SPANISH 222",
            "title": "INTRODUCTION TO LATINX CULTURES"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "SPANISH",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "CHICLA/SPANISH 222",
            "target": "SPANISH 468"
        }
    },
    {
        "data": {
            "source": "CHICLA/SPANISH 364",
            "target": "SPANISH 468"
        }
    },
    {
        "data": {
            "source": "SPANISH 223",
            "target": "CHICLA/SPANISH 364"
        }
    },
    {
        "data": {
            "source": "SPANISH 223",
            "target": "SPANISH 468"
        }
    },
    {
        "data": {
            "source": "SPANISH 224",
            "target": "CHICLA/SPANISH 364"
        }
    },
    {
        "data": {
            "source": "SPANISH 226",
            "target": "CHICLA/SPANISH 222"
        }
    },
    {
        "data": {
            "source": "SPANISH 226",
            "target": "SPANISH 223"
        }
    },
    {
        "data": {
            "source": "SPANISH 226",
            "target": "SPANISH 224"
        }
    },
    {
        "data": {
            "source": "SPANISH 226",
            "target": "SPANISH 311"
        }
    },
    {
        "data": {
            "source": "SPANISH 311",
            "target": "SPANISH 226"
        }
    }
]