[
    {
        "data": {
            "description": "Advanced language practice, including intensive writing and work in pertinent areas of grammar and stylistics.",
            "id": "SPANISH 311",
            "parent": "SPANISH",
            "title": "ADVANCED LANGUAGE PRACTICE"
        }
    },
    {
        "data": {
            "description": "Connects the topics discussed inSPANISH 320with concrete, physical speech signals. Learn to detect vocal fold vibration, evidence of tongue position, degree of closure between two organs, and friction caused by organ configuration, among other features, through the use of specialized software. Discuss sound experimental designs. Identify a specific set of sound system challenges that speakers of English face when learning Spanish. With regard to all of these issues, discuss address perception and production data, and data coming from native speakers and second language learners. Comparisons between Spanish data and those of English and other Romance languages.",
            "id": "SPANISH 420",
            "parent": "SPANISH",
            "title": "ADVANCED SPANISH PHONETICS"
        }
    },
    {
        "data": {
            "description": "Intensive practice in reading, writing, and grammar.",
            "id": "SPANISH 226",
            "parent": "SPANISH",
            "title": "INTERMEDIATE LANGUAGE PRACTICE WITH EMPHASIS ON WRITING AND GRAMMAR"
        }
    },
    {
        "data": {
            "description": "Introduction to the basic concepts of linguistics as a discipline and explore real-world Spanish use (e.g., blogs and vlogs, language corpora, press, film, recorded conversations, class visitors, etc.) and how that use varies across regions, speakers, and communicative contexts. Through examination of how different Spanish speakers deploy language in contexts such as confronting social taboos, expressing humor, being polite (or impolite), persuading particular audiences, and negotiating individual and cultural identities, students will gain a foundational understanding of several areas of linguistic study, including phonetics/ phonology, morphosyntax, pragmatics, sociolinguistics, language ideologies, and language variation and change.",
            "id": "SPANISH 225",
            "parent": "SPANISH",
            "title": "LYING, SWEARING, AND BREAKING THE RULES: AN INTRODUCTION TO THE LINGUISTIC STUDY OF SPANISH"
        }
    },
    {
        "data": {
            "description": "Practice course for improvement of pronunciation, and introduction to transcription and phonetic and phonemic analysis.",
            "id": "SPANISH 320",
            "parent": "SPANISH",
            "title": "SPANISH PHONETICS"
        }
    },
    {
        "data": {
            "id": "SPANISH",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "SPANISH 225",
            "target": "SPANISH 320"
        }
    },
    {
        "data": {
            "source": "SPANISH 226",
            "target": "SPANISH 225"
        }
    },
    {
        "data": {
            "source": "SPANISH 226",
            "target": "SPANISH 311"
        }
    },
    {
        "data": {
            "source": "SPANISH 311",
            "target": "SPANISH 226"
        }
    },
    {
        "data": {
            "source": "SPANISH 320",
            "target": "SPANISH 420"
        }
    }
]