[
    {
        "data": {
            "description": "Advanced language practice, including intensive writing and work in pertinent areas of grammar and stylistics.",
            "id": "SPANISH 311",
            "parent": "SPANISH",
            "title": "ADVANCED LANGUAGE PRACTICE"
        }
    },
    {
        "data": {
            "source": "SPANISH 223",
            "target": "SPANISH 490"
        }
    },
    {
        "data": {
            "source": "SPANISH 226",
            "target": "SPANISH 311"
        }
    },
    {
        "data": {
            "source": "SPANISH 311",
            "target": "SPANISH 226"
        }
    },
    {
        "data": {
            "source": "SPANISH 226",
            "target": "SPANISH 223"
        }
    },
    {
        "data": {
            "id": "SPANISH",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "An introduction to reading and analyzing literary works, with special emphasis on development of oral and written skills for the discussion of literature. Concentration on methods of analyzing basic literary forms, conventions, genres, and representative short texts in Spanish.",
            "id": "SPANISH 224",
            "parent": "SPANISH",
            "title": "INTRODUCTION TO HISPANIC LITERATURES"
        }
    },
    {
        "data": {
            "description": "Drawing mainly from early modern Spanish and Colonial texts, this course will explore encounters and relations with different forms of \"otherness\". We will move from America to Spain and across the Mediterranean world to Istanbul, from the late 15th century to the 17th. Issues of race, ethnicity, and religious affiliation will take on diverse forms throughout the course. Spain's long history of relations between Muslims, Jews and Christians will form a backdrop to interactions with Amerindians, sub-Saharan Africans, Jews, Moriscos, Gypsies, North African Muslims and Turks. One of the millions of slaves during this period was Miguel de Cervantes, author of Don Quixote. He and many other writers would reflect profoundly on questions of \"otherness\" in works that would have universal implications and continue to connect with our concerns in the 21st century. Such works will guide us through this course, as will a wide array of visual resources from that era and our own.",
            "id": "SPANISH 490",
            "parent": "SPANISH",
            "title": "RACE, RELIGION AND ETHNICITY IN THE AGE OF EMPIRE"
        }
    },
    {
        "data": {
            "description": "Introduction to the issues which shape the national cultures and the cultural practices of the Hispanic world. Emphasis on diversity, emergence of new imagined communities, cultural hybridity, and social movements within a historical framework.",
            "id": "SPANISH 223",
            "parent": "SPANISH",
            "title": "INTRODUCTION TO HISPANIC CULTURES"
        }
    },
    {
        "data": {
            "source": "SPANISH 224",
            "target": "SPANISH 490"
        }
    },
    {
        "data": {
            "description": "Intensive practice in reading, writing, and grammar.",
            "id": "SPANISH 226",
            "parent": "SPANISH",
            "title": "INTERMEDIATE LANGUAGE PRACTICE WITH EMPHASIS ON WRITING AND GRAMMAR"
        }
    },
    {
        "data": {
            "source": "SPANISH 226",
            "target": "SPANISH 224"
        }
    }
]