[
    {
        "data": {
            "description": "Advanced language practice, including intensive writing and work in pertinent areas of grammar and stylistics.",
            "id": "SPANISH 311",
            "parent": "SPANISH",
            "title": "ADVANCED LANGUAGE PRACTICE"
        }
    },
    {
        "data": {
            "source": "SPANISH 311",
            "target": "SPANISH 225"
        }
    },
    {
        "data": {
            "description": "Introduction to the linguistic analysis of Spanish, including morphology, syntax, dialectology, history of the language, language acquisition, and sociolinguistic variation.",
            "id": "SPANISH 327",
            "parent": "SPANISH",
            "title": "INTRODUCTION TO SPANISH LINGUISTICS"
        }
    },
    {
        "data": {
            "source": "SPANISH 226",
            "target": "SPANISH 311"
        }
    },
    {
        "data": {
            "source": "SPANISH 311",
            "target": "SPANISH 226"
        }
    },
    {
        "data": {
            "id": "SPANISH",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Introduction to the basic concepts of linguistics as a discipline and explore real-world Spanish use (e.g., blogs and vlogs, language corpora, press, film, recorded conversations, class visitors, etc.) and how that use varies across regions, speakers, and communicative contexts. Through examination of how different Spanish speakers deploy language in contexts such as confronting social taboos, expressing humor, being polite (or impolite), persuading particular audiences, and negotiating individual and cultural identities, students will gain a foundational understanding of several areas of linguistic study, including phonetics/ phonology, morphosyntax, pragmatics, sociolinguistics, language ideologies, and language variation and change.",
            "id": "SPANISH 225",
            "parent": "SPANISH",
            "title": "LYING, SWEARING, AND BREAKING THE RULES: AN INTRODUCTION TO THE LINGUISTIC STUDY OF SPANISH"
        }
    },
    {
        "data": {
            "source": "SPANISH 225",
            "target": "SPANISH 327"
        }
    },
    {
        "data": {
            "description": "Intensive practice in reading, writing, and grammar.",
            "id": "SPANISH 226",
            "parent": "SPANISH",
            "title": "INTERMEDIATE LANGUAGE PRACTICE WITH EMPHASIS ON WRITING AND GRAMMAR"
        }
    }
]