[
    {
        "data": {
            "source": "MATH 375",
            "target": "STAT 453"
        }
    },
    {
        "data": {
            "description": "Vector spaces and linear transformations, differential calculus of scalar and vector fields, determinants, eigenvalues and eigenvectors, multiple integrals, line integrals, and surface integrals. Freshmen students are invited to enroll by the Department of Mathematics.",
            "id": "MATH 375",
            "parent": "MATH",
            "title": "TOPICS IN MULTI-VARIABLE CALCULUS AND LINEAR ALGEBRA"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 320"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "description": "An introduction to linear algebra and differential equations with emphasis on the relationship between the theory of linear algebra and analytical and numerical techniques for solving differential equations. Linear algebra topics include linear systems, matrices and their algebra, vector spaces and linear transformations, eigenvalues and eigenvectors. Topics from differential equations include first order ODE, homogeneous and nonhomogeneous linear systems, and numerical methods.",
            "id": "MATH 320",
            "parent": "MATH",
            "title": "LINEAR ALGEBRA AND DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 222"
        }
    },
    {
        "data": {
            "id": "STAT",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "MATH 320",
            "target": "STAT 453"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "description": "Deep learning is a field that specializes in discovering and extracting intricate structures in large, unstructured datasets for parameterizing artificial neural networks with many layers. Since deep learning has pushed the state-of-the-art in many research and application areas, it's become indispensable for modern technology. Focuses on a understanding deep, artificial neural networks by connecting it to related concepts in statistics. Beyond covering deep learning models for predictive modeling, focus on deep generative models. Besides explanations on a mathematical and conceptual level, emphasize the practical aspects of deep learning. Open-source computing provides hands-on experience for implementing deep neural nets, working on supervised learning tasks, and applying generative models for dataset synthesis.",
            "id": "STAT 453",
            "parent": "STAT",
            "title": "INTRODUCTION TO DEEP LEARNING AND GENERATIVE MODELS"
        }
    },
    {
        "data": {
            "description": "Techniques of integration, improper integrals, first order ordinary differential equations, sequences and series, Taylor series, vector geometry in two and three dimensions.",
            "id": "MATH 222",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 2"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "First order differential equations, introduction to multivariable calculus and constrained optimization, infinite sequences and series, methods of approximation, and a brief introduction to probability. Models and applications from business and the social sciences.",
            "id": "MATH 213",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 2"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 213"
        }
    },
    {
        "data": {
            "source": "MATH 213",
            "target": "MATH 221"
        }
    }
]