[
    {
        "data": {
            "description": "Probability, random variables and their distributions, joint and conditional distributions, moments and inequalities, generating functions, transformations of random variables, sampling and distribution theory, convergence concepts and limit theorems for sequences of random variables.",
            "id": "STAT 611",
            "parent": "STAT",
            "title": "STATISTICAL MODELS FOR DATA SCIENCE"
        }
    },
    {
        "data": {
            "description": "Provides a thorough grounding in modern statistical methods. The specific learning outcomes for the course are to understand data collection in context (how/why data were collected, key questions under study); explore data by effective graphical and numerical summaries; understand probability concepts and models as tools for studying random phenomena and for statistical inference; analyze data using appropriate, modern statistical models, methods, and software; understand the statistical concepts underlying methods; develop the ability to interpret results and critically evaluate the methods used; communicate data analysis and key findings in context.",
            "id": "STAT 601",
            "parent": "STAT",
            "title": "STATISTICAL METHODS I"
        }
    },
    {
        "data": {
            "description": "Quantum computation issues, including probability, statistics, sensing, information, machine learning, and applying data science to quantum information science.",
            "id": "STAT 780",
            "parent": "STAT",
            "title": "INTRODUCTION TO QUANTUM DATA SCIENCE"
        }
    },
    {
        "data": {
            "description": "Review of probability, random variables and vectors and their distributions, moments and inequalities, generating functions, transformations of random variables, sampling and distribution theory, convergence concepts for sequences of random variables, laws of large numbers, central limit and other limit theorems.",
            "id": "STAT 609",
            "parent": "STAT",
            "title": "MATHEMATICAL STATISTICS I"
        }
    },
    {
        "data": {
            "id": "STAT",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "STAT 601",
            "target": "STAT 780"
        }
    },
    {
        "data": {
            "source": "STAT 609",
            "target": "STAT 780"
        }
    },
    {
        "data": {
            "source": "STAT 611",
            "target": "STAT 780"
        }
    }
]