[
    {
        "data": {
            "description": "Explore the reasons behind failure of colorectal cancer screening programs. Learn the standard of care for prevention, diagnosis, and treatment of colorectal cancer. Focus on all facets of the disease, with active engagement in dialogue to improve screening programs for colorectal cancer. Learn to identify methods to improve medical care and population health. Explore background studies to integrate emerging information on individual's biologic and genetic risk with population-level factors when deciding upon prevention and treatment options. Work with the various members of the healthcare team involved in treating colorectal cancer and educate the public on the importance of colorectal cancer screening.",
            "id": "SURGERY 975",
            "parent": "SURGERY",
            "title": "MULTIDISCIPLINARY APPROACHES TO COLON CANCER PREVENTION/TREATMENT"
        }
    },
    {
        "data": {
            "description": "Care of adults and children undergoing an operation or procedure, including perioperative preparation, operative care, and post-operative cares for core clinical conditions in the specialties of anesthesia, neurosurgery, ophthalmology, general surgery, otolaryngology, urology, cardiothoracic surgery, peripheral vascular surgery, orthopedics, plastic and reconstructive surgery, and gynecology, as well as interventional radiology, procedural cardiology and gastroenterology. Basic science concepts include cerebral spinal fluid production and flow, fluids and electrolytes, consciousness, inflammation and wound healing, and cancer biology. Anatomic approach using case discussions, podcasts, curated independent reading, online nationally supported modules, and simulation skills. Longitudinal patient care experience integrating communication, evidence based medicine, health information technology, quality improvement  patient safety, professionalism, scientific inquiry, and public health.",
            "id": "MEDSC-M 813",
            "parent": "MEDSC-M",
            "title": "SURGICAL AND PROCEDURAL CARE"
        }
    },
    {
        "data": {
            "description": "Identify the roles of physicians, interdisciplinary providers, health care systems, and communities in screening, treating, and preventing common, chronic conditions. Activities are centered on health promotion, outpatient-based chronic disease management, and community health. Clinical experiences will occur in primary care, behavioral health, and other ambulatory and community-based settings that focus on chronic disease management.",
            "id": "MEDSC-M 811",
            "parent": "MEDSC-M",
            "title": "CHRONIC AND PREVENTIVE CARE"
        }
    },
    {
        "data": {
            "id": "MEDSC-M",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "SURGERY",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 811",
            "target": "SURGERY 975"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "SURGERY 975"
        }
    }
]