[
    {
        "data": {
            "description": "Care of adults and children undergoing an operation or procedure, including perioperative preparation, operative care, and post-operative cares for core clinical conditions in the specialties of anesthesia, neurosurgery, ophthalmology, general surgery, otolaryngology, urology, cardiothoracic surgery, peripheral vascular surgery, orthopedics, plastic and reconstructive surgery, and gynecology, as well as interventional radiology, procedural cardiology and gastroenterology. Basic science concepts include cerebral spinal fluid production and flow, fluids and electrolytes, consciousness, inflammation and wound healing, and cancer biology. Anatomic approach using case discussions, podcasts, curated independent reading, online nationally supported modules, and simulation skills. Longitudinal patient care experience integrating communication, evidence based medicine, health information technology, quality improvement  patient safety, professionalism, scientific inquiry, and public health.",
            "id": "MEDSC-M 813",
            "parent": "MEDSC-M",
            "title": "SURGICAL AND PROCEDURAL CARE"
        }
    },
    {
        "data": {
            "description": "Identify the roles of physicians, interdisciplinary providers, health care systems, and communities in screening, treating, and preventing common, chronic conditions. Activities are centered on health promotion, outpatient-based chronic disease management, and community health. Clinical experiences will occur in primary care, behavioral health, and other ambulatory and community-based settings that focus on chronic disease management.",
            "id": "MEDSC-M 811",
            "parent": "MEDSC-M",
            "title": "CHRONIC AND PREVENTIVE CARE"
        }
    },
    {
        "data": {
            "description": "The science of diabetes and obesity as it correlates to the clinical setting. The history of endocrinology and discovery of insulin will provide the basis for understanding hormonal mechanisms controlling fuel metabolism and how these processes become dysfunctional in different disease states. Topics will include pancreatic and extrapancreatic control of metabolism, and diseases linked with obesity, including PCOS, type 2 diabetes, and cancer. Lifestyle, medical, and surgical treatments of obesity and diabetes, including pharmacologic mechanisms of insulin and non-insulin diabetes therapeutics and bariatric surgery, will be highlighted. The public health perspective will shine light on societal factors that influence obesity and diabetes care. Provides an advanced scientific foundation with which to approach evidence-based care and treatment of individuals with obesity and/or diabetes.",
            "id": "SURGERY 976",
            "parent": "SURGERY",
            "title": "THE SCIENCE OF OBESITY AND DIABETES"
        }
    },
    {
        "data": {
            "id": "MEDSC-M",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "SURGERY",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 811",
            "target": "SURGERY 976"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "SURGERY 976"
        }
    }
]