[
    {
        "data": {
            "id": "SURGERY",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MEDSC-M",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "An in-depth understanding of the key concepts of value, quality and safety is critical to the education of future physicians. The majority of adverse events experienced by hospitalized patients occur in surgery. Surgery offers the ideal setting to explore these three components critical to improving the US healthcare system. Examine factors that influence the care we provide and critically consider the value of this care. Observe efforts to improve value in surgery focusing on quality, safety and appropriate utilization of critical resources and consider areas for improvement. Follow patients in all processes of care from clinic, to the operating room, through their postoperative course, to discharge, and consider how important measures to secure safety and quality are encountered and impact care in the clinical arena. Consider price and allocation of scarce resources. Gather information for their analysis of the patient experience.",
            "id": "SURGERY 973",
            "parent": "SURGERY",
            "title": "OPTIMIZING VALUE, QUALITY AND SAFETY IN HEALTHCARE"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 812",
            "target": "SURGERY 973"
        }
    },
    {
        "data": {
            "description": "Care of adults and children undergoing an operation or procedure, including perioperative preparation, operative care, and post-operative cares for core clinical conditions in the specialties of anesthesia, neurosurgery, ophthalmology, general surgery, otolaryngology, urology, cardiothoracic surgery, peripheral vascular surgery, orthopedics, plastic and reconstructive surgery, and gynecology, as well as interventional radiology, procedural cardiology and gastroenterology. Basic science concepts include cerebral spinal fluid production and flow, fluids and electrolytes, consciousness, inflammation and wound healing, and cancer biology. Anatomic approach using case discussions, podcasts, curated independent reading, online nationally supported modules, and simulation skills. Longitudinal patient care experience integrating communication, evidence based medicine, health information technology, quality improvement  patient safety, professionalism, scientific inquiry, and public health.",
            "id": "MEDSC-M 813",
            "parent": "MEDSC-M",
            "title": "SURGICAL AND PROCEDURAL CARE"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "SURGERY 973"
        }
    },
    {
        "data": {
            "description": "Focus on assessing patients with urgent medical conditions, providing acute inpatient care, and transitioning patients to other care settings or home under the care of other professionals. Provide acute care in inpatient and outpatient urgent care settings as well as on the inpatient wards, and develop acute management plans and subsequent transition of care plans. Clinical experiences in acute care settings such as the emergency department and inpatient medicine (both general and subspecialty), psychiatry, and neurology. Builds upon fundamental science concepts introduced in Body in Balance and Mind and Motion, including Ohm's Law, acid-base balance, and volume regulation. Organ system-based approach employing varied modalities. Complete an integrated patient-centered experience by participating in the care of a patient from an urgent admission through inpatient treatment and discharge.",
            "id": "MEDSC-M 812",
            "parent": "MEDSC-M",
            "title": "ACUTE CARE"
        }
    }
]