[
    {
        "data": {
            "description": "Care of adults and children undergoing an operation or procedure, including perioperative preparation, operative care, and post-operative cares for core clinical conditions in the specialties of anesthesia, neurosurgery, ophthalmology, general surgery, otolaryngology, urology, cardiothoracic surgery, peripheral vascular surgery, orthopedics, plastic and reconstructive surgery, and gynecology, as well as interventional radiology, procedural cardiology and gastroenterology. Basic science concepts include cerebral spinal fluid production and flow, fluids and electrolytes, consciousness, inflammation and wound healing, and cancer biology. Anatomic approach using case discussions, podcasts, curated independent reading, online nationally supported modules, and simulation skills. Longitudinal patient care experience integrating communication, evidence based medicine, health information technology, quality improvement  patient safety, professionalism, scientific inquiry, and public health.",
            "id": "MEDSC-M 813",
            "parent": "MEDSC-M",
            "title": "SURGICAL AND PROCEDURAL CARE"
        }
    },
    {
        "data": {
            "description": "Develop knowledge of how people learn, adult learning principles, and how these apply to medicine. Learn and practice effective interpersonal communication techniques. Reflect on your own strategies for communicating with patients, and develop and implement a plan to improve your communication with patients. Effective communication and patient education allows physicians to act as advocates for their patients. Discuss barriers to patient education, and strategies to mitigate those barriers. Gain insight into communication and education strategies for patients with communication issues.",
            "id": "SURGERY 974",
            "parent": "SURGERY",
            "title": "PATIENT EDUCATION AS A STRATEGY FOR ADVOCACY"
        }
    },
    {
        "data": {
            "description": "Identify the roles of physicians, interdisciplinary providers, health care systems, and communities in screening, treating, and preventing common, chronic conditions. Activities are centered on health promotion, outpatient-based chronic disease management, and community health. Clinical experiences will occur in primary care, behavioral health, and other ambulatory and community-based settings that focus on chronic disease management.",
            "id": "MEDSC-M 811",
            "parent": "MEDSC-M",
            "title": "CHRONIC AND PREVENTIVE CARE"
        }
    },
    {
        "data": {
            "id": "MEDSC-M",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "SURGERY",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 811",
            "target": "SURGERY 974"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "SURGERY 974"
        }
    }
]