[
    {
        "data": {
            "description": "Provides an advanced understanding of cell biology as it relates to the nervous system. Covers the neuronal cytoskeleton, molecular motors and their cargos, the secretory system and how it functions in neurons, formation and maintenance of pre- and post-synaptic structures, neuronal organelles and their functions. Discussion of what is known about the disruptions to cell biology of neurons that contributes to neurodevelopmental and neurodegenerative diseases such as Alzheimer's disease, Parkinson's disease, Amyotrophic Lateral Sclerosis, Charcot Marie Tooth Disease, Spinal Muscular Atrophy, and others.",
            "id": "ZOOLOGY 444",
            "parent": "ZOOLOGY",
            "title": "NEURONAL CELL BIOLOGY IN HEALTH AND DISEASE"
        }
    },
    {
        "data": {
            "description": "General biological principles. Topics include: evolution, ecology, animal behavior, cell structure and function, genetics and molecular genetics and the physiology of a variety of organ systems emphasizing function in humans.",
            "id": "BIOLOGY/ZOOLOGY 101",
            "title": "ANIMAL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics and selected topics in Animal Physiology.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ZOOLOGY",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 101"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 151"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ZOOLOGY 444"
        }
    }
]