[
    {
        "data": {
            "description": "A preparation and introductory math course for students enrolled in the Summer Collegiate Experience program. Includes material from precalculus and calculus and related topics depending on students' results on the math placement exam.",
            "id": "MATH 118",
            "parent": "MATH",
            "title": "SUMMER COLLEGIATE EXPERIENCE MATHEMATICS COURSE"
        }
    },
    {
        "data": {
            "description": "Covers the graphs, properties and geometric significance of trigonometric functions of a real variable. Other topics include trigonometric equations and identities, application, trigonometric form of complex numbers, DeMoivre's theorem, and polar and parametric equations. The course also has a significant number of applications, especially related to other disciplines.",
            "id": "MATH 113",
            "parent": "MATH",
            "title": "TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "Energy resources are an essential element of the world's business, political, technical and environmental landscape. Analytic tools provided by the discipline of economics expands our understanding of this critical issue. Energy supply markets reviewed include both fossil fuels and renewable resources. Energy demand sectors include residential, commercial, industrial and transportation. Electricity represents an intermediate energy market. The interactions among these markets participants indicate how scarce resources are allocated among competing needs in the world economy.",
            "id": "AAE/CIVENGR/ENVIRST/URBRPL 561",
            "title": "ENERGY MARKETS"
        }
    },
    {
        "data": {
            "description": "One part of a series of courses to train students in the quantitative methods typically used by economic analysts in a professional setting. Provides students with the opportunity to synthesize the material they've learned in their coursework in a start-to-finish econometric analysis similar in scope and timeline to what they often would be expected to do in a professional setting. The final course product is a professional report. Students should think of this report as a professional analyst's Master's thesis - a demonstration of the student's training and capability for professional work, to be shared with prospective employers.",
            "id": "AAE 724",
            "parent": "AAE",
            "title": "PRACTICUM FOR APPLIED ECONOMISTS"
        }
    },
    {
        "data": {
            "description": "A historico-institutional analysis of development problems in the principal Latin American countries, with attention to differentiation of national growth patterns and alternative development strategies.",
            "id": "AAE/ECON/INTLBUS 462",
            "title": "LATIN AMERICAN ECONOMIC DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "A mathematical approach to the theory of consumption, production, pricing and resource allocation.",
            "id": "ECON 311",
            "parent": "ECON",
            "title": "INTERMEDIATE MICROECONOMIC THEORY - ADVANCED TREATMENT"
        }
    },
    {
        "data": {
            "description": "Addresses the process of globalization -- trade, international capital flows, labor migration and remittances, and aid -- from the perspective of developing economies and the development process.",
            "id": "AAE/INTLST 373",
            "title": "GLOBALIZATION, POVERTY AND DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Agroecology has blossomed across the world in recent decades as not only a science, but also a practice, and a movement. Employ the multiple disciplines and perspectives that Agroecology affords to analyze our agricultural and food systems wihin a broader context of dynamic social and ecological relationships.",
            "id": "AGROECOL/AGRONOMY/C&ESOC/ENTOM/ENVIRST 103",
            "title": "AGROECOLOGY: AN INTRODUCTION TO THE ECOLOGY OF FOOD AND AGRICULTURE"
        }
    },
    {
        "data": {
            "description": "An internship under guidance of a faculty or instructional academic staff member in Agricultural and Applied Economics and internship site supervisor. Students are responsible for arranging the work and credits with the AAE faculty or instructional academic staff member and the internship site supervisor.",
            "id": "AAE 399",
            "parent": "AAE",
            "title": "COORDINATIVE INTERNSHIP/COOPERATIVE EDUCATION"
        }
    },
    {
        "data": {
            "description": "An introduction to the statistical methods used in public policy. Covers the basics of probability, statistics, and quantitative methods in public policy analysis. Stresses interpretation and presentation of data as well as theory.",
            "id": "PUBAFFR 818",
            "parent": "PUBAFFR",
            "title": "INTRODUCTION TO STATISTICAL METHODS FOR PUBLIC POLICY ANALYSIS"
        }
    },
    {
        "data": {
            "description": "An introduction to the tools of game theoretic analysis, with reference to the use of game theory in political science. Intended for those desiring a basic familiarity with the theory, and  for those planning further work in formal modeling.",
            "id": "AAE/POLISCI 835",
            "title": "GAME THEORY AND POLITICAL ANALYSIS"
        }
    },
    {
        "data": {
            "description": "An overview of development economics, covering both basic theory and empirical applications. Topics include economic growth, trade, measurement of poverty and inequality, human capital, agricultural household models, technology adoption, migration, credit, savings, insurance, infrastructure, and the environment.",
            "id": "AAE 642",
            "parent": "AAE",
            "title": "FOUNDATIONS OF DEVELOPMENT ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Analyzes aggregate growth, income distribution and poverty in lower income economies. Uses microeconomics of imperfect labor, capital and insurance markets to explore why some individuals advance economically as their economies grow and others fall behind. Considers implications of aggregate and micro analysis for national and international economic policy.",
            "id": "AAE/ECON 474",
            "title": "ECONOMIC PROBLEMS OF DEVELOPING AREAS"
        }
    },
    {
        "data": {
            "description": "Application of data science methods to economic analyses. Integration of data acquisition, cleaning, analysis, and interpretation in managerial contexts. Emphasis on applications in the agri-food supply chain.",
            "id": "AAE 701",
            "parent": "AAE",
            "title": "APPLIED ECONOMIC DATA ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Application of economics to managing agricultural production systems. Topics include optimizing agricultural production, farm financial analysis, tax management, business entities, federal commodity support programs, and the structure and challenges in the US agricultural sector.",
            "id": "AAE 320",
            "parent": "AAE",
            "title": "AGRICULTURAL SYSTEMS MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Applications of quantitative methods, including optimization and simulation, to the management of natural resources, especially forests.",
            "id": "AAE/F&WECOL 652",
            "title": "DECISION METHODS FOR NATURAL RESOURCE MANAGERS"
        }
    },
    {
        "data": {
            "description": "Applying economic theory to the practice of resource and energy demand analysis. Topics include consumer demand theory and the proper modeling of demand systems, theoretical underpinnings of behavioral economics, welfare theory, cost benefit analysis and cost-effectiveness analysis, and technology adoption and diffusion.",
            "id": "AAE 771",
            "parent": "AAE",
            "title": "MICROECONOMICS OF RESOURCES AND ENERGY: THEORY TO PRACTICE"
        }
    },
    {
        "data": {
            "description": "Career and professional development geared toward the field of agricultural and applied economics or agricultural business management. Topics include resumes, cover letters, interviewing skills, internship and job applications, writing, career exploration, and networking. Panelists include faculty, alumni, and employers.",
            "id": "AAE 267",
            "parent": "AAE",
            "title": "CAREER DEVELOPMENT FOR AAE & ABM MAJORS"
        }
    },
    {
        "data": {
            "description": "Climate change and the role of applied economics in related policy analysis and research. Economics of mitigation, adaptation and geo-engineering; integrated assessment; environmental implications of energy use; climate change impacts on land use. Use of economic analysis and modeling for public policy design.",
            "id": "AAE 246",
            "parent": "AAE",
            "title": "CLIMATE CHANGE ECONOMICS AND POLICY"
        }
    },
    {
        "data": {
            "description": "Composition, organization, and techniques of agricultural production; economic change and development of agriculture, economic policies, special problems of developing African agriculture.",
            "id": "AAE/ECON 477",
            "title": "AGRICULTURAL AND ECONOMIC DEVELOPMENT IN AFRICA"
        }
    },
    {
        "data": {
            "description": "Conceptual empirical analysis of economic behavior under risk and its implications for management and policy decisions. Emphasis on economic applications to the agricultural and food sector.",
            "id": "AAE 706",
            "parent": "AAE",
            "title": "APPLIED RISK ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Contemporary theory of consumption, production, pricing and resource allocation.",
            "id": "ECON 301",
            "parent": "ECON",
            "title": "INTERMEDIATE MICROECONOMIC THEORY"
        }
    },
    {
        "data": {
            "description": "Continuation ofMATH 171. Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Completion ofMATH 217implies completion ofMATH 221and114.",
            "id": "MATH 217",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY II"
        }
    },
    {
        "data": {
            "description": "Cooperatives, credit unions, and other alternative forms of enterprise are unique businesses in which users (rather than investors) are the owners. Topics will include why these models emerge, who they serve, how they differ from other forms of enterprise, and the ways in which they can be used to address social, economic, and environmental challenges.",
            "id": "AAE 323",
            "parent": "AAE",
            "title": "COOPERATIVES AND ALTERNATIVE FORMS OF ENTERPRISE OWNERSHIP"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Current issues in resource and demand analysis, with presentations by academic researchers and industry professionals, to introduce students to current issues in resource and demand analysis, and to develop their critical thinking about addressing these issues.",
            "id": "AAE 773",
            "parent": "AAE",
            "title": "SEMINAR IN RESOURCE AND ENERGY DEMAND ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Descriptive statistics, probability concepts and distributions, random variables. Hypothesis tests and confidence intervals for one- and two-sample problems. Linear regression, model checking, and inference. Analysis of variance and basic ideas in experimental design. Utilizes the R programming language.",
            "id": "STAT 324",
            "parent": "STAT",
            "title": "INTRODUCTORY APPLIED STATISTICS FOR ENGINEERS"
        }
    },
    {
        "data": {
            "description": "Development of professional and communication skills beyond standard technical training critical for career success. Foster interpersonal and professional career skills by engaging with academic practitioners and industry professionals. Topics include verbal and written communication, project management, leadership, networking, strategic decision-making, active listening, business intelligence, teamwork, and business culture.",
            "id": "AAE 750",
            "parent": "AAE",
            "title": "PROFESSIONAL DEVELOPMENT FOR AGRIBUSINESS MANAGERS"
        }
    },
    {
        "data": {
            "description": "Directed study projects for graduate students as arranged with a faculty member.",
            "id": "AAE 999",
            "parent": "AAE",
            "title": "SPECIAL WORK - AGRICULTURAL AND APPLIED ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Distributions, measures of central tendency, dispersion and shape, the normal distribution; experiments to compare means, standard errors, confidence intervals; effects of departure from assumption; method of least squares, regression, correlation, assumptions and limitations; basic ideas of experimental design.",
            "id": "STAT 301",
            "parent": "STAT",
            "title": "INTRODUCTION TO STATISTICAL METHODS"
        }
    },
    {
        "data": {
            "description": "Economic concepts and tools relating to management and use of natural resources, including pricing principles, cost-benefit analysis, equity, externalities, economic rent, renewable and nonrenewable resources, and resource policy issues.",
            "id": "AAE/ECON/F&WECOL 531",
            "title": "NATURAL RESOURCE ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Economic problems of individuals, firms and industries with emphasis on value, price, and distribution of income.",
            "id": "ECON 101",
            "parent": "ECON",
            "title": "PRINCIPLES OF MICROECONOMICS"
        }
    },
    {
        "data": {
            "description": "Economic theory (location and growth) applicable to community economic development; the role of private and public sector in local economic development, and techniques for economic analysis of community.",
            "id": "AAE/REALEST/URBRPL 520",
            "title": "COMMUNITY ECONOMIC ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Economic tools and principles pertaining to the optimal management of natural resources. Theoretical models characterize efficient resource use and predict management decisions under different institutional settings. Empirical applications relate to public and private management of forests, fish, wildlife, minerals, and energy resources. Examples highlight the importance of discount rates, property rights, and government policies.",
            "id": "AAE 760",
            "parent": "AAE",
            "title": "FRONTIERS IN ENVIRONMENTAL AND NATURAL RESOURCE ECONOMICS 1"
        }
    },
    {
        "data": {
            "description": "Economics of agricultural technology innovation and adoption, properties and measurement of production and productivity, and impact evaluation. Empirical methods, including surveys, experiments, randomized trials, and instrumental variable methods of testing applied microeconomic models.",
            "id": "AAE 746",
            "parent": "AAE",
            "title": "FRONTIERS IN AGRICULTURAL ECONOMICS 1"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "Evaluates economic development strategies in Southeast Asia and their implications for growth, distribution and environment. Students learn trade and development theory as well as specific knowledge of Southeast Asian economic development.",
            "id": "AAE/ECON 473",
            "title": "ECONOMIC GROWTH AND DEVELOPMENT IN SOUTHEAST ASIA"
        }
    },
    {
        "data": {
            "description": "Examination of the structure of supply chains for food and agriculture and key business decisions in the the broader context of food systems.",
            "id": "AAE 422",
            "parent": "AAE",
            "title": "FOOD SYSTEMS AND SUPPLY CHAINS"
        }
    },
    {
        "data": {
            "description": "Extensions of the linear regression model; introduction to multiple equation models.",
            "id": "ECON 710",
            "parent": "ECON",
            "title": "ECONOMIC STATISTICS AND ECONOMETRICS II"
        }
    },
    {
        "data": {
            "description": "First course in a two-semester sequence: theories of firms, consumers, and markets; or partial and general equilibria in market and centralized economies; topics in welfare economics. It is expected that students will have completed three semesters calculus (such asMATH 234) and linear algebra (such asMATH 340).",
            "id": "ECON 711",
            "parent": "ECON",
            "title": "ECONOMIC THEORY-MICROECONOMICS SEQUENCE"
        }
    },
    {
        "data": {
            "description": "First order differential equations, introduction to multivariable calculus and constrained optimization, infinite sequences and series, methods of approximation, and a brief introduction to probability. Models and applications from business and the social sciences.",
            "id": "MATH 213",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 2"
        }
    },
    {
        "data": {
            "description": "Focus on extending the standard regression model. Topics include nonlinear regression models, maximum likelihood estimation, panel data, simultaneous equations, linear and nonlinear systems, analysis of discrete choice, limited dependent variables, empirical economic applications and policy analysis.",
            "id": "AAE 637",
            "parent": "AAE",
            "title": "APPLIED ECONOMETRIC ANALYSIS II"
        }
    },
    {
        "data": {
            "description": "Focuses on developing a conceptual as well as empirical analysis of microeconomic behavior, including production and consumption analysis, technical change, and investment. Emphasizes empirical applications of microeconomics, with implications for efficiency and welfare analysis. Knowledge of statistics such asSTAT/​MATH  309is recommended.",
            "id": "AAE 705",
            "parent": "AAE",
            "title": "APPLIED MICROECONOMICS"
        }
    },
    {
        "data": {
            "description": "Focuses on professional communication in a variety of contexts. Examples include but are not limited to: presenting results for technical and non-technical audiences, writing about research findings, synthesizing knowledge from multiple sources, and summarizing and critiquing different analysis strategies. Students will develop their writing and speaking skills by completing stand-alone tasks, and by coordinating communication tasks with exercises in simultaneously offered theory and econometric classes.",
            "id": "AAE 721",
            "parent": "AAE",
            "title": "PROFESSIONAL COMMUNICATION OF APPLIED ECONOMIC ANALYSIS"
        }
    },
    {
        "data": {
            "description": "For AAE Ph.D. students to develop a dissertation proposal. Working in groups and with some additional feedback from individual advisors. Developing research questions, literature search, word models, math models, testable hypotheses, identification strategies. Working with data, using LATEX, giving presentations. Peer review of weekly assignments. Developing cohort for subsequent feedback through dissertation writing and job search.",
            "id": "AAE 780",
            "parent": "AAE",
            "title": "RESEARCH COLLOQUIUM"
        }
    },
    {
        "data": {
            "description": "Hunger and poverty in developing countries and the United States. Topics include: nutrition and health, population, food production and availability, and income distribution and employment.",
            "id": "AAE/AGRONOMY/NUTRSCI 350",
            "title": "WORLD HUNGER AND MALNUTRITION"
        }
    },
    {
        "data": {
            "description": "Includes a sequential study of subject material in agribusiness management and managerial economics related to the management of agricultural businesses. Topics related to agribusiness management in the U.S., including organizational structure, marketing, strategy, financial statements, financing and production planning. Concepts from managerial economics as applied to the agribusiness firm, including production theory, cost analysis, pricing strategies, cost-benefit analysis, investment decisions and competition strategies.",
            "id": "AAE 625",
            "parent": "AAE",
            "title": "AGRIBUSINESS ECONOMICS AND MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Independent research and writing to complete dissertation requirement.",
            "id": "AAE 990",
            "parent": "AAE",
            "title": "RESEARCH AND THESIS"
        }
    },
    {
        "data": {
            "description": "Independent research guided by an AAE faculty or instructional academic staff member. Students are responsible for arranging the work and credits with the supervising instructor.",
            "id": "AAE 699",
            "parent": "AAE",
            "title": "SPECIAL PROBLEMS"
        }
    },
    {
        "data": {
            "description": "Individual study for majors completing theses for AAE degrees as arranged with a faculty member. Requires consent of supervising instructor. Continuation ofA A E 691.",
            "id": "AAE 692",
            "parent": "AAE",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Individual study for majors completing theses for AAE degrees as arranged with a faculty member. Requires consent of supervising instructor.",
            "id": "AAE 691",
            "parent": "AAE",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Individual study for majors completing theses for Honors degrees as arranged with a faculty member. Requires consent of supervising instructor. Continuation of 681. Enrolled in CALS Honors Program.",
            "id": "AAE 682",
            "parent": "AAE",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Individual study for majors completing theses for Honors degrees as arranged with a faculty member. Requires consent of supervising instructor. Enrolled in CALS Honors Program.",
            "id": "AAE 681",
            "parent": "AAE",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Instructional orientation to teaching at the higher education level in the agricultural and life sciences, direct teaching experience under faculty supervision, experience in testing and evaluation of students, and the analysis of teaching performance.",
            "id": "AAE 799",
            "parent": "AAE",
            "title": "PRACTICUM IN AGRICULTURAL AND APPLIED ECONOMICS TEACHING"
        }
    },
    {
        "data": {
            "description": "Integrated treatment of macroeconomics and microeconomics (seeECON 101andECON 102). Accelerated approach to economics training, especially for Economics: Math Emphasis majors.",
            "id": "ECON 111",
            "parent": "ECON",
            "title": "PRINCIPLES OF ECONOMICS-ACCELERATED TREATMENT"
        }
    },
    {
        "data": {
            "description": "Interdisciplinary inquiry in Latin American society and culture.",
            "id": "AAE/ANTHRO/C&ESOC/GEOG/HISTORY/LACIS/POLISCI/PORTUG/SOC/SPANISH 982",
            "title": "INTERDEPARTMENTAL SEMINAR IN THE LATIN-AMERICAN AREA"
        }
    },
    {
        "data": {
            "description": "Introduction to analysis of economic data. The techniques of descriptive statistics and statistical inference (hypothesis testing and estimation) as directed toward application in economic research.",
            "id": "ECON 310",
            "parent": "ECON",
            "title": "STATISTICS: MEASUREMENT IN ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Introduction to basic finance concepts.  Topics include financial statements, ratio analysis and interpretation, investment analysis, capital budgeting, credit concepts, and capital markets.",
            "id": "AAE 419",
            "parent": "AAE",
            "title": "AGRICULTURAL FINANCE"
        }
    },
    {
        "data": {
            "description": "Introduction to data analysis for social scientists using spreadsheets software - with specific applications to economics, business and finance - including data management and manipulation; formulas and calculations; data visualization and presentation using charts and graphics; statistical and visual analysis of economic indicators using tables, functions, graphs and descriptive statistics; and optimization of functions with economic and financial data.",
            "id": "AAE 335",
            "parent": "AAE",
            "title": "INTRODUCTION TO DATA ANALYSIS USING SPREADSHEETS"
        }
    },
    {
        "data": {
            "description": "Introduction to data and data processing using both Python and R programming languages. Concepts covered include loading data, data acquisition, cleaning data, visualization/exploring data, and storing data.",
            "id": "AAE 718",
            "parent": "AAE",
            "title": "DATA SCIENCE FOR AGRICULTURAL AND APPLIED ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Introduction to economic ways of thinking about a wide range of problems and issues. Topics include consumption, production, prices, markets, finance, trade, pollution, growth, farms, taxes, and development.",
            "id": "AAE 101",
            "parent": "AAE",
            "title": "INTRODUCTION TO AGRICULTURAL AND APPLIED ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Introduction to modern statistical practice in the life sciences, using the R programming language. Topics include: exploratory data analysis, probability and random variables; one-sample testing and confidence intervals, role of assumptions, sample size determination, two-sample inference; basic ideas in experimental design, analysis of variance, linear regression, goodness-of fit; biological applications.",
            "id": "STAT 371",
            "parent": "STAT",
            "title": "INTRODUCTORY APPLIED STATISTICS FOR THE LIFE SCIENCES"
        }
    },
    {
        "data": {
            "description": "Introduction to the standard linear regression model with an emphasis on application issues. Includes statistical foundation, hypothesis testing, functional form, model selection and procedures for handling violations of model assumption.",
            "id": "AAE 636",
            "parent": "AAE",
            "title": "APPLIED ECONOMETRIC ANALYSIS I"
        }
    },
    {
        "data": {
            "description": "Introductory overview focused on the key aspects of the real estate process: developing real estate, permitting real estate, buying and selling real estate, understanding the economics of real estate, financing real estate, valuing real estate, leasing real estate, and managing real estate.",
            "id": "AAE/ECON/REALEST/URBRPL 306",
            "title": "THE REAL ESTATE PROCESS"
        }
    },
    {
        "data": {
            "description": "Macroeconomic measurement and models of aggregate demand and supply; fiscal and monetary policy for unemployment, inflation, and growth.",
            "id": "ECON 102",
            "parent": "ECON",
            "title": "PRINCIPLES OF MACROECONOMICS"
        }
    },
    {
        "data": {
            "description": "Managerial oriented, applied presentation of microeconomic theory. Quantitative emphasis with extensive homework use of spreadsheets and written executive summaries of applied economic analyses. Applications on natural resources and agricultural markets.",
            "id": "AAE/ECON 421",
            "title": "ECONOMIC DECISION ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Micro- and macroeconomic analysis of consumer behavior, markets, business strategy and government policy. Topics include supply and demand, equilibrium, elasticity, welfare, trade, externalities, market structure, economic growth, unemployment, and inflation.",
            "id": "AAE 601",
            "parent": "AAE",
            "title": "APPLIED ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Microeconomic principles underlying the use of natural resources such as air, water, forests, fisheries, minerals and energy. These principles are applied in the examination of pollution control, preservation vs. development, deforestation, and other environmental issues.",
            "id": "AAE/ECON/ENVIRST 343",
            "title": "ENVIRONMENTAL ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Microeconomic theory applied to consumers, producers, markets, and welfare analysis. Emphasis is on the mathematics of duality and optimization methods. Computer applications of the theory. One semester of linear algebra highly recommended.",
            "id": "AAE 635",
            "parent": "AAE",
            "title": "APPLIED MICROECONOMIC THEORY"
        }
    },
    {
        "data": {
            "description": "Organization, design, and performance of food and agricultural markets. Industrial organization; firm boundaries, contracting, and collective action; spatial, temporal, and quality dimensions of market design.",
            "id": "AAE/ECON 747",
            "title": "FRONTIERS IN AGRICULTURAL ECONOMICS 2"
        }
    },
    {
        "data": {
            "description": "Overview of fundamental topics related to macroeconomics, economic measurement and financial markets, with specific applications to agricultural business and policy. Concepts include fiscal and monetary policy, the money system, models of aggregate supply and demand, business cycles, financial instruments, productivity, measurements and indicators of employment and economic growth, financial institutions, forecasting, and international trade and finance.",
            "id": "AAE 719",
            "parent": "AAE",
            "title": "APPLIED BUSINESS ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Overview of the economic performance of agriculture in feeding the growing world population. Examines contemporary economic issues in the food sector, along with research methods used in their analysis. Covers production analysis, risk and uncertainty, food demand, market structure, policy and welfare analysis.",
            "id": "AAE 641",
            "parent": "AAE",
            "title": "FOUNDATIONS OF AGRICULTURAL ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Prepares students for their own empirical work by examining contemporary econometric techniques as they are used in development, environment and natural resources, and agricultural economics. Guides students through a selection of applied models using past and current research as examples. By hearing lectures and working through papers, problem sets, replication exercises, and/or research projects, students will develop a deeper understanding of the many facets of empirical research in economics.",
            "id": "AAE 737",
            "parent": "AAE",
            "title": "APPLIED ECONOMETRIC ANALYSIS III"
        }
    },
    {
        "data": {
            "description": "Presents the welfare economics underpinnings for evaluating the social benefits and costs of government activities. Issues such as uncertainty, the social discount rate, and welfare weights will be discussed; case studies from the environmental, social policy, and agricultural areas will be studied.",
            "id": "AAE/ENVIRST/POPHLTH/PUBAFFR 881",
            "title": "BENEFIT-COST ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Principles and practices in marketing systems for U.S. agricultural commodities. Vertical organization; forward contracts, future markets, agricultural options and price formation. Alternate management at the farm, processor, wholesale and retail levels.",
            "id": "AAE 322",
            "parent": "AAE",
            "title": "COMMODITY MARKETS"
        }
    },
    {
        "data": {
            "description": "Probability distributions, statistical inference; multiple linear regression; introduction to econometric methods. It is expected that students will have completed three semesters calculus (such asMATH 234) and linear algebra (such asMATH 340).",
            "id": "ECON 709",
            "parent": "ECON",
            "title": "ECONOMIC STATISTICS AND ECONOMETRICS I"
        }
    },
    {
        "data": {
            "description": "Professional development for applied economists in sequential contexts. Examples include understanding and preparing for the professional economist job market; preparing and packaging job search materials; technical and non-technical interactions with potential employers and clients; understanding leadership styles and exploring leadership potential; examining professional ethics and norms; and gaining exposure to trends in professional development. Students will develop career skills by completing stand-alone activities, and by coordinating soft skill development tasks with exercises in simultaneously or previously offered theory and econometric classes.",
            "id": "AAE 723",
            "parent": "AAE",
            "title": "PROFESSIONAL DEVELOPMENT SEMINAR"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Provides an area equivalency for courses taken on Madison Study Abroad Programs that do not equate to existing UW courses. Current enrollment in a UW-Madison study abroad program",
            "id": "AAE 400",
            "parent": "AAE",
            "title": "STUDY ABROAD IN AGRICULTURAL AND APPLIED ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Provides an in-depth understanding of the history of organic agriculture, its production, processing, marketing, and social dimensions, and its impact on environmental, community, and human health.",
            "id": "AAE/AGRONOMY/HORT/PLPATH 367",
            "title": "INTRODUCTION TO ORGANIC AGRICULTURE: PRODUCTION, MARKETS, AND POLICY"
        }
    },
    {
        "data": {
            "description": "Real-world, hands-on collaboration with industry partners to offer practical training projects or internships under the direction and oversight of an instructor in the Department of Agricultural and Applied Economics. The goal of both internships and practical training is to offer valuable opportunities to acquire practical, industry-related skills through hands-on learning.",
            "id": "AAE 899",
            "parent": "AAE",
            "title": "AAE GRADUATE PRACTICAL TRAINING/INTERNSHIP"
        }
    },
    {
        "data": {
            "description": "Research work under direct guidance of a faculty or instructional academic staff member. Students are responsible for arranging the work and credits with the supervising instructor.",
            "id": "AAE 299",
            "parent": "AAE",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Research work under direct guidance of an AAE faculty or instructional academic staff member. Students are responsible for arranging the work and credits with the supervising instructor. Intended for students in the CALS Honors Program.",
            "id": "AAE 289",
            "parent": "AAE",
            "title": "HONORS INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Sociological examination of the linkages between the social and biophysical dimensions of the environment. Key topics include community organizing, local food systems, energy transitions, environmental justice, resource dependence, and sustainable development.",
            "id": "C&ESOC/SOC 140",
            "title": "INTRODUCTION TO COMMUNITY AND ENVIRONMENTAL SOCIOLOGY"
        }
    },
    {
        "data": {
            "description": "Special topics on contemporary issues relevant to agricultural and applied economics.",
            "id": "AAE 375",
            "parent": "AAE",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "Special topics on contemporary issues relevant to agricultural and applied economics.",
            "id": "AAE 875",
            "parent": "AAE",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "Survey of historical topics and contemporary research questions in environmental and resource economics. Focus areas include foundational models of human/environment interaction, definition and evaluation of the suite of environmental policy instruments, measuring environmental costs and benefits, and examining natural resource use.",
            "id": "AAE 643",
            "parent": "AAE",
            "title": "FOUNDATIONS OF ENVIRONMENTAL AND NATURAL RESOURCE ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Sustaining global health and well-being depends critically on interactions between human and natural systems at multiple spatial and temporal scales.  Economics provides a useful paradigm for understanding these interactions and the pathways through which individual and societal decisions made in the face of scarce resources, and threats to the natural environment, generate health and well-being outcomes.  Provides students with an opportunity to use basic economic and social science reasoning to describe global heath challenges; understand the causes and consequences of health discrepancies; evaluate health and environmental policies; and appreciate the interconnectedness of planetary health and economic outcomes.",
            "id": "AAE 352",
            "parent": "AAE",
            "title": "GLOBAL HEALTH: ECONOMICS, NATURAL SYSTEMS, AND POLICY"
        }
    },
    {
        "data": {
            "description": "Teaches generation and use of survey data. Topics include identification of target population, random, stratified,  cluster sampling, power analysis, survey collection  implementation, retrospective and prospective surveys of respondent choice, experimental choice in survey design, and econometric modeling of respondent choices.",
            "id": "AAE 777",
            "parent": "AAE",
            "title": "SURVEY AND SAMPLE DESIGN IN APPLIED ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Teaches students how to apply economic theory to economic problems, utilize quantitative techniques in economic analyses, and communicate findings and results of economic analyses.",
            "id": "AAE 500",
            "parent": "AAE",
            "title": "SENIOR CAPSTONE EXPERIENCE"
        }
    },
    {
        "data": {
            "description": "Techniques of integration, improper integrals, first order ordinary differential equations, sequences and series, Taylor series, vector geometry in two and three dimensions.",
            "id": "MATH 222",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 2"
        }
    },
    {
        "data": {
            "description": "The \"economic way of thinking\" about global and regional environmental issues. Topics include climate change, biodiversity preservation, ocean fisheries, environmental impacts of international trade, poverty and the environment, and sustainability.",
            "id": "AAE/ENVIRST 244",
            "title": "THE ENVIRONMENT AND THE GLOBAL ECONOMY"
        }
    },
    {
        "data": {
            "description": "The basic methods, implementation and applications of machine learning for understanding contemporary economic issues using large data sets. Building upon understanding of standard econometric models, the topics include data mining techniques; regression model selection and regularization; post selection inference and economic applications; tree-based methods; neural networks; random forests and casual inference; and unsupervised learning.",
            "id": "AAE 722",
            "parent": "AAE",
            "title": "MACHINE LEARNING IN APPLIED ECONOMIC ANALYSIS"
        }
    },
    {
        "data": {
            "description": "The estimation of the economic models of resource and energy demand, including evaluation of energy and resource programs, estimating demand systems in the study of dynamic pricing models, estimating discrete choice models, forecasting resource and energy demand from econometric models, and topics in the application of big-data analytics in resource and energy demand analysis.",
            "id": "AAE 772",
            "parent": "AAE",
            "title": "APPLIED ECONOMETRICS OF RESOURCE AND ENERGY DEMAND"
        }
    },
    {
        "data": {
            "description": "The first in a 2-course sequence that comprises the capstone course in Resource and Energy Demand Analysis, in which students synthesize their training in a simulated \"real world\" analysis. The course is designed to reflect the full range of professional responsibilities of a resource/energy demand analyst, from data retrieval/cleaning to analysis to reporting.",
            "id": "AAE 774",
            "parent": "AAE",
            "title": "PRACTICUM IN RESOURCE AND ENERGY DEMAND ANALYSIS I"
        }
    },
    {
        "data": {
            "description": "The fundamental mathematics and statistics necessary for the study of quantitative methods in agricultural and applied economics (AAE). Topics include the mathematics of optimization and its role in basic welfare theory and consumer demand; linear and matrix algebra and their application in both modeling consumer behavior and the statistical analysis of models; and the fundamentals of statistical analysis relevant to econometric analysis, including probability theory, sampling distributions and statistical inference.",
            "id": "AAE 670",
            "parent": "AAE",
            "title": "MATHEMATICS FOR AGRICULTURAL AND APPLIED ECONOMICS"
        }
    },
    {
        "data": {
            "description": "The fundamental mathematics and statistics necessary for the study of quantitative methods in resource and energy demand. Topics include the mathematics of optimization and its role in basic welfare theory and consumer demand; linear and matrix algebra and their application in both modeling consumer behavior and the statistical analysis of models; and the fundamentals of statistical analysis relevant to econometric analysis of resource and energy demand, including probability theory, sampling distributions, and statistical inference.",
            "id": "AAE 770",
            "parent": "AAE",
            "title": "INTRODUCTION TO QUANTITATIVE METHODS IN RESOURCE AND ENERGY ECONOMICS"
        }
    },
    {
        "data": {
            "description": "The method, application, and limitations of traditional economic approaches to the study of energy problems. Topics include microeconomic foundations of energy demand and supply; optimal pricing and allocation of energy resources; energy market structure, conduct, and performance; macro linkages of energy and the economy; and the economics of regulatory and other public policy approaches to the social control of energy.",
            "id": "AAE/ECON/ENVIRST/URBRPL 671",
            "title": "ENERGY ECONOMICS"
        }
    },
    {
        "data": {
            "description": "The nature of trade in agricultural products, trade policies and practices of importing and exporting nations, agricultural policies of major trading blocks, market instability and other primary commodity problems, recent history and current developments in multilateral trade policy.",
            "id": "AAE 319",
            "parent": "AAE",
            "title": "THE INTERNATIONAL AGRICULTURAL ECONOMY"
        }
    },
    {
        "data": {
            "description": "The objective of this course is to refine the quantitative skills necessary to succeed in intermediate- and advanced-level economics courses. The principle focus will be on applying the skills acquired in your math courses to the questions, models, and optimization problems that are common in economics. Topics include specific economic applications of algebra, financial mathematics, and calculus.",
            "id": "ECON 205",
            "parent": "ECON",
            "title": "QUANTITATIVE TOOLS FOR ECONOMICS"
        }
    },
    {
        "data": {
            "description": "The role of markets and government in the allocation of environmental goods and services. Topics include public goods, externalities and market failure; policy instruments for dealing with environmental quality problems such as air pollution; and distributional impacts of environmental regulations.",
            "id": "AAE 762",
            "parent": "AAE",
            "title": "FRONTIERS IN ENVIRONMENTAL AND NATURAL RESOURCE ECONOMICS 2"
        }
    },
    {
        "data": {
            "description": "The second in a 2-course sequence that comprises the capstone course in Resource and Energy Demand Analysis, in which students synthesize their training in a simulated \"real world\" analysis. The courses is designed to reflect the full range of professional responsibilities of a resource/energy demand analyst, from data retrieval/cleaning, to analysis, to reporting.",
            "id": "AAE 776",
            "parent": "AAE",
            "title": "PRACTICUM IN RESOURCE AND ENERGY DEMAND ANALYSIS II"
        }
    },
    {
        "data": {
            "description": "The tools and techniques used in the economic approach to policy analysis. Emphasis is on applying these methodological tools to evaluating existing public policies and policy alternatives, as well as providing a deeper understanding of how the economy operates.",
            "id": "PUBAFFR 880",
            "parent": "PUBAFFR",
            "title": "MICROECONOMIC POLICY ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Theory and empirical evidence on growth and development in low-income countries. Topics may include: measurement of poverty and inequality, risk and insurance, social networks, technology adoption, education, corruption, institutions, and behavioral economics.",
            "id": "AAE 730",
            "parent": "AAE",
            "title": "FRONTIERS IN DEVELOPMENT ECONOMICS 1"
        }
    },
    {
        "data": {
            "description": "Theory and evidence on growth and development in emerging economies, with primary focus on globalization, trade, labor markets and human capital. We use open-economy general equilibrium models to examine welfare implications of global shocks and domestic economic policies.",
            "id": "AAE 731",
            "parent": "AAE",
            "title": "FRONTIERS IN DEVELOPMENT ECONOMICS 2"
        }
    },
    {
        "data": {
            "description": "This course explores the roles of markets, states, and civil institutions, using economic theory, computer simulations, and historical experience to better understand the forces that shape the wealth and well-being of nations and people around the world.",
            "id": "AAE/INTLST 374",
            "title": "THE GROWTH AND DEVELOPMENT OF NATIONS IN THE GLOBAL ECONOMY"
        }
    },
    {
        "data": {
            "description": "This is a 1 credit seminar that will be offered each spring. There will be different presenters each year.",
            "id": "AAE 720",
            "parent": "AAE",
            "title": "SEMINAR IN QUANTITATIVE AND APPLIED ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Part of a 2-semester sequence withMATH 217; these two courses together are equivalent toMATH 114and221.",
            "id": "MATH 171",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY I"
        }
    },
    {
        "data": {
            "description": "Use microeconomic theory to analyze energy markets. Discuss the economics of oil, gas, and electricity and learn about applications to contemporary issues and policy questions.",
            "id": "AAE/ECON 371",
            "title": "ENERGY, RESOURCES AND ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Use of quantitative methods (mathematics, statistics, and optimization) to analyze problems faced by decision makers in natural resources and agriculture. Extensive homework requiring use of quantitative methods via spreadsheet tools to solve problems from an applied decision context.",
            "id": "AAE/ECON 526",
            "title": "QUANTITATIVE METHODS IN AGRICULTURAL AND APPLIED ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Uses economic concepts to illustrate the nature of technological innovation, competition, and economic growth. Topics: economics of the intellectual property protection (IPP); market structure and innovation; interaction between public and private sectors; IPP and anticompetitive policies; globalization.",
            "id": "AAE/MHR 540",
            "title": "INTELLECTUAL PROPERTY RIGHTS, INNOVATION AND TECHNOLOGY"
        }
    },
    {
        "data": {
            "description": "With primary emphasis on the U.S., the course covers social, economic and biological dimensions of food systems. Using classroom and community experience, the course combines academic approaches with practitioner knowledge. A community project is required.",
            "id": "AAE/C&ESOC/SOC 340",
            "title": "ISSUES IN FOOD SYSTEMS"
        }
    },
    {
        "data": {
            "id": "AAE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ECON",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "PUBAFFR",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "STAT",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "AAE 101",
            "target": "AAE 319"
        }
    },
    {
        "data": {
            "source": "AAE 101",
            "target": "AAE 320"
        }
    },
    {
        "data": {
            "source": "AAE 101",
            "target": "AAE 322"
        }
    },
    {
        "data": {
            "source": "AAE 101",
            "target": "AAE 419"
        }
    },
    {
        "data": {
            "source": "AAE 101",
            "target": "AAE 422"
        }
    },
    {
        "data": {
            "source": "AAE 101",
            "target": "AAE 670"
        }
    },
    {
        "data": {
            "source": "AAE 101",
            "target": "AAE/CIVENGR/ENVIRST/URBRPL 561"
        }
    },
    {
        "data": {
            "source": "AAE 101",
            "target": "AAE/ECON 371"
        }
    },
    {
        "data": {
            "source": "AAE 101",
            "target": "AAE/ECON 473"
        }
    },
    {
        "data": {
            "source": "AAE 101",
            "target": "AAE/ECON 477"
        }
    },
    {
        "data": {
            "source": "AAE 101",
            "target": "AAE/ECON/ENVIRST 343"
        }
    },
    {
        "data": {
            "source": "AAE 101",
            "target": "AAE/ECON/ENVIRST/URBRPL 671"
        }
    },
    {
        "data": {
            "source": "AAE 101",
            "target": "AAE/ECON/INTLBUS 462"
        }
    },
    {
        "data": {
            "source": "AAE 101",
            "target": "AAE/ECON/REALEST/URBRPL 306"
        }
    },
    {
        "data": {
            "source": "AAE 101",
            "target": "AAE/INTLST 373"
        }
    },
    {
        "data": {
            "source": "AAE 101",
            "target": "AAE/INTLST 374"
        }
    },
    {
        "data": {
            "source": "AAE 335",
            "target": "AAE 625"
        }
    },
    {
        "data": {
            "source": "AAE 635",
            "target": "AAE 641"
        }
    },
    {
        "data": {
            "source": "AAE 635",
            "target": "AAE 642"
        }
    },
    {
        "data": {
            "source": "AAE 635",
            "target": "AAE 643"
        }
    },
    {
        "data": {
            "source": "AAE 635",
            "target": "AAE 705"
        }
    },
    {
        "data": {
            "source": "AAE 635",
            "target": "AAE 706"
        }
    },
    {
        "data": {
            "source": "AAE 636",
            "target": "AAE 637"
        }
    },
    {
        "data": {
            "source": "AAE 636",
            "target": "AAE 641"
        }
    },
    {
        "data": {
            "source": "AAE 636",
            "target": "AAE 642"
        }
    },
    {
        "data": {
            "source": "AAE 636",
            "target": "AAE 643"
        }
    },
    {
        "data": {
            "source": "AAE 636",
            "target": "AAE 721"
        }
    },
    {
        "data": {
            "source": "AAE 636",
            "target": "AAE 722"
        }
    },
    {
        "data": {
            "source": "AAE 636",
            "target": "AAE 772"
        }
    },
    {
        "data": {
            "source": "AAE 636",
            "target": "AAE 774"
        }
    },
    {
        "data": {
            "source": "AAE 637",
            "target": "AAE 724"
        }
    },
    {
        "data": {
            "source": "AAE 721",
            "target": "AAE 723"
        }
    },
    {
        "data": {
            "source": "AAE 771",
            "target": "AAE 721"
        }
    },
    {
        "data": {
            "source": "AAE 772",
            "target": "AAE 776"
        }
    },
    {
        "data": {
            "source": "AGROECOL/AGRONOMY/C&ESOC/ENTOM/ENVIRST 103",
            "target": "AAE/AGRONOMY/HORT/PLPATH 367"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 140",
            "target": "AAE/C&ESOC/SOC 340"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "AAE/ECON 474"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON 102"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON 301"
        }
    },
    {
        "data": {
            "source": "ECON 102",
            "target": "ECON 111"
        }
    },
    {
        "data": {
            "source": "ECON 102",
            "target": "ECON 205"
        }
    },
    {
        "data": {
            "source": "ECON 102",
            "target": "ECON 310"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON 101"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON 102"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON 311"
        }
    },
    {
        "data": {
            "source": "ECON 205",
            "target": "ECON 301"
        }
    },
    {
        "data": {
            "source": "ECON 301",
            "target": "AAE 625"
        }
    },
    {
        "data": {
            "source": "ECON 301",
            "target": "AAE 635"
        }
    },
    {
        "data": {
            "source": "ECON 301",
            "target": "AAE/ECON 526"
        }
    },
    {
        "data": {
            "source": "ECON 301",
            "target": "AAE/ECON/F&WECOL 531"
        }
    },
    {
        "data": {
            "source": "ECON 301",
            "target": "AAE/MHR 540"
        }
    },
    {
        "data": {
            "source": "ECON 301",
            "target": "AAE/REALEST/URBRPL 520"
        }
    },
    {
        "data": {
            "source": "ECON 301",
            "target": "ECON 311"
        }
    },
    {
        "data": {
            "source": "ECON 310",
            "target": "AAE/ECON 421"
        }
    },
    {
        "data": {
            "source": "ECON 311",
            "target": "ECON 301"
        }
    },
    {
        "data": {
            "source": "ECON 709",
            "target": "AAE 730"
        }
    },
    {
        "data": {
            "source": "ECON 709",
            "target": "AAE 731"
        }
    },
    {
        "data": {
            "source": "ECON 709",
            "target": "AAE 737"
        }
    },
    {
        "data": {
            "source": "ECON 709",
            "target": "AAE 746"
        }
    },
    {
        "data": {
            "source": "ECON 709",
            "target": "AAE 760"
        }
    },
    {
        "data": {
            "source": "ECON 709",
            "target": "AAE 762"
        }
    },
    {
        "data": {
            "source": "ECON 709",
            "target": "AAE/ECON 747"
        }
    },
    {
        "data": {
            "source": "ECON 709",
            "target": "ECON 710"
        }
    },
    {
        "data": {
            "source": "ECON 710",
            "target": "AAE 737"
        }
    },
    {
        "data": {
            "source": "ECON 711",
            "target": "AAE 730"
        }
    },
    {
        "data": {
            "source": "ECON 711",
            "target": "AAE 731"
        }
    },
    {
        "data": {
            "source": "ECON 711",
            "target": "AAE 746"
        }
    },
    {
        "data": {
            "source": "ECON 711",
            "target": "AAE 760"
        }
    },
    {
        "data": {
            "source": "ECON 711",
            "target": "AAE 762"
        }
    },
    {
        "data": {
            "source": "ECON 711",
            "target": "AAE/ECON 747"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 113"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 113",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "MATH 217"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "AAE/ECON 526"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "AAE/F&WECOL 652"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "ECON 310"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 213"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "STAT 324"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "source": "MATH 213",
            "target": "MATH 222"
        }
    },
    {
        "data": {
            "source": "MATH 217",
            "target": "ECON 205"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "AAE 670"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "ECON 111"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 222"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "AAE 635"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "PUBAFFR 818",
            "target": "AAE/ENVIRST/POPHLTH/PUBAFFR 881"
        }
    },
    {
        "data": {
            "source": "PUBAFFR 880",
            "target": "AAE/ENVIRST/POPHLTH/PUBAFFR 881"
        }
    },
    {
        "data": {
            "source": "STAT 301",
            "target": "AAE/ECON 526"
        }
    },
    {
        "data": {
            "source": "STAT 324",
            "target": "STAT 301"
        }
    },
    {
        "data": {
            "source": "STAT 324",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "source": "STAT 371",
            "target": "STAT 324"
        }
    }
]