[
    {
        "data": {
            "description": "A preparation and introductory math course for students enrolled in the Summer Collegiate Experience program. Includes material from precalculus and calculus and related topics depending on students' results on the math placement exam.",
            "id": "MATH 118",
            "parent": "MATH",
            "title": "SUMMER COLLEGIATE EXPERIENCE MATHEMATICS COURSE"
        }
    },
    {
        "data": {
            "description": "Analytics has become an integral part of accounting to support decision making, coordination and control, and compliance with regulations. Being able to identify and pursue relevant questions using data is a critical skill for new hires, as is the ability to successfully communicate one's findings. This pursuit and communication requires a strong facility with a variety of analytics technologies.",
            "id": "ACCTIS 640",
            "parent": "ACCTIS",
            "title": "FOUNDATION IN ACCOUNTING ANALYTICS"
        }
    },
    {
        "data": {
            "description": "Audit and assurance services are vital to ensuring that organizations, their stakeholders, and the public can rely on organizations' financial information. Focus is on financial statement audits and their role in corporate governance and oversight. Emphasizes the components of the audit process with application to key financial accounting cycles and related internal controls. Also covers the professional role of public accountants and professional standards, norms and ethics.",
            "id": "ACCTIS 630",
            "parent": "ACCTIS",
            "title": "FOUNDATIONS OF AUDITING"
        }
    },
    {
        "data": {
            "description": "Covers the graphs, properties and geometric significance of trigonometric functions of a real variable. Other topics include trigonometric equations and identities, application, trigonometric form of complex numbers, DeMoivre's theorem, and polar and parametric equations. The course also has a significant number of applications, especially related to other disciplines.",
            "id": "MATH 113",
            "parent": "MATH",
            "title": "TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "An introduction to international tax issues. Topics covered may include tax treaties, foreign tax credit provisions, Subpart F rules, and taxation of inbound investment and business income.",
            "id": "ACCTIS 725",
            "parent": "ACCTIS",
            "title": "ANALYSIS OF INTERNATIONAL TAXATION"
        }
    },
    {
        "data": {
            "description": "An introduction to the U.S. income taxation concepts with emphasis on business and personal planning strategies. Taxes are placed in a framework which considers all costs of doing business. Includes approaches and skills needed to prepare individual, corporate, and partnership income tax returns.",
            "id": "ACCTIS 329",
            "parent": "ACCTIS",
            "title": "TAXATION: CONCEPTS FOR BUSINESS AND PERSONAL PLANNING"
        }
    },
    {
        "data": {
            "description": "An opportunity to experience a professional accounting practice first hand and to integrate this experience with the curriculum.",
            "id": "ACCTIS 600",
            "parent": "ACCTIS",
            "title": "PROFESSIONAL EXPERIENCE IN ACCOUNTING"
        }
    },
    {
        "data": {
            "description": "Analysis and interpretation of financial statements, including profitability and ratio analysis, cash flow analysis, accounting-based equity valuation, market impact of accounting choices, earnings quality, earnings management, mergers and acquisitions, intangibles, accounting-based trading strategies, accounting and credit ratings, and international accounting.",
            "id": "ACCTIS 603",
            "parent": "ACCTIS",
            "title": "FINANCIAL STATEMENT ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Analysis of federal tax provisions and administrative rules regarding pass-through entities, such as partnerships, S-corporations, and limited liability companies; including their application to entity formation and operation, property and ownership basis, distributions, and interest transfers.",
            "id": "ACCTIS 722",
            "parent": "ACCTIS",
            "title": "ANALYSIS OF TAXATION FOR PASS-THROUGH ENTITIES"
        }
    },
    {
        "data": {
            "description": "Application of federal tax provisions and administrative rules common to most taxpayers with introductions to rules specific to corporations, pass-through entities, and individuals.",
            "id": "ACCTIS 620",
            "parent": "ACCTIS",
            "title": "FUNDAMENTALS OF TAXATION"
        }
    },
    {
        "data": {
            "description": "Application of federal tax provisions and administrative rules pertaining to corporations and shareholders, including elective provisions for \"S\" corporations. Emphasis on tax planning and the consequences of corporate and shareholder decisions.",
            "id": "ACCTIS 621",
            "parent": "ACCTIS",
            "title": "CORPORATE AND ADVANCED TAXATION"
        }
    },
    {
        "data": {
            "description": "Auditors increasingly use analytics to provide assurance over financial and non-financial information. Audit and assurance principles will be viewed through the lens of an analytics mindset. Uses analytics in combination with other audit techniques as a basis for professional judgments. Examines how the contemporary audit environment influences professional judgments. Develops the technical knowledge and skills needed in many professional roles through discussion, case studies, and group projects.",
            "id": "ACCTIS 730",
            "parent": "ACCTIS",
            "title": "ADVANCED AUDITING: ANALYSIS, POLICY, AND JUDGMENT"
        }
    },
    {
        "data": {
            "description": "Build fundamental skills and processes to develop a strong foundation in business analysis utilizing Excel. Learn the fundamentals of data construction, manipulation, summarization, analysis and presentation.",
            "id": "GENBUS 106",
            "parent": "GENBUS",
            "title": "FOUNDATIONAL SKILLS FOR BUSINESS ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Commercial paper, real estate and personal property, partnerships, corporations, bankruptcy.",
            "id": "ACCTIS 401",
            "parent": "ACCTIS",
            "title": "BUSINESS ORGANIZATIONS AND NEGOTIABLE INSTRUMENTS"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Design of actual and standard cost systems for reporting product costs in job costing, process costing, and activity costing production environments. Overhead allocation methods. Budgeting and profit planning procedures. Techniques for variance analysis and performance evaluation. Behavioral considerations in the design and use of cost accounting information systems.",
            "id": "ACCTIS 310",
            "parent": "ACCTIS",
            "title": "COST MANAGEMENT SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Development and analysis of accounting data for managerial planning, control, decision-making, and costing, with a focus on the integration of financial and non-financial information needs for various managerial functions.",
            "id": "ACCTIS 771",
            "parent": "ACCTIS",
            "title": "ANALYSIS OF PERFORMANCE MEASUREMENT & CONTROL"
        }
    },
    {
        "data": {
            "description": "Development of quantitative intuition through practical applications and use of analysis tools. Specifically, emphasis will be on how to manage, summarize, explore, and visualize databases. The essentials of probability will be introduced and applied to decision problems where there is uncertainty. Emphasis on hypothesis testing and regression analysis and include an introduction to simulation methods. Throughout, attention will be paid to effective communication of data analysis. The use of business cases will connect the course material to both real world settings and recent advances in data analysis, including big data and data mining.",
            "id": "GENBUS 306",
            "parent": "GENBUS",
            "title": "BUSINESS ANALYTICS I"
        }
    },
    {
        "data": {
            "description": "Emphasis on hands-on experience with many commonly used analytic methodologies using the modeling and optimization tools available on almost every professional desktop. The focus is predictive and prescriptive analytics. Predictive approaches use historical data to infer causal relationships and forecast future outcomes from a given action. Prescriptive methods take this a step further, helping managers formulate decision models that identify optimal actions given a set of circumstances.",
            "id": "GENBUS 307",
            "parent": "GENBUS",
            "title": "BUSINESS ANALYTICS II"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "Examines both financial and managerial accounting for business decisions. Emphasizes preparation and interpretation of financial statements, analysis of financial information, determination of costs for products and services, and use of accounting information for planning and control of business operations.",
            "id": "ACCTIS 300",
            "parent": "ACCTIS",
            "title": "ACCOUNTING PRINCIPLES"
        }
    },
    {
        "data": {
            "description": "Examines current and emerging financial accounting theory and techniques used to measure and report financial information to investors, creditors, and orther external users, including dilutive securities, investments, revenue recognition, income tax allocation, pensions, leases and accounting changes.",
            "id": "ACCTIS 702",
            "parent": "ACCTIS",
            "title": "FINANCIAL REPORTING II"
        }
    },
    {
        "data": {
            "description": "Examines current and emerging financial accounting theory and techniques used to measure and report financial information to investors, creditors, and other external users, including dilutive securities, investments, revenue recognition, income tax allocation, pensions, leases and accounting changes.",
            "id": "ACCTIS 302",
            "parent": "ACCTIS",
            "title": "FINANCIAL REPORTING II"
        }
    },
    {
        "data": {
            "description": "Examines current and emerging financial accounting theory and techniques used to measure and report financial information to investors, creditors, and other external users. Emphasizes asset and income determination, preparation and interpretation of financial statements, and related disclosure requirements.",
            "id": "ACCTIS 301",
            "parent": "ACCTIS",
            "title": "FINANCIAL REPORTING I"
        }
    },
    {
        "data": {
            "description": "Examines current and emerging financial accounting theory and techniques used to measure and report financial information to investors, creditors, and other external users. Emphasizes asset and liability valuations and their relationships to income determination, preparation and interpretation of financial statements, and related disclosure requirements.",
            "id": "ACCTIS 701",
            "parent": "ACCTIS",
            "title": "FINANCIAL REPORTING I"
        }
    },
    {
        "data": {
            "description": "Examines generally accepted accounting principles for measurement and reporting of financial information in a balance sheet, income statement, and statement of cash flows; introduction to analysis and interpretation of financial accounting data for decision-making purposes.",
            "id": "ACCTIS 100",
            "parent": "ACCTIS",
            "title": "INTRODUCTORY FINANCIAL ACCOUNTING"
        }
    },
    {
        "data": {
            "description": "Examines the control and security of accounting information systems with an auditing and forensic perspective.  Topics covered include: data governance frameworks, risks to information (i.e., data), internal controls related to identified risks, types of assurance services, computer assisted audit tools and techniques (CAATTs), fraud, and other related topics.",
            "id": "ACCTIS 740",
            "parent": "ACCTIS",
            "title": "INFORMATION RISK, CONTROL, & FORENSICS"
        }
    },
    {
        "data": {
            "description": "Exploration of advanced subject areas possibly to be introduced into the business curriculum.",
            "id": "ACCTIS 765",
            "parent": "ACCTIS",
            "title": "CONTEMPORARY TOPICS"
        }
    },
    {
        "data": {
            "description": "Individual work suited to the needs of Ph.D. students may be arranged with a faculty member.",
            "id": "ACCTIS 999",
            "parent": "ACCTIS",
            "title": "READING AND RESEARCH-ACCOUNTING PHD"
        }
    },
    {
        "data": {
            "description": "Individual work suited to the needs of graduate students may be arranged both during regular sessions and the intersession periods.",
            "id": "ACCTIS 799",
            "parent": "ACCTIS",
            "title": "READING AND RESEARCH-ACCOUNTING"
        }
    },
    {
        "data": {
            "description": "Individual work suited to the needs of undergraduate students may be arranged with a faculty member.",
            "id": "ACCTIS 399",
            "parent": "ACCTIS",
            "title": "READING AND RESEARCH-ACCOUNTING"
        }
    },
    {
        "data": {
            "description": "Individual work to complete dissertation requirement of Ph.D. program.",
            "id": "ACCTIS 990",
            "parent": "ACCTIS",
            "title": "ACCOUNTING INDEPENDENT RESEARCH PHD THESIS"
        }
    },
    {
        "data": {
            "description": "Interpretation and use of accounting data for management planning, decision making and control. Consideration of cost-volume-profit relationships, relevant costs, variable (direct) costing, activity-based costing, transfer pricing and performance evaluation of segments of the firm.",
            "id": "ACCTIS 710",
            "parent": "ACCTIS",
            "title": "MANAGERIAL ACCOUNTING"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Managerial accounting concepts relevant for decision-making; use of accounting information for planning, decision-making, and control of business operations in various management and business environments.",
            "id": "ACCTIS 211",
            "parent": "ACCTIS",
            "title": "INTRODUCTORY MANAGERIAL ACCOUNTING"
        }
    },
    {
        "data": {
            "description": "Measurement and reporting guidelines underlying preparation of general purpose financial statements. Explore current measurement and reporting issues. Analyze and interpret financial statement data for investment, lending, and related decisions.",
            "id": "ACCTIS 700",
            "parent": "ACCTIS",
            "title": "FINANCIAL ACCOUNTING"
        }
    },
    {
        "data": {
            "description": "Methodologies and tools for tax research; utilization of tax research tools; preparation of investigative reports; professional and interprofessional responsibilities; administrative procedures and techniques.",
            "id": "ACCTIS 724",
            "parent": "ACCTIS",
            "title": "TAX RESEARCH, PROCEDURE & ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Provides the tools needed for educated consumption of accounting research. Examines and synthesizes relevant accounting research to identify important research questions. Develops the knowledge and skills needed to conduct accounting research through discussion, presentations, and writing assignments.",
            "id": "ACCTIS 971",
            "parent": "ACCTIS",
            "title": "SEMINAR IN ACCOUNTING RESEARCH"
        }
    },
    {
        "data": {
            "description": "Readings and cases in taxation; analysis and integration of related tax provisions and taxpayer impact.",
            "id": "ACCTIS 772",
            "parent": "ACCTIS",
            "title": "ANALYSIS OF TAXES & BUSINESS DECISIONS"
        }
    },
    {
        "data": {
            "description": "Review and analysis of theoretical foundations of corporate financial reporting; application of conceptual framework and finance/economic theories to understand development of major accounting standards.",
            "id": "ACCTIS 770",
            "parent": "ACCTIS",
            "title": "ACCOUNTING THEORY: REPORTING INCENTIVES AND CONSEQUENCES"
        }
    },
    {
        "data": {
            "description": "Study of current accounting and audit issues within a case context. Students will be required to perform computerized research, analyze topical accounting and audit issues, and make case presentations.",
            "id": "ACCTIS 601",
            "parent": "ACCTIS",
            "title": "PROFESSIONAL PRACTICE ISSUES IN ACCOUNTING, AUDITING, AND TAXATION"
        }
    },
    {
        "data": {
            "description": "Theoretical, procedural, and practical issues associated with the preparation of financial statements of alternative reporting entities, including the accounting for mergers and acquisitions, consolidations, foreign operations, and complex financial instruments.",
            "id": "ACCTIS 406",
            "parent": "ACCTIS",
            "title": "ACCOUNTING AND ANALYSIS FOR REPORTING ENTITIES"
        }
    },
    {
        "data": {
            "description": "This course is designed with a keen awareness for the needs of the non-financial student or professional. For this class, no previous financial training is required. The intent is to equip you with the essential concepts used to develop financial literacy. Content will cover basic financial terms and reports, analytical tools to help interpret financial data and using financial data in budgets and forecasts.",
            "id": "ACCTIS/EPD/GENBUS 781",
            "title": "FINANCIAL AND BUSINESS ACUMEN"
        }
    },
    {
        "data": {
            "description": "Understand, document, and evaluate integrated enterprise systems and critical information tracked in core business processes, applying technology to model, capture, and query data needed, and assess system design and controls.",
            "id": "ACCTIS 340",
            "parent": "ACCTIS",
            "title": "ACCOUNTING INFORMATION SYSTEMS"
        }
    },
    {
        "data": {
            "id": "ACCTIS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "GENBUS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ACCTIS 100",
            "target": "ACCTIS 211"
        }
    },
    {
        "data": {
            "source": "ACCTIS 100",
            "target": "ACCTIS 300"
        }
    },
    {
        "data": {
            "source": "ACCTIS 100",
            "target": "ACCTIS 301"
        }
    },
    {
        "data": {
            "source": "ACCTIS 100",
            "target": "ACCTIS 640"
        }
    },
    {
        "data": {
            "source": "ACCTIS 211",
            "target": "ACCTIS 310"
        }
    },
    {
        "data": {
            "source": "ACCTIS 211",
            "target": "ACCTIS 340"
        }
    },
    {
        "data": {
            "source": "ACCTIS 300",
            "target": "ACCTIS 100"
        }
    },
    {
        "data": {
            "source": "ACCTIS 300",
            "target": "ACCTIS 329"
        }
    },
    {
        "data": {
            "source": "ACCTIS 301",
            "target": "ACCTIS 302"
        }
    },
    {
        "data": {
            "source": "ACCTIS 301",
            "target": "ACCTIS 340"
        }
    },
    {
        "data": {
            "source": "ACCTIS 301",
            "target": "ACCTIS 620"
        }
    },
    {
        "data": {
            "source": "ACCTIS 302",
            "target": "ACCTIS 406"
        }
    },
    {
        "data": {
            "source": "ACCTIS 340",
            "target": "ACCTIS 730"
        }
    },
    {
        "data": {
            "source": "ACCTIS 620",
            "target": "ACCTIS 621"
        }
    },
    {
        "data": {
            "source": "ACCTIS 620",
            "target": "ACCTIS 722"
        }
    },
    {
        "data": {
            "source": "ACCTIS 620",
            "target": "ACCTIS 724"
        }
    },
    {
        "data": {
            "source": "ACCTIS 620",
            "target": "ACCTIS 725"
        }
    },
    {
        "data": {
            "source": "ACCTIS 620",
            "target": "ACCTIS 772"
        }
    },
    {
        "data": {
            "source": "ACCTIS 630",
            "target": "ACCTIS 730"
        }
    },
    {
        "data": {
            "source": "ACCTIS 700",
            "target": "ACCTIS 701"
        }
    },
    {
        "data": {
            "source": "ACCTIS 700",
            "target": "ACCTIS 710"
        }
    },
    {
        "data": {
            "source": "ACCTIS 701",
            "target": "ACCTIS 630"
        }
    },
    {
        "data": {
            "source": "ACCTIS 701",
            "target": "ACCTIS 702"
        }
    },
    {
        "data": {
            "source": "ACCTIS 702",
            "target": "ACCTIS 406"
        }
    },
    {
        "data": {
            "source": "ACCTIS 702",
            "target": "ACCTIS 603"
        }
    },
    {
        "data": {
            "source": "ACCTIS 702",
            "target": "ACCTIS 770"
        }
    },
    {
        "data": {
            "source": "ACCTIS 710",
            "target": "ACCTIS 771"
        }
    },
    {
        "data": {
            "source": "GENBUS 106",
            "target": "GENBUS 306"
        }
    },
    {
        "data": {
            "source": "GENBUS 106",
            "target": "GENBUS 307"
        }
    },
    {
        "data": {
            "source": "GENBUS 306",
            "target": "GENBUS 307"
        }
    },
    {
        "data": {
            "source": "GENBUS 307",
            "target": "ACCTIS 640"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 113"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 113",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "GENBUS 306"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    }
]