[
    {
        "data": {
            "description": "Introduces foundational texts in the study of modern Africa and the social, political, and economic contexts of the continent's cultural production and productivity. Conceptual explorations of interesting issues such as the African encounter with Europe, anticolonialism, race, racialism, and subjectivity, African and European languages and epistemology, transformations in gendered structures, and the environment, and the circulation and consumption of cultural forms and practices. Examines the long histories and theories of cultural production and practices in Africa, the local/global provenance of forms and styles, and the contexts of their local, national, and global circulation and consumption. Promotes critical thinking by putting like and unlike texts together and considering rhetoric and implied meanings, all in the context of Africa's interactive history with the world in the modern era.",
            "id": "AFRICAN 605",
            "parent": "AFRICAN",
            "title": "ADVANCED TOPICS IN AFRICAN CULTURAL STUDIES"
        }
    },
    {
        "data": {
            "description": "A critical and historical study of selected topics in African literary studies.",
            "id": "AFRICAN 606",
            "parent": "AFRICAN",
            "title": "ADVANCED TOPICS IN AFRICAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "A critical study of the major works.",
            "id": "AFRICAN 412",
            "parent": "AFRICAN",
            "title": "CONTEMPORARY AFRICAN FICTION"
        }
    },
    {
        "data": {
            "description": "A critical study of the major works.",
            "id": "AFRICAN/AFROAMER 413",
            "title": "CONTEMPORARY AFRICAN AND CARIBBEAN DRAMA"
        }
    },
    {
        "data": {
            "description": "A multi-disciplinary introduction to the identities, history, language, literature, and artistic heritage of Swahili speakers.",
            "id": "AFRICAN 232",
            "parent": "AFRICAN",
            "title": "INTRODUCTION TO SWAHILI CULTURES"
        }
    },
    {
        "data": {
            "description": "A selection of Arabic texts, ranging from Classical to modern.",
            "id": "AFRICAN 445",
            "parent": "AFRICAN",
            "title": "ADVANCED READINGS IN ARABIC TEXTS"
        }
    },
    {
        "data": {
            "description": "A study of culture and cultural production, circulation, consumption, and meaning making in Africa. Discussions foreground material and imaginative cultural forms and practices-their origins, languages, contents, forms, functions, genres, and audiences. Examines the uses to which particular meanings of culture and its forms are put, by whom, and to what purpose, and how meanings are fought over, reshaped, and reconstituted, and under what conditions those are or can be possible. Surveys the entrenched modes of both conceptual and critical apprehension of the cultural forms and practices (from Negritude to postcolonialism and postmodernism), explores their methods of reading, raises the issue of their linkages to sources in Euro-America, and assesses the extent to which the unique concerns of the biography of culture in Africa (expressed by its creators and scholars) have tried to tame and refashion what are now globally shared critical tools of cultural reading.",
            "id": "AFRICAN 403",
            "parent": "AFRICAN",
            "title": "THEORIES OF AFRICAN CULTURAL STUDIES"
        }
    },
    {
        "data": {
            "description": "A study of culture and cultural production, circulation, consumption, and meaning making in Africa. Discussions foreground material and imaginative cultural forms and practices-their origins, languages, contents, forms, functions, genres, and audiences. Examines the uses to which particular meanings of culture and its forms are put, by whom, and to what purpose, and how meanings are fought over, reshaped, and reconstituted, and under what conditions those are or can be possible. Surveys the entrenched modes of both conceptual and critical apprehension of the cultural forms and practices (from Negritude to postcolonialism and postmodernism), explores their methods of reading, raises the issue of their linkages to sources in Euro-America, and assesses the extent to which the unique concerns of the biography of culture in Africa (expressed by its creators and scholars) have tried to tame and refashion what are now globally shared critical tools of cultural reading.",
            "id": "AFRICAN 803",
            "parent": "AFRICAN",
            "title": "THEORIES OF AFRICAN CULTURAL STUDIES"
        }
    },
    {
        "data": {
            "description": "A theoretical and practical exploration of second language acquisition (SLA) and self-instructional methods. Test and/or modify one or more theories/methods by putting these self-instructional methods into practice in order to learn a less commonly taught language (LCTL).",
            "id": "AFRICAN 672",
            "parent": "AFRICAN",
            "title": "INTENSIVE SUMMER MULTILANGUAGE SEMINAR"
        }
    },
    {
        "data": {
            "description": "A theoretical and practical exploration of second language acquisition (SLA) and self-instructional methods. Tests and/or modifies one or more theories/methods by putting these self-instructional methods into practice in order to learn a less commonly taught language (LCTL).",
            "id": "AFRICAN 670",
            "parent": "AFRICAN",
            "title": "THEORIES AND METHODS OF LEARNING A LESS COMMONLY TAUGHT LANGUAGE"
        }
    },
    {
        "data": {
            "description": "Advanced directed study projects as arranged with a faculty member.",
            "id": "AFRICAN 698",
            "parent": "AFRICAN",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Advanced directed study projects as arranged with a faculty member.",
            "id": "AFRICAN 699",
            "parent": "AFRICAN",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Advanced grammar and conversational practice. Reading contemporary Yoruba literature and other writings.",
            "id": "AFRICAN 373",
            "parent": "AFRICAN",
            "title": "THIRD SEMESTER YORUBA"
        }
    },
    {
        "data": {
            "description": "Advanced level mentored reading, writing, and research for dissertators.",
            "id": "AFRICAN 999",
            "parent": "AFRICAN",
            "title": "INDEPENDENT READING AND RESEARCH"
        }
    },
    {
        "data": {
            "description": "Advanced level mentored reading, writing, and research for students with dissertator status.",
            "id": "AFRICAN 990",
            "parent": "AFRICAN",
            "title": "THESIS"
        }
    },
    {
        "data": {
            "description": "Advanced linguistic structures, literature and poetry. Introduction to Yoruba cultures in the works of Wole Soyinka.",
            "id": "AFRICAN 475",
            "parent": "AFRICAN",
            "title": "FIFTH SEMESTER YORUBA"
        }
    },
    {
        "data": {
            "description": "Advanced speaking knowledge and grammatical analysis. Structure, reading, drills.",
            "id": "AFRICAN 338",
            "parent": "AFRICAN",
            "title": "FOURTH SEMESTER-A LANGUAGE OF SOUTHERN AFRICA"
        }
    },
    {
        "data": {
            "description": "Advanced study of a topic in African linguistics. Content will vary with each offering.",
            "id": "AFRICAN 701",
            "parent": "AFRICAN",
            "title": "ADVANCED TOPICS IN AFRICAN LINGUISTICS"
        }
    },
    {
        "data": {
            "description": "African society and culture, polity and economy in multidisciplinary perspectives from prehistory and ancient kingdoms through the colonial period to contemporary developments, including modern nationalism, economic development and changing social structure.",
            "id": "AFRICAN/AFROAMER/ANTHRO/GEOG/HISTORY/POLISCI/SOC 277",
            "title": "AFRICA: AN INTRODUCTORY SURVEY"
        }
    },
    {
        "data": {
            "description": "An introduction to current research in African cultural studies, ranging from various literary genres and uses of discourse; to diverse media including screen media, music, cartoons, and journalism; and to other forms of popular expression like soccer and drama. Through an introduction to these forms, study the diverse methods used by scholars in this field, such as textual analysis, film criticism, ethnomusicology, discourse analysis, and ethnography; and to the cultural diversity of Africa and its diasporic cultures.",
            "id": "AFRICAN 100",
            "parent": "AFRICAN",
            "title": "INTRODUCTION TO AFRICAN CULTURAL EXPRESSION"
        }
    },
    {
        "data": {
            "description": "An introduction to literature and visual culture of Africa in various periods and places; specific topics will vary.",
            "id": "AFRICAN 303",
            "parent": "AFRICAN",
            "title": "AFRICAN LITERATURE AND VISUAL CULTURE"
        }
    },
    {
        "data": {
            "description": "An introduction to the most significant topics of contemporary Arabic literature and cinema. Discuss the legacy of colonialism, repressive nature of post-independence regimes, discourses on nationalism, religion vs. secularization, gender relations, representation of cultural otherness, and the Arab Springs. Materials will be drawn from a variety of cultural forms including literature, film, music, and performance; and scholarship, exploring the social, cultural, political, and economic contexts in which texts and films are written and exhibited.",
            "id": "AFRICAN/INTLST 302",
            "title": "ARABIC LITERATURE AND CINEMA"
        }
    },
    {
        "data": {
            "description": "An introduction to various approaches to studying African languages in societal context from the perspective of experts in sociolinguistics, linguistic ethnography, and language pedagogy. Topics covered will include multilingualism, codeswitching, codemixing, translanguaging, language invention/disinvention, interactional practices, discourse analysis, language and politics, language and identity, language in education, language, gender, and sexuality, language and the media, language choice in literature and film, language and popular culture, translation, and language learning.",
            "id": "AFRICAN 206",
            "parent": "AFRICAN",
            "title": "INTRODUCTION TO AFRICAN LINGUISTIC PRACTICES"
        }
    },
    {
        "data": {
            "description": "Analysis of retention of African elements in African-American oral, written, and material culture. Social, cultural, and political issues regarding race, self-definition, and self-determination in both Africa and North America will be examined.",
            "id": "AFRICAN/AFROAMER/HISTORY/POLISCI 297",
            "title": "AFRICAN AND AFRICAN-AMERICAN LINKAGES: AN INTRODUCTION"
        }
    },
    {
        "data": {
            "description": "Approaches to the analysis of African oral narrative performances, heroic poetry, epic, and the genres of written literature: Aesthetic, symbolic, and structural analysis and their interrelationships.",
            "id": "AFRICAN 402",
            "parent": "AFRICAN",
            "title": "THEORY OF AFRICAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Chronological and thematic survey of major trends, authors, and works of Lusophone Africa since 1936.",
            "id": "AFRICAN/PORTUG 451",
            "title": "LUSOPHONE AFRICAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Collaborative exploration and discussion of current research and literature on critical approaches to applied linguistics (CALx), including critical discourse analysis (CDA), mostly in African contexts. Develop a large-scale research project (QP or doctoral dissertation), conduct a review of current research, and present work in progress to receive critical feedback.",
            "id": "AFRICAN 804",
            "parent": "AFRICAN",
            "title": "CRITICAL APPLIED LINGUISTICS WORKING GROUP"
        }
    },
    {
        "data": {
            "description": "Continue to develop and refine competence and performance in linguistic skills.",
            "id": "AFRICAN 374",
            "parent": "AFRICAN",
            "title": "FOURTH SEMESTER YORUBA"
        }
    },
    {
        "data": {
            "description": "Covers the norms and expectations that inhere in academic writing as well as the mechanics of producing original scholarship. Designed to develop a full understanding of the craft of marshaling evidence to support an argument in the humanities, particularly African cultural studies.",
            "id": "AFRICAN 700",
            "parent": "AFRICAN",
            "title": "READING AND WRITING AFRICAN CULTURAL STUDIES"
        }
    },
    {
        "data": {
            "description": "Critical interrogation of the relationship between HipHop and social justice. What is \"HipHop,\" what is \"social justice,\" what is their relationship, how can HipHop can be an effective force for social justice, and what obstacles mitigate against this potential? Discussions will develop familiarity with important concepts in Black studies and social theory such as race and colonialism, imperialism and hegemony, structure and agency, identity and strategic essentialism. Consider the race/class/gender dimensions of weekly topics, acquire a broader familiarity with HipHop activism, and develop new conceptual tools and critical thinking skills.",
            "id": "AFRICAN/AFROAMER 233",
            "title": "GLOBAL HIPHOP AND SOCIAL JUSTICE"
        }
    },
    {
        "data": {
            "description": "Develops metacognitive skills and critical thinking about teaching as a scholarly activity, through the creation of a teaching portfolio that documents the ideas and objectives that have informed their teaching to date and potential future teaching.",
            "id": "AFRICAN 705",
            "parent": "AFRICAN",
            "title": "TEACHING PORTFOLIO"
        }
    },
    {
        "data": {
            "description": "Directed language study for students experienced in language self instruction. The instructor will continue to consult with the student and monitor progress.",
            "id": "AFRICAN 399",
            "parent": "AFRICAN",
            "title": "DIRECTED STUDY OF AN AFRICAN LANGUAGE"
        }
    },
    {
        "data": {
            "description": "Discusses use of self-instructional methods to learn a less commonly taught language (LCTL), gets feedback on individualized syllabi and assessment plans, and presents progress reports orally and in writing. Homework includes continuous self-instruction in the chosen LCTL including reading, writing, oral, and listening skills; work with a conversation partner; and cultural knowledge.",
            "id": "AFRICAN 671",
            "parent": "AFRICAN",
            "title": "MULTILANGUAGE SEMINAR"
        }
    },
    {
        "data": {
            "description": "Emphasis on proficiency through speaking, listening, reading and writing, and on communication in cultural context.",
            "id": "AFRICAN 339",
            "parent": "AFRICAN",
            "title": "FIRST SEMESTER SUMMER ARABIC"
        }
    },
    {
        "data": {
            "description": "Emphasis on proficiency through speaking, listening, reading, and writing, and on communication in cultural context.",
            "id": "AFRICAN 341",
            "parent": "AFRICAN",
            "title": "THIRD SEMESTER SUMMER ARABIC"
        }
    },
    {
        "data": {
            "description": "Emphasis on proficiency through speaking, listening, reading, and writing, and on communication in cultural context.",
            "id": "AFRICAN 342",
            "parent": "AFRICAN",
            "title": "FOURTH SEMESTER SUMMER ARABIC"
        }
    },
    {
        "data": {
            "description": "Emphasis on proficiency through speaking, listening, reading, and writing, and on communication in cultural context.",
            "id": "AFRICAN 343",
            "parent": "AFRICAN",
            "title": "FIFTH SEMESTER SUMMER ARABIC"
        }
    },
    {
        "data": {
            "description": "Emphasis on proficiency through speaking, listening, reading, and writing, and on communication in cultural context.",
            "id": "AFRICAN 344",
            "parent": "AFRICAN",
            "title": "SIXTH SEMESTER SUMMER ARABIC"
        }
    },
    {
        "data": {
            "description": "Emphasis on proficiency through speaking, listening, ready and writing, and on communication in cultural context.",
            "id": "AFRICAN 340",
            "parent": "AFRICAN",
            "title": "SECOND SEMESTER SUMMER ARABIC"
        }
    },
    {
        "data": {
            "description": "Examines critical concepts in the cultural study of racially specified \"black music\" as it has developed into a global phenomenon. Pairs major theories in black cultural analysis (postcolonial criticism, diaspora theory, global capitalism, etc.) with a body of literature pertaining to a particular musical topic, geographic area, or tradition. Develops critical skills for undertaking cultural music analysis. Considers the long histories and theories of cultural production and practices in global Africa, the local/global provenance of forms and styles, and the contexts of their local, national, and global circulation and consumption.",
            "id": "AFRICAN 609",
            "parent": "AFRICAN",
            "title": "ADVANCED TOPICS IN GLOBAL BLACK MUSIC STUDIES"
        }
    },
    {
        "data": {
            "description": "Examines representations of soccer in sub-Saharan Africa. It is meant to make us think about African soccer as a cultural and political practice, while keeping in mind that this is a sport or a game. What does this sport, \"the beautiful game\" as it is called, the most widely followed and adored game, mean to Africans? What is the role of fans and spectators, alongside readers of literature and viewers of film? How does soccer link Africa to the rest of the world? Briefly cover the history of the game, in the world and in Africa, and its social impact; learn about both magic and racism in African soccer; read novels, discuss paintings, and watch films that represent soccer in meaningful ways and connect it to important issues of the neocolonial world.",
            "id": "AFRICAN 304",
            "parent": "AFRICAN",
            "title": "SOCCER IN AFRICA"
        }
    },
    {
        "data": {
            "description": "Examines various mediated cultural forms such as broadcasting, news, performance, music, film, or social media created and used across regions and countries in Africa, addressing issues such as cultural identity, nation building, constraints on expression, access, and reception, and the interaction of global and African cultural forms.",
            "id": "AFRICAN 405",
            "parent": "AFRICAN",
            "title": "TOPICS IN AFRICAN CULTURAL STUDIES"
        }
    },
    {
        "data": {
            "description": "Examines various mediated cultural forms such as broadcasting, news, performance, music, film, or social media created and used and across regions and countries in Africa, addressing issues such as cultural identity, nation building, constraints on expression, access, and reception, and the interaction of global and African cultural forms.",
            "id": "AFRICAN 905",
            "parent": "AFRICAN",
            "title": "SEMINAR IN AFRICAN CULTURAL STUDIES: TOPICS"
        }
    },
    {
        "data": {
            "description": "Explore African Muslim communities and Black Muslim communities in the US as an under-examined archive of Islamic authenticity and authority. Involves close readings of ethnographies, fiction, films, and other forms of cultural expression and examination of the practice of Islam and representation of Muslims in Africa and Muslims of African ancestry in the US. Through both primary and secondary sources, explore themes of not just authenticity and authority but also related issues of representation, positionality, difference, otherness, essentialism, and normativity. Ultimately, form a deeper understanding of the diversity and complexity of Islam and Muslims of African ancestry.",
            "id": "AFRICAN/RELIGST 414",
            "title": "ISLAM IN AFRICA AND THE DIASPORA"
        }
    },
    {
        "data": {
            "description": "Explore the diverse lived experiences of religion in Africa, examine the role of religion in shaping individual and communal identities, and understand the complex ways in which religion is practiced, experienced, and expressed in various African contexts.",
            "id": "AFRICAN/RELIGST 408",
            "title": "EVERYDAY RELIGION IN AFRICA"
        }
    },
    {
        "data": {
            "description": "Explores how HipHop, a quintessential manifestation of African American culture, is adopted and adapted by African youth to fight for social justice and democracy in their local contexts, while at the same time constructing a diasporic African sensibility and \"cultural citizenship\" that transcends boarders and oceans. Beginning with the history, culture, and politics of HipHop in the U.S., we compare and contrast HipHop's development in Africa with specific attention to Senegal. Explores the the youth culture and politics in Senegal and the ongoing process of cross-cultural flows and hybridity.",
            "id": "AFRICAN/AFROAMER 220",
            "title": "HIPHOP, YOUTH CULTURE, AND POLITICS IN SENEGAL"
        }
    },
    {
        "data": {
            "description": "Explores key thematics in the teaching and understanding of African cultural studies. Organized around methodology and pedagogy: what is, how we know, name, and categorize; and how we teach, analyze, and communicate.",
            "id": "AFRICAN 704",
            "parent": "AFRICAN",
            "title": "TOPICS IN AFRICAN CULTURAL STUDIES PEDAGOGY"
        }
    },
    {
        "data": {
            "description": "Explores the historical relationship between Muslims and Jews in a variety of contexts from the seventh century to the present. Surveys literary and cultural exchanges against the background of shifting political and social conditions across the Middle East, Europe, and the United States. Considers also the parallel legacies of anti-Semitism, Orientalism, and Islamophobia. Major themes include comparative religion, secularization, migration, and colonialism, as well as the politics of history and cultural memory. Introduces readings in English translation of medieval and modern texts originally written across languages, and especially in Hebrew and Arabic.",
            "id": "AFRICAN/JEWISH/MEDIEVAL/RELIGST 462",
            "title": "MUSLIMS AND JEWS"
        }
    },
    {
        "data": {
            "description": "Explores the interplay between Africa and the World from the 19th century to the present, covering subjects such as the slave- trade, repatriation, Africanizing of culture in the Americas and Europe, the spread and revival of world religions, colonialism, global capitalism, the rise of global popular culture such as pop music and video films, environmental concerns and global epidemics.",
            "id": "AFRICAN/HISTORY 129",
            "title": "AFRICA ON THE GLOBAL STAGE"
        }
    },
    {
        "data": {
            "description": "Field methods, techniques, and analytical approaches. Topics vary but may include ethnography, narrative analysis, critical discourse analysis, and other research methods.",
            "id": "AFRICAN 926",
            "parent": "AFRICAN",
            "title": "SEMINAR IN RESEARCH METHODS IN AFRICAN CULTURAL STUDIES"
        }
    },
    {
        "data": {
            "description": "First-semester Intermediate High intensive practice in reading, writing, and grammar.",
            "id": "PORTUG 225",
            "parent": "PORTUG",
            "title": "THIRD YEAR CONVERSATION AND COMPOSITION"
        }
    },
    {
        "data": {
            "description": "First-semester elementary-level Portuguese language practice: grammar, conversation, and reading. Requires no previous knowledge of Portuguese.",
            "id": "PORTUG 101",
            "parent": "PORTUG",
            "title": "FIRST SEMESTER PORTUGUESE"
        }
    },
    {
        "data": {
            "description": "First-semester intermediate-level Portuguese language review: readings, culture, and patterns of conversation.",
            "id": "PORTUG 201",
            "parent": "PORTUG",
            "title": "THIRD SEMESTER PORTUGUESE"
        }
    },
    {
        "data": {
            "description": "For advanced learners of Modern Standard Arabic; emphasis on proficiency through speaking, listening, reading, and writing, and on communication in cultural context.",
            "id": "AFRICAN 329",
            "parent": "AFRICAN",
            "title": "FIFTH SEMESTER ARABIC"
        }
    },
    {
        "data": {
            "description": "For advanced learners of Modern Standard Arabic; emphasis on proficiency through speaking, listening, reading, and writing, and on communication in cultural context.",
            "id": "AFRICAN 330",
            "parent": "AFRICAN",
            "title": "SIXTH SEMESTER ARABIC"
        }
    },
    {
        "data": {
            "description": "For advanced learners of Standard Swahili; emphasis on proficiency through speaking, listening, reading, and writing, and on communication in cultural context.",
            "id": "AFRICAN 435",
            "parent": "AFRICAN",
            "title": "FIFTH SEMESTER SWAHILI"
        }
    },
    {
        "data": {
            "description": "For advanced learners of Standard Swahili; emphasis on proficiency through speaking, listening, reading, and writing, and on communication in cultural context.",
            "id": "AFRICAN 436",
            "parent": "AFRICAN",
            "title": "SIXTH SEMESTER SWAHILI"
        }
    },
    {
        "data": {
            "description": "For advanced learners of colloquial Arabic from specific region of Arab nations; emphasis on proficiency through speaking, listening, reading, writing and on communication in cultural context.",
            "id": "AFRICAN 326",
            "parent": "AFRICAN",
            "title": "COLLOQUIAL ARABIC"
        }
    },
    {
        "data": {
            "description": "For beginning learners of Hausa; emphasis on proficiency through speaking, listening, reading, and writing, and on communication in cultural context.",
            "id": "AFRICAN 361",
            "parent": "AFRICAN",
            "title": "FIRST SEMESTER HAUSA"
        }
    },
    {
        "data": {
            "description": "For beginning learners of Hausa; emphasis on proficiency through speaking, listening, reading, and writing, and on communication in cultural context.",
            "id": "AFRICAN 362",
            "parent": "AFRICAN",
            "title": "SECOND SEMESTER HAUSA"
        }
    },
    {
        "data": {
            "description": "For beginning learners of Modern Standard Arabic; emphasis on proficiency through speaking, listening, reading, and writing, and on communication in cultural context.",
            "id": "AFRICAN 321",
            "parent": "AFRICAN",
            "title": "FIRST SEMESTER ARABIC"
        }
    },
    {
        "data": {
            "description": "For beginning learners of Modern Standard Arabic; emphasis on proficiency through speaking, listening, reading, and writing, and on communication in cultural context.",
            "id": "AFRICAN 322",
            "parent": "AFRICAN",
            "title": "SECOND SEMESTER ARABIC"
        }
    },
    {
        "data": {
            "description": "For beginning learners of Standard Swahili; emphasis on proficiency through speaking, listening, reading, and writing, and on communication in cultural context.",
            "id": "AFRICAN 331",
            "parent": "AFRICAN",
            "title": "FIRST SEMESTER SWAHILI"
        }
    },
    {
        "data": {
            "description": "For beginning learners of Standard Yoruba; emphasis on proficiency through speaking, listening, reading, and writing, and on communication in cultural context.",
            "id": "AFRICAN 371",
            "parent": "AFRICAN",
            "title": "FIRST SEMESTER YORUBA"
        }
    },
    {
        "data": {
            "description": "For beginning learners of Swahili; emphasis on proficiency through speaking, listening, reading, and writing, and on communication in cultural context.",
            "id": "AFRICAN 332",
            "parent": "AFRICAN",
            "title": "SECOND SEMESTER SWAHILI"
        }
    },
    {
        "data": {
            "description": "For beginning learners of a Southern African language; emphasis on proficiency through speaking, listening, reading, and writing, and on communication in cultural context.",
            "id": "AFRICAN 335",
            "parent": "AFRICAN",
            "title": "FIRST SEMESTER-A LANGUAGE OF SOUTHERN AFRICA"
        }
    },
    {
        "data": {
            "description": "For beginning learners of a Southern African language; emphasis on proficiency through speaking, listening, reading, and writing, and on communication in cultural context.",
            "id": "AFRICAN 336",
            "parent": "AFRICAN",
            "title": "SECOND SEMESTER-A LANGUAGE OF SOUTHERN AFRICA"
        }
    },
    {
        "data": {
            "description": "For beginning learners of a West African language; emphasis on proficiency through speaking, listening, reading, and writing, and on communication in cultural context.",
            "id": "AFRICAN 391",
            "parent": "AFRICAN",
            "title": "FIRST SEMESTER-A LANGUAGE OF WEST AFRICA"
        }
    },
    {
        "data": {
            "description": "For beginning learners of a West African language; emphasis on proficiency through speaking, listening, reading, and writing, and on communication in cultural context.",
            "id": "AFRICAN 392",
            "parent": "AFRICAN",
            "title": "SECOND SEMESTER-A LANGUAGE OF WEST AFRICA"
        }
    },
    {
        "data": {
            "description": "For beginning learners of standard Yoruba; emphasis on proficiency through speaking, listening, reading, and writing, and on communication in cultural context.",
            "id": "AFRICAN 372",
            "parent": "AFRICAN",
            "title": "SECOND SEMESTER YORUBA"
        }
    },
    {
        "data": {
            "description": "For intermediate learners of Modern Standard Arabic. Emphasis on proficiency through speaking, listening, reading, and writing, and on communication in cultural context.",
            "id": "AFRICAN 324",
            "parent": "AFRICAN",
            "title": "FOURTH SEMESTER ARABIC"
        }
    },
    {
        "data": {
            "description": "For intermediate learners of Modern Standard Arabic; emphasis on proficiency through speaking, listening, reading, and writing, and on communication in cultural context.",
            "id": "AFRICAN 323",
            "parent": "AFRICAN",
            "title": "THIRD SEMESTER ARABIC"
        }
    },
    {
        "data": {
            "description": "For intermediate learners of a West African language. Four-skills approach (speaking, listening, writing, reading) centered around authentic texts, recordings, and images. Grammar review, concerted vocabulary expansion, and intensive practice.",
            "id": "AFRICAN 393",
            "parent": "AFRICAN",
            "title": "THIRD SEMESTER-A LANGUAGE OF WEST AFRICA"
        }
    },
    {
        "data": {
            "description": "For intermediate learners of a West African language. Four-skills approach (speaking, listening, writing, reading) centered around authentic texts, recordings, and images. Grammar review, concerted vocabulary expansion, and intensive practice.",
            "id": "AFRICAN 394",
            "parent": "AFRICAN",
            "title": "FOURTH SEMESTER-A LANGUAGE OF WEST AFRICA"
        }
    },
    {
        "data": {
            "description": "For intermediate learners of colloquial Arabic from specific region of Arab nations; emphasis on proficiency through speaking, listening, writing and on communication in cultural context.",
            "id": "AFRICAN 325",
            "parent": "AFRICAN",
            "title": "COLLOQUIAL ARABIC"
        }
    },
    {
        "data": {
            "description": "Four-skills approach (speaking, listening, writing, reading) centered around authentic texts, recordings, and images. Grammar review, concerted vocabulary expansion, and intensive practice.",
            "id": "AFRICAN 333",
            "parent": "AFRICAN",
            "title": "THIRD SEMESTER SWAHILI"
        }
    },
    {
        "data": {
            "description": "Four-skills approach (speaking, listening, writing, reading) centered around authentic texts, recordings, and images. Grammar review, concerted vocabulary expansion, and intensive practice.",
            "id": "AFRICAN 334",
            "parent": "AFRICAN",
            "title": "FOURTH SEMESTER SWAHILI"
        }
    },
    {
        "data": {
            "description": "Fourth-year second-semester advanced oral practice and writing.",
            "id": "PORTUG 312",
            "parent": "PORTUG",
            "title": "FOURTH YEAR COMPOSITION AND CONVERSATION"
        }
    },
    {
        "data": {
            "description": "Historical and critical study of the classics of contemporary African and Caribbean literary drama written in English. Thematic issues include the African encounter with Europe, postcolonial disillusionment and the betrayal of ideals, and also stylistic matters as the relationship(s) between traditional drama and other performance forms, and modern drama written in European languages. Considers theories and critical approaches to understanding the cross-continental drama traditions and their contexts. Examines the long histories of cultural, performance, and theatrical relationships between Africa and the Caribbean and how the relationships have been shaped by race and economics, past and present. Considers and questions conventional claims made by others and your own assumptions; stimulates analytical thinking about identity.",
            "id": "AFRICAN/AFROAMER 813",
            "title": "CONTEMPORARY AFRICAN AND CARIBBEAN DRAMA"
        }
    },
    {
        "data": {
            "description": "Interdisciplinary inquiry in African societies and cultures.",
            "id": "AFRICAN/ANTHRO/ECON/GEOG/HISTORY/POLISCI 983",
            "title": "INTERDEPARTMENTAL SEMINAR IN AFRICAN STUDIES TOPICS"
        }
    },
    {
        "data": {
            "description": "Introduces the phenomenon of \"musical blackness\" as a US-based, transnational cultural form and practice. Explores (topics will vary) how US-based, racially specified black musical forms, together with global forms also identified as \"black,\" were constituted as part of the legacies of European colonial encounter and US imperial expansion; the categories of \"traditional\" music and popular style took shape and have been experienced as something part and parcel of this historical process. Gives close consideration to genre, style, and performance practice, in order to understand the many ways in which musical sound and social/political ideas are inextricably linked.",
            "id": "AFRICAN 409",
            "parent": "AFRICAN",
            "title": "TOPICS IN US AND GLOBAL BLACK MUSIC STUDIES"
        }
    },
    {
        "data": {
            "description": "Introduction to a special topic in African literature, focused on a specific region or genre.",
            "id": "AFRICAN 203",
            "parent": "AFRICAN",
            "title": "INTRODUCTORY TOPICS IN AFRICAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Introduction to some aspects of the life and culture of Yoruba-speaking people of West Africa, Cuba, Brazil, and Haiti, including the importance of Yoruba culture in the Americas.",
            "id": "AFRICAN 230",
            "parent": "AFRICAN",
            "title": "INTRODUCTION TO YORUBA LIFE AND CULTURE"
        }
    },
    {
        "data": {
            "description": "Introduction to the literature, oral or written, of a coherent cultural area of Africa, for those for whom texts in the original language are not accessible.",
            "id": "AFRICAN 300",
            "parent": "AFRICAN",
            "title": "AFRICAN LITERATURE IN TRANSLATION"
        }
    },
    {
        "data": {
            "description": "Introductory exploration of a thematic or chronological area of African history. Topics vary by instructor.",
            "id": "AFRICAN/HISTORY 106",
            "title": "INTRODUCTION TO AFRICAN HISTORY"
        }
    },
    {
        "data": {
            "description": "Language use in African societies; multilingualism; language in politics, religion, socialization.",
            "id": "AFRICAN 500",
            "parent": "AFRICAN",
            "title": "LANGUAGE AND SOCIETY IN AFRICA"
        }
    },
    {
        "data": {
            "description": "Mentored individual research and study for students completing African Cultural Studies Honors in the Major.",
            "id": "AFRICAN 681",
            "parent": "AFRICAN",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Mentored individual research and study for students completing African Cultural Studies Honors in the Major.",
            "id": "AFRICAN 682",
            "parent": "AFRICAN",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Modern and contemporary topics in the African francophone world, which includes both the African continent and the African diaspora. Taught in English.",
            "id": "AFRICAN/FRENCH 216",
            "title": "MODERN AND CONTEMPORARY FRANCOPHONE TOPICS"
        }
    },
    {
        "data": {
            "description": "Monitored self-instruction of a less commonly taught language, meeting individually with the instructor. Requires development of an individualized study plan, bibliographic and online research, work with conversation partners online or in the community, and regular self-assessments.",
            "id": "AFRICAN 697",
            "parent": "AFRICAN",
            "title": "DIRECTED STUDY OF A LESS COMMONLY TAUGHT LANGUAGE"
        }
    },
    {
        "data": {
            "description": "More complex linguistic structure. Proverbs. Yoruba cultural background in the works of Wole Soyinka.",
            "id": "AFRICAN 476",
            "parent": "AFRICAN",
            "title": "SIXTH SEMESTER YORUBA"
        }
    },
    {
        "data": {
            "description": "Observation and discussion of undergraduate culture course. Consideration of pedagogical issues and limited opportunity for practice teaching.",
            "id": "AFRICAN 796",
            "parent": "AFRICAN",
            "title": "TEACHING APPRENTICESHIP"
        }
    },
    {
        "data": {
            "description": "Overview of cinematic works from francophone Africa and/or other areas of Africa. Teaches analysis and writing about cinema. Explores links between cinema and national or regional politics and ideology. Examines spectatorship in relation to questions of identity formation.",
            "id": "AFRICAN/FRENCH 440",
            "title": "AFRICAN/FRANCOPHONE FILM"
        }
    },
    {
        "data": {
            "description": "Overview on Arabic cultural production. Develops a historic and critical understanding of Arabic literary traditions, as well as related musical and visual arts, up to the twenty-first century.",
            "id": "AFRICAN 231",
            "parent": "AFRICAN",
            "title": "INTRODUCTION TO ARABIC LITERARY CULTURE"
        }
    },
    {
        "data": {
            "description": "Popular culture (such as popular literature, music, television, news media, movies, etc.) will be used to introduce the African continent and its cultures, people, and languages. Explore text from a different regions on the continent, with a focus on differences and similarities across the continent at the level of aesthetics and context.",
            "id": "AFRICAN 212",
            "parent": "AFRICAN",
            "title": "INTRODUCTION TO AFRICAN POPULAR CULTURE"
        }
    },
    {
        "data": {
            "description": "Provides a conceptual focus for the study of various forms of literature from around the African world. Literary forms studied may include novels, drama, poetry, short stories, cinema, and more. Depending on the conceptual focus, texts from a particular region, period, or language may be stressed, or they will coalesce around certain themes, such as modernity, cultural identity, nation building, ideology, globalization, and more.",
            "id": "AFRICAN 406",
            "parent": "AFRICAN",
            "title": "TOPICS IN AFRICAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Reading, discussion, and literary history of the sixteenth, nineteenth, and twentieth centuries.",
            "id": "PORTUG 221",
            "parent": "PORTUG",
            "title": "INTRODUCTION TO LUSO-BRAZILIAN LITERATURES"
        }
    },
    {
        "data": {
            "description": "Second-semester Intermediate High intensive practice in reading, writing, and grammar.",
            "id": "PORTUG 226",
            "parent": "PORTUG",
            "title": "THIRD YEAR CONVERSATION AND COMPOSITION"
        }
    },
    {
        "data": {
            "description": "Second-semester elementary-level Portuguese language practice: grammar, conversation, and reading.",
            "id": "PORTUG 102",
            "parent": "PORTUG",
            "title": "SECOND SEMESTER PORTUGUESE"
        }
    },
    {
        "data": {
            "description": "Second-semester intermediate-level Portuguese language review: readings, culture, and patterns of conversation.",
            "id": "PORTUG 202",
            "parent": "PORTUG",
            "title": "FOURTH SEMESTER PORTUGUESE"
        }
    },
    {
        "data": {
            "description": "Special topics across various genres of African Cultural Studies covering cultural production, circulation, consumption, and meaning making in Africa.",
            "id": "AFRICAN 669",
            "parent": "AFRICAN",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "Special topics in modern African literature, covering various genres (prose, poetry, drama).",
            "id": "AFRICAN 901",
            "parent": "AFRICAN",
            "title": "SEMINAR IN MODERN AFRICAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Special topics related to African languages and/or linguistics at the introductory level. Introduction to the diversity of African languages, superdiverse multilingual African societies, and the relationships between language and other societal issues.",
            "id": "AFRICAN 204",
            "parent": "AFRICAN",
            "title": "INTRODUCTORY TOPICS IN AFRICAN LANGUAGES"
        }
    },
    {
        "data": {
            "description": "Studies modern African literature, written in English, and covering various genres such as poetry, the novel, drama, and/or the short story.",
            "id": "AFRICAN 453",
            "parent": "AFRICAN",
            "title": "MODERN AFRICAN LITERATURE IN ENGLISH"
        }
    },
    {
        "data": {
            "description": "Survey of African literary traditions and introduction to literary analysis.",
            "id": "AFRICAN 201",
            "parent": "AFRICAN",
            "title": "INTRODUCTION TO AFRICAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Surveys the past 20 years of digital technology and communications culture on the African continent, cross-referenced with discourse on technology experiences in other parts of the developing world, through the framework of development studies. Readings include case studies of micro-tech practices as well as political and social use of new media, and government and NGO-led tech interventions. Information Communication Technology for Development (ICT4D) is a key area of focus. Cross-discipline areas include communications and media studies, African, Latin American and International area studies, as well as the social anthropology of technology and science, and design. Think critically about technology use in the context of different tech cultures from around the world. Apply this perspective towards new media solutions to social problems.",
            "id": "AFRICAN/COMARTS/LIS 444",
            "title": "TECHNOLOGY AND DEVELOPMENT IN AFRICA AND BEYOND"
        }
    },
    {
        "data": {
            "description": "The emergence and development of Islam; schism; theology; asceticism; speculative and popular mysticism; literatures in diverse Islamic languages. Not open to students with credit for LCA 370 prior to Fall 2019.",
            "id": "AFRICAN/ASIAN/RELIGST 370",
            "title": "ISLAM: RELIGION AND CULTURE"
        }
    },
    {
        "data": {
            "description": "The oral tradition and the written word; the composition of stories, relationship between performer and audience, and transmission of tradition in various African societies.",
            "id": "AFRICAN/FOLKLORE 210",
            "title": "THE AFRICAN STORYTELLER"
        }
    },
    {
        "data": {
            "description": "Theories and teaching methodologies for second language acquisition plus practical classroom techniques for teaching and directing programs in African languages.",
            "id": "AFRICAN 703",
            "parent": "AFRICAN",
            "title": "TOPICS IN TEACHING AFRICAN LANGUAGES"
        }
    },
    {
        "data": {
            "description": "Through a wide range of theoretical texts and critical reflection, explores the ongoing conversation about cultural production and literary criticism in the context of African cultural studies.",
            "id": "AFRICAN 802",
            "parent": "AFRICAN",
            "title": "THEORY AND CRITICISM OF AFRICAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Topics in African languages, especially sociocultural linguistics and critical applied linguistics in Africa.",
            "id": "AFRICAN 407",
            "parent": "AFRICAN",
            "title": "TOPICS IN AFRICAN LANGUAGES"
        }
    },
    {
        "data": {
            "description": "Various topics in African cultural studies and African expressive cultures. Topics will include cultural and/or political themes that cut across multiple media and genres, including two or more of the following: literature, film, media, music, performance, language use, etc.",
            "id": "AFRICAN 202",
            "parent": "AFRICAN",
            "title": "INTRODUCTORY TOPICS IN AFRICAN CULTURAL STUDIES"
        }
    },
    {
        "data": {
            "id": "AFRICAN",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "PORTUG",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "AFRICAN 201",
            "target": "AFRICAN 402"
        }
    },
    {
        "data": {
            "source": "AFRICAN 201",
            "target": "AFRICAN 412"
        }
    },
    {
        "data": {
            "source": "AFRICAN 201",
            "target": "AFRICAN/AFROAMER 413"
        }
    },
    {
        "data": {
            "source": "AFRICAN 203",
            "target": "AFRICAN 406"
        }
    },
    {
        "data": {
            "source": "AFRICAN 203",
            "target": "AFRICAN 453"
        }
    },
    {
        "data": {
            "source": "AFRICAN 204",
            "target": "AFRICAN 407"
        }
    },
    {
        "data": {
            "source": "AFRICAN 204",
            "target": "AFRICAN 500"
        }
    },
    {
        "data": {
            "source": "AFRICAN 321",
            "target": "AFRICAN 322"
        }
    },
    {
        "data": {
            "source": "AFRICAN 322",
            "target": "AFRICAN 323"
        }
    },
    {
        "data": {
            "source": "AFRICAN 322",
            "target": "AFRICAN 325"
        }
    },
    {
        "data": {
            "source": "AFRICAN 323",
            "target": "AFRICAN 324"
        }
    },
    {
        "data": {
            "source": "AFRICAN 324",
            "target": "AFRICAN 329"
        }
    },
    {
        "data": {
            "source": "AFRICAN 325",
            "target": "AFRICAN 326"
        }
    },
    {
        "data": {
            "source": "AFRICAN 329",
            "target": "AFRICAN 330"
        }
    },
    {
        "data": {
            "source": "AFRICAN 330",
            "target": "AFRICAN 445"
        }
    },
    {
        "data": {
            "source": "AFRICAN 331",
            "target": "AFRICAN 332"
        }
    },
    {
        "data": {
            "source": "AFRICAN 332",
            "target": "AFRICAN 333"
        }
    },
    {
        "data": {
            "source": "AFRICAN 333",
            "target": "AFRICAN 334"
        }
    },
    {
        "data": {
            "source": "AFRICAN 334",
            "target": "AFRICAN 435"
        }
    },
    {
        "data": {
            "source": "AFRICAN 335",
            "target": "AFRICAN 336"
        }
    },
    {
        "data": {
            "source": "AFRICAN 339",
            "target": "AFRICAN 340"
        }
    },
    {
        "data": {
            "source": "AFRICAN 340",
            "target": "AFRICAN 341"
        }
    },
    {
        "data": {
            "source": "AFRICAN 341",
            "target": "AFRICAN 342"
        }
    },
    {
        "data": {
            "source": "AFRICAN 342",
            "target": "AFRICAN 343"
        }
    },
    {
        "data": {
            "source": "AFRICAN 343",
            "target": "AFRICAN 344"
        }
    },
    {
        "data": {
            "source": "AFRICAN 361",
            "target": "AFRICAN 362"
        }
    },
    {
        "data": {
            "source": "AFRICAN 371",
            "target": "AFRICAN 372"
        }
    },
    {
        "data": {
            "source": "AFRICAN 372",
            "target": "AFRICAN 373"
        }
    },
    {
        "data": {
            "source": "AFRICAN 373",
            "target": "AFRICAN 374"
        }
    },
    {
        "data": {
            "source": "AFRICAN 374",
            "target": "AFRICAN 475"
        }
    },
    {
        "data": {
            "source": "AFRICAN 391",
            "target": "AFRICAN 392"
        }
    },
    {
        "data": {
            "source": "AFRICAN 392",
            "target": "AFRICAN 393"
        }
    },
    {
        "data": {
            "source": "AFRICAN 393",
            "target": "AFRICAN 394"
        }
    },
    {
        "data": {
            "source": "AFRICAN 403",
            "target": "AFRICAN 605"
        }
    },
    {
        "data": {
            "source": "AFRICAN 405",
            "target": "AFRICAN 669"
        }
    },
    {
        "data": {
            "source": "AFRICAN 409",
            "target": "AFRICAN 609"
        }
    },
    {
        "data": {
            "source": "AFRICAN 412",
            "target": "AFRICAN 606"
        }
    },
    {
        "data": {
            "source": "AFRICAN 435",
            "target": "AFRICAN 436"
        }
    },
    {
        "data": {
            "source": "AFRICAN 475",
            "target": "AFRICAN 476"
        }
    },
    {
        "data": {
            "source": "AFRICAN 671",
            "target": "AFRICAN 670"
        }
    },
    {
        "data": {
            "source": "PORTUG 101",
            "target": "PORTUG 102"
        }
    },
    {
        "data": {
            "source": "PORTUG 102",
            "target": "PORTUG 201"
        }
    },
    {
        "data": {
            "source": "PORTUG 201",
            "target": "PORTUG 202"
        }
    },
    {
        "data": {
            "source": "PORTUG 202",
            "target": "PORTUG 221"
        }
    },
    {
        "data": {
            "source": "PORTUG 202",
            "target": "PORTUG 225"
        }
    },
    {
        "data": {
            "source": "PORTUG 221",
            "target": "AFRICAN/PORTUG 451"
        }
    },
    {
        "data": {
            "source": "PORTUG 225",
            "target": "PORTUG 226"
        }
    },
    {
        "data": {
            "source": "PORTUG 226",
            "target": "PORTUG 312"
        }
    },
    {
        "data": {
            "source": "PORTUG 312",
            "target": "AFRICAN/PORTUG 451"
        }
    }
]