[
    {
        "data": {
            "description": "Study of the interpretations of the African American past conveyed via theatrical films and television; relationship to other images of blacks found throughout the popular culture; relationship to societal trends.",
            "id": "AFROAMER 303",
            "parent": "AFROAMER",
            "title": "BLACKS, FILM, AND SOCIETY"
        }
    },
    {
        "data": {
            "description": "The aesthetic and political evolution of hip-hop culture and its relationship to contemporary social issues.",
            "id": "AFROAMER 154",
            "parent": "AFROAMER",
            "title": "HIP-HOP AND CONTEMPORARY AMERICAN SOCIETY"
        }
    },
    {
        "data": {
            "description": "The influence of traditional West African dance/music heritage in historical, artistic, social contexts in the development of new hybrid forms of music/dance created by cross-pollination of cultures of Africans, Europeans and indigenous peoples in the New World.",
            "id": "AFROAMER/DANCE/MUSIC 318",
            "title": "CULTURAL CROSS CURRENTS: WEST AFRICAN DANCE/MUSIC IN THE AMERICAS"
        }
    },
    {
        "data": {
            "description": "Mentored individual research and study for students completing a thesis in an Honors program.",
            "id": "AFROAMER 681",
            "parent": "AFROAMER",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Mentored individual research and study for students completing a senior thesis.",
            "id": "AFROAMER 691",
            "parent": "AFROAMER",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Mentored individual research and study for students completing a Master's thesis.",
            "id": "AFROAMER 790",
            "parent": "AFROAMER",
            "title": "RESEARCH AND THESIS"
        }
    },
    {
        "data": {
            "description": "The evolution of stereotypes. The literary manifestations of the assumptions black and white American writers hold toward members of the opposite race.",
            "id": "AFROAMER 155",
            "parent": "AFROAMER",
            "title": "THEY: RACE IN AMERICAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Examines Black women's struggles for racial justices; reconsiders conventional notions of leadership, politics and protest. Topics include abolitionism, anti-lynching campaigns, woman suffrage, labor movement, club movement, cultural expressions, civil rights protest, Black feminism/womanism, poverty and welfare rights, environmental racism, etc.",
            "id": "AFROAMER/GEN&WS 624",
            "title": "AFRICAN AMERICAN WOMEN'S ACTIVISM (19TH & 20TH CENTURIES)"
        }
    },
    {
        "data": {
            "description": "Explores the historical relationship between education and the African American freedom struggle from the early twentieth century to the present. Topics include school segregation, desegregation, and resegregation; high school and college student activism; Black Power; civil rights protest strategies and tactics, and the role of the federal government.",
            "id": "AFROAMER/EDPOL/HISTORY 712",
            "title": "EDUCATION AND THE CIVIL RIGHTS MOVEMENT"
        }
    },
    {
        "data": {
            "description": "An intensive analysis of specific cultural themes in African Americans' experiences.",
            "id": "AFROAMER 675",
            "parent": "AFROAMER",
            "title": "SELECTED TOPICS IN AFRO-AMERICAN CULTURE"
        }
    },
    {
        "data": {
            "description": "Delve into the origins of African American Studies as an academic discipline and explore its early forms. Examine how African Americans have contributed to the understanding of the African American experience, both historically and in the present day. Analyze current struggles of the Black community for freedom, justice, and humanity.",
            "id": "AFROAMER 101",
            "parent": "AFROAMER",
            "title": "INTRODUCTION TO AFRICAN AMERICAN STUDIES"
        }
    },
    {
        "data": {
            "source": "AFRICAN 231",
            "target": "AFRICAN/AFROAMER 413"
        }
    },
    {
        "data": {
            "description": "Analyses and interpretations of literary works by black women writers through historical, philosophical, political, feminist, and other contemporary critical methods.",
            "id": "AFROAMER/GEN&WS 677",
            "title": "CRITICAL AND THEORETICAL PERSPECTIVES IN BLACK WOMEN'S WRITINGS"
        }
    },
    {
        "data": {
            "source": "AFRICAN 203",
            "target": "AFRICAN/AFROAMER 413"
        }
    },
    {
        "data": {
            "description": "Intensive literary criticism of the works of selected authors. Emphasis on fiction, but non-fiction when appropriate. Works of one or two authors.",
            "id": "AFROAMER 525",
            "parent": "AFROAMER",
            "title": "MAJOR AUTHORS"
        }
    },
    {
        "data": {
            "description": "Directed study projects as arranged with a faculty member.",
            "id": "AFROAMER 199",
            "parent": "AFROAMER",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "A critical study of the major works.",
            "id": "AFRICAN/AFROAMER 413",
            "title": "CONTEMPORARY AFRICAN AND CARIBBEAN DRAMA"
        }
    },
    {
        "data": {
            "description": "Autobiographies of major African Americans studied in depth to locate the constants and variables in the Black American experience. Focus on the variety of individual responses to conditions in the United States.",
            "id": "AFROAMER 265",
            "parent": "AFROAMER",
            "title": "AFRICAN-AMERICAN AUTOBIOGRAPHY"
        }
    },
    {
        "data": {
            "description": "An intensive analysis of specific historical themes in African Americans' experiences.",
            "id": "AFROAMER 671",
            "parent": "AFROAMER",
            "title": "SELECTED TOPICS IN AFRO-AMERICAN HISTORY"
        }
    },
    {
        "data": {
            "description": "Cultural images by and about Black women; feminine creativity in the arts within their historical, cultural, social, and political contexts.",
            "id": "AFROAMER/GEN&WS 267",
            "title": "ARTISTIC/CULTURAL IMAGES OF BLACK WOMEN"
        }
    },
    {
        "data": {
            "description": "Latin American culture and society from an interdisciplinary perspective; historical developments from pre-Columbian times to the present; political movements; economic problems; social change; ecology in tropical Latin America; legal systems; literature and the arts; cultural contrasts involving the US and Latin America; land reform; labor movements; capitalism, socialism, imperialism; mass media.",
            "id": "AFROAMER/ANTHRO/C&ESOC/GEOG/HISTORY/LACIS/POLISCI/SOC/SPANISH 260",
            "title": "LATIN AMERICA: AN INTRODUCTION"
        }
    },
    {
        "data": {
            "source": "AFRICAN/FOLKLORE 210",
            "target": "AFRICAN/AFROAMER 413"
        }
    },
    {
        "data": {
            "description": "Exploration of core problems of political life, such as the nature and limits of obligation, the concept of justice and its political implications, and the relationship between equality and liberty, through a selection of ancient and modern sources. Not open to students with credit for POLI SCI 209 prior to fall 2017",
            "id": "POLISCI 160",
            "parent": "POLISCI",
            "title": "INTRODUCTION TO POLITICAL THEORY"
        }
    },
    {
        "data": {
            "description": "Explores how HipHop, a quintessential manifestation of African American culture, is adopted and adapted by African youth to fight for social justice and democracy in their local contexts, while at the same time constructing a diasporic African sensibility and \"cultural citizenship\" that transcends boarders and oceans. Beginning with the history, culture, and politics of HipHop in the U.S., we compare and contrast HipHop's development in Africa with specific attention to Senegal. Explores the the youth culture and politics in Senegal and the ongoing process of cross-cultural flows and hybridity.",
            "id": "AFRICAN/AFROAMER 220",
            "title": "HIPHOP, YOUTH CULTURE, AND POLITICS IN SENEGAL"
        }
    },
    {
        "data": {
            "description": "Critical interrogation of the relationship between HipHop and social justice. What is \"HipHop,\" what is \"social justice,\" what is their relationship, how can HipHop can be an effective force for social justice, and what obstacles mitigate against this potential? Discussions will develop familiarity with important concepts in Black studies and social theory such as race and colonialism, imperialism and hegemony, structure and agency, identity and strategic essentialism. Consider the race/class/gender dimensions of weekly topics, acquire a broader familiarity with HipHop activism, and develop new conceptual tools and critical thinking skills.",
            "id": "AFRICAN/AFROAMER 233",
            "title": "GLOBAL HIPHOP AND SOCIAL JUSTICE"
        }
    },
    {
        "data": {
            "description": "Introduction to comparative ethnic studies, examining race, ethnicity, and indigeneity within the United States. Includes perspectives from African American, American Indian, Asian American, and Chican@ and Latin@ studies.",
            "id": "AFROAMER/AMERIND/ASIANAM/CHICLA/FOLKLORE 102",
            "title": "INTRODUCTION TO COMPARATIVE US ETHNIC AND AMERICAN INDIAN STUDIES"
        }
    },
    {
        "data": {
            "description": "Survey from the African beginnings to the present day. Focus on slave trade and slavery; major black figures of the past; social, economic, and political trends within the black community.",
            "id": "AFROAMER 231",
            "parent": "AFROAMER",
            "title": "INTRODUCTION TO AFRO-AMERICAN HISTORY"
        }
    },
    {
        "data": {
            "description": "Examines the interaction between African American musical culture and its historical context, with an emphasis on the period from 1920 to the present.",
            "id": "AFROAMER 156",
            "parent": "AFROAMER",
            "title": "BLACK MUSIC AND AMERICAN CULTURAL HISTORY"
        }
    },
    {
        "data": {
            "description": "Survey of the characteristics and problems of African Americans in contemporary society.",
            "id": "AFROAMER 151",
            "parent": "AFROAMER",
            "title": "INTRODUCTION TO CONTEMPORARY AFRO-AMERICAN SOCIETY"
        }
    },
    {
        "data": {
            "description": "This course focuses on the emerging field of gender studies in the scholarship on the post-World War II civil rights movement in the United States.",
            "id": "AFROAMER/GEN&WS 625",
            "title": "GENDER, RACE AND THE CIVIL RIGHTS MOVEMENT"
        }
    },
    {
        "data": {
            "source": "POLISCI 160",
            "target": "AFROAMER/POLISCI 519"
        }
    },
    {
        "data": {
            "description": "Explores a range of theories that African Americans have drawn upon to cope with and ameliorate their political circumstances in the United States within the specific parameters of political theory.",
            "id": "AFROAMER/POLISCI 519",
            "title": "AFRICAN AMERICAN POLITICAL THEORY"
        }
    },
    {
        "data": {
            "description": "Survey of the decisive role played by race in American politics, 1932-present. Focus on origins and accomplishments of \"the Second Reconstruction\"; Black Power and white backlash; contemporary racial politics and issues.",
            "id": "AFROAMER 272",
            "parent": "AFROAMER",
            "title": "RACE AND AMERICAN POLITICS FROM THE NEW DEAL TO THE NEW RIGHT"
        }
    },
    {
        "data": {
            "description": "Art and visual culture by/or pertaining to women throughout the African Diaspora and Africa. Though the focus is on 10th century art by black women, it will go into visual culture (art objects, photographs, images, dress, culturally-coded representation) concerning black women historically.",
            "id": "AFROAMER/GEN&WS 367",
            "title": "ART AND VISUAL CULTURE: WOMEN OF THE AFRICAN DIASPORA AND AFRICA"
        }
    },
    {
        "data": {
            "id": "AFROAMER",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Assesses how race and gender (as well as socio-economic status, age, sexuality, region, etc.) shaped the experiences and options of African Americans, especially women, in U.S. society from WW II to the present.",
            "id": "AFROAMER/GEN&WS 326",
            "title": "RACE AND GENDER IN POST-WORLD WAR II U.S. SOCIETY"
        }
    },
    {
        "data": {
            "description": "Mentored individual research and study for students completing a thesis in an Honors program.",
            "id": "AFROAMER 682",
            "parent": "AFROAMER",
            "title": "SENIOR HONOR THESIS"
        }
    },
    {
        "data": {
            "description": "Examines the rich heritage of African arts and architecture as they shape and have been shaped by the histories and cultural values (social, political, religious, philosophical, and aesthetic) of African peoples, both past and present, on the continent where humanity began. It includes an historical overview of selected artistic traditions from different parts of the continent from 26,000 BCE to the 21st century and thematic/cultural case studies: artists and aesthetics; textiles, decorative, and personal/body arts; architecture; and individual artists.",
            "id": "AFROAMER/ARTHIST 241",
            "title": "INTRODUCTION TO AFRICAN ART AND ARCHITECTURE"
        }
    },
    {
        "data": {
            "source": "AFROAMER 151",
            "target": "AFROAMER/POLISCI 519"
        }
    },
    {
        "data": {
            "description": "Surveys the medical and scientific constructions of categories of race, placing the development of racial theories in a broad social and political context. Pays particular attention to the importance of racial science in slavery and colonialism.",
            "id": "AFROAMER/HISTSCI 275",
            "title": "SCIENCE, MEDICINE, AND RACE: A HISTORY"
        }
    },
    {
        "data": {
            "description": "Uses an interdisciplinary framework to interrogate core assumptions, arguments, and silences in past and present black feminist thought.",
            "id": "AFROAMER/GEN&WS 333",
            "title": "BLACK FEMINISMS"
        }
    },
    {
        "data": {
            "description": "African society and culture, polity and economy in multidisciplinary perspectives from prehistory and ancient kingdoms through the colonial period to contemporary developments, including modern nationalism, economic development and changing social structure.",
            "id": "AFRICAN/AFROAMER/ANTHRO/GEOG/HISTORY/POLISCI/SOC 277",
            "title": "AFRICA: AN INTRODUCTORY SURVEY"
        }
    },
    {
        "data": {
            "description": "African-American slavery and its impact on mid-19th century social, political, and economic life; the causes, course, and consequences of the Civil War; the rise and fall of postwar Reconstruction and non-racial citizenship; the impact of these histories on contemporary American society.",
            "id": "AFROAMER/HISTORY 393",
            "title": "SLAVERY, CIVIL WAR, AND RECONSTRUCTION, 1848-1877"
        }
    },
    {
        "data": {
            "description": "The oral tradition and the written word; the composition of stories, relationship between performer and audience, and transmission of tradition in various African societies.",
            "id": "AFRICAN/FOLKLORE 210",
            "title": "THE AFRICAN STORYTELLER"
        }
    },
    {
        "data": {
            "source": "AFRICAN 201",
            "target": "AFRICAN/AFROAMER 413"
        }
    },
    {
        "data": {
            "description": "Content will vary to facilitate in-depth engagement with a particular topic in Visual Culture. Topics will be pursued with analytic attention to gender, sexuality and race.",
            "id": "AFROAMER/ARTHIST 802",
            "title": "VISUAL CULTURES: TOPICS IN VISUAL CULTURES"
        }
    },
    {
        "data": {
            "description": "Introduction to a special topic in African literature, focused on a specific region or genre.",
            "id": "AFRICAN 203",
            "parent": "AFRICAN",
            "title": "INTRODUCTORY TOPICS IN AFRICAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Focuses on the notion of blackness as it is developed in the poetry and drama of key figures of the 1960s Black Arts Movement. Emphasizes the emergence of a critical discourse specific to a \"new\" black aesthetic.",
            "id": "AFROAMER 338",
            "parent": "AFROAMER",
            "title": "THE BLACK ARTS MOVEMENT"
        }
    },
    {
        "data": {
            "description": "Historical and critical study of the classics of contemporary African and Caribbean literary drama written in English. Thematic issues include the African encounter with Europe, postcolonial disillusionment and the betrayal of ideals, and also stylistic matters as the relationship(s) between traditional drama and other performance forms, and modern drama written in European languages. Considers theories and critical approaches to understanding the cross-continental drama traditions and their contexts. Examines the long histories of cultural, performance, and theatrical relationships between Africa and the Caribbean and how the relationships have been shaped by race and economics, past and present. Considers and questions conventional claims made by others and your own assumptions; stimulates analytical thinking about identity.",
            "id": "AFRICAN/AFROAMER 813",
            "title": "CONTEMPORARY AFRICAN AND CARIBBEAN DRAMA"
        }
    },
    {
        "data": {
            "description": "Survey of African literary traditions and introduction to literary analysis.",
            "id": "AFRICAN 201",
            "parent": "AFRICAN",
            "title": "INTRODUCTION TO AFRICAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Introduction to a historical and/or contemporary topic concerning the African American experience. Explores key factors of African American experiences that impact current society.",
            "id": "AFROAMER 270",
            "parent": "AFROAMER",
            "title": "SELECTED TOPICS IN AFRICAN AMERICAN STUDIES"
        }
    },
    {
        "data": {
            "description": "Focuses on the knowledge, theories, and methods that are fundamental to the transdisciplinary discipline of Visual Cultures. Develops skills in critical reading, research, analysis, writing, and oral presentation.",
            "id": "AFROAMER/ARTHIST 801",
            "title": "HISTORIOGRAPHY, THEORY AND METHODS IN VISUAL CULTURE"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "This course will provide students with an overvview of the field of Black women's studies.",
            "id": "AFROAMER/GEN&WS 221",
            "title": "INTRODUCTION TO BLACK WOMEN'S STUDIES"
        }
    },
    {
        "data": {
            "description": "Introduction to the history of African American theater and major African American playwrights and actors.",
            "id": "AFROAMER 225",
            "parent": "AFROAMER",
            "title": "INTRODUCTION TO AFRICAN AMERICAN DRAMATIC LITERATURE"
        }
    },
    {
        "data": {
            "description": "Advanced directed study projects as arranged with a faculty member.",
            "id": "AFROAMER 699",
            "parent": "AFROAMER",
            "title": "DIRECTED STUDY IN AFRO-AMERICAN STUDIES"
        }
    },
    {
        "data": {
            "description": "Overview on Arabic cultural production. Develops a historic and critical understanding of Arabic literary traditions, as well as related musical and visual arts, up to the twenty-first century.",
            "id": "AFRICAN 231",
            "parent": "AFRICAN",
            "title": "INTRODUCTION TO ARABIC LITERARY CULTURE"
        }
    },
    {
        "data": {
            "description": "Survey of African American history from 1900 to the present. Topics covered include segregation, the Civil Rights Movement, the political, social and cultural changes of the late 20th century, and the Obama presidency.",
            "id": "AFROAMER/HISTORY 321",
            "title": "AFRO-AMERICAN HISTORY SINCE 1900"
        }
    },
    {
        "data": {
            "description": "Analysis of major works of African American fiction, drama, poetry and autobiography.  Attention given to historical, cultural and biographical contexts.",
            "id": "AFROAMER 227",
            "parent": "AFROAMER",
            "title": "MASTERPIECES OF AFRICAN AMERICAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Civil rights history from 1930-1970. Legal, historical and economic origins of the civil rights movement. Study of the movement's impact on United States culture, politics, and international relations.",
            "id": "AFROAMER/HISTORY 628",
            "title": "HISTORY OF THE CIVIL RIGHTS MOVEMENT IN THE UNITED STATES"
        }
    },
    {
        "data": {
            "description": "Provides historical perspectives on current dilemmas facing black patients and health care professionals.",
            "id": "AFROAMER/HISTSCI/MEDHIST 523",
            "title": "RACE, AMERICAN MEDICINE AND PUBLIC HEALTH"
        }
    },
    {
        "data": {
            "description": "An intensive analysis of specific themes in the Afro-American experience. Subjects vary with instructor.",
            "id": "AFROAMER/ENGL 672",
            "title": "SELECTED TOPICS IN AFRO-AMERICAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Research and discussion of topics in African American History.",
            "id": "AFROAMER 631",
            "parent": "AFROAMER",
            "title": "COLLOQUIUM IN AFRO-AMERICAN HISTORY"
        }
    },
    {
        "data": {
            "description": "Historical survey of African American art. Beginning with the African heritage and concluding with creativity of the 1970's, examine the evolution of African American art. Attention to the aesthetic sensibilities of diverse styles as well as the social significance of Black art within the art arena.",
            "id": "AFROAMER/ARTHIST 242",
            "title": "INTRODUCTION TO AFRO-AMERICAN ART"
        }
    },
    {
        "data": {
            "description": "An examination of the social, economic, political, and cultural issues influencing the education of Black Americans from the early nineteenth century to the 1960s.",
            "id": "AFROAMER/EDPOL 567",
            "title": "HISTORY OF AFRICAN AMERICAN EDUCATION"
        }
    },
    {
        "data": {
            "description": "Introductory level course on specific topics in African American culture.",
            "id": "AFROAMER 271",
            "parent": "AFROAMER",
            "title": "SELECTED TOPICS IN AFRICAN AMERICAN CULTURE"
        }
    },
    {
        "data": {
            "description": "Black literature and culture during the 1920's. Focus on unique Black literary expression of era, historical background, esthetics, polemical essays.",
            "id": "AFROAMER 337",
            "parent": "AFROAMER",
            "title": "THE HARLEM RENAISSANCE"
        }
    },
    {
        "data": {
            "description": "Addresses the relationship between slavery and capitalism in the British North American colonies and the United States of America. Drawing on recent scholarship that explores how slavery and capitalism are independent systems, examines  how the labor of enslaved people affected the development and growth of wage labor; the impact of the growth and dominance of capitalism as an economic system on the institution of slavery; and the experiences of enslaved people.",
            "id": "AFROAMER 621",
            "parent": "AFROAMER",
            "title": "SLAVERY AND CAPITALISM IN THE UNITED STATES"
        }
    },
    {
        "data": {
            "id": "AFRICAN",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "POLISCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Surveys the history of the Caribbean from the 15th century to the present. Emphasizes the importance of colonialism, commodity-based capitalism, globalization, slavery, and forced labor for the modeling of the region's social, economic, cultural, and political structures. Pay particular attention to the resilient, creative and resourceful ways in which Caribbean people have responded to these adverse conditions. Examine the circumstances that have shaped migrations from the region to the United States and Canada during the 20th and 21st centuries. Study how these diasporic communities have created social spaces in these two countries that have remained closely linked to the Caribbean through economic, political, and filial networks.",
            "id": "AFROAMER/HISTORY 347",
            "title": "THE CARIBBEAN AND ITS DIASPORAS"
        }
    },
    {
        "data": {
            "description": "Mentored individual research and study for students completing a senior thesis.",
            "id": "AFROAMER 692",
            "parent": "AFROAMER",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Exploration of civil rights. Question what it means to discriminate (on the basis of race, sex, national origin, religion, and disability), how we might investigate and detect acts of discrimination, and the legal constraints on governmental efforts to remedy discrimination in employment, housing, and voting. Explore the intersection of government power and civil rights. Examine how the government targets groups during times of national crisis. Consider what constitutes acceptable conditions of incarceration for prisoners. Finally, learn police use-of-force doctrine, and discuss the challenge of protecting both officer and civilian safety.",
            "id": "AFROAMER/LEGALST 435",
            "title": "CIVIL RIGHTS: POLICING, PRISONS, VOTING, HOUSING, EMPLOYMENT"
        }
    },
    {
        "data": {
            "description": "An intensive analysis of specific societal themes in African Americans' experiences.",
            "id": "AFROAMER 673",
            "parent": "AFROAMER",
            "title": "SELECTED TOPICS IN AFRO-AMERICAN SOCIETY"
        }
    },
    {
        "data": {
            "description": "Analysis of retention of African elements in African-American oral, written, and material culture. Social, cultural, and political issues regarding race, self-definition, and self-determination in both Africa and North America will be examined.",
            "id": "AFRICAN/AFROAMER/HISTORY/POLISCI 297",
            "title": "AFRICAN AND AFRICAN-AMERICAN LINKAGES: AN INTRODUCTION"
        }
    },
    {
        "data": {
            "description": "Explores African American women's experience from waning days of slavery to present. Topics include slavery, emancipation, reconstruction, segregation, migration, urban and rural poverty, civil rights, nationalism, feminism and sexual politics.",
            "id": "AFROAMER/GEN&WS 324",
            "title": "BLACK WOMEN IN AMERICA: RECONSTRUCTION TO THE PRESENT"
        }
    },
    {
        "data": {
            "description": "An Afro Asian perspective provides a lens through which intersections between Asian American and African American dance and martial arts are studied and practiced. Asian American and African American movement genres provide tools to explore dance fusion, choreography, and improvisation, to create dances informed by African American and Asian American legacies of struggle, innovation and transformation, while cognizant of historical forces of oppression and racism. Building connections through respectful communication with others are learned through dance practice, discussion and writing about concepts learned through readings, videos, and guest artist visits. Engagement with dance as a cultural vehicle for creative problem-solving and risk-taking occurs through guided class or smaller group activities.",
            "id": "AFROAMER/ASIANAM/DANCE/FOLKLORE 319",
            "title": "AFRO ASIAN IMPROV: FROM HIP HOP TO MARTIAL ARTS FUSION"
        }
    },
    {
        "data": {
            "description": "Historical interplay of racism and sexism in the lives of Black and White women of different class backgrounds in the United States.",
            "id": "AFROAMER/GEN&WS 323",
            "title": "GENDER, RACE AND CLASS: WOMEN IN U.S. HISTORY"
        }
    },
    {
        "data": {
            "description": "An introduction to the writings of Afro-American women from the nineteenth to the twentieth century. Fiction, autobiography, non-fiction prose, and poetry will be read and discussed.",
            "id": "AFROAMER/GEN&WS 222",
            "title": "INTRODUCTION TO BLACK WOMEN WRITERS"
        }
    },
    {
        "data": {
            "description": "In-depth treatment of a key theme in black historical studies.",
            "id": "AFROAMER 302",
            "parent": "AFROAMER",
            "title": "UNDERGRADUATE STUDIES IN AFRO-AMERICAN HISTORY"
        }
    },
    {
        "data": {
            "description": "Survey of African American history from its roots in Africa to the end of the 19th century. Topics considered include the slave trade, the political and cultural practices of enslaved communities, forms of resistance, Reconstruction, and systems of segregation.",
            "id": "AFROAMER/HISTORY 322",
            "title": "AFRO-AMERICAN HISTORY TO 1900"
        }
    }
]