[
    {
        "data": {
            "description": "Independent research on the student's thesis or degree project.",
            "id": "AGROECOL 990",
            "parent": "AGROECOL",
            "title": "RESEARCH"
        }
    },
    {
        "data": {
            "description": "A stepping stone between the classroom and society. Emphasizes integration of diverse bodies of agroecological knowledge, critical thinking, and engagement with real-world problems and current research. Topics such as: bioproducts, food systems and security, economic vitality of communities, climate change, humans and their environment, biodiversity, resource management and policy, and social equity.",
            "id": "AGROECOL 503",
            "parent": "AGROECOL",
            "title": "AGROECOLOGY CAPSTONE"
        }
    },
    {
        "data": {
            "description": "Agroecology has blossomed across the world in recent decades as not only a science, but also a practice, and a movement. Employ the multiple disciplines and perspectives that Agroecology affords to analyze our agricultural and food systems wihin a broader context of dynamic social and ecological relationships.",
            "id": "AGROECOL/AGRONOMY/C&ESOC/ENTOM/ENVIRST 103",
            "title": "AGROECOLOGY: AN INTRODUCTION TO THE ECOLOGY OF FOOD AND AGRICULTURE"
        }
    },
    {
        "data": {
            "description": "Agroecology systems provide a variety of social, economic, and ecological functions to society, each with a different network of stakeholders. This course explores methods of evaluating these diverse functions and perspectives, with a special focus on participatory approaches.",
            "id": "AGROECOL 702",
            "parent": "AGROECOL",
            "title": "THE MULTIFUNCTIONALITY OF AGRICULTURE"
        }
    },
    {
        "data": {
            "description": "Could you grow and gather enough food to feed yourself? Learn the biology behind how to grow healthy plants in a healthy ecosystem by creating plans for a large food garden. Focus on understanding the scientific method, analyzing data and sources, and using scientific research as a tool to make decisions. Identify credible information sources for solving unpredictable, real-world problems faced by food growers. Practice awareness and understanding of the natural world.",
            "id": "AGROECOL 187",
            "parent": "AGROECOL",
            "title": "PLANTS AND THE SCIENCE OF SURVIVAL"
        }
    },
    {
        "data": {
            "description": "Explores in-depth agriculture systems as coupled ecological and social complexities. Examines the components of agricultural systems and analyzes how different ecological and social contexts influence and are influenced by the agricultural system. Explores and analyzes how management decisions (crop breeding, in-crop management, landscape-level, etc.) ramify to influence processes and outcomes at different levels of complexity (e.g., ecosystem, landscape, social well-being, human health, economic) and the socio-ecological tradeoffs that ensue. Develops skills to analyze how the design and implementation of integrated agricultural systems can contribute to solutions for pressing societal challenges such as climate change, biodiversity declines, unsustainable resource use and social inequality.",
            "id": "AGROECOL 303",
            "parent": "AGROECOL",
            "title": "AGROECOLOGICAL SYSTEMS: WORKING TOWARDS SUSTAINABILITY"
        }
    },
    {
        "data": {
            "description": "Facilitated discussions on agroecology-related scholarship, policies, and practices. May include presentations on current or proposed research.",
            "id": "AGROECOL 710",
            "parent": "AGROECOL",
            "title": "SEMINAR IN AGROECOLOGY"
        }
    },
    {
        "data": {
            "description": "Farms may be analyzed as intentional entities shaped by the contexts in which they must operate. This course explores how these biophysical and social contexts both exert constraints and provide opportunities, leading to the diversity of farms observed.",
            "id": "AGROECOL 701",
            "parent": "AGROECOL",
            "title": "THE FARM AS SOCIO-ENVIRONMENTAL ENDEAVOR"
        }
    },
    {
        "data": {
            "description": "Field study of farms, processing, marketing, distribution, and policy-making in the food system. Courses will be several days of visits, discussions with the operators, and student-faculty discussion sections. Presentations or written reports may be required.",
            "id": "AGROECOL 720",
            "parent": "AGROECOL",
            "title": "AGROECOLOGY FIELD STUDY"
        }
    },
    {
        "data": {
            "description": "Impacts of global change drivers (climate change, atmospheric chemistry, bioenergy, urbanization, policy) on agroecosystems and their associated goods and services; environmental impacts of agricultural land use and feedbacks to climate; modeling approaches; critical review of current scientific literature.",
            "id": "AGROECOL/AGRONOMY/ENVIRST 724",
            "title": "AGROECOSYSTEMS AND GLOBAL CHANGE"
        }
    },
    {
        "data": {
            "description": "Instructional orientation to teaching at the higher education level in Agroecology, direct evidence-based teaching experience under faculty supervision, experience in testing and evaluation of students, and the analysis of teaching performance.",
            "id": "AGROECOL 799",
            "parent": "AGROECOL",
            "title": "PRACTICUM IN AGROECOLOGY TEACHING"
        }
    },
    {
        "data": {
            "description": "Internship under guidance of a faculty or instructional academic staff member in Agroecology and internship site supervisor. Students are responsible for arranging the work and credits with the faculty or instructional academic staff member and the internship site supervisor.",
            "id": "AGROECOL 399",
            "parent": "AGROECOL",
            "title": "COORDINATIVE INTERNSHIP/COOPERATIVE EDUCATION"
        }
    },
    {
        "data": {
            "description": "Provides an area equivalency for courses taken on Madison Study Abroad Programs that do not equate to existing UW courses. Current enrollment in a UW-Madison study abroad program",
            "id": "AGROECOL 400",
            "parent": "AGROECOL",
            "title": "STUDY ABROAD IN AGROECOLOGY"
        }
    },
    {
        "data": {
            "description": "Scholarship on special topics, under the supervision of an agroecology faculty member.",
            "id": "AGROECOL 699",
            "parent": "AGROECOL",
            "title": "SPECIAL PROBLEMS"
        }
    },
    {
        "data": {
            "id": "AGROECOL",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "AGROECOL 303",
            "target": "AGROECOL 503"
        }
    },
    {
        "data": {
            "source": "AGROECOL/AGRONOMY/C&ESOC/ENTOM/ENVIRST 103",
            "target": "AGROECOL 303"
        }
    },
    {
        "data": {
            "source": "AGROECOL/AGRONOMY/C&ESOC/ENTOM/ENVIRST 103",
            "target": "AGROECOL 503"
        }
    }
]