[
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics and selected topics in Animal Physiology.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Development of models, programs, inferences, and interpretations of analysis of variance in biological research; mixed vs. random effects models and their development; choosing the correct inference range; variance and covariance analyses; repeated measures; dealing with missing data; SAS programming. Knowledge of statistics such asSTAT/​F&W ECOL  571is strongly encouraged.",
            "id": "AGRONOMY 772",
            "parent": "AGRONOMY",
            "title": "APPLICATIONS IN ANOVA"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for Physics, AMEP, and Astronomy-Physics majors. Mechanics, waves, thermodynamics and statistical mechanics, topics in modern physics; with computation.  A more mathematically rigorous and in-depth introduction to physics than the other introductory physics sequences.",
            "id": "PHYSICS 247",
            "parent": "PHYSICS",
            "title": "A MODERN INTRODUCTION TO PHYSICS"
        }
    },
    {
        "data": {
            "source": "GENETICS 467",
            "target": "AGRONOMY/HORT 338"
        }
    },
    {
        "data": {
            "description": "Instructional orientation to teaching at the higher education level in the agricultural and life sciences, direct teaching experience under faculty supervision, experience in testing and evaluation of students, and the analysis of teaching performance.",
            "id": "AGRONOMY 799",
            "parent": "AGRONOMY",
            "title": "PRACTICUM IN AGRONOMY TEACHING"
        }
    },
    {
        "data": {
            "description": "Explores how and why genetically modified (GM) crops are created and their regulation at the federal and state level. Through case studies, students will learn about the impacts of GM crops and critically evaluate arguments both for and against their use. Readings and discussion introduce students to the complex economic, cultural, and political issues surrounding GM crops.",
            "id": "AGRONOMY/HORT 360",
            "title": "GENETICALLY MODIFIED CROPS: SCIENCE, REGULATION & CONTROVERSY"
        }
    },
    {
        "data": {
            "description": "Delves into aspects of natural sciences (biology and agricultural sciences) and social sciences underpinning the assessment of food production systems as related to a variety of outcomes including but not restricted to human and environmental health, air and water quality, greenhouse gases emission, land use, economic opportunity, social justice, as well as mitigation and adaptation to climate change, locally, regionally, domestically, across continents, and globally.",
            "id": "AGRONOMY/DYSCI 471",
            "title": "FOOD PRODUCTION SYSTEMS AND SUSTAINABILITY"
        }
    },
    {
        "data": {
            "description": "Agronomic cropping systems of the Midwest: environmental impacts, productivity, and profitability. Cropping system diversification and sustainable agriculture. An agroecological approach, the application of ecological concepts and principles for the improvement of cropping systems is emphasized.",
            "id": "AGRONOMY 300",
            "parent": "AGRONOMY",
            "title": "CROPPING SYSTEMS"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "AGRONOMY/HORT 501"
        }
    },
    {
        "data": {
            "source": "GENETICS 466",
            "target": "GENETICS 467"
        }
    },
    {
        "data": {
            "description": "Crops, food, and cropping systems from different parts of the world and their impact on global sustainability and health. Introduction to crop biology, environmental requirements, and agronomic production practices of major food crops. Environmental, socioeconomic, and health impacts of farming systems and how to assess their sustainability. For those with broad interests in global issues, agroecology, food, environment, health, and agriculture.",
            "id": "AGRONOMY 377",
            "parent": "AGRONOMY",
            "title": "GLOBAL FOOD PRODUCTION AND HEALTH"
        }
    },
    {
        "data": {
            "description": "Computing-intensive course to prepare students for genetic mapping research; linkage analysis and QTL mapping in designed crosses; linkage disequilibrium and association analysis (GWAS). Recommended preparation is undergraduate courses in genetics and statistics and prior experience writing R scripts (such as module 1 of STAT 327).",
            "id": "AGRONOMY/ANSCI/GENETICS/HORT 615",
            "title": "GENETIC MAPPING"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "AGRONOMY/BOTANY/HORT 340"
        }
    },
    {
        "data": {
            "source": "CHEM 115",
            "target": "SOILSCI 301"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "SOILSCI 301"
        }
    },
    {
        "data": {
            "description": "Soils are fundamental to ecosystem science. A systems approach is used to investigate how soils look and function. Topics investigated include soil structure, biology, water, fertility, and taxonomy as well as the human impact on the soil environment.",
            "id": "ENVIRST/GEOG/SOILSCI 230",
            "title": "SOIL: ECOSYSTEM AND RESOURCE"
        }
    },
    {
        "data": {
            "source": "ANSCI/DYSCI 101",
            "target": "AGRONOMY 302"
        }
    },
    {
        "data": {
            "description": "Agroecology has blossomed across the world in recent decades as not only a science, but also a practice, and a movement. Employ the multiple disciplines and perspectives that Agroecology affords to analyze our agricultural and food systems wihin a broader context of dynamic social and ecological relationships.",
            "id": "AGROECOL/AGRONOMY/C&ESOC/ENTOM/ENVIRST 103",
            "title": "AGROECOLOGY: AN INTRODUCTION TO THE ECOLOGY OF FOOD AND AGRICULTURE"
        }
    },
    {
        "data": {
            "description": "Principles and application of chemical equilibrium, coordination chemistry, oxidation-reduction and electrochemistry, kinetics, nuclear chemistry, introduction to organic chemistry, and chemistry laboratory skills.",
            "id": "CHEM 104",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Genetics of eukaryotes and prokaryotes. Includes transmission genetics, probability and hypothesis testing, genetic mapping, molecular genetics, gene expression, and genetic engineering. Illustrative material includes viruses, bacteria, plants, fungi, insects, and humans.",
            "id": "GENETICS 467",
            "parent": "GENETICS",
            "title": "GENERAL GENETICS 1"
        }
    },
    {
        "data": {
            "description": "Descriptive statistics, distributions, one- and two-sample normal inference, power, one-way ANOVA, simple linear regression, categorical data, non-parametric methods; underlying assumptions and diagnostic work.",
            "id": "F&WECOL/STAT 571",
            "title": "STATISTICAL METHODS FOR BIOSCIENCE I"
        }
    },
    {
        "data": {
            "description": "An overview of animal sciences covering anatomy, physiology, nutrition, reproduction, genetics, management, animal welfare, and behavior of domesticated animals. Food animals are emphasized to discuss their contributions to humans.",
            "id": "ANSCI/DYSCI 101",
            "title": "INTRODUCTION TO ANIMAL SCIENCES"
        }
    },
    {
        "data": {
            "description": "Provides an in-depth understanding of the history of organic agriculture, its production, processing, marketing, and social dimensions, and its impact on environmental, community, and human health.",
            "id": "AAE/AGRONOMY/HORT/PLPATH 367",
            "title": "INTRODUCTION TO ORGANIC AGRICULTURE: PRODUCTION, MARKETS, AND POLICY"
        }
    },
    {
        "data": {
            "description": "Plant-environment interactions with particular reference to energy exchanges and water relations. Models are used to provide a quantitative synthesis of information from plant physiology, soil physics, and micrometeorology with some consideration of plant-pest interactions.",
            "id": "AGRONOMY/ATMOCN/SOILSCI 532",
            "title": "ENVIRONMENTAL BIOPHYSICS"
        }
    },
    {
        "data": {
            "source": "PHYSICS 207",
            "target": "PHYSICS 201"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "PHYSICS 247",
            "target": "AGRONOMY/ATMOCN/SOILSCI 532"
        }
    },
    {
        "data": {
            "description": "Accelerated coverage of topics in general chemistry, including introduction to laboratory techniques. Topics include atomic and molecular structure, chemical equilibrium, acid-base chemistry, thermodynamics, kinetics, and electrochemistry.",
            "id": "CHEM 109",
            "parent": "CHEM",
            "title": "ADVANCED GENERAL CHEMISTRY"
        }
    },
    {
        "data": {
            "source": "AGRONOMY 100",
            "target": "AGRONOMY 300"
        }
    },
    {
        "data": {
            "source": "GENETICS 466",
            "target": "AGRONOMY/HORT 338"
        }
    },
    {
        "data": {
            "description": "Genetics in eukaryotes and prokaryotes.  Includes transmission genetics, molecular genetics, evolutionary genetics, genetic engineering, and societal issues associated with genetics.  Illustrative material includes bacteria, plants, insects, and vertebrates.",
            "id": "GENETICS 466",
            "parent": "GENETICS",
            "title": "PRINCIPLES OF GENETICS"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for students majoring in biological sciences. Mechanics: kinematics, statics, dynamics; energy and momentum. Heat and sound.",
            "id": "PHYSICS 207",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Introduction to the basic principles and concepts of the biology of plants. an integrative approach stressing evolutionary sequences and the relationship between structure and function at succeeding levels of organization: molecule, cell, organism, population, community. Correlated lectures, laboratories, and discussions.",
            "id": "BIOLOGY/BOTANY 130",
            "title": "GENERAL BOTANY"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "AGRONOMY/ATMOCN/SOILSCI 532"
        }
    },
    {
        "data": {
            "source": "AGROECOL/AGRONOMY/C&ESOC/ENTOM/ENVIRST 103",
            "target": "AGRONOMY 377"
        }
    },
    {
        "data": {
            "source": "AGRONOMY 100",
            "target": "AGRONOMY/BOTANY/SOILSCI 370"
        }
    },
    {
        "data": {
            "id": "SOILSCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "SOILSCI 301",
            "target": "AGRONOMY/HORT/SOILSCI 326"
        }
    },
    {
        "data": {
            "description": "Functions, requirements and uptake of essential plant nutrients; chemical and microbial processes affecting nutrient availability; diagnosis of plant and soil nutrient status; fertilizers and efficient fertilizer use in different tillage systems.",
            "id": "AGRONOMY/HORT/SOILSCI 326",
            "title": "PLANT NUTRITION MANAGEMENT"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "GENETICS 467"
        }
    },
    {
        "data": {
            "description": "Plant science applied to the growth, production, management, distribution and utilization of field crops.",
            "id": "AGRONOMY 100",
            "parent": "AGRONOMY",
            "title": "PRINCIPLES AND PRACTICES IN CROP PRODUCTION"
        }
    },
    {
        "data": {
            "description": "Research work under direct guidance of a faculty or instructional academic staff member. Students are responsible for arranging the work and credits with the supervising instructor.",
            "id": "AGRONOMY 299",
            "parent": "AGRONOMY",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "AGRONOMY/HORT 502"
        }
    },
    {
        "data": {
            "description": "Special topics on issues relevant to Agronomy.",
            "id": "AGRONOMY 375",
            "parent": "AGRONOMY",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "AGRONOMY 302"
        }
    },
    {
        "data": {
            "source": "CHEM 115",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "description": "An internship under guidance of a faculty or instructional academic staff member in Agronomy and internship site supervisor. Students are responsible for arranging the work and credits with the faculty or instructional academic staff member and the internship site supervisor.",
            "id": "AGRONOMY 399",
            "parent": "AGRONOMY",
            "title": "COORDINATIVE INTERNSHIP/COOPERATIVE EDUCATION"
        }
    },
    {
        "data": {
            "description": "Explores a detailed atomic and molecular view of matter and its interactions, with a specific focus on quantum theory, molecular structure, and chemical bonding. Application required for enrollment.",
            "id": "CHEM 115",
            "parent": "CHEM",
            "title": "CHEMICAL PRINCIPLES I"
        }
    },
    {
        "data": {
            "source": "ENVIRST/GEOG/SOILSCI 230",
            "target": "AGRONOMY/HORT/SOILSCI 326"
        }
    },
    {
        "data": {
            "source": "AGRONOMY 100",
            "target": "AAE/AGRONOMY/HORT/PLPATH 367"
        }
    },
    {
        "data": {
            "description": "Genetic analysis, population genetics, evolution and quantitative genetics. Includes mutant screens, pathway analysis, mosaic analysis, reverse genetics, genomics, Hardy-Weinberg  linkage equilibrium, inbreeding, genetic drift, natural selection, population structure, inheritance of complex traits, domestication and human evolution.",
            "id": "GENETICS 468",
            "parent": "GENETICS",
            "title": "GENERAL GENETICS 2"
        }
    },
    {
        "data": {
            "description": "Topics include: selected topics in plant physiology, a survey of the five major kingdoms of organisms, speciation and evolutionary theory, and ecology at multiple levels of the biological hierarchy.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Individual study for majors completing theses for Agronomy Honors degrees.",
            "id": "AGRONOMY 681",
            "parent": "AGRONOMY",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 222"
        }
    },
    {
        "data": {
            "description": "Independent writing and research to complete thesis or dissertation requirements.",
            "id": "AGRONOMY 990",
            "parent": "AGRONOMY",
            "title": "RESEARCH"
        }
    },
    {
        "data": {
            "source": "PHYSICS 201",
            "target": "PHYSICS 103"
        }
    },
    {
        "data": {
            "description": "Weekly seminar topics in agronomy and horticulture.",
            "id": "AGRONOMY 920",
            "parent": "AGRONOMY",
            "title": "SEMINAR"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "source": "GENETICS 467",
            "target": "AGRONOMY/HORT 502"
        }
    },
    {
        "data": {
            "source": "GENETICS 467",
            "target": "GENETICS 468"
        }
    },
    {
        "data": {
            "id": "BIOCORE",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "MATH 213",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "description": "Principles of transferring plant genes by sexual, somatic, and molecular methods and the application of gene transfer in plant breeding and genetic engineering to improve crop plants.",
            "id": "AGRONOMY/HORT 338",
            "title": "PLANT BREEDING AND BIOTECHNOLOGY"
        }
    },
    {
        "data": {
            "id": "PHYSICS",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for engineering students. Mechanics: kinematics, statics, dynamics; energy and momentum.",
            "id": "PHYSICS 201",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Individual study for majors completing theses for Honors degrees as arranged with a faculty member. Requires consent of supervising instructor. Continuation ofAGRONOMY 681. Enrolled in CALS Honors Program.",
            "id": "AGRONOMY 682",
            "parent": "AGRONOMY",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Highlights the connections between tropical plants and society. Topics include multidisciplinary reflections on the biology of tropical plants, as well as an overview of different production systems and some of the social and environmental problems associated with the utilization of tropical plants in the context of local and global markets. Provides the opportunity to demonstrate comparative skills with respect to local and international challenges posed by the topics we address in class. Illustrates connections between horticulture and conservation, food security, nutrition, and global health.",
            "id": "AGRONOMY/HORT 376",
            "title": "TROPICAL HORTICULTURAL SYSTEMS"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "SOILSCI 301"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 101"
        }
    },
    {
        "data": {
            "description": "Introduces new graduate students to the diversity of ecologists across the UW-Madison campus. Includes discussions of key topics in professional development, research presentations by faculty members, and discussions of assigned papers with senior graduate students.",
            "id": "AGRONOMY/ATMOCN/BOTANY/ENTOM/ENVIRST/F&WECOL/GEOG/ZOOLOGY 953",
            "title": "INTRODUCTION TO ECOLOGY RESEARCH AT UW-MADISON"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "PHYSICS 207",
            "target": "AGRONOMY/ATMOCN/SOILSCI 532"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "target": "AGRONOMY/BOTANY/HORT 340"
        }
    },
    {
        "data": {
            "source": "GENETICS 466",
            "target": "AGRONOMY/HORT 360"
        }
    },
    {
        "data": {
            "description": "Presents an overview of the techniques, biology and underlying theory of plant tissue culture, genetic engineering and genome editing. Overviews of research and commercial applications, and issues/challenges in the area of plant biotechnology are also covered.",
            "id": "AGRONOMY/BOTANY/HORT 340",
            "title": "PLANT CELL CULTURE AND GENETIC ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Lab and field techniques used in breeding and maintaining economic crops.",
            "id": "AGRONOMY/HORT 502",
            "title": "TECHNIQUES OF PLANT BREEDING"
        }
    },
    {
        "data": {
            "description": "Basic principles of ecology and interrelations between individuals, populations, communities, ecosystems and their environment; transmission genetics and introduction to population genetics; origin of life, evolutionary mechanisms, ancestral relationships among species, and the diversity of life.",
            "id": "BIOCORE 381",
            "parent": "BIOCORE",
            "title": "EVOLUTION, ECOLOGY, AND GENETICS"
        }
    },
    {
        "data": {
            "description": "Establishment, management, harvesting and utilization of forage crops for use as hay, pasture and silage. Emphasis on cool season perennial grasses and legumes.",
            "id": "AGRONOMY 302",
            "parent": "AGRONOMY",
            "title": "FORAGE MANAGEMENT AND UTILIZATION"
        }
    },
    {
        "data": {
            "source": "SOILSCI 301",
            "target": "ENVIRST/GEOG/SOILSCI 230"
        }
    },
    {
        "data": {
            "source": "PHYSICS 201",
            "target": "PHYSICS 207"
        }
    },
    {
        "data": {
            "id": "GENETICS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "GENETICS 468",
            "target": "GENETICS 466"
        }
    },
    {
        "data": {
            "id": "AGRONOMY",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Use of statistical methods to facilitate improvements in quantitative traits of cultivated plants.",
            "id": "AGRONOMY/HORT 811",
            "title": "BIOMETRICAL PROCEDURES IN PLANT BREEDING"
        }
    },
    {
        "data": {
            "description": "Stoichiometry and the mole concept, the behavior of gases, liquids and solids, thermochemistry, electronic structure of atoms and chemical bonding, descriptive chemistry of selected elements and compounds, intermolecular forces, and chemistry laboratory skills.",
            "id": "CHEM 103",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "A stepping stone between the classroom and society. Emphasizes discussion and activities for enhancing integration of diverse bodies of knowledge, critical thinking, and effective written and oral communication.",
            "id": "AGRONOMY 500",
            "parent": "AGRONOMY",
            "title": "SENIOR CAPSTONE EXPERIENCE"
        }
    },
    {
        "data": {
            "source": "AGRONOMY 100",
            "target": "AGRONOMY 302"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "BOTANY/PLPATH 123",
            "target": "AGRONOMY/BOTANY/SOILSCI 370"
        }
    },
    {
        "data": {
            "description": "Introduction to physics at the non-calculus level. Principles of mechanics, heat, and waves, with applications to a number of different fields. Not recommended for students in the physical sciences and engineering.",
            "id": "PHYSICS 103",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "source": "AGROECOL/AGRONOMY/C&ESOC/ENTOM/ENVIRST 103",
            "target": "AAE/AGRONOMY/HORT/PLPATH 367"
        }
    },
    {
        "data": {
            "source": "PHYSICS 207",
            "target": "PHYSICS 103"
        }
    },
    {
        "data": {
            "description": "Hunger and poverty in developing countries and the United States. Topics include: nutrition and health, population, food production and availability, and income distribution and employment.",
            "id": "AAE/AGRONOMY/NUTRSCI 350",
            "title": "WORLD HUNGER AND MALNUTRITION"
        }
    },
    {
        "data": {
            "description": "Physical chemical and biological properties of soils as they affect soil-plant-water relations, soil classification and suitability for agricultural and other uses.",
            "id": "SOILSCI 301",
            "parent": "SOILSCI",
            "title": "GENERAL SOIL SCIENCE"
        }
    },
    {
        "data": {
            "description": "Review of methods for controlling error in research experiments; review and in-depth development of factorial treatment designs; theory, analysis, and examples of advanced experimental designs for plant and animal research. Knowledge of statistics such asSTAT/​F&W ECOL  571is strongly encouraged.",
            "id": "AGRONOMY 771",
            "parent": "AGRONOMY",
            "title": "EXPERIMENTAL DESIGNS"
        }
    },
    {
        "data": {
            "description": "Explores the interaction between society and plant-associated microbes. Topics include: the Irish potato famine, pesticides in current agriculture, role of economics and consumer preference in crop disease management and the release of genetically engineered organisms.",
            "id": "BOTANY/PLPATH 123",
            "title": "PLANTS, PARASITES, AND PEOPLE"
        }
    },
    {
        "data": {
            "description": "Understand factors driving global, continental, regional, and local distribution of grasslands. Discuss how management affects provision of grassland ecosystem goods and services. Compare and contrast plant community and ecosystem dynamics in native prairie and intensively managed pastures.",
            "id": "AGRONOMY/BOTANY/SOILSCI 370",
            "title": "GRASSLAND ECOLOGY"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Principles involved in breeding and maintaining economic crops; factors affecting the choice of breeding methods; alternative approaches through hybridization and selection.",
            "id": "AGRONOMY/HORT 501",
            "title": "PRINCIPLES OF PLANT BREEDING"
        }
    },
    {
        "data": {
            "source": "AGRONOMY 100",
            "target": "AGRONOMY 377"
        }
    },
    {
        "data": {
            "description": "An in-depth study of a selection of ethical issues arising from the application of modern biotechnology to microorganisms, plants, non-human animals, and human beings. We will aim at a discussion that is informed by empirical research and by work done in ethical theory, political philosophy, and other relevant disciplines, and whose character is rigorous, clear, nuanced, and unbiased.",
            "id": "AGRONOMY/C&ESOC/MEDHIST/PHILOS 565",
            "title": "THE ETHICS OF MODERN BIOTECHNOLOGY"
        }
    },
    {
        "data": {
            "description": "Polynomial regression, multiple regression, two-way ANOVA with and without interaction, split-plot design, subsampling, analysis of covariance, elementary sampling, introduction to bioassay.",
            "id": "F&WECOL/STAT 572",
            "title": "STATISTICAL METHODS FOR BIOSCIENCE II"
        }
    },
    {
        "data": {
            "source": "GENETICS 466",
            "target": "AGRONOMY/HORT 501"
        }
    },
    {
        "data": {
            "description": "Impacts of global change drivers (climate change, atmospheric chemistry, bioenergy, urbanization, policy) on agroecosystems and their associated goods and services; environmental impacts of agricultural land use and feedbacks to climate; modeling approaches; critical review of current scientific literature.",
            "id": "AGROECOL/AGRONOMY/ENVIRST 724",
            "title": "AGROECOSYSTEMS AND GLOBAL CHANGE"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 109"
        }
    },
    {
        "data": {
            "description": "Special topics on issues relevant to Agronomy.",
            "id": "AGRONOMY 875",
            "parent": "AGRONOMY",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "source": "PHYSICS 103",
            "target": "AGRONOMY/ATMOCN/SOILSCI 532"
        }
    },
    {
        "data": {
            "description": "General biological principles. Topics include: evolution, ecology, animal behavior, cell structure and function, genetics and molecular genetics and the physiology of a variety of organ systems emphasizing function in humans.",
            "id": "BIOLOGY/ZOOLOGY 101",
            "title": "ANIMAL BIOLOGY"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "AGRONOMY/HORT 501"
        }
    },
    {
        "data": {
            "description": "Provides an area equivalency for courses taken on Madison Study Abroad Programs that do not equate to existing UW courses. Current enrollment in a UW-Madison study abroad program",
            "id": "AGRONOMY 400",
            "parent": "AGRONOMY",
            "title": "STUDY ABROAD IN AGRONOMY"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "AGRONOMY/BOTANY/HORT 340"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "AGRONOMY 302"
        }
    },
    {
        "data": {
            "description": "Graduate seminar in Plant Breeding  Plant Genetics (PBPG) that requires students to give oral scientific presentations on topics chosen by the instructors and/or the student¿s thesis research. This seminar is coordinated by PBPG faculty on a rotating basis.",
            "id": "AGRONOMY/GENETICS/HORT 957",
            "title": "SEMINAR-PLANT BREEDING"
        }
    },
    {
        "data": {
            "description": "Discuss advanced topics in selection theory and the utilization of molecular markers in selection.",
            "id": "AGRONOMY/HORT 812",
            "title": "SELECTION THEORY FOR QUANTITATIVE TRAITS IN PLANTS"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 213"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 152"
        }
    },
    {
        "data": {
            "source": "F&WECOL/STAT 571",
            "target": "F&WECOL/STAT 572"
        }
    },
    {
        "data": {
            "source": "CHEM 115",
            "target": "AGRONOMY/HORT/SOILSCI 326"
        }
    },
    {
        "data": {
            "description": "Techniques of integration, improper integrals, first order ordinary differential equations, sequences and series, Taylor series, vector geometry in two and three dimensions.",
            "id": "MATH 222",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 2"
        }
    },
    {
        "data": {
            "description": "Research work under direct guidance of an Agronomy faculty or instructional academic staff member. Students are responsible for arranging the work and credits with the supervising instructor. Intended for students in the CALS Honors Program.",
            "id": "AGRONOMY 289",
            "parent": "AGRONOMY",
            "title": "HONORS INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "GENETICS 467",
            "target": "GENETICS 466"
        }
    },
    {
        "data": {
            "description": "First order differential equations, introduction to multivariable calculus and constrained optimization, infinite sequences and series, methods of approximation, and a brief introduction to probability. Models and applications from business and the social sciences.",
            "id": "MATH 213",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 2"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "description": "Independent research guided by an Agronomy faculty or instructional academic staff member. Students are responsible for arranging the work and credits with the supervising instructor.",
            "id": "AGRONOMY 699",
            "parent": "AGRONOMY",
            "title": "SPECIAL PROBLEMS"
        }
    },
    {
        "data": {
            "source": "F&WECOL/STAT 572",
            "target": "AGRONOMY/HORT 811"
        }
    },
    {
        "data": {
            "source": "GENETICS 466",
            "target": "AGRONOMY/HORT 502"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "GENETICS 467"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 151"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "GENETICS 466"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "PHYSICS 247"
        }
    }
]