[
    {
        "data": {
            "description": "An expanded version of the American Heart Association's Advanced Cardiac Life Support (ACLS) course designed to provide the necessary knowledge and skills to manage the first minutes of a cardiorespiratory emergency using ACLS protocols. Opportunities to learn the proper management of the ten core cases (i.e. Asystole, Bradycardia, Tachycardia, etc.) in the three rescuer roles: lone rescuer; resuscitation team member; and resuscitation team leader. Learn essential resuscitation skills including: recognition of cardiac arrest rhythms and common bradycardias and tachycardias; proper use of conventional and automated external defibrillators (AED); use of transcutaneous pacing devices; advanced airway management; administration of drugs via intravenous and endotracheal routes; recognition of the 12-lead electrocardiogram signs of acute injury and ischemia; adult CPR.",
            "id": "ANESTHES 930",
            "parent": "ANESTHES",
            "title": "RESUSCITATION ANESTHESIOLOGY ELECTIVE"
        }
    },
    {
        "data": {
            "description": "Direct supervision by residents, fellows, and attending physicians in Anesthesiology, Neurology, and Palliative Care departments, including but not limited to the Acute Pain Service, Regional Anesthesia service, Chronic Pain Service, Chronic Pain Clinic, Headache Clinic, Carbone Cancer Center, and Madison Surgery Center. Participate in regularly scheduled supervisor-student meetings, which involve some or all of the following: rounding on service patients, interviewing clinic patients, participating in scheduled procedures, presenting cases and teaching topics, and discussing patient cases. Complete independent activities including some or all of the following: reading about patient conditions and preparing for direct patient care as needed. Complete other patient care related learning activities as assigned by instructors; these are dependent on the individual student, the patients under the student's care, and the location.",
            "id": "ANESTHES 940",
            "parent": "ANESTHES",
            "title": "INTEGRATED ELECTIVE IN PAIN MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Focus on assessing patients with urgent medical conditions, providing acute inpatient care, and transitioning patients to other care settings or home under the care of other professionals. Provide acute care in inpatient and outpatient urgent care settings as well as on the inpatient wards, and develop acute management plans and subsequent transition of care plans. Clinical experiences in acute care settings such as the emergency department and inpatient medicine (both general and subspecialty), psychiatry, and neurology. Builds upon fundamental science concepts introduced in Body in Balance and Mind and Motion, including Ohm's Law, acid-base balance, and volume regulation. Organ system-based approach employing varied modalities. Complete an integrated patient-centered experience by participating in the care of a patient from an urgent admission through inpatient treatment and discharge.",
            "id": "MEDSC-M 812",
            "parent": "MEDSC-M",
            "title": "ACUTE CARE"
        }
    },
    {
        "data": {
            "description": "In-depth exposure to inpatient and outpatient anesthesiology as well as sub-specialty anesthesiology, working under the direct supervision of Anesthesiology faculty, residents, fellows and advanced practice providers. Each student's schedule is individualized to meet each location's capacity and student preference.",
            "id": "ANESTHES 919",
            "parent": "ANESTHES",
            "title": "INDIVIDUALIZED ANESTHESIOLOGY CLINICAL ELECTIVE"
        }
    },
    {
        "data": {
            "description": "Independent research under the direct supervision of Anesthesiology Faculty. Each student's research project is individualized to meet student research goals within the context of the faculty research needs.",
            "id": "ANESTHES 910",
            "parent": "ANESTHES",
            "title": "INDEPENDENT READING & RESEARCH IN ANESTHESIOLOGY"
        }
    },
    {
        "data": {
            "description": "Care of adults and children undergoing an operation or procedure, including perioperative preparation, operative care, and post-operative cares for core clinical conditions in the specialties of anesthesia, neurosurgery, ophthalmology, general surgery, otolaryngology, urology, cardiothoracic surgery, peripheral vascular surgery, orthopedics, plastic and reconstructive surgery, and gynecology, as well as interventional radiology, procedural cardiology and gastroenterology. Basic science concepts include cerebral spinal fluid production and flow, fluids and electrolytes, consciousness, inflammation and wound healing, and cancer biology. Anatomic approach using case discussions, podcasts, curated independent reading, online nationally supported modules, and simulation skills. Longitudinal patient care experience integrating communication, evidence based medicine, health information technology, quality improvement  patient safety, professionalism, scientific inquiry, and public health.",
            "id": "MEDSC-M 813",
            "parent": "MEDSC-M",
            "title": "SURGICAL AND PROCEDURAL CARE"
        }
    },
    {
        "data": {
            "description": "Early recognition and aggressive management of shock states is one of the most challenging and rewarding patient care experiences. If done well the patient impact is incredible and lives can be saved. Integrate detailed physiologic understanding of shock states and shock evaluation - including echocardiography - with the pharmacology of shock management to develop a practical approach to patient care. Echocardiography training will emphasize obtaining views, recognizing anatomy and appreciating biventricular function as a method to differentiate shock states and select an appropriate treatment plan. The in-depth science of the course will be supplemented by clinical experiences focusing on shock evaluation and management in the cardiothoracic critical care unit, medical intensive care unit and, when possible, with cardiac anesthesiology enabling the student to develop a practical bedside approach to the evaluation and management of shock.",
            "id": "ANESTHES 911",
            "parent": "ANESTHES",
            "title": "THE SHOCK COURSE"
        }
    },
    {
        "data": {
            "description": "Independent study projects as arranged with faculty or instructional staff.",
            "id": "ANESTHES 699",
            "parent": "ANESTHES",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Participate in the care of critically ill patients assigned to the Cardiothoracic Intensive Care Unit (CITCU) critical care team. Includes post-surgical patients who have undergone coronary artery bypass grafting, cardiac valvular procedures, ventricular assist device placements, cardiac transplantation and lung transplantation. May include patients with significant cardiothoracic surgical history (e.g. patients who have a ventricular assist device or who had prior lung transplantation) who are admitted for \"medical\" reasons including sepsis or shock of varying etiologies. As part of the CTICU team, participate in management of patients requiring venovenous and venoatrial extracorporeal membrane oxygenator (ECMO) support. The students are supervised by residents (house staff), fellows (largely in critical care anesthesiology, occasionally in pulmonology  critical care) and attending physicians.",
            "id": "ANESTHES 922",
            "parent": "ANESTHES",
            "title": "CARDIOTHORACIC INTENSIVE CARE UNIT CLINICAL ANESTHESIA ELECTIVE"
        }
    },
    {
        "data": {
            "description": "Supervised by house staff, clinical anesthetists and attending physicians. Activities include: pre-operative chart review and anesthetic plan proposal, participating in scheduled procedures, presenting cases and teaching topics, and discussing patient cases. Evaluate and learn to co-manage the full spectrum of inpatient and ambulatory anesthesia patients. Care for patients undergoing sedation, monitored anesthesia care, general and regional anesthesia. Learn the indications for and data provided by various invasive and non-invasive monitoring techniques. Become familiar with relevant pharmacology including, anesthetic agents, muscle relaxants, resuscitation drugs and pain medications. Learn fundamental airway management skills including bag-mask ventilation, supraglottic airway placement, and endotracheal intubation skills. Intravenous access technique practice is taught, including a central line placement course.",
            "id": "ANESTHES 920",
            "parent": "ANESTHES",
            "title": "CLINICAL ANESTHESIOLOGY ELECTIVE"
        }
    },
    {
        "data": {
            "id": "ANESTHES",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MEDSC-M",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 812",
            "target": "ANESTHES 911"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "ANESTHES 911"
        }
    }
]