[
    {
        "data": {
            "description": "Explores animal welfare topics from the animal's perspective. Analyzes contemporary welfare issues and policies based on our scientific understanding of the experiences of animals. Emphasizes farmed animals, but also draws on examples from zoo, lab, and companion animals.",
            "id": "ANSCI 245",
            "parent": "ANSCI",
            "title": "ANIMAL WELFARE"
        }
    },
    {
        "data": {
            "description": "",
            "id": "ANSCI/DYSCI/GENETICS 951",
            "title": "SEMINAR IN ANIMAL BREEDING"
        }
    },
    {
        "data": {
            "description": "A systematic coverage of many of the animals (including birds) that humans keep as their social companions. The classification, nutritional requirements, environmental considerations, reproductive habits, health, legal aspects and economics of companion animals and their supportive organizations.",
            "id": "ANSCI 200",
            "parent": "ANSCI",
            "title": "THE BIOLOGY AND APPRECIATION OF COMPANION ANIMALS"
        }
    },
    {
        "data": {
            "description": "An advanced approach with emphasis on statistical foundations. Classical theory with extensions to maternal and paternal effects. Selection theory is considered in depth.",
            "id": "ANSCI 610",
            "parent": "ANSCI",
            "title": "QUANTITATIVE GENETICS"
        }
    },
    {
        "data": {
            "description": "An internship under guidance of a faculty or instructional academic staff member in Animal and Dairy Sciences and internship site supervisor. Students are responsible for arranging the work and credits with the faculty or instructional academic staff member and the internship site supervisor.",
            "id": "ANSCI 399",
            "parent": "ANSCI",
            "title": "COORDINATIVE INTERNSHIP/COOPERATIVE EDUCATION"
        }
    },
    {
        "data": {
            "description": "An overview of animal sciences covering anatomy, physiology, nutrition, reproduction, genetics, management, animal welfare, and behavior of domesticated animals. Food animals are emphasized to discuss their contributions to humans.",
            "id": "ANSCI/DYSCI 101",
            "title": "INTRODUCTION TO ANIMAL SCIENCES"
        }
    },
    {
        "data": {
            "description": "Application of biological, technological, and economical principles to muscle and related tissue utilized for food.",
            "id": "ANSCI/FOODSCI 305",
            "title": "INTRODUCTION TO MEAT SCIENCE AND TECHNOLOGY"
        }
    },
    {
        "data": {
            "description": "Application of genetics, systems of mating, physiology, nutrition and economics to the production of beef.",
            "id": "ANSCI 431",
            "parent": "ANSCI",
            "title": "BEEF CATTLE PRODUCTION"
        }
    },
    {
        "data": {
            "description": "Application of research findings in breeding, feeding, management and marketing to modernize production. Lab may include farm visits, practical exercises in testing changes, and \"tools\" used by producers.",
            "id": "ANSCI 432",
            "parent": "ANSCI",
            "title": "SWINE PRODUCTION"
        }
    },
    {
        "data": {
            "description": "Application of the principles of quantitative genetics to the improvement of livestock and poultry; breeding value estimation and selection techniques; effects of inbreeding and hybrid vigor; crossbreeding systems.",
            "id": "ANSCI/DYSCI 363",
            "title": "PRINCIPLES OF ANIMAL BREEDING"
        }
    },
    {
        "data": {
            "description": "Basic biology of microorganisms, including structure, function, physiology, genetics, ecology, diversity, and evolution.",
            "id": "MICROBIO 303",
            "parent": "MICROBIO",
            "title": "BIOLOGY OF MICROORGANISMS"
        }
    },
    {
        "data": {
            "description": "Chemical constitution, structures, reactions, stereochemistry of fats, phospholipids, related compounds; methods of isolation, characterization; synthesis; relation of structure to physical properties.",
            "id": "ANSCI/FOODSCI 710",
            "title": "CHEMISTRY OF THE FOOD LIPIDS"
        }
    },
    {
        "data": {
            "description": "Chemistry, nutrition, and metabolism of biological systems.",
            "id": "BIOCHEM 501",
            "parent": "BIOCHEM",
            "title": "INTRODUCTION TO BIOCHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Computing-intensive course to prepare students for genetic mapping research; linkage analysis and QTL mapping in designed crosses; linkage disequilibrium and association analysis (GWAS). Recommended preparation is undergraduate courses in genetics and statistics and prior experience writing R scripts (such as module 1 of STAT 327).",
            "id": "AGRONOMY/ANSCI/GENETICS/HORT 615",
            "title": "GENETIC MAPPING"
        }
    },
    {
        "data": {
            "description": "Core organic chemistry concepts of structure, reactivity, and synthesis with regards to the functional groups commonly found in commercial and biological substances. Covers a selection of topics fromCHEM 343and345.",
            "id": "CHEM 341",
            "parent": "CHEM",
            "title": "ELEMENTARY ORGANIC CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Covers growth and development of an animal from a single cell to an organism and factors such as nutrition, hormone, genetics and gut microbials influencing growth and development in both cell and tissue levels. Includes the molecular and cellular basis of prenatal and postnatal growth and development. Focuses on development and growth of tissues including muscle, adipose, connective, mammary, and bone tissues that are associated with animal production. Also includes the use of growth promotants in livestock to improve growth performance and increase the quality of carcasses and animal production.",
            "id": "ANSCI 336",
            "parent": "ANSCI",
            "title": "ANIMAL GROWTH AND DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Covers physiological processes that regulate the body and the anatomy and function of different physiological systems. Includes interactions between organ systems, analysis of a single organ system from the molecular to the organismal, and comparisons and contrasts of organ systems among different domestic animal species.",
            "id": "ANSCI/DYSCI 373",
            "title": "ANIMAL PHYSIOLOGY"
        }
    },
    {
        "data": {
            "description": "Covers the current key challenges and opportunities in the broad fields of animal agriculture, animal biology, animal health, and veterinary medicine, as well as internship and career opportunities and professional development activities that will maximize the value of an undergraduate career at UW-Madison and provide preparation for post-graduation endeavors.",
            "id": "ANSCI 135",
            "parent": "ANSCI",
            "title": "GRAND CHALLENGES AND CAREER OPPORTUNITIES IN ANIMAL AND DAIRY SCIENCES"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Develop an understanding of the global food supply from farm to table by exploring ruminant animals, non-ruminant animals including insects, and selected agricultural materials. Topics such as the following will be discussed: land usage, environmental impacts from different feeding operations, utilization of food waste, and health risks associated with food consumption.",
            "id": "ANSCI 210",
            "parent": "ANSCI",
            "title": "YOU AND YOUR FOOD: FARM TO TABLE"
        }
    },
    {
        "data": {
            "description": "Discuss nutrient requirements, composition of ingredients used to meet requirements and the mathematical steps involved in diet formulation with emphasis on research animals and human subjects.",
            "id": "ANSCI/NUTRSCI 626",
            "title": "EXPERIMENTAL DIET DESIGN"
        }
    },
    {
        "data": {
            "description": "Discussion of literature that has a bearing on animal nutrition. Students are to survey the literature and present a seminar.",
            "id": "ANSCI/DYSCI 931",
            "title": "SEMINAR IN ANIMAL NUTRITION"
        }
    },
    {
        "data": {
            "description": "Examination of the structure and function of microbial communities that live inside and on host organisms (plants, animals, and humans). Introduction to general concepts of the microbiome and microbiota, and their relationship to host nutrition, health, and disease.",
            "id": "ANSCI/BOTANY/MICROBIO 335",
            "title": "THE MICROBIOME OF PLANTS, ANIMALS, AND HUMANS"
        }
    },
    {
        "data": {
            "description": "Examines issues related to global agriculture and healthy sustainable development. Using a regional approach and focusing on crops and livestock case studies, students will learn the interdependence between US agriculture and agriculture in emerging economies. Some topics covered include population and food, immigration, the environment; crop and livestock agriculture; global trade; sustainability; and the role of women in agriculture and the role of dairy products in a healthy diet.",
            "id": "ANSCI/DYSCI/FOODSCI/SOILSCI 473",
            "title": "INTERNATIONAL FIELD STUDY IN ANIMAL AGRICULTURE AND SUSTAINABLE DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Examines issues related to global agriculture and healthy sustainable development. Using a regional approach and focusing on crops and livestock case studies, students will learn the interdependence between US agriculture and agriculture in emerging economies. Some topics covered include population and food, immigration, the environment; crop and livestock agriculture; global trade; sustainability; food security, the role of women in agriculture, and the role of dairy products in a healthy diet.",
            "id": "ANSCI/DYSCI/FOODSCI/SOILSCI 472",
            "title": "ANIMAL AGRICULTURE AND GLOBAL SUSTAINABLE DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Experimental design and proper data analysis are critical processes for scientific research. Planning and performing research studies have statistical implications that influence how results are interpreted. Learn the fundamentals of generalized linear models, experimental design, and data analysis using common examples from biological studies.",
            "id": "ANSCI 865",
            "parent": "ANSCI",
            "title": "DESIGN AND ANALYSIS OF BIOLOGICAL STUDIES"
        }
    },
    {
        "data": {
            "description": "Explores a detailed atomic and molecular view of matter and its interactions, with a specific focus on quantum theory, molecular structure, and chemical bonding. Application required for enrollment.",
            "id": "CHEM 115",
            "parent": "CHEM",
            "title": "CHEMICAL PRINCIPLES I"
        }
    },
    {
        "data": {
            "description": "Explores methods for interrogating structure-function relationships, molecular profiles, and microstructure of foods. Provides hands-on experience using computational approaches to model protein-small molecule interactions, analysis of small molecules using high-resolution MS, and protein composition and morphology with fluorescence spectroscopy and microscopy. Knowledge of food chemistry or organic chemistry (such asFOOD SCI 410,CHEM 341,343, or345) required.",
            "id": "ANSCI/FOODSCI 711",
            "title": "FOOD BIOCHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Focuses on calf and heifer nutrition, regulation of dry matter intake, plant and forage chemistry, vitamins, lipids, and starch.",
            "id": "ANSCI/DYSCI 825",
            "title": "RUMINANT NUTRITIONAL PHYSIOLOGY II"
        }
    },
    {
        "data": {
            "description": "Focuses on rumen microbiology, metabolite modeling, as well as protein and VFA nutrition and metabolism.",
            "id": "ANSCI/DYSCI 824",
            "title": "RUMINANT NUTRITIONAL PHYSIOLOGY I"
        }
    },
    {
        "data": {
            "description": "Food laws and regulations, regulatory and commerical grading standards used in the food industry.",
            "id": "ANSCI/FOODSCI 321",
            "title": "FOOD LAWS AND REGULATIONS"
        }
    },
    {
        "data": {
            "description": "Full-time off-campus work experience which combines classroom theory with practical knowledge of operations to provide a background upon which to base a professional career. Students receive credit only for the term in which they are actively enrolled and working. The same work experience may not count toward credit in another course.",
            "id": "ANSCI 1",
            "parent": "ANSCI",
            "title": "COOPERATIVE EDUCATION/CO-OP IN ANIMAL SCIENCES"
        }
    },
    {
        "data": {
            "description": "Fundamental business and economic principles and practices for successful poultry production with emphasis on problem solving in flock management.",
            "id": "ANSCI 315",
            "parent": "ANSCI",
            "title": "POULTRY ENTERPRISE MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "General biological principles. Topics include: evolution, ecology, animal behavior, cell structure and function, genetics and molecular genetics and the physiology of a variety of organ systems emphasizing function in humans.",
            "id": "BIOLOGY/ZOOLOGY 101",
            "title": "ANIMAL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "General concepts of animal biology at an introductory level emphasizing the evolutionary relationships between animals. Learn about general body plans and strategies used to accomplish the basic tasks of staying alive in major animal groups using preserved and live animals. Study the diversity within each group of animals by integrating the body plans with the lifestyle and ecology of animals. Dissections of earthworm, freshwater mussel, squid, sea star, and rat aid the study of these general principles.",
            "id": "BIOLOGY/ZOOLOGY 102",
            "title": "ANIMAL BIOLOGY LABORATORY"
        }
    },
    {
        "data": {
            "description": "Genomics has revolutionized many fields of science, including animal breeding, plant breeding, physiology, microbiology, and human medicine. A basic overview of the latest concepts in genomics, including 3D genome organization, the importance of genome annotation, the use of genomic testing in plant and animal breeding, the potential of genomic prediction on human medicine, and the latest advances in omics integration.",
            "id": "ANSCI 366",
            "parent": "ANSCI",
            "title": "CONCEPTS IN GENOMICS"
        }
    },
    {
        "data": {
            "description": "Hands-on experience and demonstrations to develop practical skills with animals and to better understand the application of science to food production animals. It covers anatomy, physiology, nutrition, reproduction, genetics, management, animal welfare, and behavior of domesticated animals.",
            "id": "ANSCI/DYSCI 102",
            "title": "INTRODUCTION TO ANIMAL SCIENCES LABORATORY"
        }
    },
    {
        "data": {
            "description": "History of artificial incubation relevant to the U.S. hatching industry. Practices involved in successful incubation of hatching eggs. Embryonic development in birds. Management factors involved in breeder hen production and operating a hatchery.",
            "id": "ANSCI 511",
            "parent": "ANSCI",
            "title": "BREEDER FLOCK AND HATCHERY MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Honors research work under direct guidance of a faculty member in an area of Animal Sciences.  Students are responsible for arranging the work and credits with the supervising instructor.",
            "id": "ANSCI 289",
            "parent": "ANSCI",
            "title": "HONORS INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Independent research in preparation of a graduate thesis under supervision of a faculty member.",
            "id": "ANSCI 990",
            "parent": "ANSCI",
            "title": "RESEARCH"
        }
    },
    {
        "data": {
            "description": "Individual advanced work in an area of Animal Sciences under the direct guidance of a faculty member.",
            "id": "ANSCI 699",
            "parent": "ANSCI",
            "title": "SPECIAL PROBLEMS"
        }
    },
    {
        "data": {
            "description": "Individual introductory to intermediate work under direct guidance of a faculty member in an area of Animal Sciences.  Students are responsible for arranging the work and credits with the supervising instructor.",
            "id": "ANSCI 299",
            "parent": "ANSCI",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Individual study for majors completing theses as arranged with a faculty member.",
            "id": "ANSCI 691",
            "parent": "ANSCI",
            "title": "THESIS"
        }
    },
    {
        "data": {
            "description": "Individual study for majors completing theses for Honors degrees as arranged with a faculty member.",
            "id": "ANSCI 681",
            "parent": "ANSCI",
            "title": "SENIOR HONOR THESIS"
        }
    },
    {
        "data": {
            "description": "Instructional orientation to teaching at the higher education level in the agricultural and life sciences, direct teaching experience under faculty supervision, experience in testing and evaluation of students, and the analysis of teaching performance.",
            "id": "ANSCI 799",
            "parent": "ANSCI",
            "title": "PRACTICUM IN ANIMAL SCIENCES TEACHING"
        }
    },
    {
        "data": {
            "description": "Integrates nutritional and biochemical concepts to understand digestive and metabolic processes in dairy and beef cattle, which are then quantitatively represented to predict and manipulate production and health outcomes.",
            "id": "ANSCI/DYSCI 414",
            "title": "RUMINANT NUTRITION & METABOLISM"
        }
    },
    {
        "data": {
            "description": "Introduces key concepts of sensor technology used for livestock and companion animal monitoring and veterinary medicine. Describes applications of Artificial Intelligence (AI) systems for livestock animals and veterinary medicine, including animal monitoring, computer-aided diagnosis, and optimized farm management decisions.",
            "id": "ANSCI/BSE 344",
            "title": "DIGITAL TECHNOLOGIES FOR ANIMAL MONITORING"
        }
    },
    {
        "data": {
            "description": "Introduction to bird biology, ecology, and behavior. Topics include the evolutionary origin of birds and flight, anatomy and physiology, functional morphology, migration, communication, reproductive strategies, ecological adaptations and roles, and biogeographical patterns.",
            "id": "ANSCI/F&WECOL/ZOOLOGY 520",
            "title": "ORNITHOLOGY"
        }
    },
    {
        "data": {
            "description": "Introduction to the basic principles and concepts of the biology of plants. an integrative approach stressing evolutionary sequences and the relationship between structure and function at succeeding levels of organization: molecule, cell, organism, population, community. Correlated lectures, laboratories, and discussions.",
            "id": "BIOLOGY/BOTANY 130",
            "title": "GENERAL BOTANY"
        }
    },
    {
        "data": {
            "description": "Methods of assessing information quality are studied. Each student develops an analytical and critical seminar on a topic of personal interest in the animal sciences.",
            "id": "ANSCI 435",
            "parent": "ANSCI",
            "title": "ANIMAL SCIENCES PROSEMINAR"
        }
    },
    {
        "data": {
            "description": "Nutrient requirements for growth and production of monogastric animals. Discuss concepts of establishing nutrient requirements and feeding strategies. Laboratory exercises are designed to develop problem solving skills required for the assessment of nutritional adequacy and economical soundness of feeding programs.",
            "id": "ANSCI 415",
            "parent": "ANSCI",
            "title": "APPLICATION OF MONOGASTRIC NUTRITION PRINCIPLES"
        }
    },
    {
        "data": {
            "description": "Nutrients and their assimilation, function, and interactions that affect metabolism in mammals.  Differences among species will be used to emphasize unique digestive and physiological functions and how these differences affect metabolism of nutrients. Humans will be used in some comparisons. Follows physiological progression of nutrients, starting with an overview of the digestive tract followed by water and builds on specific roles of nutrients and substrates needed to provide basic processes required for maintenance, tissue accretion, and homeostatic regulation of nutrients.",
            "id": "ANSCI/DYSCI/NUTRSCI 311",
            "title": "COMPARATIVE ANIMAL NUTRITION"
        }
    },
    {
        "data": {
            "description": "Outdoor and indoor labs/lectures emphasizing identification of southern Wisconsin birds by sight and vocalization. Two required Saturday field trips in Southern Wisconsin.",
            "id": "ANSCI/F&WECOL/ZOOLOGY 521",
            "title": "BIRDS OF SOUTHERN WISCONSIN"
        }
    },
    {
        "data": {
            "description": "Overview of poultry science and production.  Topics include anatomy and physiology, nutrition, health, reproduction, genetics, egg and meat quality, and management.  Includes information on poultry flocks of various sizes and purposes, from hobby flocks to commercial production.",
            "id": "ANSCI 140",
            "parent": "ANSCI",
            "title": "INTRODUCTION TO POULTRY: FROM BACKYARD CHICKENS TO COMMERCIAL PRODUCTION"
        }
    },
    {
        "data": {
            "description": "Physical, biological and social nature of animal agriculture systems and their improvement in developing countries; analysis of the state of livestock research and development in the developing countries and the world role of U.S. animal agriculture.",
            "id": "ANSCI/DYSCI 370",
            "title": "LIVESTOCK PRODUCTION AND HEALTH IN AGRICULTURAL DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Principles and application of chemical equilibrium, coordination chemistry, oxidation-reduction and electrochemistry, kinetics, nuclear chemistry, introduction to organic chemistry, and chemistry laboratory skills.",
            "id": "CHEM 104",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Principles and procedures in the commercial manufacture of processed meat products; sausage manufacturing, curing, smoking, freezing and packaging.",
            "id": "ANSCI/FOODSCI 515",
            "title": "COMMERCIAL MEAT PROCESSING"
        }
    },
    {
        "data": {
            "description": "Principles of organ and system function with emphasis on male and female reproduction, embryonic development and factors affecting hatchability.",
            "id": "ANSCI 503",
            "parent": "ANSCI",
            "title": "AVIAN PHYSIOLOGY"
        }
    },
    {
        "data": {
            "description": "Principles of reproductive physiology, improvement of fertility, and artificial insemination.",
            "id": "ANSCI/DYSCI 434",
            "title": "REPRODUCTIVE PHYSIOLOGY"
        }
    },
    {
        "data": {
            "description": "Procurement, processing and distribution of poultry meat, eggs and derived products; factors affecting quality, including methods of determining quality.",
            "id": "ANSCI 508",
            "parent": "ANSCI",
            "title": "POULTRY PRODUCTS TECHNOLOGY"
        }
    },
    {
        "data": {
            "description": "Promotes scientific and professional development. Presenters develop and deliver research presentations to a scientific audience, field questions, and receive critiques about their presentation style and scientific approach. Additional presentations include professional development, career advancement opportunities, and topics of interest to the endocrinology and reproduction community at large.",
            "id": "ANSCI/OBS&GYN/ZOOLOGY 954",
            "title": "SEMINAR IN ENDOCRINOLOGY-REPRODUCTIVE PHYSIOLOGY"
        }
    },
    {
        "data": {
            "description": "Provides a conceptual understanding of nutrient requirements for optimal growth and production of commercial poultry species. The use of computer programming for feed formulation is emphasized.",
            "id": "ANSCI 314",
            "parent": "ANSCI",
            "title": "POULTRY NUTRITION"
        }
    },
    {
        "data": {
            "description": "Provides a knowledgebase in both theoretical and applied scientific approaches associated with microbiome sciences in animal production systems. Covers the basic principles of microbiology through applied practical approaches in using cross-species comparisons in companion and agricultural species from classical microbiological techniques to novel next-generation sequence-based approaches.",
            "id": "ANSCI 420",
            "parent": "ANSCI",
            "title": "MICROBIOMES OF ANIMAL SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Provides an area equivalency for courses taken on Madison Study Abroad Programs that do not equate to existing UW courses.",
            "id": "ANSCI 400",
            "parent": "ANSCI",
            "title": "STUDY ABROAD IN ANIMAL SCIENCES"
        }
    },
    {
        "data": {
            "description": "Provides an introduction to and exploration of the interconnectivity between factors that affect health and disease and the central role of the immune system using infectious disease in animals as a key focus. Explores principal causes and identification of animal diseases, common diseases of farm animals, zoonoses and public health, disease prevention and management including biosecurity measures and host immune responses. Fosters appreciation for the translatability and universality of knowledge between human and animal health and disease.",
            "id": "ANSCI/DYSCI 320",
            "title": "ANIMAL HEALTH AND DISEASE"
        }
    },
    {
        "data": {
            "description": "Provides an introduction to human and animal relationships from prehistory to the present. Examines how animals have influenced social and economic structures of past societies, with a focus on the advent of domestication. Explores the cultural and economic changes that domestication has had on human societies, as well as the behavioral, genetic, and morphological changes that this process had on once wild animals. Emphasizes the methods used to retrace human-animal interactions, drawing on cross-cultural examples from anthropology, ethnozoology, archaeology, history, and genetics.",
            "id": "ANSCI 240",
            "parent": "ANSCI",
            "title": "ANCIENT ANIMALS AND PEOPLES"
        }
    },
    {
        "data": {
            "description": "Provides immersive, hands-on training in large animal procedural and surgical techniques to develop knowledge and appreciation for the interconnectivity and interdependence between physiological processes of the various organ systems.  Serves as an introduction to translatable skills for careers in biomedical animal research, veterinary medicine, or human medicine.",
            "id": "ANSCI 377",
            "parent": "ANSCI",
            "title": "INTEGRATIVE ANIMAL PHYSIOLOGY LABORATORY"
        }
    },
    {
        "data": {
            "description": "Second semester of individual study for majors completing theses as arranged with a faculty member.",
            "id": "ANSCI 692",
            "parent": "ANSCI",
            "title": "THESIS"
        }
    },
    {
        "data": {
            "description": "Second semester of individual study for majors completing theses for Honors degrees as arranged with a faculty member.",
            "id": "ANSCI 682",
            "parent": "ANSCI",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Specialized subject matter of current interest to graduate students.",
            "id": "ANSCI 875",
            "parent": "ANSCI",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "Stoichiometry and the mole concept, the behavior of gases, liquids and solids, thermochemistry, electronic structure of atoms and chemical bonding, descriptive chemistry of selected elements and compounds, intermolecular forces, and chemistry laboratory skills.",
            "id": "CHEM 103",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "The genetic basis for predisposition to disease or resistance to disease in livestock and companion animal species. Genetic defects, their discovery, diagnosis and treatment.",
            "id": "ANSCI/DYSCI 362",
            "title": "VETERINARY GENETICS"
        }
    },
    {
        "data": {
            "description": "The molecular basis for inheritance of monogenic and polygenic traits related to animal disease and production. An introduction to the principles of improving animal health and performance by selection and mating systems in companion animals, horses, livestock, and poultry.",
            "id": "ANSCI/DYSCI 361",
            "title": "INTRODUCTION TO ANIMAL AND VETERINARY GENETICS"
        }
    },
    {
        "data": {
            "description": "The occurrence, etiology, clinical signs, control and prevention of infectious and noninfectious diseases commonly affecting domestically reared poultry. Instruction in avian necropsy, zoonosis, sanitation and regulation.",
            "id": "ANSCI 512",
            "parent": "ANSCI",
            "title": "MANAGEMENT FOR AVIAN HEALTH"
        }
    },
    {
        "data": {
            "description": "The two semester sequenceMATH 112-MATH 113covers similar material asMATH 114, but in a slower pace. Not recommended for students with less than an AB inMATH 96.",
            "id": "MATH 114",
            "parent": "MATH",
            "title": "ALGEBRA AND TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "This course will provide an introduction to genetic epidemiology. Topics will include a general overview of genetics and Mendelian and complex inheritance, as well as various elements of study design, including participant ascertainment; phenotype definition; biologic sample selection; genotyping, sequencing, and quality control; measurement of covariates, and choice of analytic methods. We will briefly discuss some of the original study designs and then focus on current study designs for the remainder of the class. Additional emerging topics will be briefly touched upon. Students will complete short homework assignments to enforce concepts learned during lectures, discuss journal articles, and prepare a very short grant application for the mid-term project. In the final weeks of class, students will work together to analyze data from a real genetic study, prepare tables, interpret the findings, and present their project to their peers.",
            "id": "ANSCI/GENETICS/POPHLTH 849",
            "title": "GENETIC EPIDEMIOLOGY"
        }
    },
    {
        "data": {
            "description": "Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Part of a 2-semester sequence withMATH 217; these two courses together are equivalent toMATH 114and221.",
            "id": "MATH 171",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY I"
        }
    },
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics and selected topics in Animal Physiology.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Topics include: selected topics in plant physiology, a survey of the five major kingdoms of organisms, speciation and evolutionary theory, and ecology at multiple levels of the biological hierarchy.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Various topics in Animal Science of current interest to undergraduate students.",
            "id": "ANSCI 375",
            "parent": "ANSCI",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "id": "ANSCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "BIOCHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MICROBIO",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ANSCI/DYSCI 101",
            "target": "ANSCI 314"
        }
    },
    {
        "data": {
            "source": "ANSCI/DYSCI 101",
            "target": "ANSCI 315"
        }
    },
    {
        "data": {
            "source": "ANSCI/DYSCI 101",
            "target": "ANSCI 503"
        }
    },
    {
        "data": {
            "source": "ANSCI/DYSCI 101",
            "target": "ANSCI 511"
        }
    },
    {
        "data": {
            "source": "ANSCI/DYSCI 101",
            "target": "ANSCI 512"
        }
    },
    {
        "data": {
            "source": "ANSCI/DYSCI 101",
            "target": "ANSCI/DYSCI 102"
        }
    },
    {
        "data": {
            "source": "ANSCI/DYSCI 101",
            "target": "ANSCI/DYSCI 370"
        }
    },
    {
        "data": {
            "source": "ANSCI/DYSCI 361",
            "target": "ANSCI 431"
        }
    },
    {
        "data": {
            "source": "ANSCI/DYSCI 361",
            "target": "ANSCI 432"
        }
    },
    {
        "data": {
            "source": "ANSCI/DYSCI 361",
            "target": "ANSCI/DYSCI 362"
        }
    },
    {
        "data": {
            "source": "ANSCI/DYSCI 361",
            "target": "ANSCI/DYSCI 363"
        }
    },
    {
        "data": {
            "source": "ANSCI/DYSCI 434",
            "target": "ANSCI 431"
        }
    },
    {
        "data": {
            "source": "ANSCI/DYSCI/FOODSCI/SOILSCI 472",
            "target": "ANSCI/DYSCI/FOODSCI/SOILSCI 473"
        }
    },
    {
        "data": {
            "source": "ANSCI/DYSCI/NUTRSCI 311",
            "target": "ANSCI 415"
        }
    },
    {
        "data": {
            "source": "ANSCI/DYSCI/NUTRSCI 311",
            "target": "ANSCI 431"
        }
    },
    {
        "data": {
            "source": "ANSCI/DYSCI/NUTRSCI 311",
            "target": "ANSCI/DYSCI 414"
        }
    },
    {
        "data": {
            "source": "ANSCI/FOODSCI 305",
            "target": "ANSCI/FOODSCI 515"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 501",
            "target": "ANSCI/DYSCI/NUTRSCI 311"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "ANSCI 366"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 152"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 101"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "target": "BIOLOGY/ZOOLOGY 102"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ANSCI 336"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ANSCI 366"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ANSCI 377"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ANSCI 420"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ANSCI/DYSCI 320"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ANSCI/DYSCI 361"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ANSCI/DYSCI 373"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ANSCI/DYSCI 434"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ANSCI/F&WECOL/ZOOLOGY 520"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ANSCI/F&WECOL/ZOOLOGY 521"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ANSCI/FOODSCI 305"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 151"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "MICROBIO 303"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 102",
            "target": "ANSCI 336"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 102",
            "target": "ANSCI 366"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 102",
            "target": "ANSCI 377"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 102",
            "target": "ANSCI 420"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 102",
            "target": "ANSCI/DYSCI 320"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 102",
            "target": "ANSCI/DYSCI 361"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 102",
            "target": "ANSCI/DYSCI 373"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 102",
            "target": "ANSCI/DYSCI 434"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 102",
            "target": "ANSCI/F&WECOL/ZOOLOGY 520"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 102",
            "target": "ANSCI/F&WECOL/ZOOLOGY 521"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 102",
            "target": "ANSCI/FOODSCI 305"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 341"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "MICROBIO 303"
        }
    },
    {
        "data": {
            "source": "CHEM 115",
            "target": "ANSCI 508"
        }
    },
    {
        "data": {
            "source": "CHEM 115",
            "target": "ANSCI/FOODSCI 305"
        }
    },
    {
        "data": {
            "source": "CHEM 341",
            "target": "ANSCI 420"
        }
    },
    {
        "data": {
            "source": "CHEM 341",
            "target": "BIOCHEM 501"
        }
    },
    {
        "data": {
            "source": "MATH 114",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "ANSCI/BSE 344"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 114"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "MICROBIO 303",
            "target": "ANSCI/BOTANY/MICROBIO 335"
        }
    }
]