[
    {
        "data": {
            "description": "An integrated anthropological view of the city and urbanization as a human and cultural phenomenon, including major theories and concrete data from both 'first', 'second' and 'third' worlds, emphasizing the continuity of urban development from the first cities until now.",
            "id": "ANTHRO 307",
            "parent": "ANTHRO",
            "title": "URBAN ANTHROPOLOGY"
        }
    },
    {
        "data": {
            "description": "Contributions of women anthropologists to feminist and anthropological theories and research methods. Field research and gender. Current debates in women's studies and anthropology in light of recent research on women and gender in cross-cultural perspective.",
            "id": "ANTHRO/GEN&WS 443",
            "title": "ANTHROPOLOGY BY WOMEN"
        }
    },
    {
        "data": {
            "description": "Focuses on music's significant role in the formation and maintenance of Brazilian national identity. Learn how a variety of Brazilian individuals, groups, and institutions have contributed to popular and scholarly debates about Brazilian culture, identity, and forms of belonging. These discussions will be anchored to important themes in Brazil's recent history, present, and imagined future, such as cultural cannibalism (antropofagia), and racial hybridity (mestiçagem). Gain insight into how Brazilian artists and their audiences have debated race and racism through expressive means by analyzing a variety of anthropological and ethnomusicological texts about Brazilian popular music, literature, and its most famous annual ritual, Carnival.",
            "id": "ANTHRO 340",
            "parent": "ANTHRO",
            "title": "MUSIC, RACE, AND CULTURE IN BRAZIL"
        }
    },
    {
        "data": {
            "description": "General understanding of humans in relation to cultures, evolutionary development and racial diversity, capacities for society, and the development of the world's major cultures.",
            "id": "ANTHRO 100",
            "parent": "ANTHRO",
            "title": "GENERAL ANTHROPOLOGY"
        }
    },
    {
        "data": {
            "description": "Global archaeological survey of the origins of pristine civilizations beginning with the development of food production and ending with the emergence of the world's first civilizations. Focus of attention: Near East, Egypt, the Indus Valley, North China, Mesoamerica, and Peru.",
            "id": "ANTHRO 322",
            "parent": "ANTHRO",
            "title": "THE ORIGINS OF CIVILIZATION"
        }
    },
    {
        "data": {
            "description": "Intellectual history of the major theoretical debates and key figures in cultural anthropology up to the 1960's.",
            "id": "ANTHRO 860",
            "parent": "ANTHRO",
            "title": "HISTORY OF ANTHROPOLOGICAL THEORY"
        }
    },
    {
        "data": {
            "description": "Supervised research on topics selected by students. Independently design a research project, synthesize methods and empirical results, and report one's findings. Develop the skills necessary for independent research in Primatology.",
            "id": "ANTHRO 420",
            "parent": "ANTHRO",
            "title": "INTRODUCTION TO PRIMATOLOGICAL RESEARCH"
        }
    },
    {
        "data": {
            "description": "Uses the conceptual tools of cultural anthropology to explore the wide range of children's and youths' experiences outside of and beyond school.",
            "id": "ANTHRO 415",
            "parent": "ANTHRO",
            "title": "THE ANTHROPOLOGICAL STUDY OF CHILDREN & YOUTH"
        }
    },
    {
        "data": {
            "description": "A comparative examination of the legal realm of tribal and peasant societies as seen in cross-cultural perspective. Describes the relationship of law to anthropology, presents theories of change of legal systems and provides ethnographic case studies.",
            "id": "ANTHRO 448",
            "parent": "ANTHRO",
            "title": "ANTHROPOLOGY OF LAW"
        }
    },
    {
        "data": {
            "description": "A comprehensive examination of skeletal anatomy at both the gross and histologic levels. Utilizes laboratory methods for the archaeological identification of skeletal fragments; criteria for the estimation of age, sex, stature, and other aspects of forensic anthropology.",
            "id": "ANTHRO 303",
            "parent": "ANTHRO",
            "title": "HUMAN SKELETAL ANATOMY"
        }
    },
    {
        "data": {
            "description": "A course carried with a UW-Madison study abroad program which has no equivalent on this campus. Enrollment in a UW-Madison resident study abroad program",
            "id": "ANTHRO 453",
            "parent": "ANTHRO",
            "title": "STUDY ABROAD: TOPICS IN ARCHAEOLOGY"
        }
    },
    {
        "data": {
            "description": "A course carried with a UW-Madison study abroad program which has no equivalent on this campus. Enrollment in a UW-Madison resident study abroad program",
            "id": "ANTHRO 454",
            "parent": "ANTHRO",
            "title": "STUDY ABROAD: TOPICS IN BIOLOGICAL ANTHROPOLOGY"
        }
    },
    {
        "data": {
            "description": "A course carried with a UW-Madison study abroad program which has no equivalent on this campus. Enrollment in a UW-Madison resident study abroad program",
            "id": "ANTHRO 455",
            "parent": "ANTHRO",
            "title": "STUDY ABROAD: TOPICS IN CULTURAL ANTHROPOLOGY"
        }
    },
    {
        "data": {
            "description": "A detailed overview of field methods for behavioral ecologists, focusing specifically on behavioral and ecological sampling techniques. It addresses the challenging process of situating an empirical study within the context of theoretical paradigms.",
            "id": "ANTHRO/PSYCH 906",
            "title": "METHODS AND HYPOTHESIS-TESTING FOR BEHAVIORAL ECOLOGISTS"
        }
    },
    {
        "data": {
            "description": "A survey of the archaeological record of human development in Africa, beginning over two million years ago and continuing through the transition to farming and metallurgy; greatest emphasis on the stone age portion of prehistory.",
            "id": "ANTHRO 333",
            "parent": "ANTHRO",
            "title": "PREHISTORY OF AFRICA"
        }
    },
    {
        "data": {
            "description": "Advanced directed study projects as arranged with a faculty member.",
            "id": "ANTHRO 698",
            "parent": "ANTHRO",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Advanced directed study projects as arranged with a faculty member.",
            "id": "ANTHRO 699",
            "parent": "ANTHRO",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Advanced level mentored reading and research for students with dissertator status.",
            "id": "ANTHRO 990",
            "parent": "ANTHRO",
            "title": "RESEARCH AND THESIS"
        }
    },
    {
        "data": {
            "description": "Advanced level mentored reading and research for students with dissertator status.",
            "id": "ANTHRO 999",
            "parent": "ANTHRO",
            "title": "READING AND RESEARCH"
        }
    },
    {
        "data": {
            "description": "Advanced morphology and syntax; advanced conversation and composition; cultural background of Quechua speaking peoples through reading of myths, legends and folktales.",
            "id": "ANTHRO/LACIS 363",
            "title": "INTERMEDIATE QUECHUA"
        }
    },
    {
        "data": {
            "description": "African society and culture, polity and economy in multidisciplinary perspectives from prehistory and ancient kingdoms through the colonial period to contemporary developments, including modern nationalism, economic development and changing social structure.",
            "id": "AFRICAN/AFROAMER/ANTHRO/GEOG/HISTORY/POLISCI/SOC 277",
            "title": "AFRICA: AN INTRODUCTORY SURVEY"
        }
    },
    {
        "data": {
            "description": "An exploration of the foundational concepts and methods of educational anthropology. Examines anthropological inquiry on educational research with particular reference to cultural perspectives on education and educational systems, learning as cultural transmission, and application of anthropological knowledge to curriculum.",
            "id": "ANTHRO/EDPOL 570",
            "title": "ANTHROPOLOGY AND EDUCATION"
        }
    },
    {
        "data": {
            "description": "An introduction to historical approaches in anthropology: topics covered include early theories, evolutionism, ethnohistory, culture change, ritual and symbolic transformation, indigenous/oral histories, conceptions of time and the analysis of texts and visual images.",
            "id": "ANTHRO 424",
            "parent": "ANTHRO",
            "title": "HISTORICAL ANTHROPOLOGY"
        }
    },
    {
        "data": {
            "description": "An introduction to the genres of American Indian Folklore. Special attention is given to creation stories, trickster tales, and the relationship between folklore and historical memory.",
            "id": "AMERIND/ANTHRO/FOLKLORE 431",
            "title": "AMERICAN INDIAN FOLKLORE"
        }
    },
    {
        "data": {
            "description": "An introduction to the principles and techniques in the identification and interpretation of animal bones. Includes analysis of an archaeological bone assemblage.",
            "id": "ANTHRO 391",
            "parent": "ANTHRO",
            "title": "BONES FOR THE ARCHAEOLOGIST"
        }
    },
    {
        "data": {
            "description": "An introduction to the techniques of field archaeology, including site survey, mapping, and excavation by participation in an actual, off-campus archaeological field project. Also instruction in the description and analysis of artifacts. Includes full-time, off-campus, on-site excavation work, which typically takes place outside of Madison. Excavation sites vary.",
            "id": "ANTHRO 370",
            "parent": "ANTHRO",
            "title": "FIELD COURSE IN ARCHAEOLOGY"
        }
    },
    {
        "data": {
            "description": "Analytical treatment of current anthropological approaches to the study of ethnicity, nation, and nationalism accompanied by case studies.",
            "id": "ANTHRO 606",
            "parent": "ANTHRO",
            "title": "ETHNICITY, NATIONS, AND NATIONALISM"
        }
    },
    {
        "data": {
            "description": "Anthropological approaches. Illustrated by critical considerations of outstanding contributions. Selected religious systems; areal and topical comparative studies; religion as an ethnographic problem.",
            "id": "ANTHRO/RELIGST 343",
            "title": "ANTHROPOLOGY OF RELIGION"
        }
    },
    {
        "data": {
            "description": "Anthropological theory, methodology, and field techniques with specific reference to school ethnography and cross-cultural studies of socialization and education. Topics vary.",
            "id": "ANTHRO/EDPOL 970",
            "title": "SEMINAR IN ANTHROPOLOGY AND EDUCATION"
        }
    },
    {
        "data": {
            "description": "Basic principles of ecology and interrelations between individuals, populations, communities, ecosystems and their environment; transmission genetics and introduction to population genetics; origin of life, evolutionary mechanisms, ancestral relationships among species, and the diversity of life.",
            "id": "BIOCORE 381",
            "parent": "BIOCORE",
            "title": "EVOLUTION, ECOLOGY, AND GENETICS"
        }
    },
    {
        "data": {
            "description": "Behavior, including its development, motivation, frustrations, emotion, intelligence, learning, forgetting, personality, language, thinking, and social behavior.",
            "id": "PSYCH 202",
            "parent": "PSYCH",
            "title": "INTRODUCTION TO PSYCHOLOGY"
        }
    },
    {
        "data": {
            "description": "Comparison and analysis of political structures, behavior and processes among selected peoples of the world; special emphasis on leadership, authority, power, and the origins of the states; the relevance of primitive political systems to anthropological theory and to the comparative study of politics.",
            "id": "ANTHRO 350",
            "parent": "ANTHRO",
            "title": "POLITICAL ANTHROPOLOGY"
        }
    },
    {
        "data": {
            "description": "Comparison of the form and function of such social institutions as marriage and the family, age and sex groups, secret societies, task groups, and class in cross-cultural perspective.",
            "id": "ANTHRO 345",
            "parent": "ANTHRO",
            "title": "FAMILY, KIN AND COMMUNITY IN ANTHROPOLOGICAL PERSPECTIVE"
        }
    },
    {
        "data": {
            "description": "Content varies. Some representative topics: peoples and cultures of the European part of the USSR, peoples and cultures of Soviet Asia, anthropology of space and time, anthropology and history, pastoralists and pastoral Nomads, American Indian folklore, etc.",
            "id": "ANTHRO 330",
            "parent": "ANTHRO",
            "title": "TOPICS IN ETHNOLOGY"
        }
    },
    {
        "data": {
            "description": "Continuation of advanced conversation and composition; cultural background of Quechua-speaking peoples through reading of myths, legends, folktales; problems in dialectology.",
            "id": "ANTHRO/LACIS 364",
            "title": "ADVANCED QUECHUA"
        }
    },
    {
        "data": {
            "description": "Continued introduction to Yucatec Maya language. Focus on acquiring  vocabulary and grammar for basic conversational proficiency. Taught through in-class oral and aural exercises, language tapes, and primary texts. Learn about Maya culture, history, folklore, and language politics.",
            "id": "ANTHRO/LACIS 377",
            "title": "SECOND SEMESTER YUCATEC MAYA"
        }
    },
    {
        "data": {
            "description": "Continued introduction to phonology and morphology; concentration on the acquisition of conversational skills; reading of texts of graded difficulty.",
            "id": "ANTHRO/LACIS 362",
            "title": "ELEMENTARY QUECHUA"
        }
    },
    {
        "data": {
            "description": "Cultural and ecological factors influencing the composition and structure of human populations; variation and distribution of genes within and between populations; history and evolution of human populations as evidenced by genomes.",
            "id": "ANTHRO 304",
            "parent": "ANTHRO",
            "title": "HEREDITY, ENVIRONMENT AND HUMAN POPULATIONS"
        }
    },
    {
        "data": {
            "description": "Current anthropological literature and methods. Assigned problems.",
            "id": "ANTHRO 940",
            "parent": "ANTHRO",
            "title": "SEMINAR-PROBLEMS IN CULTURAL ANTHROPOLOGY"
        }
    },
    {
        "data": {
            "description": "Current literature and methods and work on assigned problems.",
            "id": "ANTHRO 942",
            "parent": "ANTHRO",
            "title": "SEMINAR-ARCHAEOLOGICAL PROBLEMS"
        }
    },
    {
        "data": {
            "description": "Current research with attention to the evolutionary biology of humans and fossil human relatives.",
            "id": "ANTHRO 605",
            "parent": "ANTHRO",
            "title": "SEMINAR-CURRENT PROBLEMS IN PALEOANTHROPOLOGY"
        }
    },
    {
        "data": {
            "description": "Description and analysis of native cultures, and the role of environmental and historical factors in North America.",
            "id": "AMERIND/ANTHRO 314",
            "title": "INDIANS OF NORTH AMERICA"
        }
    },
    {
        "data": {
            "description": "Discussion and preparation of reports on specific topics indicated by changing title of seminar.",
            "id": "ANTHRO 490",
            "parent": "ANTHRO",
            "title": "UNDERGRADUATE SEMINAR"
        }
    },
    {
        "data": {
            "description": "Elementary theory and practical work in phonetics, phonology, morphology, and syntax, with attention to formal grammar.",
            "id": "ANTHRO/LINGUIS 301",
            "title": "INTRODUCTION TO LINGUISTICS: DESCRIPTIVE AND THEORETICAL"
        }
    },
    {
        "data": {
            "description": "Elementary theory and practical work in phonetics, phonology, morphology, and syntax, with attention to formal grammar.",
            "id": "LINGUIS 101",
            "parent": "LINGUIS",
            "title": "HUMAN LANGUAGE"
        }
    },
    {
        "data": {
            "description": "Evaluates the conservation status of non-human primates, and considers why different species are vulnerable to different kinds of threats. The ways in which regional and global conservation policies are developed and implemented will also be discussed.",
            "id": "ANTHRO 668",
            "parent": "ANTHRO",
            "title": "PRIMATE CONSERVATION"
        }
    },
    {
        "data": {
            "description": "Evolutionary biology, emphasizing how modern scientists study evolution. Topics include: nature and mechanisms of microevolution, macroevolution, adaptation, speciation; systematics and taxonomy; quantitative genetics and measurement of natural selection; phylogenetic analyses of behavior, physiology, morphology, biochemistry; current controversies in evolution.",
            "id": "ANTHRO/BOTANY/ZOOLOGY 410",
            "title": "EVOLUTIONARY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Examination of international health issues from the theoretical and methodological perspectives of anthropology. Includes case studies of applied medical anthropology work as well as critical analysis of development initiatives in public health.",
            "id": "ANTHRO 919",
            "parent": "ANTHRO",
            "title": "ANTHROPOLOGY AND INTERNATIONAL HEALTH"
        }
    },
    {
        "data": {
            "description": "Examination of theory relevant to the evolution of humans and nonhuman primates including morphological, behavioral, and genetic aspects.",
            "id": "ANTHRO 603",
            "parent": "ANTHRO",
            "title": "SEMINAR IN EVOLUTIONARY THEORY"
        }
    },
    {
        "data": {
            "description": "Examines and interprets the roles of American Indian women in traditional societies, and in contemporary North America.",
            "id": "AMERIND/ANTHRO/FOLKLORE/GEN&WS 437",
            "title": "AMERICAN INDIAN WOMEN"
        }
    },
    {
        "data": {
            "description": "Explore the psychology and biology of our closest living ancestors and how it can provide insights into human behavior and cognition. Learn how a variety of factors (ecological, evolutionary, developmental, and experiential) shape the variation we see across and within primate species. Topics include investigation of similarities and differences across taxa in development, learning, memory, evolution of the brain, spatial navigation, tool-use, social behavior, parental behavior, communication, self-recognition, and theory of mind, as well as ethical issues and conservation.",
            "id": "PSYCH 450",
            "parent": "PSYCH",
            "title": "PRIMATE PSYCHOLOGY: INSIGHTS INTO HUMAN BEHAVIOR"
        }
    },
    {
        "data": {
            "description": "Explores the history and culture of the Caribbean by focusing on its musics, both religious and secular. Special attention will be directed to the impact of colonialism on the emergence of racially stratified societies. Music will also enable us to investigate the concepts of diaspora and creolization. Other topics include: gender and sexuality, the role of technology in the production and distribution of music, music and politics, the impact of tourism, and the global impact of Caribbean musics.",
            "id": "ANTHRO 237",
            "parent": "ANTHRO",
            "title": "CUT 'N' MIX: MUSIC, RACE, AND CULTURE IN THE CARIBBEAN"
        }
    },
    {
        "data": {
            "description": "Explores the significance of movements, sounds, and the body in the transmission of knowledge, the formation of cultural communities, and the expression of identity. Offers first-hand practical experience of the ethnographic study of dance and movements.",
            "id": "ANTHRO 460",
            "parent": "ANTHRO",
            "title": "THE ANTHROPOLOGY OF DANCE: MOVEMENT AND MUSIC IN PERFORMANCE"
        }
    },
    {
        "data": {
            "description": "Explores the ways in which humans have used of rocks and associated minerals, i.e. lithics and lapidary technology, to create utilitarian as well as ornamental objects in the past and the present.  Explores gender roles in lithic technology and how specific technologies were used to create utilitarian as well as ornamental and symbolic objects. Gain a new perspective of the critical role of lithic technologies in long term human adaptive strategies as well as in ornament and symbolic art.",
            "id": "ANTHRO 337",
            "parent": "ANTHRO",
            "title": "LITHICS AND ARCHAEOLOGY"
        }
    },
    {
        "data": {
            "description": "Focuses on language and its culture, example topics include: extinction and revival, language and nationhood, how widely and deeply languages differ, language and worldview, writing systems and literacy, language discrimination and inequality.",
            "id": "ANTHRO/FOLKLORE/INTLST/LINGUIS 211",
            "title": "GLOBAL LANGUAGE ISSUES"
        }
    },
    {
        "data": {
            "description": "Folklore of Central, Eastern and Northern Europe and among emigrants from these regions in North America. A survey of genres of folklore, history of research, and modes of interpretation, past and present.",
            "id": "FOLKLORE/GNS 200",
            "title": "FOLKLORE OF CENTRAL, EASTERN AND NORTHERN EUROPE"
        }
    },
    {
        "data": {
            "description": "Folklore of ethnic, regional, religious, and occupational cultures, emphasizing how diverse peoples (African Americans, American Indians, Appalachians, Chicanos, Germans, Irish, Jews, Mormons, miners, service workers, etc.) use traditional festivals, artifacts, songs and stories to express their experiences within American life.",
            "id": "FOLKLORE 230",
            "parent": "FOLKLORE",
            "title": "INTRODUCTION TO AMERICAN FOLKLORE"
        }
    },
    {
        "data": {
            "description": "Fundamentals of anthropological thought using a cross-section of basic works in social science. Emphasizes discussion, critical analysis, and development of professional writing skills.",
            "id": "ANTHRO 900",
            "parent": "ANTHRO",
            "title": "FUNDAMENTALS OF ANTHROPOLOGICAL THEORY"
        }
    },
    {
        "data": {
            "description": "Genetic basis of morphological, physiological and behavioral variations within and between human populations, and their origins and evolution.",
            "id": "ANTHRO 105",
            "parent": "ANTHRO",
            "title": "PRINCIPLES OF BIOLOGICAL ANTHROPOLOGY"
        }
    },
    {
        "data": {
            "description": "Human evolution beginning with the Pliocene appearance of our genus, Homo, and ending with the worldwide spread of modern Homo sapiens  throughout the world.",
            "id": "ANTHRO 411",
            "parent": "ANTHRO",
            "title": "THE EVOLUTION OF THE GENUS, HOMO"
        }
    },
    {
        "data": {
            "description": "Identifies and examines cultural and environmental factors which should be taken into account in planning effective development. Case studies of development programs in less developed countries. Possible contributions of anthropologists and environmental scientists in planning, implementing, and evaluating development programs.",
            "id": "ANTHRO 477",
            "parent": "ANTHRO",
            "title": "ANTHROPOLOGY, ENVIRONMENT, AND DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Independent research in specific problems in physical anthropology, archaeology, or cultural anthropology; under supervision.",
            "id": "ANTHRO 690",
            "parent": "ANTHRO",
            "title": "PROBLEMS IN ANTHROPOLOGY"
        }
    },
    {
        "data": {
            "description": "Intensive study of a problem in human variability through study of nontechnical materials. Emphasis on acquiring anthropological concepts through discussion and direct experience of ethnographic, archaeological, or human physical evidence.",
            "id": "ANTHRO 120",
            "parent": "ANTHRO",
            "title": "FRESHMAN/SOPHOMORE SEMINAR IN ANTHROPOLOGY"
        }
    },
    {
        "data": {
            "description": "Interdisciplinary inquiry in African societies and cultures.",
            "id": "AFRICAN/ANTHRO/ECON/GEOG/HISTORY/POLISCI 983",
            "title": "INTERDEPARTMENTAL SEMINAR IN AFRICAN STUDIES TOPICS"
        }
    },
    {
        "data": {
            "description": "Interdisciplinary inquiry in Latin American society and culture.",
            "id": "AAE/ANTHRO/C&ESOC/GEOG/HISTORY/LACIS/POLISCI/PORTUG/SOC/SPANISH 982",
            "title": "INTERDEPARTMENTAL SEMINAR IN THE LATIN-AMERICAN AREA"
        }
    },
    {
        "data": {
            "description": "Introduction to Yucatec Maya language. Focus on acquiring  vocabulary and grammar for basic conversational proficiency. Taught through in-class oral and aural exercises, language tapes, and primary texts. Learn about Maya culture, history, folklore, and language politics.",
            "id": "ANTHRO/LACIS 376",
            "title": "FIRST SEMESTER YUCATEC MAYA"
        }
    },
    {
        "data": {
            "description": "Introduction to cultural anthropology. Comparative cross-cultural consideration of social organization, economics, politics, language, religion, ecology, gender, and cultural change. Includes a primary focus on U.S. ethnic and racial minorities.",
            "id": "ANTHRO 104",
            "parent": "ANTHRO",
            "title": "CULTURAL ANTHROPOLOGY AND HUMAN DIVERSITY"
        }
    },
    {
        "data": {
            "description": "Introduction to the ancient world from origins of human culture to the beginnings of written history as revealed by archaeological research at great sites and ruins around the globe. Archaeological analyses of important sites as case studies to illustrate concepts and techniques used by archaeologists in their efforts to understand the diversity of the human past.",
            "id": "ANTHRO 102",
            "parent": "ANTHRO",
            "title": "ARCHAEOLOGY AND THE PREHISTORIC WORLD"
        }
    },
    {
        "data": {
            "description": "Introduction to the archaeological evidence for the diverse Native American cultures of Wisconsin over the past 12,000 years.",
            "id": "AMERIND/ANTHRO 354",
            "title": "ARCHAEOLOGY OF WISCONSIN"
        }
    },
    {
        "data": {
            "description": "Introduction to the evidence, debates, and theories related to violence and warfare in the human past, and how related behaviors are linked to the evolution of our species and modern manifestations of war. Highlights archaeological methods that recognize past warfare practices. Using case studies from the Pleistocene to the present, explores variations of warfare from all over the world. Topics considered include 1) the highly variable nature of violence and warfare in different cultural settings; 2) the antiquity of warfare; 3) how violence has shaped human societies. Historical and cross-cultural ethnographic research will be juxtaposed against archaeological cases to provide contextualized and data-rich examinations. Learn to critically evaluate arguments, claims, and interpretations made about war, peace, and human nature.",
            "id": "ANTHRO 339",
            "parent": "ANTHRO",
            "title": "ARCHAEOLOGY OF WARFARE AND HUMAN NATURE"
        }
    },
    {
        "data": {
            "description": "Introduction to the methods, historical development, and scientific principles of archaeology. Discover how archaeologists generate and interpret information about the human past. Introduces scientific inquiry and provides a foundation for pursuing advanced archaeological courses and field research.",
            "id": "ANTHRO 212",
            "parent": "ANTHRO",
            "title": "PRINCIPLES OF ARCHAEOLOGY"
        }
    },
    {
        "data": {
            "description": "Japanese culture from anthropological perspectives. Emphasis on the order of meaning which serves both as model for and model of the day-to-day behavior and thought processes of the Japanese.",
            "id": "ANTHRO 357",
            "parent": "ANTHRO",
            "title": "INTRODUCTION TO THE ANTHROPOLOGY OF JAPAN"
        }
    },
    {
        "data": {
            "description": "Latin American culture and society from an interdisciplinary perspective; historical developments from pre-Columbian times to the present; political movements; economic problems; social change; ecology in tropical Latin America; legal systems; literature and the arts; cultural contrasts involving the US and Latin America; land reform; labor movements; capitalism, socialism, imperialism; mass media.",
            "id": "AFROAMER/ANTHRO/C&ESOC/GEOG/HISTORY/LACIS/POLISCI/SOC/SPANISH 260",
            "title": "LATIN AMERICA: AN INTRODUCTION"
        }
    },
    {
        "data": {
            "description": "Learn about the great diversity of Native American cultures in eastern North America, with an emphasis on those of the Midwest and Southeast. More than twelve thousand years of accommodations to diverse natural and social environments are covered, starting with archaeological evidence for and oral traditions describing the initial peopling of the Americas and ending with the European invasion and interactions with the Native Americans of the Eastern Woodlands.",
            "id": "AMERIND/ANTHRO 355",
            "title": "ARCHAEOLOGY OF EASTERN NORTH AMERICA"
        }
    },
    {
        "data": {
            "description": "Mentored individual research and study for students completing a senior thesis.",
            "id": "ANTHRO 691",
            "parent": "ANTHRO",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Mentored individual research and study for students completing a senior thesis.",
            "id": "ANTHRO 692",
            "parent": "ANTHRO",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Mentored individual research and study for students completing a thesis in an Honors program.",
            "id": "ANTHRO 681",
            "parent": "ANTHRO",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Mentored individual research and study for students completing a thesis in an Honors program.",
            "id": "ANTHRO 682",
            "parent": "ANTHRO",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Origins and structures of mind, brain, and consciousness. Transitions from early mammalian through primate to hominid intelligence. Genetics and plasticity in brain development. Modern studies of human brain mechanisms and consciousness.",
            "id": "ANTHRO/NTP/PSYCH/ZOOLOGY 619",
            "title": "BIOLOGY OF MIND"
        }
    },
    {
        "data": {
            "description": "Overview of the major theoretical developments and debates in biological anthropology and their relevance to both historical and current research.",
            "id": "ANTHRO 601",
            "parent": "ANTHRO",
            "title": "PROSEMINAR IN BIOLOGICAL ANTHROPOLOGY"
        }
    },
    {
        "data": {
            "description": "Phonology and morphology; concentration on the acquisition of conversational skills; reading of texts of graded difficulty.",
            "id": "ANTHRO/LACIS 361",
            "title": "ELEMENTARY QUECHUA"
        }
    },
    {
        "data": {
            "description": "Practicum in the curation of prehistoric stone, bone, and ceramics. Involves handling materials, identification of artifacts, conservation techinques, preparation of materials for storage or display.",
            "id": "ANTHRO 696",
            "parent": "ANTHRO",
            "title": "ARCHAEOLOGICAL METHODS OF CURATION"
        }
    },
    {
        "data": {
            "description": "Primate behavior examined from an evolutionary and ecological perspective, focusing on adaptations to the social and nonsocial environment. Topics include: nepotism, reciprocity, competition, cooperation, sex differences, the ecological role of primates in their communities, cognition, and conservation. Considers the major threats to primates today, and how behavioral adaptations and anthropogenic variables interact to affect the future survival of primates at local, regional, and global scales.",
            "id": "ANTHRO 458",
            "parent": "ANTHRO",
            "title": "PRIMATE BEHAVIORAL ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Production, distribution and consumption in a broad range of societies; land tenure and personal property concepts, prestige systems, and incentives to labor.",
            "id": "ANTHRO 348",
            "parent": "ANTHRO",
            "title": "ECONOMIC ANTHROPOLOGY"
        }
    },
    {
        "data": {
            "description": "Provides a comprehensive understanding of the policies, procedures, and ethics pertaining to the development, management, and exhibition of anthropology collections. This includes an overview of the establishment, history, and laws governing anthropology collections and collections management methods used specifically for archaeological artifacts, ethnographic objects, and bioanthropological specimens. Ideal for those interested in natural history museums, museum studies, or the museum profession.",
            "id": "ANTHRO 405",
            "parent": "ANTHRO",
            "title": "INTRODUCTION TO MUSEUM STUDIES IN ANTHROPOLOGY"
        }
    },
    {
        "data": {
            "description": "Provides analytical tools for the critical examination of the social, cultural, political and economic determinants of health conditions and medical practice. Pays special attention to how these factors determine how patients and providers experience and ideate disease and treatment, and how they respond to specific health care policies. Emphasizes the important role that conditions of structural violence and inequality play as determinants of health conditions in a globalized world.",
            "id": "ANTHRO/MEDHIST 231",
            "title": "INTRODUCTION TO SOCIAL MEDICINE"
        }
    },
    {
        "data": {
            "description": "Representation and self-representation of ethnic cultures in Wisconsin. For example: museums, mass media, ethnic theater.",
            "id": "ANTHRO/FOLKLORE 520",
            "title": "ETHNIC REPRESENTATIONS IN WISCONSIN"
        }
    },
    {
        "data": {
            "description": "Reviewing the current state of anthropological studies of globalization and examining various approaches taken to the subject. Focusing on works that conceptualize and theorize the transnational culture and ethnographies that represent and explore its multiplicity and complexity.",
            "id": "ANTHRO 917",
            "parent": "ANTHRO",
            "title": "GLOBALIZATION AND TRANSNATIONAL CULTURES"
        }
    },
    {
        "data": {
            "description": "Selected areas, periods or problems in archaeology.",
            "id": "ANTHRO 310",
            "parent": "ANTHRO",
            "title": "TOPICS IN ARCHAEOLOGY"
        }
    },
    {
        "data": {
            "description": "Social and economic factors relating to stability, growth, and change in the non-Western areas of the contemporary world.",
            "id": "ANTHRO/C&ESOC/ECON/SOC 925",
            "title": "SEMINAR: SOCIO-ECONOMIC CHANGE IN UNDERDEVELOPED AREAS"
        }
    },
    {
        "data": {
            "description": "Study of the interactions between human cultures and plants. Topics include: traditional resource management and agriculture; crop domestication, evolution, and conservation; archaeobotany; indigenous knowledge; folk taxonomy; plants in symbolism and religion; dietary patterns; phytochemistry; global movement of plants and peoples.",
            "id": "AMERIND/ANTHRO/BOTANY 474",
            "title": "ETHNOBOTANY"
        }
    },
    {
        "data": {
            "description": "Survey of cultural anthropology with emphasis on ethnographic description, methodology, and contemporary theories. Focuses on humanistic and social scientific approaches to human sociocultural diversity.",
            "id": "ANTHRO 300",
            "parent": "ANTHRO",
            "title": "CULTURAL ANTHROPOLOGY: THEORY AND ETHNOGRAPHY"
        }
    },
    {
        "data": {
            "description": "Survey of psychologically oriented approaches in cultural anthropology: ethnopsychiatry, the ethnography of emotion, conceptions of the self, cognitive development, and culturally defined deviance and mental illness.",
            "id": "ANTHRO 545",
            "parent": "ANTHRO",
            "title": "PSYCHOLOGICAL ANTHROPOLOGY"
        }
    },
    {
        "data": {
            "description": "The ecology of health and disease in human cultures; health-related social systems and behavior cross-culturally; practical implications of medical anthropology for improving the health of specific populations.",
            "id": "ANTHRO 365",
            "parent": "ANTHRO",
            "title": "MEDICAL ANTHROPOLOGY"
        }
    },
    {
        "data": {
            "description": "The evolution of the Hominoidea is reconstructed from direct and indirect evidence. Cladistic and phylogenetic analyses are used to study the relationships among species. Interpretations of the fossil record are presented from a historical perspective, focusing on the hominoid-hominid transition.",
            "id": "ANTHRO 302",
            "parent": "ANTHRO",
            "title": "HOMINOID EVOLUTION"
        }
    },
    {
        "data": {
            "description": "The origins and development of early technologies. Impact of key prehistoric and pre-industrial inventions on the course of human evolution.",
            "id": "ANTHRO 352",
            "parent": "ANTHRO",
            "title": "ANCIENT TECHNOLOGY AND INVENTION"
        }
    },
    {
        "data": {
            "description": "The relationship of language as a communication system to the culture transmitted by it. Principle problems in the interrelations of language and nonlinguistic human behavior.",
            "id": "ANTHRO/LINGUIS 430",
            "title": "LANGUAGE AND CULTURE"
        }
    },
    {
        "data": {
            "description": "The study of society through the analysis of symbolic systems. Myth, cosmology, ritual, political symbolism, the symbolic study of kinship, symbols and social change.",
            "id": "ANTHRO 456",
            "parent": "ANTHRO",
            "title": "SYMBOLIC ANTHROPOLOGY"
        }
    },
    {
        "data": {
            "description": "Theoretical and ethnographic approaches to the anthropology of gender, focusing on current works. Topics include sexual inequality, research methods, gender and history, gender and ethnographic writing, cultural constructions of masculinity, sexuality, and gender studies and anthropological theory.",
            "id": "ANTHRO/GEN&WS 920",
            "title": "ANTHROPOLOGY OF GENDER"
        }
    },
    {
        "data": {
            "description": "Theoretical and practical aspects of ethnographic research; history of field research in anthropology; research design issues; writing proposals; the fieldwork experience; methods of field data collection; ethical issues; data interpretation and analysis; writing ethnography.",
            "id": "ANTHRO 909",
            "parent": "ANTHRO",
            "title": "RESEARCH METHODS AND RESEARCH DESIGN IN CULTURAL ANTHROPOLOGY"
        }
    },
    {
        "data": {
            "description": "This course introduces students to the interdisciplinary field of material culture studies. It is intended for students interested in any professional endeavor related to material culture, including careers in museums, galleries, historical societies, historic preservation organizations, and academic institutions. During the semester, students have varied opportunities to engage with and contemplate the material world to which people give meaning and which, in turn, influences their lives. Sessions combine in some way the following: presentations from faculty members and professionals who lecture on a phase of material culture related to his/her own scholarship or other professional work; discussion of foundational readings in the field; visits to collections and sites on campus and around Madison; discussion of readings assigned by visiting presenters or the professors; and exams and short papers that engage material culture topics.",
            "id": "ANTHRO/ARTHIST/DS/HISTORY/LANDARC 264",
            "title": "DIMENSIONS OF MATERIAL CULTURE"
        }
    },
    {
        "data": {
            "description": "This course introduces students to the interdisciplinary field of material culture studies. It is intended for students interested in any professional endeavor related to material culture, including careers in museums, galleries, historical societies, historic preservation organizations, and academic institutions. During the semester, students have varied opportunities to engage with and contemplate the material world to which people give meaning and which, in turn, influences their lives. Sessions combine in some way the following: presentations from faculty members and professionals who lecture on a phase of material culture related to his/her own scholarship or other professional work; discussion of foundational readings in the field; visits to collections and sites on campus and around Madison; discussion of readings assigned by visiting presenters or the professors; and exams and short papers that engage material culture topics.",
            "id": "ANTHRO/ARTHIST/DS/HISTORY/LANDARC 764",
            "title": "DIMENSIONS OF MATERIAL CULTURE"
        }
    },
    {
        "data": {
            "description": "Uses the conceptual tools of anthropology to explore how culture, biology, and power together shape the ways people are born, experience good and poor health, seek therapeutic aid, and die. Draws on material from around the world, with a particular focus on the experience of marginalized minority people in the United States.",
            "id": "ANTHRO 265",
            "parent": "ANTHRO",
            "title": "INTRODUCTION TO CULTURE AND HEALTH"
        }
    },
    {
        "data": {
            "description": "Worldwide archaeological evidence for the development of human culture and behavior from the earliest appearance of human groups to the threshold of the agricultural revolution.",
            "id": "ANTHRO 321",
            "parent": "ANTHRO",
            "title": "THE EMERGENCE OF HUMAN CULTURE"
        }
    },
    {
        "data": {
            "id": "ANTHRO",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "BIOCORE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "FOLKLORE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "LINGUIS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "PSYCH",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ANTHRO 100",
            "target": "ANTHRO 420"
        }
    },
    {
        "data": {
            "source": "ANTHRO 100",
            "target": "ANTHRO 477"
        }
    },
    {
        "data": {
            "source": "ANTHRO 102",
            "target": "ANTHRO 321"
        }
    },
    {
        "data": {
            "source": "ANTHRO 102",
            "target": "ANTHRO 333"
        }
    },
    {
        "data": {
            "source": "ANTHRO 102",
            "target": "ANTHRO 337"
        }
    },
    {
        "data": {
            "source": "ANTHRO 102",
            "target": "ANTHRO 370"
        }
    },
    {
        "data": {
            "source": "ANTHRO 102",
            "target": "ANTHRO 391"
        }
    },
    {
        "data": {
            "source": "ANTHRO 104",
            "target": "ANTHRO 307"
        }
    },
    {
        "data": {
            "source": "ANTHRO 104",
            "target": "ANTHRO 330"
        }
    },
    {
        "data": {
            "source": "ANTHRO 104",
            "target": "ANTHRO 340"
        }
    },
    {
        "data": {
            "source": "ANTHRO 104",
            "target": "ANTHRO 345"
        }
    },
    {
        "data": {
            "source": "ANTHRO 104",
            "target": "ANTHRO 348"
        }
    },
    {
        "data": {
            "source": "ANTHRO 104",
            "target": "ANTHRO 456"
        }
    },
    {
        "data": {
            "source": "ANTHRO 104",
            "target": "ANTHRO/RELIGST 343"
        }
    },
    {
        "data": {
            "source": "ANTHRO 105",
            "target": "ANTHRO 302"
        }
    },
    {
        "data": {
            "source": "ANTHRO 105",
            "target": "ANTHRO 303"
        }
    },
    {
        "data": {
            "source": "ANTHRO 105",
            "target": "ANTHRO 304"
        }
    },
    {
        "data": {
            "source": "ANTHRO 105",
            "target": "ANTHRO 601"
        }
    },
    {
        "data": {
            "source": "ANTHRO 302",
            "target": "ANTHRO 411"
        }
    },
    {
        "data": {
            "source": "ANTHRO 321",
            "target": "ANTHRO 352"
        }
    },
    {
        "data": {
            "source": "ANTHRO 458",
            "target": "ANTHRO 668"
        }
    },
    {
        "data": {
            "source": "ANTHRO/BOTANY/ZOOLOGY 410",
            "target": "ANTHRO 603"
        }
    },
    {
        "data": {
            "source": "ANTHRO/BOTANY/ZOOLOGY 410",
            "target": "ANTHRO 605"
        }
    },
    {
        "data": {
            "source": "ANTHRO/LACIS 361",
            "target": "ANTHRO/LACIS 362"
        }
    },
    {
        "data": {
            "source": "ANTHRO/LACIS 362",
            "target": "ANTHRO/LACIS 363"
        }
    },
    {
        "data": {
            "source": "ANTHRO/LACIS 363",
            "target": "ANTHRO/LACIS 364"
        }
    },
    {
        "data": {
            "source": "ANTHRO/LACIS 376",
            "target": "ANTHRO/LACIS 377"
        }
    },
    {
        "data": {
            "source": "ANTHRO/LINGUIS 301",
            "target": "LINGUIS 101"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "ANTHRO/BOTANY/ZOOLOGY 410"
        }
    },
    {
        "data": {
            "source": "FOLKLORE 230",
            "target": "AMERIND/ANTHRO/FOLKLORE 431"
        }
    },
    {
        "data": {
            "source": "FOLKLORE/GNS 200",
            "target": "ANTHRO/FOLKLORE 520"
        }
    },
    {
        "data": {
            "source": "LINGUIS 101",
            "target": "ANTHRO/LINGUIS 301"
        }
    },
    {
        "data": {
            "source": "PSYCH 202",
            "target": "PSYCH 450"
        }
    },
    {
        "data": {
            "source": "PSYCH 450",
            "target": "ANTHRO 458"
        }
    }
]