[
    {
        "data": {
            "description": "Artists' formal, technical and expressive concerns; the principal ideas of movements which have significantly influenced the major tendencies in contemporary art.",
            "id": "ART 108",
            "parent": "ART",
            "title": "FOUNDATIONS OF CONTEMPORARY ART"
        }
    },
    {
        "data": {
            "description": "Builds on the work begun in Making Comics 1. Students will already be comfortable working on deadline, with applying previous comics-making experience to a variety of story styles, both fictional and non-fictional, and with using a variety of materials. This class is just as rigorous and demanding as Art 307. You'll be required to write and draw in your journal every day. Homework is substantial. Students will finish a 3-4 page comic strip each week, even when feeling uninspired. Readings will include more long-form comics. Students will identify a theme present in their own work to be explored through drawing and writing. In the last part of the semester, students will create a 'zine with a focused narrative. It will be an original, reproducible, handmade book of at least 32 pages, comprised of both visual and written elements. Everything created will be drawn, painted and written by hand.",
            "id": "ART 507",
            "parent": "ART",
            "title": "MAKING COMICS 2"
        }
    },
    {
        "data": {
            "description": "Covers materials and techniques used in contemporary letterpress printing of both text and image with a focus on letterpress printing as an art medium. Learn how to print using handset type, photopolymer plates and other printmaking techniques suitable for letterpress. Design and letterpress print broadsides and artist's books.",
            "id": "ART 486",
            "parent": "ART",
            "title": "LETTERPRESS PRINTING: BOOKS AND MULTIPLES"
        }
    },
    {
        "data": {
            "description": "Examination of current artists' motivations, intentions, and processes and their relationship to general developments in contemporary art.",
            "id": "ART 208",
            "parent": "ART",
            "title": "CURRENT DIRECTIONS IN ART"
        }
    },
    {
        "data": {
            "description": "Studio projects in site-specific art making supplemented by readings and examples of relevant contemporary artists' work.",
            "id": "ART 521",
            "parent": "ART",
            "title": "INSTALLATIONS AND ENVIRONMENTS"
        }
    },
    {
        "data": {
            "description": "A capstone experience for seniors in the Graphic Design Program. A hybrid of studio and seminar, course work will combine inquiry, research, creative problem-solving, and design prototyping. Students will use research to launch a comprehensive graphic design thesis project which will be exhibited at the end of the term.",
            "id": "ART 560",
            "parent": "ART",
            "title": "GRAPHIC DESIGN SENIOR THESIS PROJECT AND EXHIBITION"
        }
    },
    {
        "data": {
            "description": "A low-enrollment course developing skills in critical reading, logical thinking, use of evidence, and use of library resources. Emphasis on writing in the conventions of specific fields.",
            "id": "ART 236",
            "parent": "ART",
            "title": "BASCOM COURSE"
        }
    },
    {
        "data": {
            "description": "A project-based introduction to the examination of user experience, and is oriented toward practical methods for approaching a design problem. The focus of the course is to develop conceptual design based on the needs of users. Students will receive grounding in user research methods, design sketching, and design validation.",
            "id": "ART 575",
            "parent": "ART",
            "title": "USER EXPERIENCE FOR GRAPHIC DESIGN"
        }
    },
    {
        "data": {
            "description": "Addresses basic visual communication principles that include semiotics, gestalt, form, and context, and applies them to the design of icons, symbols, and pictograms. Cultural, psychological, social, and historical interpretations of these forms are analyzed through design projects, readings, discussion, and research.",
            "id": "ART 442",
            "parent": "ART",
            "title": "ICONS, SYMBOLS, AND PICTOGRAMS"
        }
    },
    {
        "data": {
            "description": "Advanced computer imaging for printmaking. Emphasis is on self-initiated projects that combine printmaking or photographic techniques with digital output.",
            "id": "ART 636",
            "parent": "ART",
            "title": "COMPUTER AUGMENTED PRINTMAKING"
        }
    },
    {
        "data": {
            "description": "Advanced concepts and practices using clay/ceramics to create fine art objects.",
            "id": "ART 624",
            "parent": "ART",
            "title": "ADVANCED CERAMICS II"
        }
    },
    {
        "data": {
            "description": "Advanced concepts and processes in transparent and opaque watercolor media.",
            "id": "ART 642",
            "parent": "ART",
            "title": "ADVANCED WATERCOLOR II"
        }
    },
    {
        "data": {
            "description": "Advanced concepts and techniques in fine art glass.",
            "id": "ART 554",
            "parent": "ART",
            "title": "ADVANCED GLASSWORKING"
        }
    },
    {
        "data": {
            "description": "Advanced instruction in the production of sound tracks to complement the work of artists in dance, video, film, computer art and other interdisciplinary forms.",
            "id": "ART/DANCE 441",
            "title": "ADVANCED SOUND DESIGN"
        }
    },
    {
        "data": {
            "description": "Advanced level drawing course taught in a structured format where students work on various problems/issues in drawing.",
            "id": "ART 512",
            "parent": "ART",
            "title": "ADVANCED DRAWING I"
        }
    },
    {
        "data": {
            "description": "Advanced level graphic course designed to prepare senior level students for entrance into the design profession. Portfolio and resume  preparation will be the primary emphasis. Legal and professional practice topics also will be addressed.",
            "id": "ART 656",
            "parent": "ART",
            "title": "DESIGN PORTFOLIO AND PROFESSIONAL PRACTICE"
        }
    },
    {
        "data": {
            "description": "Advanced techniques in creating functional and/or fine art metal objects.",
            "id": "ART 544",
            "parent": "ART",
            "title": "ADVANCED ART METAL I"
        }
    },
    {
        "data": {
            "description": "Advanced work and examination of the percepts of drawing with the human figure. Emphasis on conceptual development in conversation with contemporary life drawing practices.",
            "id": "ART 632",
            "parent": "ART",
            "title": "ADVANCED LIFE DRAWING II"
        }
    },
    {
        "data": {
            "description": "Advanced work in depicting the human figure as a source for creative and independent viewpoints in painting and other media.",
            "id": "ART 552",
            "parent": "ART",
            "title": "ADVANCED PAINTING: NEW FIGURATION II"
        }
    },
    {
        "data": {
            "description": "An advanced investigation of typography for visual communication and expression. Emphasis is placed on the analysis of meaning as conveyed through, materials, technology, and design. Projects are experimental and are designed to challenge you to expand your understanding of the function typography plays in design, art, and culture.",
            "id": "ART 525",
            "parent": "ART",
            "title": "ADVANCED TYPOGRAPHY"
        }
    },
    {
        "data": {
            "description": "An advanced project based class in 3D Digital Animation. Students will complete a single major animation project based on their own proposal as approved by the instructor.",
            "id": "ART 629",
            "parent": "ART",
            "title": "3D DIGITAL STUDIO III"
        }
    },
    {
        "data": {
            "description": "An exploration of art genres that often incorporate a form of time-based performance, including but not limited to elements found in theater, dance, music, spoken word/poetry, etc.",
            "id": "ART 511",
            "parent": "ART",
            "title": "ART PERFORMANCE"
        }
    },
    {
        "data": {
            "description": "An introduction to a range of digital media techniques for artists and designers, including digital imaging, vector graphics, web design and 3D digital modeling.  Emphasis on creative development along with technical skill building.",
            "id": "ART 107",
            "parent": "ART",
            "title": "INTRODUCTION TO DIGITAL FORMS"
        }
    },
    {
        "data": {
            "description": "An introduction to designing for accessibility and inclusion including visual design research, design thinking, and digital fabrication.",
            "id": "ART 564",
            "parent": "ART",
            "title": "GRAPHIC DESIGN FOR ACCESSIBILITY"
        }
    },
    {
        "data": {
            "description": "An introduction to making comics as both a subject and means of academic inquiry. This is a rigorous class and the workload is substantial. Students will learn a variety of ways of making pictures and stories using materials that will vary over the course of the semester. Final project will be an original, reproducible, handmade book of at least 32 pages, based on the stories or comics or characters created during the semester. No previous drawing experience necessary, but must be eager to draw seven days per week throughout the duration of the course.",
            "id": "ART 307",
            "parent": "ART",
            "title": "MAKING COMICS 1"
        }
    },
    {
        "data": {
            "description": "An introduction to the principles of computer coding in a visual context. Course emphasizes the production of graphical and interactive output delivered on a screen.",
            "id": "ART 309",
            "parent": "ART",
            "title": "DIGITAL ART AND CODE"
        }
    },
    {
        "data": {
            "description": "An introduction to time-based art forms including video, installation, and visual art performance.",
            "id": "ART 318",
            "parent": "ART",
            "title": "INTRODUCTION TO VIDEO, PERFORMANCE & INSTALLATION ART"
        }
    },
    {
        "data": {
            "description": "Anatomical structure and intrinsic forms involved in drawing from different models. Development of technical control in a range of media.",
            "id": "ART 232",
            "parent": "ART",
            "title": "LIFE DRAWING I"
        }
    },
    {
        "data": {
            "description": "Application of lighting design to the stage and natural environment. Color principles, lighting instruments, and control equipment. Production participation and labs.",
            "id": "ART/THEATRE 366",
            "title": "STAGE LIGHTING I"
        }
    },
    {
        "data": {
            "description": "Applying design principles to 3-D investigations. Lectures, studio exercises, discussions.",
            "id": "ART 104",
            "parent": "ART",
            "title": "THREE-DIMENSIONAL DESIGN"
        }
    },
    {
        "data": {
            "description": "Basic jewelry techniques; metal fabrication dealing with piercing, soldering, forming.",
            "id": "ART 244",
            "parent": "ART",
            "title": "ART METAL I"
        }
    },
    {
        "data": {
            "description": "Color phenomena and visual perception as applied in art problems. Lectures, readings in theory, philosophy, and history of design.",
            "id": "ART 302",
            "parent": "ART",
            "title": "COLOR"
        }
    },
    {
        "data": {
            "description": "Continuation of 522.  Entrance is by consent through competitive portfolio review, held in the final week of the fall and spring semesters. Qualified applicants will have completed Art 222, 322, and at least one of the following: Art 312, 332, 342, 452, 512, 522, 542; or have transferred equivalent coursework. Not open to graduate students.",
            "id": "ART 622",
            "parent": "ART",
            "title": "ADVANCED UNDERGRADUATE PAINTING WORKSHOP"
        }
    },
    {
        "data": {
            "description": "Continuation of advanced level drawing. Focus on advanced techniques and conceptual development in conversation with contemporary drawing practices.",
            "id": "ART 612",
            "parent": "ART",
            "title": "ADVANCED DRAWING II"
        }
    },
    {
        "data": {
            "description": "Continued investigation in sculpture studio practices with an emphasis on developing concepts and technique.",
            "id": "ART 314",
            "parent": "ART",
            "title": "SCULPTURE II"
        }
    },
    {
        "data": {
            "description": "Continued investigation into forming; hand-building, throwing, slip-casting, press molding; with emphasis on individual form concepts. Glazing, decorating, firing techniques including reduction, oxidation and primitive methods.",
            "id": "ART 324",
            "parent": "ART",
            "title": "CERAMICS II"
        }
    },
    {
        "data": {
            "description": "Continued investigations in watercolor and mixed media works on paper with goal of development of concepts and technical skill.",
            "id": "ART 342",
            "parent": "ART",
            "title": "WATERCOLOR II"
        }
    },
    {
        "data": {
            "description": "Continuing instruction in the use of various materials as required by each student in terms of the formal and conceptual basis of their work. Emphasis on the development of individually directed studio projects, professional art practices, and preparing work for exhibition.",
            "id": "ART 614",
            "parent": "ART",
            "title": "ADVANCED SCULPTURE WORKSHOP 2"
        }
    },
    {
        "data": {
            "description": "Covers the theory and practice of designing newspapers, magazines, books, and other narrative forms. Emphasis will be placed on advanced typographic theory, and advanced digital and manual production skills.",
            "id": "ART 546",
            "parent": "ART",
            "title": "GRAPHIC DESIGN FOR PUBLICATIONS"
        }
    },
    {
        "data": {
            "description": "Defines the role of packaging in product identification, presentation, and production. The unique challenges of adapting typography, illustration, design and materials to three-dimensional forms are explored. Research includes marketing objectives, structural integrity and display aesthetics.",
            "id": "ART 465",
            "parent": "ART",
            "title": "GRAPHIC DESIGN FOR PACKAGING"
        }
    },
    {
        "data": {
            "description": "Development of advanced concepts and techniques in lithography, to include drawing on stone with crayon and tusche, transfer techniques, color processes; studio practice, lectures, discussions, and critiques.",
            "id": "ART 516",
            "parent": "ART",
            "title": "ADVANCED LITHOGRAPHY"
        }
    },
    {
        "data": {
            "description": "Development of advanced concepts and techniques in wood-based functional and/or fine art forms.",
            "id": "ART 534",
            "parent": "ART",
            "title": "ADVANCED WOOD WORKING"
        }
    },
    {
        "data": {
            "description": "Development of advanced concepts and techniques using silk screen processes to create fine art forms.",
            "id": "ART 536",
            "parent": "ART",
            "title": "ADVANCED SERIGRAPHY"
        }
    },
    {
        "data": {
            "description": "Development of technical processes, concepts, historical continuity. Study and application of various media of oils, acrylics, collage materials.",
            "id": "ART 322",
            "parent": "ART",
            "title": "INTERMEDIATE PAINTING I"
        }
    },
    {
        "data": {
            "description": "Direct drawing on stone with crayon and tusche, transfer techniques, color processes; studio practice, lectures, discussions, and critiques.",
            "id": "ART 316",
            "parent": "ART",
            "title": "LITHOGRAPHY"
        }
    },
    {
        "data": {
            "description": "Elements and principles of design relevant to design of the visual environment.",
            "id": "DS 120",
            "parent": "DS",
            "title": "DESIGN: FUNDAMENTALS I"
        }
    },
    {
        "data": {
            "description": "Emphasis on advanced techniques, color, personal concepts and expression, criticism, communicative potential of photography.",
            "id": "ART 576",
            "parent": "ART",
            "title": "ADVANCED PHOTOGRAPHY"
        }
    },
    {
        "data": {
            "description": "Emphasis on color problems, surface qualities; studio practice, discussion, critiques.",
            "id": "ART 506",
            "parent": "ART",
            "title": "ADVANCED RELIEF PRINTMAKING"
        }
    },
    {
        "data": {
            "description": "Examine conceptual and technical processes used for designing fonts and typefaces in a digital environment.",
            "id": "ART 565",
            "parent": "ART",
            "title": "TYPEFACE DESIGN"
        }
    },
    {
        "data": {
            "description": "Examines conceptual and technical processes used setting type in motion in a digital environment using digital video, computer graphic, and digital photo technologies. Students must takeART 107andART 346prior to enrolling in this course.",
            "id": "ART 568",
            "parent": "ART",
            "title": "MOTION TYPOGRAPHY"
        }
    },
    {
        "data": {
            "description": "Examines the design of posters as a mode of communication. Students will learn to create effective combinations of words and images that mobilize principles of composition, perception, and rhetoric. Projects will encourage students to further explore graphic design as a means of communication, artistic expression, and information organization.",
            "id": "ART 467",
            "parent": "ART",
            "title": "GRAPHIC DESIGN FOR POSTERS"
        }
    },
    {
        "data": {
            "description": "Examines the major developments in graphic design and typography as the fields slowly emerged and began to define themselves during the 19th, 20th, and 21st centuries.",
            "id": "ART 438",
            "parent": "ART",
            "title": "HISTORY OF GRAPHIC DESIGN AND TYPOGRAPHY"
        }
    },
    {
        "data": {
            "description": "Exploration of wood as a medium for constructing creative and functional three-dimensional forms.",
            "id": "ART 334",
            "parent": "ART",
            "title": "WOOD WORKING"
        }
    },
    {
        "data": {
            "description": "Explore creative visual interface and interactive storytelling for the Web.",
            "id": "ART 556",
            "parent": "ART",
            "title": "GRAPHIC DESIGN FOR INTERACTIVE MEDIA"
        }
    },
    {
        "data": {
            "description": "Explore current and historical practices in the digital fine arts while refining conceptual and technical understanding of digital art forms as powerful tools for generating and communicating images and ideas. Students will create and manipulate both static and moving imagery, with implications for digital drawing, painting, print-making, video editing/post-production, and narrative or non-narrative 2D animation in a fine art context.",
            "id": "ART 428",
            "parent": "ART",
            "title": "DIGITAL IMAGING STUDIO"
        }
    },
    {
        "data": {
            "description": "Explore the aesthetic of computational graphic design and typography with physical interaction, sound, data, and digital fabrication.",
            "id": "ART 356",
            "parent": "ART",
            "title": "CODING FOR GRAPHIC DESIGN"
        }
    },
    {
        "data": {
            "description": "Explore the drawing process through projects that address one or more formal, technical, and/or conceptual issues. The concept of drawing as a vehicle for conveying ideas will be addressed through the study of composition, illusional space, perspective and proportion, and the analysis of form.",
            "id": "ART 212",
            "parent": "ART",
            "title": "DRAWING METHODS & CONCEPTS"
        }
    },
    {
        "data": {
            "description": "Focuses on developing an understanding of design processes through the utilization of specific fabrication materials and methods. Experience is gained in giving form to objects and products. Prototyping techniques and digital design tools will be explored. In addition, investigates the movements in the history of product design and the development of materials, production, technologies, consumption and other social and cultural concerns that impact the field. A special focus on the identification and use of sustainable materials and processes.",
            "id": "ART 558",
            "parent": "ART",
            "title": "PRODUCT DEVELOPMENT FOR GRAPHIC DESIGN"
        }
    },
    {
        "data": {
            "description": "Focuses on performance made for the screen including first person narrative, spoken word, video dance, fictional cinema, experimental documentary and other forms of mediated performance practice.",
            "id": "ART 531",
            "parent": "ART",
            "title": "SCREEN PERFORMANCE"
        }
    },
    {
        "data": {
            "description": "Foundational elements of theatrical design and developing the skills to translate text into visual and/or aural content. Involves an introduction to script analysis; visual, aural, and dramaturgical research; problem solving skills; creative exploration and visual communication. Relevant to designers, directors, actors, stage managers, technicians, and informed audience members.",
            "id": "THEATRE 130",
            "parent": "THEATRE",
            "title": "FUNDAMENTALS OF THEATRICAL DESIGN"
        }
    },
    {
        "data": {
            "description": "Further advanced study in the art of metalsmithing.",
            "id": "ART 644",
            "parent": "ART",
            "title": "ADVANCED ART METAL II"
        }
    },
    {
        "data": {
            "description": "Further examination of the percepts of drawing with the human figure. Emphasis on formal elements. Problems of structure. Intense studio practice working from the model.",
            "id": "ART 532",
            "parent": "ART",
            "title": "ADVANCED LIFE DRAWING I"
        }
    },
    {
        "data": {
            "description": "Further investigation into anatomical structure and intrinsic forms involved in drawing from different models. Development of concepts and technique.",
            "id": "ART 332",
            "parent": "ART",
            "title": "LIFE DRAWING II"
        }
    },
    {
        "data": {
            "description": "Game design is a subdiscipline in which graphic designers create meaningful play and interactive experience through words, images, structure, process, and the study of user experience. This course, which explores both digital and non-digital games, aims to provide you with a critical vocabulary and historical context for analyzing games, as well as the skills and techniques necessary to incorporate game design into your ongoing design practice.",
            "id": "ART 563",
            "parent": "ART",
            "title": "GRAPHIC DESIGN FOR GAMES"
        }
    },
    {
        "data": {
            "description": "Gives students direct experience in the field of graphic design by working on actual client-based projects. Projects vary each term, and include both on and off campus clients. The course operates as professional design studio doing work for university, local and regional clients.",
            "id": "ART 663",
            "parent": "ART",
            "title": "GRAPHIC DESIGN PRACTICUM"
        }
    },
    {
        "data": {
            "description": "Glassworking toward a personal concept of material.",
            "id": "ART 354",
            "parent": "ART",
            "title": "GLASSWORKING"
        }
    },
    {
        "data": {
            "description": "Graduate level instruction in all ceramics processes.",
            "id": "ART 924",
            "parent": "ART",
            "title": "ADVANCED RESEARCH-CERAMICS"
        }
    },
    {
        "data": {
            "description": "Graduate level instruction in all drawing media processes.",
            "id": "ART 912",
            "parent": "ART",
            "title": "ADVANCED RESEARCH-DRAWING"
        }
    },
    {
        "data": {
            "description": "Graduate level instruction in all painting media.",
            "id": "ART 722",
            "parent": "ART",
            "title": "GRADUATE PAINTING I"
        }
    },
    {
        "data": {
            "description": "Graduate level instruction in all painting processes.",
            "id": "ART 922",
            "parent": "ART",
            "title": "ADVANCED RESEARCH-PAINTING"
        }
    },
    {
        "data": {
            "description": "Graduate level instruction in all printmaking and photography processes.",
            "id": "ART 996",
            "parent": "ART",
            "title": "ADVANCED RESEARCH-GRAPHICS"
        }
    },
    {
        "data": {
            "description": "Graduate level instruction in all sculpture processes.",
            "id": "ART 914",
            "parent": "ART",
            "title": "ADVANCED RESEARCH-SCULPTURE"
        }
    },
    {
        "data": {
            "description": "Graduate level instruction in metalsmithing.",
            "id": "ART 944",
            "parent": "ART",
            "title": "ADVANCED RESEARCH-ART METAL"
        }
    },
    {
        "data": {
            "description": "Graduate level investigations of advanced intaglio methods; exploration toward an individual and mature imagery in graphics materials.",
            "id": "ART 726",
            "parent": "ART",
            "title": "GRADUATE INTAGLIO PRINTMAKING I"
        }
    },
    {
        "data": {
            "description": "Graduate level study in advanced graphics media. Emphasis on development of personal concepts.",
            "id": "ART 736",
            "parent": "ART",
            "title": "GRADUATE GRAPHICS WORKSHOP I"
        }
    },
    {
        "data": {
            "description": "Group critique for advanced students working in the various disciplines of the visual arts.",
            "id": "ART 608",
            "parent": "ART",
            "title": "INTERDISCIPLINARY CRITIQUE IN THE VISUAL ARTS"
        }
    },
    {
        "data": {
            "description": "Historical survey of visual theatre, painting, and architectural styles adapted to various dramatic forms. Application of design elements and styles to contemporary theatre productions.",
            "id": "ART/THEATRE 572",
            "title": "SET DESIGN II"
        }
    },
    {
        "data": {
            "description": "Independent graduate work in advanced area of study under direction of art faculty.",
            "id": "ART 999",
            "parent": "ART",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Independent undergraduate work in advanced area of study under direction of art faculty.",
            "id": "ART 699",
            "parent": "ART",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Instruction in the use of various materials as required by the individual in terms of the formal and conceptual basis of the work. Emphasis on independent research and development of studio projects.",
            "id": "ART 514",
            "parent": "ART",
            "title": "ADVANCED SCULPTURE WORKSHOP 1"
        }
    },
    {
        "data": {
            "description": "Intermediate/advanced class covering the theory and practice of 3D digital modeling and animation software as a tool for making art.",
            "id": "ART 529",
            "parent": "ART",
            "title": "3D DIGITAL STUDIO II"
        }
    },
    {
        "data": {
            "description": "Introduces the basic principles of graphic design. Develop an initial understanding of formal, conceptual, and technical aspects of the field. Emphasis will be given to the importance of working process, presentation and craftsmanship.",
            "id": "ART 346",
            "parent": "ART",
            "title": "BASIC GRAPHIC DESIGN"
        }
    },
    {
        "data": {
            "description": "Introduces the principles of sewn construction and addresses the physical and aesthetic properties of fiber and fabrics in the context of apparel design. The studios address skills necessary to plan and construct basic garments. Lectures, hands-on studios, and critiques explore the fundamentals of apparel structure and emphasize the interrelationship of fabric, design and apparel construction as well as the creative, expressive potential of materials and making.",
            "id": "DS 153",
            "parent": "DS",
            "title": "SEWN CONSTRUCTION I"
        }
    },
    {
        "data": {
            "description": "Introduction to graduate study in art. Will explore the relationships between the contemporary art world, research and studio practice, theoretical issues, and education in the arts. Also addresses building and sustaining a career in the arts.",
            "id": "ART 700",
            "parent": "ART",
            "title": "INTRODUCTION TO GRADUATE STUDIES IN ART"
        }
    },
    {
        "data": {
            "description": "Introduction to intaglio printmaking techniques. Studio problems in platemaking and printing.",
            "id": "ART 326",
            "parent": "ART",
            "title": "ETCHING"
        }
    },
    {
        "data": {
            "description": "Introduction to light as sculptural medium including techniques for creating art using luminous tubes.",
            "id": "ART 454",
            "parent": "ART",
            "title": "NEON: LIGHT AS SCULPTURE"
        }
    },
    {
        "data": {
            "description": "Introduction to more advanced printing techniques, large format camera, critical analysis, and discussion of history of photography and current trends.",
            "id": "ART 476",
            "parent": "ART",
            "title": "INTERMEDIATE PHOTOGRAPHY"
        }
    },
    {
        "data": {
            "description": "Introduction to techniques and basic sculpture concepts to provide a survey of sculpture studio practices.",
            "id": "ART 214",
            "parent": "ART",
            "title": "SCULPTURE I"
        }
    },
    {
        "data": {
            "description": "Introduction to the practice and application of digital fabrication technologies in an artistic context with an emphasis on extending and integrating with traditional material approaches to art production. Includes theoretical readings devoted to the implications of digital and machine technologies on art practice.",
            "id": "ART 409",
            "parent": "ART",
            "title": "DIGITAL FABRICATION STUDIO"
        }
    },
    {
        "data": {
            "description": "Introduction to three-dimensional modeling in the computer, in particular the use of 3D digital models for the creation of images and objects.",
            "id": "ART 429",
            "parent": "ART",
            "title": "3D DIGITAL STUDIO I"
        }
    },
    {
        "data": {
            "description": "Introduction to tools, techniques and concepts of digital photography, with an emphasis on the workflow beginning with composition and image capture, to digital manipulation and enhancement, to the end goal of print or online publication. Develop a robust fundamental skill set in digital photography through lectures, readings, discussions, practical instruction, instructor review and group critiques.",
            "id": "ART 176",
            "parent": "ART",
            "title": "DIGITAL PHOTOGRAPHY FOR NON-ART MAJORS"
        }
    },
    {
        "data": {
            "description": "Introduction to user-centered, responsive web design for mobile, tablet, and laptop. Write HTML, CSS, and Javascript directly to design and develop fully responsive websites.",
            "id": "ART 333",
            "parent": "ART",
            "title": "INTRO TO RESPONSIVE WEB DESIGN"
        }
    },
    {
        "data": {
            "description": "Introduction to various technical processes and aspects of painting. Studio practice, lectures, discussions, and critiques.",
            "id": "ART 222",
            "parent": "ART",
            "title": "INTRODUCTION TO PAINTING"
        }
    },
    {
        "data": {
            "description": "Investigation and explanation of papermaking by hand as it relates to printmaking, drawing, and sculpture. History of papermaking stressing the last hundred years. Techniques of the craft, traditional sheet forming and use of paper pulp as pure plastic material with same educational goals as metal, ceramics, and wood.",
            "id": "ART 466",
            "parent": "ART",
            "title": "PAPERMAKING: HISTORY, ELEMENTS AND TECHNIQUES"
        }
    },
    {
        "data": {
            "description": "Materials and techniques of silk screen process; silk screen as a fine art form.",
            "id": "ART 336",
            "parent": "ART",
            "title": "SERIGRAPHY"
        }
    },
    {
        "data": {
            "description": "Painting with watercolor and mixed media on paper. Experimental and traditional uses of the media will be explored, emphasizing drawing, composition, and imagination. Field trips.",
            "id": "ART 242",
            "parent": "ART",
            "title": "WATERCOLOR I"
        }
    },
    {
        "data": {
            "description": "Present studio research to peers and faculty and engage with collaborative audience representing multiple artistic disciplines. Provides a holistic understanding of the creative process as it relates to practice and research. Diverse array of skills-sets and the opportunity to influence and enhance the creative process strengthening abilities in performing analysis and critical inquiry into practice and research.",
            "id": "ART 740",
            "parent": "ART",
            "title": "INTERDISCIPLINARY GRADUATE CRITIQUE"
        }
    },
    {
        "data": {
            "description": "Principles and techniques in video art.",
            "id": "ART 518",
            "parent": "ART",
            "title": "ARTIST'S VIDEO"
        }
    },
    {
        "data": {
            "description": "Principles of composition, scale, perspective, and color applied to the stage; production of ground plans, elevations, sketches, and models.",
            "id": "ART/THEATRE 372",
            "title": "SET DESIGN I"
        }
    },
    {
        "data": {
            "description": "Production of audio soundtracks to complement the work of artists. The relationship of sound and music to dance, video, film, computer art, and other interdisciplinary forms.",
            "id": "ART/DANCE 341",
            "title": "SOUND DESIGN FOR THE PERFORMING AND VISUAL ARTS"
        }
    },
    {
        "data": {
            "description": "Prominent artists, curators  critics present their work through lectures and visual presentations.",
            "id": "ART 508",
            "parent": "ART",
            "title": "COLLOQUIUM IN ART"
        }
    },
    {
        "data": {
            "description": "Properties of clay and fundamentals of forming; hand-building, throwing, slip-casting, press molding; with emphasis on individual form concepts. Glazing, decorating, firing techniques including reduction, oxidation and primitive methods.",
            "id": "ART 224",
            "parent": "ART",
            "title": "CERAMICS I"
        }
    },
    {
        "data": {
            "description": "Provides an introduction to exhibition design from spatial typography, posters, banners, and wayfinding to online exhibition design, including virtual reality for the Web.",
            "id": "ART 443",
            "parent": "ART",
            "title": "GRAPHIC DESIGN FOR EXHIBITIONS"
        }
    },
    {
        "data": {
            "description": "Provides an introduction to the fundamentals of two-dimensional design. Develop a clear understanding of visual communication through problem-solving and formal and conceptual experimentation. Learn the elements and principles of design and manipulate those using analog and digital processes. Introduction to the Adobe Creative Suite of products, including InDesign, Illustrator, and (to a lesser degree) Photoshop. Serves as an introduction to professional presentation skills and techniques to hone craftsmanship.",
            "id": "ART 102",
            "parent": "ART",
            "title": "TWO-DIMENSIONAL DESIGN"
        }
    },
    {
        "data": {
            "description": "Provides students with fundamental skills in combining had printed and digital output.  Hybrid print integrates laser plate, monoprint, collograph, stencil, stamping, and embossment with inkjet output.  Focuses on enhancement of digital output through integration of hand printed elements.",
            "id": "ART 348",
            "parent": "ART",
            "title": "INTRODUCTION TO DIGITAL PRINTMAKING"
        }
    },
    {
        "data": {
            "description": "Research in advanced intaglio techniques. Color printing.",
            "id": "ART 526",
            "parent": "ART",
            "title": "ADVANCED ETCHING/INTAGLIO"
        }
    },
    {
        "data": {
            "description": "Reviews common welding and metal fabrication techniques available to artists, including various welding processes, brazing techniques, torch work, cutting devices, bending methods, and finishing techniques.  Mild steel will be the primary material of exploration.",
            "id": "ART 343",
            "parent": "ART",
            "title": "METAL FABRICATION AND WELDING IN SCULPTURE"
        }
    },
    {
        "data": {
            "description": "Seek answers to the fundamental question \"What is art?\" from multiple perspectives such as historical, theoretical, critical, conceptual, formal, and experiential. Develop visual literacy, sophisticated observational skills and a formal language to assist in the interpretation of objects and experiences in the context of art. Through both theory and practice, develop an understanding of the ways artists arrive at the ideas that inform their creative processes. Includes a survey of developments in art media and looks broadly at art movements, trends and styles throughout history and in varied world cultures.",
            "id": "ART 100",
            "parent": "ART",
            "title": "INTRODUCTION TO ART"
        }
    },
    {
        "data": {
            "description": "Special topics in grad-level seminars.",
            "id": "ART 908",
            "parent": "ART",
            "title": "SEMINAR-ART"
        }
    },
    {
        "data": {
            "description": "Students discuss community-based practices in the field, and will work with a community partner in an art-related capacity.",
            "id": "ART 338",
            "parent": "ART",
            "title": "SERVICE LEARNING IN ART"
        }
    },
    {
        "data": {
            "description": "Studio design problems in two and three dimensional off-loom constructions; off-loom weaving, looping, and knotting; historical reference and contemporary application.",
            "id": "ART/DS 226",
            "title": "TEXTILE DESIGN: OFF-LOOM CONSTRUCTION"
        }
    },
    {
        "data": {
            "description": "Technical processes; emphasis on personal expression, concepts, in various approaches to painting.",
            "id": "ART 522",
            "parent": "ART",
            "title": "ADVANCED PAINTING I"
        }
    },
    {
        "data": {
            "description": "Techniques, philosophies, and concepts in photography as an art form. Emphasis on personal expression and relationship to other media.",
            "id": "ART 376",
            "parent": "ART",
            "title": "PHOTOGRAPHY"
        }
    },
    {
        "data": {
            "description": "The exploration of conceptual drawing in various media. Emphasis on conceptual/formal solutions.",
            "id": "ART 312",
            "parent": "ART",
            "title": "INTERMEDIATE DRAWING I"
        }
    },
    {
        "data": {
            "description": "The human figure as a source for creative and independent viewpoints in painting and other media. Students work together in the painting studio from a live model and from other figural sources.",
            "id": "ART 452",
            "parent": "ART",
            "title": "INTERMEDIATE PAINTING: NEW FIGURATION I"
        }
    },
    {
        "data": {
            "description": "The multiple and sequential visual imagery of the non-printed book, including its design and creation.",
            "id": "ART 446",
            "parent": "ART",
            "title": "ARTISTS' BOOKS"
        }
    },
    {
        "data": {
            "description": "The relationship of hand weaving to textural surfaces and sculptural forms are examined through the study of problems including structure, pattern, composition, and additional conceptual technical possibilities. Content is explored in the development of individual direction and in relationship to the discussion of historical and contemporary textiles and other works of art. Pursue an advanced investigation of concept and technique of hand-woven cloth.",
            "id": "ART/DS 229",
            "title": "TEXTILE DESIGN: WEAVING I"
        }
    },
    {
        "data": {
            "description": "This course examines the theory and practice of visual representation of information. Students will learn to create effective and illuminating graphical displays of data based on four basic formulations -- location, time, category, hierarchy, and index.",
            "id": "ART 463",
            "parent": "ART",
            "title": "INFORMATION GRAPHICS"
        }
    },
    {
        "data": {
            "description": "This is an advanced graphic design course with an emphasis on corporate brand identity development. Topics can include mark development, product packaging, marketing and advertising collateral, web branding, and broadcast advertising development. Special attention is given the application of semiotics and other forms of basic communication theory to the design process.",
            "id": "ART 458",
            "parent": "ART",
            "title": "GRAPHIC DESIGN FOR BRANDING AND IDENTITY"
        }
    },
    {
        "data": {
            "description": "This online course allows students who have found outside art-related internships to earn academic credit in connection with their work experience.",
            "id": "ART 393",
            "parent": "ART",
            "title": "INTERNSHIPS IN ART"
        }
    },
    {
        "data": {
            "description": "Thrown and hand-built forms, clay bodies, glazes, firing, general studio procedure; emphasis on development of personal concepts.",
            "id": "ART 524",
            "parent": "ART",
            "title": "ADVANCED CERAMICS I"
        }
    },
    {
        "data": {
            "description": "To develop perceptions, use of perspective, line, light and dark, development of space, and expressive qualities in drawing.",
            "id": "ART 112",
            "parent": "ART",
            "title": "DRAWING I"
        }
    },
    {
        "data": {
            "description": "Topical courses in art at an advanced level.",
            "id": "ART 548",
            "parent": "ART",
            "title": "SPECIAL TOPICS: ADVANCED LEVEL"
        }
    },
    {
        "data": {
            "description": "Topics courses exploring advanced concepts in historical, theoretical and studio practices in the discipline of time-based art forms, including but not limited to: digital animation, video, installation, and visual art performance.",
            "id": "ART 570",
            "parent": "ART",
            "title": "ADVANCED TOPICS IN 4D ART"
        }
    },
    {
        "data": {
            "description": "Topics courses exploring historical, theoretical and studio components surrounding time-based art forms including digital animation, video, installation, and visual art performance.",
            "id": "ART 470",
            "parent": "ART",
            "title": "SPECIAL TOPICS IN 4D ART"
        }
    },
    {
        "data": {
            "description": "Traditional and nontraditional methods of fine art foundry.",
            "id": "ART 414",
            "parent": "ART",
            "title": "ART FOUNDRY"
        }
    },
    {
        "data": {
            "description": "Transparent and opaque watercolor media; studio practice, critiques, field trips.",
            "id": "ART 542",
            "parent": "ART",
            "title": "ADVANCED WATERCOLOR I"
        }
    },
    {
        "data": {
            "description": "Various beginning-level special topics courses in Art.",
            "id": "ART 448",
            "parent": "ART",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "Woodcut, collage print, linoleum cut, and wood engraving; color printing. Studio practice, lectures, discussion, critiques.",
            "id": "ART 306",
            "parent": "ART",
            "title": "RELIEF PRINTMAKING"
        }
    },
    {
        "data": {
            "id": "ART",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "DS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "THEATRE",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ART 100",
            "target": "ART 232"
        }
    },
    {
        "data": {
            "source": "ART 100",
            "target": "ART 318"
        }
    },
    {
        "data": {
            "source": "ART 100",
            "target": "ART 512"
        }
    },
    {
        "data": {
            "source": "ART 102",
            "target": "ART 333"
        }
    },
    {
        "data": {
            "source": "ART 102",
            "target": "ART 346"
        }
    },
    {
        "data": {
            "source": "ART 102",
            "target": "ART 438"
        }
    },
    {
        "data": {
            "source": "ART 102",
            "target": "ART 442"
        }
    },
    {
        "data": {
            "source": "ART 102",
            "target": "ART 443"
        }
    },
    {
        "data": {
            "source": "ART 102",
            "target": "ART 463"
        }
    },
    {
        "data": {
            "source": "ART 102",
            "target": "ART 465"
        }
    },
    {
        "data": {
            "source": "ART 102",
            "target": "ART 467"
        }
    },
    {
        "data": {
            "source": "ART 102",
            "target": "ART 563"
        }
    },
    {
        "data": {
            "source": "ART 102",
            "target": "ART 564"
        }
    },
    {
        "data": {
            "source": "ART 102",
            "target": "ART 575"
        }
    },
    {
        "data": {
            "source": "ART 102",
            "target": "ART 663"
        }
    },
    {
        "data": {
            "source": "ART 104",
            "target": "ART 214"
        }
    },
    {
        "data": {
            "source": "ART 104",
            "target": "ART 334"
        }
    },
    {
        "data": {
            "source": "ART 107",
            "target": "ART 309"
        }
    },
    {
        "data": {
            "source": "ART 107",
            "target": "ART 318"
        }
    },
    {
        "data": {
            "source": "ART 107",
            "target": "ART 333"
        }
    },
    {
        "data": {
            "source": "ART 107",
            "target": "ART 346"
        }
    },
    {
        "data": {
            "source": "ART 107",
            "target": "ART 409"
        }
    },
    {
        "data": {
            "source": "ART 107",
            "target": "ART 429"
        }
    },
    {
        "data": {
            "source": "ART 107",
            "target": "ART 565"
        }
    },
    {
        "data": {
            "source": "ART 107",
            "target": "ART 568"
        }
    },
    {
        "data": {
            "source": "ART 112",
            "target": "ART 212"
        }
    },
    {
        "data": {
            "source": "ART 176",
            "target": "ART 376"
        }
    },
    {
        "data": {
            "source": "ART 176",
            "target": "ART 428"
        }
    },
    {
        "data": {
            "source": "ART 176",
            "target": "ART 476"
        }
    },
    {
        "data": {
            "source": "ART 208",
            "target": "ART 518"
        }
    },
    {
        "data": {
            "source": "ART 212",
            "target": "ART 232"
        }
    },
    {
        "data": {
            "source": "ART 212",
            "target": "ART 312"
        }
    },
    {
        "data": {
            "source": "ART 214",
            "target": "ART 314"
        }
    },
    {
        "data": {
            "source": "ART 214",
            "target": "ART 521"
        }
    },
    {
        "data": {
            "source": "ART 222",
            "target": "ART 242"
        }
    },
    {
        "data": {
            "source": "ART 222",
            "target": "ART 302"
        }
    },
    {
        "data": {
            "source": "ART 222",
            "target": "ART 322"
        }
    },
    {
        "data": {
            "source": "ART 222",
            "target": "ART 452"
        }
    },
    {
        "data": {
            "source": "ART 224",
            "target": "ART 324"
        }
    },
    {
        "data": {
            "source": "ART 224",
            "target": "ART 354"
        }
    },
    {
        "data": {
            "source": "ART 232",
            "target": "ART 332"
        }
    },
    {
        "data": {
            "source": "ART 242",
            "target": "ART 342"
        }
    },
    {
        "data": {
            "source": "ART 244",
            "target": "ART 343"
        }
    },
    {
        "data": {
            "source": "ART 244",
            "target": "ART 544"
        }
    },
    {
        "data": {
            "source": "ART 302",
            "target": "ART 222"
        }
    },
    {
        "data": {
            "source": "ART 306",
            "target": "ART 326"
        }
    },
    {
        "data": {
            "source": "ART 306",
            "target": "ART 348"
        }
    },
    {
        "data": {
            "source": "ART 306",
            "target": "ART 506"
        }
    },
    {
        "data": {
            "source": "ART 306",
            "target": "ART 636"
        }
    },
    {
        "data": {
            "source": "ART 307",
            "target": "ART 507"
        }
    },
    {
        "data": {
            "source": "ART 312",
            "target": "ART 512"
        }
    },
    {
        "data": {
            "source": "ART 314",
            "target": "ART 514"
        }
    },
    {
        "data": {
            "source": "ART 316",
            "target": "ART 516"
        }
    },
    {
        "data": {
            "source": "ART 318",
            "target": "ART 518"
        }
    },
    {
        "data": {
            "source": "ART 322",
            "target": "ART 522"
        }
    },
    {
        "data": {
            "source": "ART 324",
            "target": "ART 524"
        }
    },
    {
        "data": {
            "source": "ART 326",
            "target": "ART 336"
        }
    },
    {
        "data": {
            "source": "ART 326",
            "target": "ART 526"
        }
    },
    {
        "data": {
            "source": "ART 332",
            "target": "ART 532"
        }
    },
    {
        "data": {
            "source": "ART 334",
            "target": "ART 534"
        }
    },
    {
        "data": {
            "source": "ART 336",
            "target": "ART 536"
        }
    },
    {
        "data": {
            "source": "ART 342",
            "target": "ART 542"
        }
    },
    {
        "data": {
            "source": "ART 343",
            "target": "ART 414"
        }
    },
    {
        "data": {
            "source": "ART 346",
            "target": "ART 356"
        }
    },
    {
        "data": {
            "source": "ART 346",
            "target": "ART 438"
        }
    },
    {
        "data": {
            "source": "ART 346",
            "target": "ART 442"
        }
    },
    {
        "data": {
            "source": "ART 346",
            "target": "ART 458"
        }
    },
    {
        "data": {
            "source": "ART 346",
            "target": "ART 463"
        }
    },
    {
        "data": {
            "source": "ART 346",
            "target": "ART 465"
        }
    },
    {
        "data": {
            "source": "ART 346",
            "target": "ART 467"
        }
    },
    {
        "data": {
            "source": "ART 346",
            "target": "ART 525"
        }
    },
    {
        "data": {
            "source": "ART 346",
            "target": "ART 546"
        }
    },
    {
        "data": {
            "source": "ART 346",
            "target": "ART 558"
        }
    },
    {
        "data": {
            "source": "ART 346",
            "target": "ART 560"
        }
    },
    {
        "data": {
            "source": "ART 346",
            "target": "ART 563"
        }
    },
    {
        "data": {
            "source": "ART 346",
            "target": "ART 575"
        }
    },
    {
        "data": {
            "source": "ART 346",
            "target": "ART 656"
        }
    },
    {
        "data": {
            "source": "ART 346",
            "target": "ART 663"
        }
    },
    {
        "data": {
            "source": "ART 354",
            "target": "ART 554"
        }
    },
    {
        "data": {
            "source": "ART 376",
            "target": "ART 446"
        }
    },
    {
        "data": {
            "source": "ART 376",
            "target": "ART 476"
        }
    },
    {
        "data": {
            "source": "ART 429",
            "target": "ART 529"
        }
    },
    {
        "data": {
            "source": "ART 438",
            "target": "ART 356"
        }
    },
    {
        "data": {
            "source": "ART 438",
            "target": "ART 443"
        }
    },
    {
        "data": {
            "source": "ART 438",
            "target": "ART 458"
        }
    },
    {
        "data": {
            "source": "ART 438",
            "target": "ART 525"
        }
    },
    {
        "data": {
            "source": "ART 438",
            "target": "ART 546"
        }
    },
    {
        "data": {
            "source": "ART 438",
            "target": "ART 558"
        }
    },
    {
        "data": {
            "source": "ART 438",
            "target": "ART 565"
        }
    },
    {
        "data": {
            "source": "ART 438",
            "target": "ART 568"
        }
    },
    {
        "data": {
            "source": "ART 452",
            "target": "ART 552"
        }
    },
    {
        "data": {
            "source": "ART 467",
            "target": "ART 560"
        }
    },
    {
        "data": {
            "source": "ART 467",
            "target": "ART 564"
        }
    },
    {
        "data": {
            "source": "ART 470",
            "target": "ART 570"
        }
    },
    {
        "data": {
            "source": "ART 476",
            "target": "ART 576"
        }
    },
    {
        "data": {
            "source": "ART 512",
            "target": "ART 612"
        }
    },
    {
        "data": {
            "source": "ART 514",
            "target": "ART 614"
        }
    },
    {
        "data": {
            "source": "ART 524",
            "target": "ART 624"
        }
    },
    {
        "data": {
            "source": "ART 529",
            "target": "ART 629"
        }
    },
    {
        "data": {
            "source": "ART 532",
            "target": "ART 632"
        }
    },
    {
        "data": {
            "source": "ART 542",
            "target": "ART 642"
        }
    },
    {
        "data": {
            "source": "ART 544",
            "target": "ART 644"
        }
    },
    {
        "data": {
            "source": "ART 546",
            "target": "ART 556"
        }
    },
    {
        "data": {
            "source": "ART 546",
            "target": "ART 656"
        }
    },
    {
        "data": {
            "source": "ART 575",
            "target": "ART 556"
        }
    },
    {
        "data": {
            "source": "ART/DANCE 341",
            "target": "ART/DANCE 441"
        }
    },
    {
        "data": {
            "source": "ART/THEATRE 372",
            "target": "ART/THEATRE 572"
        }
    },
    {
        "data": {
            "source": "DS 120",
            "target": "ART/DS 226"
        }
    },
    {
        "data": {
            "source": "DS 153",
            "target": "ART/DS 226"
        }
    },
    {
        "data": {
            "source": "THEATRE 130",
            "target": "ART/THEATRE 366"
        }
    }
]