[
    {
        "data": {
            "description": "Sociological analysis of historical and recent ethnic/racial conflict and movements in the U.S., including the relations between European Americans, African Americans, Mexican Americans, Native Americans, and Asian Americans, with additional material on other groups and relations.",
            "id": "ASIANAM/SOC 220",
            "title": "ETHNIC MOVEMENTS IN THE UNITED STATES"
        }
    },
    {
        "data": {
            "description": "Explores the history and circumstances whereby Hmong Americans came together as a political unit to address the domestic and international concerns of the Hmong American community.",
            "id": "ASIANAM 441",
            "parent": "ASIANAM",
            "title": "HMONG AMERICAN SOCIAL MOVEMENTS IN THE 20TH AND 21ST CENTURIES"
        }
    },
    {
        "data": {
            "description": "Examines the diverse food cultures of Asian America as an entryway to questions about Asian American politics, identities, and histories. Considers Asian American food consumption, labor, and discourses in relation to challenging racism and fighting for belonging in the U.S.",
            "id": "ASIANAM 250",
            "parent": "ASIANAM",
            "title": "EATING ASIAN AMERICA"
        }
    },
    {
        "data": {
            "description": "Examines the impact of colonialism, war, and capitalism on the movement of Asians to the U.S. Considers how racial, gendered, class, sexual, and national formations within the U.S. structured Asian immigration to North America.",
            "id": "ASIANAM/HISTORY 160",
            "title": "ASIAN AMERICAN HISTORY: MOVEMENT AND DISLOCATION"
        }
    },
    {
        "data": {
            "description": "An examination of specific themes in Asian American life and culture. Topics may include comparative analyses of Asian American communities, Asian American experience and history, and the specific concerns and histories of Asian groups in the U.S., such as Korean, Hmong, South Asian, Southeast Asian, Chinese, and Japanese.",
            "id": "ASIANAM 240",
            "parent": "ASIANAM",
            "title": "TOPICS IN ASIAN AMERICAN STUDIES"
        }
    },
    {
        "data": {
            "description": "Survey of Asian American literature from 1880 to present.",
            "id": "ASIANAM/ENGL 270",
            "title": "A SURVEY OF ASIAN AMERICAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Introduction to the historical, sociological, anthropological, political, and cultural study of Americans of Asian ancestry.",
            "id": "ASIANAM 101",
            "parent": "ASIANAM",
            "title": "INTRODUCTION TO ASIAN AMERICAN STUDIES"
        }
    },
    {
        "data": {
            "description": "Representations of minority groups in U.S. news and entertainment mass media. Historical, social, political, economic, and other factors influencing the mass mediated depictions of minorities.",
            "id": "ASIANAM/JOURN 662",
            "title": "MASS MEDIA AND MINORITIES"
        }
    },
    {
        "data": {
            "description": "Introduction to comparative ethnic studies, examining race, ethnicity, and indigeneity within the United States. Includes perspectives from African American, American Indian, Asian American, and Chican@ and Latin@ studies.",
            "id": "AFROAMER/AMERIND/ASIANAM/CHICLA/FOLKLORE 102",
            "title": "INTRODUCTION TO COMPARATIVE US ETHNIC AND AMERICAN INDIAN STUDIES"
        }
    },
    {
        "data": {
            "description": "Explores the intersection between race and sexuality in American literature with an emphasis on sex/gender difference, feminism, transgenderism, and nationalism. Focuses on the nature of literature as advocacy, with an emphasis on Asian-American issues.",
            "id": "ASIANAM/ENGL/GEN&WS 463",
            "title": "RACE AND SEXUALITY IN AMERICAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Advanced directed study projects as arranged with a faculty member.",
            "id": "ASIANAM 699",
            "parent": "ASIANAM",
            "title": "INDEPENDENT STUDY: DIRECTED READINGS IN ASIAN AMERICAN STUDIES"
        }
    },
    {
        "data": {
            "description": "In-depth study of the peoples, conflicts, and wars in Cambodia, Laos, and Vietnam, with emphasis on the Cold War era (1945-1990) and on the resulting migration and resettlement of over one million Hmong, Khmer, Lao, and Vietnamese in the United States. Not open to students with credit for LCA 246 prior to Fall 2019.",
            "id": "ASIAN/ASIANAM/HISTORY 246",
            "title": "SOUTHEAST ASIAN REFUGEES OF THE \"COLD\" WAR"
        }
    },
    {
        "data": {
            "id": "ASIANAM",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Explores fantasy as a conduit of political meaning in Asian American fiction, graphic novels, anime, and art. Analyzes race as it circulates in visual mediums and literary texts. Engages issues such as stereotyping, caricature, and microaggressions; whitewashing, yellowface, and passing; race fetishism; cultural appropriation; multiracialism; kawaii or cute style; techno- orientalism and virtual Asians. Foregrounding fantasies of bodilessness, examine race as it is grafted onto nonhuman forms-objects, digital avatars, robots-at the borders of science and fiction. Examines how projections of the future reflect cultural anxieties about race, immigration, and Asian Americans.",
            "id": "ASIANAM 152",
            "parent": "ASIANAM",
            "title": "ASIAN AMERICAN LITERARY AND POPULAR CULTURE: RACE, FANTASY, FUTURES"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "An Afro Asian perspective provides a lens through which intersections between Asian American and African American dance and martial arts are studied and practiced. Asian American and African American movement genres provide tools to explore dance fusion, choreography, and improvisation, to create dances informed by African American and Asian American legacies of struggle, innovation and transformation, while cognizant of historical forces of oppression and racism. Building connections through respectful communication with others are learned through dance practice, discussion and writing about concepts learned through readings, videos, and guest artist visits. Engagement with dance as a cultural vehicle for creative problem-solving and risk-taking occurs through guided class or smaller group activities.",
            "id": "AFROAMER/ASIANAM/DANCE/FOLKLORE 319",
            "title": "AFRO ASIAN IMPROV: FROM HIP HOP TO MARTIAL ARTS FUSION"
        }
    },
    {
        "data": {
            "description": "Themes in Asian American Studies. Topics may include activism, public policy, history, poverty, family, law, immigration, diaspora, refugeeism, gender, sexuality.",
            "id": "ASIANAM 540",
            "parent": "ASIANAM",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "Introduction to the changing images of race and ethnicity in U.S. entertainment media and popular culture.  Surveys history, key concepts and contemporary debates regarding mediated representation of ethnic minorities. Critical and cultural studies approaches are emphasized.",
            "id": "CHICLA/COMARTS 347",
            "title": "RACE, ETHNICITY, AND MEDIA"
        }
    },
    {
        "data": {
            "description": "Throughout the history of Asian America, poetry has been a vehicle for the creation and exploration of an Asian American voice; in poetry we can see the continuing struggle over what form Asian American expression will take. Will it follow Asian or European models? Will it employ traditional forms, or experiment in search of new styles? Will it be individual or collective, introspective or political? We will explore these questions through a study of a wide range of Asian American poets from a variety of historical periods and ethnicities, including Janice Mirikitani, Lawson Fusao Inada, Li-Young Lee, John Yau, Myung Mi Kim, and Linh Dinh.",
            "id": "ASIANAM/ENGL 465",
            "title": "ASIAN AMERICAN POETRY"
        }
    },
    {
        "data": {
            "description": "Topics will vary. All topics will emphasize the following learning outcomes: awareness of history's impact on the present, ability to recognize and question assumptions, development of critical thinking skills, awareness of relations between self and others, and effective participation in a multicultural society.",
            "id": "ASIANAM/ENGL 462",
            "title": "TOPIC IN ASIAN AMERICAN LITERATURE"
        }
    },
    {
        "data": {
            "source": "ASIANAM 101",
            "target": "ASIANAM/COMARTS 420"
        }
    },
    {
        "data": {
            "description": "Topics in the arts and humanities that illuminate the Asian American experience.",
            "id": "ASIANAM 560",
            "parent": "ASIANAM",
            "title": "HUMANITIES TOPICS"
        }
    },
    {
        "data": {
            "description": "Explores how Hmong's participation in the Secret War that the U.S. waged in Laos shaped their experiences in the U.S., heightening the importance of Hmong Americans' social, cultural, and political self-definition and in making known their contributions to the advancement of U.S. society.",
            "id": "ASIANAM 170",
            "parent": "ASIANAM",
            "title": "HMONG AMERICAN EXPERIENCES IN THE UNITED STATES"
        }
    },
    {
        "data": {
            "source": "CHICLA/COMARTS 347",
            "target": "ASIANAM/COMARTS 420"
        }
    },
    {
        "data": {
            "description": "Examines the social, cultural, and political citizenship of Asians in the U.S. with particular emphasis on diaspora, transnationality, and place.",
            "id": "ASIANAM/HISTORY 161",
            "title": "ASIAN AMERICAN HISTORY: SETTLEMENT AND NATIONAL BELONGING"
        }
    },
    {
        "data": {
            "description": "Major texts by Asian American women writers.",
            "id": "ASIANAM/ENGL/GEN&WS 464",
            "title": "ASIAN AMERICAN WOMEN WRITERS"
        }
    },
    {
        "data": {
            "description": "Since the 19th century, \"America\" has often been defined by its relationship with \"Asia,\" through cultural influence, immigration, imperialism, and war. Traces the role of Asia and Asians in American literature and culture, from the Chinese and Japanese cultural influences that helped shape literary modernism to the rise of a distinctive culture produced by Asian immigrants to America and their descendants.",
            "id": "ASIANAM/ENGL 150",
            "title": "LITERATURE & CULTURE OF ASIAN AMERICA"
        }
    },
    {
        "data": {
            "description": "Techniques of exercises and movement forms derived from several Asian cultures as taught in the United States. Studied in the context of the construction and expression of ethnic and cultural identity.",
            "id": "ASIANAM/DANCE 121",
            "title": "ASIAN AMERICAN MOVEMENT"
        }
    },
    {
        "data": {
            "description": "Examines representations of Asian American in American media using historical, analytical, and critical approaches. Issues of cultural production, identity, race, politics, and gender are linked to examinations of specific media forms.",
            "id": "ASIANAM/COMARTS 420",
            "title": "ASIAN AMERICANS AND MEDIA"
        }
    }
]