[
    {
        "data": {
            "description": "Interdisciplinary approaches to specific social sciences topics in Asian studies. Topics may include comparative analysis of a theme across the countries in Asia or focus on a theme within a single country.",
            "id": "ASIAN 301",
            "parent": "ASIAN",
            "title": "SOCIAL SCIENCE TOPICS IN ASIAN STUDIES"
        }
    },
    {
        "data": {
            "description": "Survey of major cultural, social, political and economic developments in Japanese history from ancient to recent times.",
            "id": "ASIAN/HISTORY 104",
            "title": "INTRODUCTION TO EAST ASIAN HISTORY: JAPAN"
        }
    },
    {
        "data": {
            "description": "Survey of Korean cinema from the Golden Age classics of the 1950s and 1960s to new blockbuster hits and art-house films throughout the contemporary period; investigate not only the major genres of Korean cinema, but also the increased recognition throughout the world of such renowned Korean auteurs as Park Chan-wook and Bong Joon-ho; discusses the issues of colonialism, national division, civil war, military dictatorships, the democratic movement, and globalization.",
            "id": "ASIAN 374",
            "parent": "ASIAN",
            "title": "KOREAN CINEMA"
        }
    },
    {
        "data": {
            "description": "As an introduction to Southeast Asia, covers the ethnic, cultural, religious, and political histories of the region from the classical states period to the present, with an emphasis on colonialism, nationalism, decolonization, and the emergence of modern political and social systems into the 21st century, including an exposure to region's contemporary literature. Not open to students who completed LCA 244 prior to Fall 2019.",
            "id": "ASIAN/GEOG/HISTORY/POLISCI/SOC 244",
            "title": "INTRODUCTION TO SOUTHEAST ASIA:  VIETNAM TO THE PHILIPPINES"
        }
    },
    {
        "data": {
            "description": "India is home to one of the largest film industries in the world, Bollywood. Beyond Bollywood, India has a thriving film culture that caters to its many regional languages. Explore India's diverse, yet interconnected film and media cultures as well as the global resonances of Indian- and South-Asian-inflected media elsewhere. Examine questions of diasporic identity through media produced by the South Asian American community. Consider questions of genre, style and auteurship, ethnicity, decolonization, gender non-conformity, caste, settler colonialism, censorship and linguistic nationalism that shape cinematic discourses in the country and its intersection with South Asian diaspora in the United States.",
            "id": "ASIAN/COMARTS 443",
            "title": "INDIAN CINEMA IN THE U.S. AND BEYOND"
        }
    },
    {
        "data": {
            "description": "An interdisciplinary exploration of contemporary Indian society, politics, and culture. Consider the diverse, complex, and often contradictory fabric of modern India through the lens of several conceptual themes which consider emergent discourses and dynamics of change as the joint product of India's classical heritage and its transformation into a post-colonial nation-state since 1947. Explores tensions and continuities between the pre-modern and modern.",
            "id": "ASIAN 252",
            "parent": "ASIAN",
            "title": "CONTEMPORARY INDIAN SOCIETY"
        }
    },
    {
        "data": {
            "source": "ASIALANG 104",
            "target": "ASIALANG 203"
        }
    },
    {
        "data": {
            "source": "ASIALANG 304",
            "target": "ASIAN 563"
        }
    },
    {
        "data": {
            "description": "Covers Japanese literature from the late nineteenth through the present century. Not open to students with credit for E ASIAN 354 prior to Fall 2019.",
            "id": "ASIAN 355",
            "parent": "ASIAN",
            "title": "MODERN JAPANESE LITERATURE"
        }
    },
    {
        "data": {
            "source": "ASIALANG 103",
            "target": "ASIALANG 104"
        }
    },
    {
        "data": {
            "description": "Topics in the study of the visual cultures of East Asia from antiquity to the present. Focuses on illustrative texts and genres, major historiographic, theoretical, and methodological issues, and the technologies of vision and visuality in China, Japan, and Korea.",
            "id": "ASIAN 433",
            "parent": "ASIAN",
            "title": "TOPICS IN EAST ASIAN VISUAL CULTURES"
        }
    },
    {
        "data": {
            "description": "Offers the student an opportunity to work with a faculty member on an individual study program. Students must have junior or senior standing.",
            "id": "ASIAN 699",
            "parent": "ASIAN",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "A historical examination of the Korean War and the politics and society of North Korea and South Korea.",
            "id": "ASIAN/HISTORY 335",
            "title": "THE KOREAS: KOREAN WAR TO THE 21ST CENTURY"
        }
    },
    {
        "data": {
            "description": "An introduction to the culture, life-styles and thought of the Japanese people, with frequent reference to their history, literature and art. Not open to students with credit for E ASIAN 253 prior to Fall 2018",
            "id": "ASIAN 253",
            "parent": "ASIAN",
            "title": "JAPANESE POPULAR CULTURE"
        }
    },
    {
        "data": {
            "description": "Events leading to the Pearl Harbor attack, the conduct of World War II in the Pacific, the nature of the wartime Japanese state and effects of the war on Japanese society, the dropping of the atomic bombs, and Japan's decision to surrender. The war as an epoch in Japanese history.",
            "id": "ASIAN/HISTORY 456",
            "title": "PEARL HARBOR & HIROSHIMA: JAPAN, THE US & THE CRISIS IN ASIA"
        }
    },
    {
        "data": {
            "description": "Historical introduction to the important literary works of Japan, generally about courtly romance, idealized warriors, and the Buddhist search for enlightenment. This course will cover the classical period, from the eighth through the mid-nineteenth century; most material comes from the particularly wonderful tenth through sixteenth centuries. Not open to students with credit for E ASIAN 353 prior to Fall 2019.",
            "id": "ASIAN 353",
            "parent": "ASIAN",
            "title": "LOVERS, WARRIORS AND MONKS: SURVEY OF JAPANESE LITERATURE"
        }
    },
    {
        "data": {
            "description": "A historical survey of Hindu scriptures, rituals, philosophies, and ethics from the ancient to the contemporary world. Concepts such as karma, yoga, and reincarnation will be put in the broader contexts of Hindu theism, worship, and law. Not open to students who completed RELIG ST 355 prior to Fall 2019.",
            "id": "ASIAN/RELIGST 306",
            "title": "HINDUISM"
        }
    },
    {
        "data": {
            "description": "Explores the prolonged cycle of wars in Vietnam and its neighbors, 1940 to date, with due regard for both local and U.S. perspectives.",
            "id": "ASIAN/HISTORY 319",
            "title": "THE VIETNAM WARS"
        }
    },
    {
        "data": {
            "description": "Focus on proficiency in four skills (speaking, listening, reading, and writing) to communicate in Japanese in basic everyday situations. Continuation of skill development fromASIALANG 103. Students with prior experience in the language are required to take a placement test administered by the department. Not open to students with credit for E ASIAN 104 prior to Summer 2019.",
            "id": "ASIALANG 104",
            "parent": "ASIALANG",
            "title": "SECOND SEMESTER JAPANESE"
        }
    },
    {
        "data": {
            "description": "The disintegration of traditional Chinese society under the impact of Western imperialism, the rise of modern Chinese nationalism, and the emergence of modern revolutionary movements and ideologies.",
            "id": "ASIAN/HISTORY 341",
            "title": "HISTORY OF MODERN CHINA, 1800-1949"
        }
    },
    {
        "data": {
            "description": "Surveys the classical literatures of South Asia, from ancient origins to adaptations in the modern world. Includes poetry, prose, and drama translated into English from Persian, Prakrit, Sanskrit, Tamil, Telugu, Hindi/Urdu, and other languages. Examines the relationship between literature in theory, in practice, and politics.",
            "id": "ASIAN/LITTRANS 212",
            "title": "CLASSICAL SOUTH ASIAN LITERATURES"
        }
    },
    {
        "data": {
            "description": "From Greek ethnos, \"folk\" + grapho, \"to write,\" doing ethnography involves writing about people, societies, and cultures. It is a qualitative, rather than a quantitative, type of research. One does ethnography, and thus it's a process.  But an ethnography is also a product: the outcome of the ethnographic process is an ethnography. In-depth studies and discussions of classic and contemporary ethnographies in multiple Asian contexts that focus on themes like religion, health, economics, and sexuality in writing, photography, and film at once illustrate various methods involved in doing ethnography and illuminate why scholars have for decades studied and represented Asia through ethnography. The methods of ethnography are never divorced from the motivations of the scholars, and thus it is crucial to probe critically and collectively what ethnography is (theory), how it is done (practice), and why is it worth doing generally and in Asian contexts in particular.",
            "id": "ASIAN 655",
            "parent": "ASIAN",
            "title": "ETHNOGRAPHY IN ASIA"
        }
    },
    {
        "data": {
            "source": "ASIALANG 303",
            "target": "ASIAN 435"
        }
    },
    {
        "data": {
            "description": "Second semester is devoted to writing the thesis paper under the guidance of a faculty advisor. Students must be enrolled in Honors in the Major or Honors in the Liberal Arts.",
            "id": "ASIAN 682",
            "parent": "ASIAN",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "An examination of methodological and theoretical issues in Asian humanities, with emphasis on literary, religious, and cultural studies.",
            "id": "ASIAN 600",
            "parent": "ASIAN",
            "title": "CAPSTONE SEMINAR IN ASIAN HUMANITIES"
        }
    },
    {
        "data": {
            "description": "Provides an introduction to basic grammar and vocabulary of literary Chinese prose and poetry. In addition, fundamental background knowledge and reference tools that can aid in the understanding of classical Chinese texts will be introduced. English is the primary language of translation and class discussion, with supplementary use of modern Mandarin. This course is intended for learners of modern Chinese as a foreign language and students of other Asian languages who need Classical Chinese for their studies. Students with prior experience in the language are required to take a placement test administered by the department.",
            "id": "ASIALANG 311",
            "parent": "ASIALANG",
            "title": "FIRST SEMESTER CLASSICAL CHINESE"
        }
    },
    {
        "data": {
            "description": "Introduces some of the most important deities of South Asia through visual representation, mythical narratives and rituals of worship. Topics include the development of iconographic forms and concepts, masculine and feminine aspects of the divine, the belief in human embodiments of divinities, the phenomenon of possession, modes of domestic and public worship and the symbolism of the temple structure.",
            "id": "ASIAN/RELIGST 405",
            "title": "GODS AND GODDESSES OF SOUTH ASIA"
        }
    },
    {
        "data": {
            "description": "The culture of the literati in the T'ang; major trends of Neo-Confucianism during the Sung and Ming; the Confucian response to the West in the nineteenth century; the emergence of the modern Chinese intelligentsia and iconoclasm in the early May Fourth period.",
            "id": "ASIAN/HISTORY 337",
            "title": "SOCIAL AND INTELLECTUAL HISTORY OF CHINA, 589 AD-1919"
        }
    },
    {
        "data": {
            "description": "An exploration of social continuity and change of contemporary South Korea. Covers different institutions of a society - political, economic, and societal/cultural spheres. Incorporates material from anthropology, sociology, political science, economics, and law. Focus on South Korea after the division of the 'two Koreas'.",
            "id": "ASIAN/SOC 336",
            "title": "SOCIAL CHANGE IN CONTEMPORARY SOUTH KOREA"
        }
    },
    {
        "data": {
            "source": "ASIALANG 111",
            "target": "ASIALANG 102"
        }
    },
    {
        "data": {
            "description": "Topics vary related to the History of South Asia, Eurasia, and the Indian Ocean.",
            "id": "ASIAN/HISTORY 463",
            "title": "TOPICS IN SOUTH ASIAN HISTORY"
        }
    },
    {
        "data": {
            "source": "ASIALANG 203",
            "target": "ASIALANG 204"
        }
    },
    {
        "data": {
            "description": "An overview of current research being done on Asia in a variety of different disciplines.",
            "id": "ASIAN 815",
            "parent": "ASIAN",
            "title": "SEMINAR: INTERDISCIPLINARY APPROACHES TO ASIA"
        }
    },
    {
        "data": {
            "description": "Directed study projects for undergraduate students as arranged with a faculty member.",
            "id": "ASIAN 299",
            "parent": "ASIAN",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Historical overview of India and South Asia's global architectural histories from the ancient to the modern periods.  While focusing predominantly on architectural sites in India, examine architecture at multiple sites across the globe which share connected histories with South Asia.  We live in a world of nation states and are shaped by national histories.  However, in the arc of human history, nation states are of recent vintage.  Examine India's global architectural histories not only through comparison but, in the words of historian Sanjay Subrahmanyam, \"by seeking out the at times fragile threads that connected\" India to \"the globe.\"  Capturing the mobility of populations, traders, conquerors, missionaries, pilgrims, tourists, colonists, architects, artists, scholars, religion, merchandise, art, architecture, and ideas, we show that South Asia's global architectural histories are themselves the complex products of varied histories of cultural encounters.",
            "id": "ARTHIST/ASIAN 179",
            "title": "PASSAGE THROUGH INDIA: SOUTH ASIA'S GLOBAL ARCHITECTURAL HISTORIES"
        }
    },
    {
        "data": {
            "description": "A critical introduction to Chinese-language prose fiction and poetry from the late 19th century through today.",
            "id": "ASIAN 352",
            "parent": "ASIAN",
            "title": "SURVEY OF MODERN CHINESE LITERATURE"
        }
    },
    {
        "data": {
            "description": "Selections principally from materials in modern Chinese society, to expose students to reading a variety of topics and styles. Classes conducted in Chinese. Students with prior experience in the language are required to take a placement test administered by the department. Not open to students with credit for E ASIAN 302 prior to Fall 2019.",
            "id": "ASIALANG 302",
            "parent": "ASIALANG",
            "title": "SIXTH SEMESTER CHINESE"
        }
    },
    {
        "data": {
            "description": "Introduces the basic grammar along with 400 Chinese characters of standard spoken Chinese. Students with prior experience in the language are required to take a placement test administered by the department.",
            "id": "ASIALANG 102",
            "parent": "ASIALANG",
            "title": "SECOND SEMESTER CHINESE"
        }
    },
    {
        "data": {
            "description": "Introductory survey of Hinduism, Buddhism, Islam, Sikhism, etc., and an examination of the cultural, historical, ritual, and philosophical foundations of South Asian religion. Not open to students with credit for LCA 274 prior to Fall 2019.",
            "id": "ASIAN/RELIGST 274",
            "title": "RELIGION IN SOUTH ASIA"
        }
    },
    {
        "data": {
            "description": "One of the general fields such as discourse analysis, sociolinguistics, pragmatics, language pedagogy, etc.",
            "id": "ASIAN 775",
            "parent": "ASIAN",
            "title": "JAPANESE APPLIED LINGUISTICS"
        }
    },
    {
        "data": {
            "description": "Introduction to the fundamental phonetic system and grammar of standard spoken Chinese along with 200 characters. Not open to students with credit forASIALANG 101(or E ASIAN 101 or 121 prior to Fall 2019).",
            "id": "ASIALANG 110",
            "parent": "ASIALANG",
            "title": "ELEMENTARY CHINESE I"
        }
    },
    {
        "data": {
            "description": "An introduction to the Qur'an, the sacred scripture of the Islamic religious tradition, focused on Muslim approaches to reading the text, its themes and history, and its use as a source of law, theology, aesthetics, politics, and practices of piety.",
            "id": "ASIAN/RELIGST 206",
            "title": "THE QUR'AN: RELIGIOUS SCRIPTURE & LITERATURE"
        }
    },
    {
        "data": {
            "description": "An extensive overview of the literature during Japan's early modern or Edo period (1600-1868). The main goal of the course is to introduce one of the world's great cultures through its literature during a period that many people consider to be the culmination of a millennium of cultural development prior to Japan's forced opening to the West in the second half of the nineteenth century. To this end we will read snippets from vastly popular works in the major genres of comic books, novellas, essays, poetry, kabuki and puppet plays and so on, concentrating on the eighteenth and nineteenth centuries. Some key questions in this course include: What is early modernity? What is literature? What is Japanese about these materials? Not open to students with credit for E ASIAN 354 prior to Fall 2019",
            "id": "ASIAN 354",
            "parent": "ASIAN",
            "title": "EARLY MODERN JAPANESE LITERATURE"
        }
    },
    {
        "data": {
            "description": "Covers the history of Chinese literature from the Zhou through the end of the Yuan, focusing primarily on poetic and prose genres. Primary source readings will be in Chinese, with additional critical assessment of published translations; secondary source readings in both Chinese and English.",
            "id": "ASIAN 641",
            "parent": "ASIAN",
            "title": "HISTORY OF CHINESE LITERATURE I"
        }
    },
    {
        "data": {
            "description": "Under the guidance of their advisors and other committee members, students compile reading lists for their defined preliminary exam fields and read essential sources and scholarship from those lists. They will demonstrate their critical reading of this material in meetings with the advisor or other committee members.",
            "id": "ASIAN 799",
            "parent": "ASIAN",
            "title": "READING FOR RESEARCH"
        }
    },
    {
        "data": {
            "description": "Enhances knowledge of and sensitivity towards social factors that influence how Japanese language is used in different contexts. Topics include language standardization and policies, dialects, gender differences, multilingualism, translation, and impact of technology on language. In addition to discussing books and articles on these subject matters, engage in the collaborative analysis of actual examples of Japanese language use taken from everyday interactions, interviews, traditional and social media discourse, popular culture, and public signage, among others. Through this process, evaluate critically taken-for-granted beliefs and assumptions about the Japanese language and its users; examine how particular beliefs and assumptions have been established, maintained, and challenged; and make informed choices in adopting different styles of language and in positioning themselves in a Japanese speech community. Not open to students with credit for E ASIAN 358 prior to Fall 2019.",
            "id": "ASIAN 358",
            "parent": "ASIAN",
            "title": "LANGUAGE IN JAPANESE SOCIETY"
        }
    },
    {
        "data": {
            "source": "ASIALANG 204",
            "target": "ASIAN 435"
        }
    },
    {
        "data": {
            "source": "ASIALANG 102",
            "target": "ASIAN 351"
        }
    },
    {
        "data": {
            "description": "By studying the distinctively Tibetan forms of Buddhism, we also examine more general issues, such as the relationship between theory and practice, ancient meditation and mind training, the politics of \"world making\", and the connection between identity and experience. Not open to students with credit for LCA 421 prior to Fall 2019.",
            "id": "ASIAN/RELIGST 307",
            "title": "A SURVEY OF TIBETAN BUDDHISM"
        }
    },
    {
        "data": {
            "description": "The basic thought, practices and history of Buddhism, including selflessness and relativity, practices of meditation, merit- making and compassion from both local and translocal perspectives. Includes a discussion of Buddhism as a contemporary, North American religion. Not open to students with credit for E ASIAN or LCA 308 prior to Fall 2019.",
            "id": "ASIAN/HISTORY/RELIGST 308",
            "title": "INTRODUCTION TO BUDDHISM"
        }
    },
    {
        "data": {
            "description": "An introduction to the societies, politics and cultures of Southeast Asia through modern literature. Fiction, testimony, poetry and ephemeral materials will be read alongside literary analysis to understand the roles of writing and art in social and political transformation. Topics will include revolution and uprising; violence and war; environment, migration and displacement; gender and sexuality; censorship and what cannot be written; and cities, the countryside and the spaces between them. Not open to students with credit for LCA 403 prior to Fall 2018",
            "id": "ASIAN 403",
            "parent": "ASIAN",
            "title": "SOUTHEAST ASIAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Explores how different cultures in Asia conceive of and relate to the monstrous, ghostly, and divine, both in the past and in the contemporary world. These themes are approached from a range of different disciplinary perspectives, including religious studies, literature, anthropology, and history.",
            "id": "ASIAN/RELIGST 236",
            "title": "ASIA ENCHANTED: GHOSTS, GODS, AND MONSTERS"
        }
    },
    {
        "data": {
            "description": "In-depth study of the peoples, conflicts, and wars in Cambodia, Laos, and Vietnam, with emphasis on the Cold War era (1945-1990) and on the resulting migration and resettlement of over one million Hmong, Khmer, Lao, and Vietnamese in the United States. Not open to students with credit for LCA 246 prior to Fall 2019.",
            "id": "ASIAN/ASIANAM/HISTORY 246",
            "title": "SOUTHEAST ASIAN REFUGEES OF THE \"COLD\" WAR"
        }
    },
    {
        "data": {
            "description": "The emergence and development of Islam; schism; theology; asceticism; speculative and popular mysticism; literatures in diverse Islamic languages. Not open to students with credit for LCA 370 prior to Fall 2019.",
            "id": "AFRICAN/ASIAN/RELIGST 370",
            "title": "ISLAM: RELIGION AND CULTURE"
        }
    },
    {
        "data": {
            "description": "This course is intended to help students understand World War II from the perspective of Asia. The focus is not only on the American and Japanese roles in the war but also on lesser, often overlooked participants such as China, Korea, and Southeast Asia. The course will focus not only on the diplomatic, political, and military situation of wartime Asia, but also on perceptions and experiences of the war from those most heavily affected by it: those experiencing it on the ground. Understanding this war is critical for helping us understand contemporary Asia. The foundations of the Cold War and the post-Cold War world that we live in today were forged on battlefields in mainland China, Burma, small islands in the Pacific, and in the skies over the archipelago of Japan. In order to provide the background and understand the legacies, this course covers an extended time frame, beginning in the 19th century with the arrival of the West in Asia and continues into the 1950s.",
            "id": "ASIAN/HISTORY 363",
            "title": "CHINA AND WORLD WAR II IN ASIA"
        }
    },
    {
        "data": {
            "description": "Emphasis upon handling of research problems. Focus upon methods, resources, intellectual approaches, and changing interpretations.",
            "id": "ASIAN/HISTORY 857",
            "title": "SEMINAR-HISTORY OF INDIA (SOUTH ASIA)"
        }
    },
    {
        "data": {
            "description": "Covers the history of Chinese-language literature from the late imperial period though today. The primary focus will be on prose fiction, with additional coverage of the development of major forms such as spoken drama, free-verse poetry, and modern criticism. In exploring these genres and forms, special attention given to issues of language, representation, and politics. The majority of readings will be in Chinese.",
            "id": "ASIAN 642",
            "parent": "ASIAN",
            "title": "HISTORY OF CHINESE LITERATURE II"
        }
    },
    {
        "data": {
            "description": "One of the general fields such as theater, fiction, etc., studied intensively.",
            "id": "ASIAN 763",
            "parent": "ASIAN",
            "title": "STUDIES IN JAPANESE LITERATURE"
        }
    },
    {
        "data": {
            "description": "Examines contemplative practices in the two major Indian religions, Buddhism and Hinduism. Covers practices described in ancient texts but also provides an overview of selected modern practices.",
            "id": "ASIAN/RELIGST 473",
            "title": "MEDITATION IN INDIAN BUDDHISM AND HINDUISM"
        }
    },
    {
        "data": {
            "id": "ASIAN",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Introduces intermediate-level communication skills in varying Chinese settings. Students will learn a wide range of vocabulary, grammar structure and pragmatic usage in situated dialogues. They will improve four language skills (listening, speaking, reading and writing) and pragmatic competence through interactive and meaningful in-class activities and after-class assignments. Students with prior experience in the language are required to take a placement test administered by the department.",
            "id": "ASIALANG 202",
            "parent": "ASIALANG",
            "title": "FOURTH SEMESTER CHINESE"
        }
    },
    {
        "data": {
            "description": "Students engage in an independent research under the guidance of a faculty advisor. Students must be enrolled in Honors in the Major or Honors in the Liberal Arts.",
            "id": "ASIAN 681",
            "parent": "ASIAN",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "source": "ASIALANG 104",
            "target": "ASIAN 434"
        }
    },
    {
        "data": {
            "description": "Focus on proficiency in four skills (speaking, listening, reading, and writing) and Japanese culture. Continuation of skill development from the second-year language courses reviewing, reinforcing and expanding grammar, kanji and vocabulary/ expressions. Students with prior experience in the language are required to take a placement test administered by the department. Not open to students with credit for E ASIAN 303 prior to Summer 2019.",
            "id": "ASIALANG 303",
            "parent": "ASIALANG",
            "title": "FIFTH SEMESTER JAPANESE"
        }
    },
    {
        "data": {
            "description": "Subfields of applied linguistics in Chinese such as sociolinguistics, pragmatics, corpus linguistics, language pedagogy, second language acquisition, etc.",
            "id": "ASIAN 633",
            "parent": "ASIAN",
            "title": "CHINESE APPLIED LINGUISTICS"
        }
    },
    {
        "data": {
            "description": "Introduction to the haiku, one of the world's great verseforms, in its original Japanese context. Debunks the notion of the haiku as a traditional form of Zen Japanese micropoetry, instead arguing that it was an \"invented tradition,\" a late nineteenth-century Japanese response to modernization and westernization. Not open to students with credit for E ASIAN 367 prior to Fall 2018",
            "id": "ASIAN 367",
            "parent": "ASIAN",
            "title": "HAIKU"
        }
    },
    {
        "data": {
            "description": "Introduction to the grammar of classical Japanese and to reading calligraphy on art. Visits to Chazen collection a part of course. Students with prior experience in the language are required to take a placement test administered by the department. Not open to students with credit for E ASIAN 323 prior to Fall 2019.",
            "id": "ASIALANG 313",
            "parent": "ASIALANG",
            "title": "CLASSICAL JAPANESE"
        }
    },
    {
        "data": {
            "description": "Methods of language teaching in general and Japanese language teaching in particular; with emphasis on special problems in teaching Japanese in the US context.",
            "id": "ASIAN 435",
            "parent": "ASIAN",
            "title": "TEACHING OF JAPANESE"
        }
    },
    {
        "data": {
            "description": "Provides an introduction to basic grammar and vocabulary of literary Chinese prose and poetry as well as the discipline of translation from and into Classical Chinese for students who are native or near-native speakers of modern Chinese. In addition, fundamental background knowledge and reference tools that can aid in the understanding of classical Chinese texts will be introduced. Students improve their own skills in Classical Chinese at the same time as developing materials to aid in the Classical Chinese study of students who are learning the classical and modern language simultaneously. Not open to students with credit for E ASIAN 321 prior to Fall 2019.",
            "id": "ASIALANG 315",
            "parent": "ASIALANG",
            "title": "FIRST SEMESTER CLASSICAL CHINESE FOR CHINESE SPEAKERS"
        }
    },
    {
        "data": {
            "description": "A course carried with a UW-Madison study abroad program which has no equivalent on this campus. Current enrollment in a UW-Madison study abroad program",
            "id": "ASIAN 372",
            "parent": "ASIAN",
            "title": "TOPICS IN CHINESE: STUDY ABROAD"
        }
    },
    {
        "data": {
            "source": "ASIALANG 313",
            "target": "ASIAN 533"
        }
    },
    {
        "data": {
            "description": "Multidisciplinary and historical perspectives on the East Asian civilizations of China, Japan, Korea, Tibet and Mongolia from prehistory to the present, including developments in philosophy, economy, governance, social structure, kinship, geography, etc.",
            "id": "ASIAN/HISTORY/POLISCI 255",
            "title": "INTRODUCTION TO EAST ASIAN CIVILIZATIONS"
        }
    },
    {
        "data": {
            "source": "ASIALANG 203",
            "target": "ASIAN 376"
        }
    },
    {
        "data": {
            "description": "Directed study offers the student an opportunity to work with a faculty member on an individual study program.",
            "id": "ASIAN 698",
            "parent": "ASIAN",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Explores the theory and history of comics, graphic novels, and other media with a comics-like quality from around the world. Our goal is to develop a deeper understanding of comics as a major mode of human communication.",
            "id": "ASIAN 310",
            "parent": "ASIAN",
            "title": "INTRODUCTION TO COMICS AND GRAPHIC NOVELS: THEORY, HISTORY, METHOD"
        }
    },
    {
        "data": {
            "description": "Advanced topics in theories focused on the mechanisms of contemplative practices such as mindfulness, focused attention and compassion practices, with special emphasis on the interaction of traditional theories from contemplative traditions such as Buddhism and more recent theoretical accounts in psychology and cognitive science.",
            "id": "ASIAN/RELIGST 650",
            "title": "PROSEMINAR IN BUDDHIST THOUGHT"
        }
    },
    {
        "data": {
            "description": "Japanese warriors, their ideals, and their images from the tenth century to the present.",
            "id": "ASIAN/HISTORY 454",
            "title": "SAMURAI: HISTORY AND IMAGE"
        }
    },
    {
        "data": {
            "source": "ASIALANG 301",
            "target": "ASIAN 641"
        }
    },
    {
        "data": {
            "description": "Development and exchange of scholarly information on specific topics in the field of linguistics. It rotates between various topics about the Chinese language from contemporary perspectives. It may focus on phonetics, phonology, morphology, syntax, semantics, pragmatics, sociolinguistics, applied linguistics, second language acquisition, or discourse analysis. The mastery of the knowledge learned in this course is essential for further study in Chinese linguistics.",
            "id": "ASIAN 632",
            "parent": "ASIAN",
            "title": "STUDIES IN CHINESE LINGUISTICS"
        }
    },
    {
        "data": {
            "description": "A historical introduction to the important literary works of Japan. Focus on literary tradition before the restoration of 1868.",
            "id": "LITTRANS 263",
            "parent": "LITTRANS",
            "title": "SURVEY OF JAPANESE LITERATURE IN TRANSLATION"
        }
    },
    {
        "data": {
            "source": "ASIALANG 203",
            "target": "ASIAN 378"
        }
    },
    {
        "data": {
            "source": "ASIALANG 203",
            "target": "ASIAN 355"
        }
    },
    {
        "data": {
            "description": "Surveys Japanese ghost stories in translation from a range of eras and media, including theater and film. Considers historical origins and reception, with particular emphasis on storytelling and adaptation across formats.",
            "id": "ASIAN 357",
            "parent": "ASIAN",
            "title": "JAPANESE GHOST STORIES"
        }
    },
    {
        "data": {
            "description": "Independent research for graduate students.",
            "id": "ASIAN 999",
            "parent": "ASIAN",
            "title": "INDEPENDENT RESEARCH"
        }
    },
    {
        "data": {
            "description": "Focus on proficiency in four skills (speaking, listening, reading, and writing) and Japanese culture. Continuation of skill development fromASIALANG 203. Students with prior experience in the language are required to take a placement test administered by the department. Not open to students with credit for E ASIAN 204 prior to Summer 2019.",
            "id": "ASIALANG 204",
            "parent": "ASIALANG",
            "title": "FOURTH SEMESTER JAPANESE"
        }
    },
    {
        "data": {
            "description": "Offers a comparative and interdisciplinary introduction to multiple cultures of Asia. Possible topics include but are not limited to: travelogues; the languages of Asia; food cultures of Asia.",
            "id": "ASIAN 100",
            "parent": "ASIAN",
            "title": "GATEWAY TO ASIA: SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "Concentrates on image complexes (art, photography, and cinema) and visual environments (architecture, urban planning, and public rituals) of India; examination of visual culture through thematic issues such as, sexuality, patronage, cultural encounter, transculturation, ways of viewing, modernism, and nationalism. Not open to students with credit for LCA 428 prior to Fall 2019.",
            "id": "ARTHIST/ASIAN 428",
            "title": "VISUAL CULTURES OF INDIA"
        }
    },
    {
        "data": {
            "description": "Advanced topics in Asian studies.",
            "id": "ASIAN 630",
            "parent": "ASIAN",
            "title": "PROSEMINAR: STUDIES IN CULTURES OF ASIA"
        }
    },
    {
        "data": {
            "description": "Spatial lagacy of colonialism; explores important ways in which the population, landscape, architecture, and urban environment of colonies were mapped, made, and represented, particularly in the 19th and 20th centuries; theoretical and empirical analyses from diverse disciplines and spatial terrain. Not open to students with credit for LCA 621 prior to Fall 2019.",
            "id": "ARTHIST/ASIAN 621",
            "title": "MAPPING, MAKING, AND REPRESENTING COLONIAL SPACES"
        }
    },
    {
        "data": {
            "description": "Selected topics in the study of Asian Languages and Cultures.",
            "id": "ASIAN 300",
            "parent": "ASIAN",
            "title": "TOPICS IN ASIAN STUDIES"
        }
    },
    {
        "data": {
            "description": "The social, economic and political transformation of China under Communism; the role of ideology in contemporary Chinese historical development; the nature of that historical development in the comparative perspective of other post-revolutionary histories.",
            "id": "ASIAN/HISTORY 342",
            "title": "HISTORY OF THE PEOPLES REPUBLIC OF CHINA, 1949 TO THE PRESENT"
        }
    },
    {
        "data": {
            "description": "Historical overview of the built environment of cities of Asia from antiquity to the present; architectural and urban legacy in its social and historical context; exploration of common themes that thread through the diverse geographical regions and cultures of Asia. Not open to students with credit for LCA 379 prior to Fall 2019.",
            "id": "ARTHIST/ASIAN 379",
            "title": "CITIES OF ASIA"
        }
    },
    {
        "data": {
            "description": "Rotating subjects in the study of Chinese Linguistics.",
            "id": "ASIAN 932",
            "parent": "ASIAN",
            "title": "SEMINAR IN CHINESE LINGUISTICS"
        }
    },
    {
        "data": {
            "description": "Methods of teaching Chinese as a second language including comparative study of Chinese and English structure, introduction to teaching techniques. Not open to students with credit for E ASIAN 622 prior to Fall 2019.",
            "id": "ASIAN 712",
            "parent": "ASIAN",
            "title": "TEACHING OF CHINESE"
        }
    },
    {
        "data": {
            "source": "ASIALANG 202",
            "target": "ASIALANG 301"
        }
    },
    {
        "data": {
            "id": "ASIALANG",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ASIALANG 103",
            "target": "ASIALANG 114"
        }
    },
    {
        "data": {
            "description": "Focus on proficiency in four skills (speaking, listening, reading, and writing) to communicate in Japanese in basic everyday situations. Students with prior experience in the language are required to take a placement test administered by the department.",
            "id": "ASIALANG 114",
            "parent": "ASIALANG",
            "title": "SECOND SEMESTER ELEMENTARY JAPANESE"
        }
    },
    {
        "data": {
            "source": "ASIALANG 304",
            "target": "ASIAN 573"
        }
    },
    {
        "data": {
            "description": "Surveys anime (Japanese animation) from 1930s shorts through contemporary feature-length, experimental, and televised serial-form productions. Draws on critical writings on postmodernism, digital cinema, and visual culture. Some Japanese language ability is required. Not open to students with credit for E ASIAN 378 prior to Fall 2019.",
            "id": "ASIAN 378",
            "parent": "ASIAN",
            "title": "ANIME"
        }
    },
    {
        "data": {
            "description": "Explore topics in comparative, connected, and/or trans-Asian literatures and languages. Important thinkers and movements in Asian history will be examined and discussed. Through close readings and discussion, presentations, and writing probe vital theories, methodologies, and critical themes in Asian Studies research.",
            "id": "ASIAN 873",
            "parent": "ASIAN",
            "title": "SEMINAR IN LANGUAGES AND LITERATURES OF ASIA"
        }
    },
    {
        "data": {
            "description": "Literary or cultural study of a particular theme, work, period, or genre in regions across Asia. Translations serve as the principal texts.",
            "id": "ASIAN 360",
            "parent": "ASIAN",
            "title": "TOPICS IN ASIAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "A historical narrative of Chinese-language film from the turn of the century to contemporary China, Taiwan, and Hong Kong. All films include English subtitles. No knowledge of Chinese language is required. Not open to students with credit for E ASIAN 520 prior to Fall 2019.",
            "id": "ASIAN 375",
            "parent": "ASIAN",
            "title": "SURVEY OF CHINESE FILM"
        }
    },
    {
        "data": {
            "source": "ASIALANG 201",
            "target": "ASIAN 351"
        }
    },
    {
        "data": {
            "description": "Literary or cultural study of a particular theme, work, period, or genre in Chinese literature. Possible topics include: Confucian Analects, The Dream of the Red Chamber, Journey to the West, or Traditional Chinese Drama. Translations serve as the principal texts, but students of Chinese are required to do some reading in the original.",
            "id": "ASIAN 371",
            "parent": "ASIAN",
            "title": "TOPICS IN CHINESE LITERATURE"
        }
    },
    {
        "data": {
            "source": "ASIALANG 303",
            "target": "ASIALANG 304"
        }
    },
    {
        "data": {
            "description": "Survey of major cultural, social, political, and intellectual developments in Korea from the 10th century to the 21st century.",
            "id": "ASIAN/HISTORY 108",
            "title": "INTRODUCTION TO EAST ASIAN HISTORY - KOREA"
        }
    },
    {
        "data": {
            "description": "Extensive readings in modern Japanese literature and discussion of literary content.",
            "id": "ASIAN 563",
            "parent": "ASIAN",
            "title": "READINGS IN MODERN JAPANESE LITERATURE"
        }
    },
    {
        "data": {
            "description": "Extensive readings in early Modern or Classical Japanese literature, and discussion of visual-verbal content. Students may repeat this course if the topic is different.",
            "id": "ASIAN 573",
            "parent": "ASIAN",
            "title": "READINGS IN CLASSICAL JAPANESE LITERATURE"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "A course carried with a UW-Madison study abroad program which has no equivalent on this campus. Current enrollment in a UW-Madison study abroad program",
            "id": "ASIAN 373",
            "parent": "ASIAN",
            "title": "TOPICS IN JAPANESE: STUDY ABROAD"
        }
    },
    {
        "data": {
            "source": "ASIALANG 110",
            "target": "ASIALANG 111"
        }
    },
    {
        "data": {
            "description": "An examination of travel narratives, both fiction and non-fiction in print and in film, and the experiences of Western travelers in Asia, with the goal of developing one's own travel writing. Ideal for students with an interest in Asia, have travelled to Asia, or are interested in travelling to Asia.",
            "id": "ASIAN 203",
            "parent": "ASIAN",
            "title": "LOST IN TRANSLATION: WESTERN EXPERIENCE IN ASIA"
        }
    },
    {
        "data": {
            "source": "ASIALANG 302",
            "target": "ASIAN 641"
        }
    },
    {
        "data": {
            "description": "Surveys the manga (Japanese comicbook) from its precursors in premodern woodblock-printed booklets to its contemporary manifestations in subgenres like shonen, gekiga, mecha, and shojo. Draws upon critical writings on visual culture, literature, and visual-verbal narrative. Not open to students with credit for E ASIAN 376 prior to Fall 2019",
            "id": "ASIAN 376",
            "parent": "ASIAN",
            "title": "MANGA"
        }
    },
    {
        "data": {
            "source": "ASIALANG 102",
            "target": "ASIALANG 201"
        }
    },
    {
        "data": {
            "description": "Rotating subjects in the study of Chinese Literature.",
            "id": "ASIAN 951",
            "parent": "ASIAN",
            "title": "SEMINAR IN CHINESE LITERATURE"
        }
    },
    {
        "data": {
            "description": "Survey of the fundamental trends in Buddhist thought through the works of major philosophers. Themes include the concept of \"selflessness\" and concomitant theories of essencelessness, perception, language and rationality. Not open to students with credit for E ASIAN or LCA 466 prior to Fall 2019.",
            "id": "ASIAN/RELIGST 466",
            "title": "BUDDHIST THOUGHT"
        }
    },
    {
        "data": {
            "description": "Introduction to a wide variety of ancient Tibetan cultural beliefs, practices and motifs that are practiced to this day. Examines topics such as: gender roles and stereotypes in Tibetan society; folk beliefs and practices; astrology, divination, dream interpretation and related issues; art, music and theater; traditional Tibetan medicine and healing practices; and finally, the varied and extensive religious traditions of Tibet in their cultural manifestations. Examines central themes and inquires into the ways it contributes to-or contests-a cultural universe that has direct impact on Tibetan lives.",
            "id": "ASIAN 268",
            "parent": "ASIAN",
            "title": "TIBETAN CULTURES AND TRADITIONS"
        }
    },
    {
        "data": {
            "description": "Introduction to the fundamental phonetic system and grammar of standard spoken Chinese along with 200 characters. Students with prior experience in the language are required to take a placement test administered by the department.",
            "id": "ASIALANG 111",
            "parent": "ASIALANG",
            "title": "ELEMENTARY CHINESE II"
        }
    },
    {
        "data": {
            "source": "ASIALANG 303",
            "target": "ASIALANG 313"
        }
    },
    {
        "data": {
            "description": "Topics in the study of the visual cultures of East Asia from antiquity to the present. Focuses on illustrative texts and genres, major historiographic, theoretical, and methodological issues, and the technologies of vision and visuality in China, Japan, and Korea.",
            "id": "ASIAN 833",
            "parent": "ASIAN",
            "title": "TOPICS IN EAST ASIAN VISUAL CULTURES"
        }
    },
    {
        "data": {
            "description": "Focus on proficiency in four skills (speaking, listening, reading, and writing) to communicate in Japanese in basic everyday situations. No previous knowledge of Japanese expected. Not open to students with credit for E ASIAN 103 prior to Summer 2019).",
            "id": "ASIALANG 103",
            "parent": "ASIALANG",
            "title": "FIRST SEMESTER JAPANESE"
        }
    },
    {
        "data": {
            "description": "Explore perspectives related to human flourishing from the sciences and humanities; investigate themes such as transformation, resilience, compassion, diversity, gratitude, community; expand self-awareness, enhanced social connectivity, and ability to change; formulate a sense of what it means to lead a flourishing life that sustains meaningful and fulfilling engagement with studies, relationships, community, and career.",
            "id": "ASIAN/COUNPSY/EDPSYCH/PSYCH 120",
            "title": "THE ART AND SCIENCE OF HUMAN FLOURISHING"
        }
    },
    {
        "data": {
            "description": "Provides an introductory overview of the Chinese language from a contemporary perspective. Covers various topics including phonetics, phonology, dialects, morphology, syntax, orthography, semantics, and pragmatics. Not open to students with credit for E ASIAN 432 prior to Fall 2019.",
            "id": "ASIAN 432",
            "parent": "ASIAN",
            "title": "INTRODUCTION TO CHINESE LINGUISTICS"
        }
    },
    {
        "data": {
            "description": "The senior thesis involves research conducted in collaboration with a faculty member.",
            "id": "ASIAN 692",
            "parent": "ASIAN",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "source": "ASIALANG 104",
            "target": "ASIAN 358"
        }
    },
    {
        "data": {
            "description": "Kendo practice (martial art) supplemented by lecture describing its historical roots and philosophical background. Not open to students with credit for E ASIAN 277 prior to Fall 2019.",
            "id": "ASIAN 277",
            "parent": "ASIAN",
            "title": "KENDO: INTEGRATION OF MARTIAL ARTS AND LIBERAL ARTS"
        }
    },
    {
        "data": {
            "source": "ASIALANG 301",
            "target": "ASIAN 642"
        }
    },
    {
        "data": {
            "source": "ASIALANG 311",
            "target": "ASIAN 672"
        }
    },
    {
        "data": {
            "description": "Further practice in reading and writing. Extensive as well as intensive readings in contemporary texts. At least 1,000 more characters introduced. Conducted in Japanese. Students with prior experience in the language are required to take a placement test administered by the department. Not open to students with credit for E ASIAN 304 prior to Summer 2019.",
            "id": "ASIALANG 304",
            "parent": "ASIALANG",
            "title": "SIXTH SEMESTER JAPANESE"
        }
    },
    {
        "data": {
            "description": "Phonology, morphology and syntax of the modern standard colloquial Japanese, including historical and dialectal aspects. Not open to students with credit for E ASIAN 434 prior to Fall 2019.",
            "id": "ASIAN 434",
            "parent": "ASIAN",
            "title": "INTRODUCTION TO JAPANESE LINGUISTICS"
        }
    },
    {
        "data": {
            "description": "Research in connection with the doctoral thesis.",
            "id": "ASIAN 990",
            "parent": "ASIAN",
            "title": "THESIS RESEARCH"
        }
    },
    {
        "data": {
            "description": "An examination of contemporary East Asia (mainly South Korea, Japan, Taiwan, and China) by using concepts and frameworks from history, anthropology, sociology, political science, economics, and law. An emphasis will be on the intersection of multiple structures of inequality such as gender, race/ethnicity, citizenship, class, and sexuality.",
            "id": "ASIAN/SOC 334",
            "title": "GENDER, WORK, AND FAMILY IN EAST ASIA"
        }
    },
    {
        "data": {
            "description": "Focus on proficiency in four skills (speaking, listening, reading, and writing) and Japanese culture. Continuation of skill development from elementary language courses reviewing, reinforcing and expanding grammar, kanji and vocabulary/ expressions. Students with prior experience in the language are required to take a placement test administered by the department. Not open to students with credit for E ASIAN 203 prior to Summer 2019.",
            "id": "ASIALANG 203",
            "parent": "ASIALANG",
            "title": "THIRD SEMESTER JAPANESE"
        }
    },
    {
        "data": {
            "description": "Explores how ancient Indian traditions have been reframed for the modern age. Topics include the Ramayama in popular media, negotiations over sacred spaces, and popular Tantra. We will also examine recent controversies, such as the one surrounding the ancient Jain practice of fasting until death (sallekhana) in the modern age.",
            "id": "ASIAN/RELIGST 430",
            "title": "INDIAN TRADITIONS IN THE MODERN AGE"
        }
    },
    {
        "data": {
            "description": "Explores the themes, structure, and reception history of Japan's The Tale of Genji (ca. 1008). Not open to students with credit for E ASIAN 361 prior to Fall 2019.",
            "id": "ASIAN 361",
            "parent": "ASIAN",
            "title": "LOVE AND POLITICS: THE TALE OF GENJI"
        }
    },
    {
        "data": {
            "id": "LITTRANS",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Selections principally from materials in modern Chinese society, to expose students to reading a variety of topics and styles. Classes conducted in Chinese. Students with prior experience in the language are required to take a placement test administered by the department. Not open to students with credit for E ASIAN 301 prior to Fall 2019.",
            "id": "ASIALANG 301",
            "parent": "ASIALANG",
            "title": "FIFTH SEMESTER CHINESE"
        }
    },
    {
        "data": {
            "source": "ASIALANG 315",
            "target": "ASIALANG 311"
        }
    },
    {
        "data": {
            "description": "Looking at the cultural institutions of politics, medicine, and religion in multiple cultures and historical times, students will explore ideas about what constitutes a perfect body, how and why different parts of the body are privileged over others, and how and why the notion of bodily perfectibility differs for men and women, children and adults, and humans and gods. Readings encourage such questions as: Is the perfect body attainable and, if so, how? And, who benefits from bodily perfection (or the rhetoric of the bodily perfection)? We will ask these questions with comparative intent: we want both to learn about cultures other than our own and, in the process of understanding the other, we will ask how this new knowledge might empower us to be more observant and critical of the role(s) and treatment of the body in our own society historically and today.",
            "id": "ASIAN/RELIGST 505",
            "title": "THE PERFECTIBLE BODY IN RELIGIONS, MEDICINES, AND POLITICS"
        }
    },
    {
        "data": {
            "source": "ASIALANG 201",
            "target": "ASIALANG 202"
        }
    },
    {
        "data": {
            "description": "Survey of major developments in Chinese history from 1500 B.C. to the founding of the Communist state in 1949. Emphasis on patterns and themes; equal time devoted to the classical and traditional period and the modern era.",
            "id": "ASIAN/HISTORY 103",
            "title": "INTRODUCTION TO EAST ASIAN HISTORY: CHINA"
        }
    },
    {
        "data": {
            "description": "Introduces intermediate-level communication skills in varying Chinese settings. Students will learn a wide range of vocabulary, grammar structure and pragmatic usage in situated dialogues. They will improve four language skills (listening, speaking, reading and writing) and pragmatic competence through interactive and meaningful in-class activities and after-class assignments. Students with prior experience in the language are required to take a placement test administered by the department.",
            "id": "ASIALANG 201",
            "parent": "ASIALANG",
            "title": "THIRD SEMESTER CHINESE"
        }
    },
    {
        "data": {
            "description": "Critically engages with Korean popular culture in order to explore how an arena often dismissed as \"mere entertainment\" can act as an indicator of cultural values and a producer of cultural meaning. Treats works of popular culture as important economic, political, and social texts and asks us to reflect on how the production and consumption of popular culture shapes, and is shaped by, our lived experiences. Explores what popular culture says about society and, conversely, what society says about popular culture.",
            "id": "ASIAN 254",
            "parent": "ASIAN",
            "title": "KOREAN POPULAR CULTURE"
        }
    },
    {
        "data": {
            "description": "Explores the history of Yoga techniques from the ancient to the modern period. Not open to students with credit for RELIG ST 623 prior to Spring 2019.",
            "id": "ASIAN/RELIGST 460",
            "title": "THE HISTORY OF YOGA"
        }
    },
    {
        "data": {
            "description": "The senior thesis involves research conducted in collaboration with a faculty member (non-honors student).",
            "id": "ASIAN 691",
            "parent": "ASIAN",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Introduction to Chinese historical linguistics, including the sound systems of the Shih-ching, T'ang poems, and Yuan songs, and their historical relations to the sounds of modern Mandarin, and syntactic interaction between classical and vernacular Chinese. Not open to students with credit for E ASIAN 631 prior to Fall 2019.",
            "id": "ASIAN 631",
            "parent": "ASIAN",
            "title": "HISTORY OF THE CHINESE LANGUAGE"
        }
    },
    {
        "data": {
            "description": "A critical introduction to the literature of China from early texts through the late imperial period. Works include poetry, prose, fiction and drama. Not open to students who completed E ASIAN 351 prior to Fall 2019.",
            "id": "ASIAN 351",
            "parent": "ASIAN",
            "title": "SURVEY OF CLASSICAL CHINESE LITERATURE"
        }
    },
    {
        "data": {
            "description": "Introduction to advanced study of modern literatures of India in translation from several languages. Emphasizes literary and critical analysis of short story, novel, poetry, and drama; historical and cultural contexts of literature; and relations and dynamics of multiple literary cultures. Not open to students with credit for LCA 311 prior to Fall 2019.",
            "id": "ASIAN 311",
            "parent": "ASIAN",
            "title": "MODERN INDIAN LITERATURES"
        }
    },
    {
        "data": {
            "description": "Theoretical background and recent trends in foreign language teaching. Teaching of the four skills (speaking, listening, reading and writing) and culture, developing curricula and lesson plans, and assessment to help you develop a repertoire of teaching techniques and strategies.",
            "id": "ASIAN 700",
            "parent": "ASIAN",
            "title": "TEACHING ASIAN LANGUAGES"
        }
    },
    {
        "data": {
            "source": "ASIALANG 114",
            "target": "ASIALANG 103"
        }
    },
    {
        "data": {
            "description": "Effects of the modern Western revolution on the established societies of Southeast Asia through colonial rule and economic and cultural change. Not open to students with credit for LCA 458 prior to Fall 2018.",
            "id": "ASIAN/HISTORY 458",
            "title": "HISTORY OF SOUTHEAST ASIA SINCE 1800"
        }
    },
    {
        "data": {
            "source": "ASIALANG 204",
            "target": "ASIALANG 303"
        }
    },
    {
        "data": {
            "description": "Study of literature, drama, and film produced by authors of South Asian origin in Europe, North America, and the Caribbean. Course considers theories of diaspora, changing patterns of subcontinental migration, and relation of diasporic forms to the cultures of origin and adoption. Not open to students with credit for LCA 478 prior to Fall 2019.",
            "id": "ASIAN/ENGL 478",
            "title": "INDIAN WRITERS ABROAD: LITERATURE, DIASPORA AND GLOBALIZATION"
        }
    },
    {
        "data": {
            "description": "Intensive study of selected short story and novel texts from the xiaoshuo tradition. In addition to the primary texts, traditional and modern audience reception, criticism, and adaptations will be discussed.Readings will be conducted in the original Chinese, supplemented by English translations when available. The course can be repeated if the topic differs.",
            "id": "ASIAN 672",
            "parent": "ASIAN",
            "title": "STUDIES IN CHINESE FICTION"
        }
    },
    {
        "data": {
            "description": "Study primary and secondary sources to explore how South Asian societies have understood the ideas of health and well-being throughout history. We will consider a number of cases that illustrate uniquely South Asian conceptions of illness and physical dysfunction and the ways in which people in South Asia have attempted (and continue to attempt today) to heal bodies. Students will learn about the traditional healing systems of South Asia, including Ayurveda, Siddha, and Unani, the basic components of each systems' ideas about disease pathology and treatment that have been used for centuries to heal illness, maintain good health, and, in some instances, aspire to a state of super-health that transcends the limitations of bodily existence altogether.",
            "id": "ASIAN/RELIGST 218",
            "title": "HEALTH AND HEALING IN SOUTH ASIA"
        }
    },
    {
        "data": {
            "source": "ASIALANG 102",
            "target": "ASIAN 631"
        }
    },
    {
        "data": {
            "source": "LITTRANS 263",
            "target": "ASIAN 353"
        }
    },
    {
        "data": {
            "source": "ASIALANG 301",
            "target": "ASIALANG 302"
        }
    },
    {
        "data": {
            "description": "Provides an extensive overview of the literature during Japan's early modern or Edo period (1600-1868). The main goal of the course is to introduce students to the literature of this period through readings in the original early modern Japanese language.",
            "id": "ASIAN 533",
            "parent": "ASIAN",
            "title": "READINGS IN EARLY MODERN JAPANESE LITERATURE"
        }
    },
    {
        "data": {
            "description": "Acquaints entering graduate students with the history of the study of Chinese literature in the West, with the basic reference tools and methodologies, and with the various critical approaches to Chinese literature. BA in Chinese or equiv",
            "id": "ASIAN 701",
            "parent": "ASIAN",
            "title": "PROSEMINAR IN CHINESE LITERATURE"
        }
    }
]