[
    {
        "data": {
            "description": "Properties of neutral and ionized interstellar gas, giant molecular clouds, the warm and hot intercloud medium, supernova remnants, and interstellar dust. Physical processes in low density gases including radiation transfer, excitation and ionization of interstellar atoms and molecules, and the interaction between gas and dust.",
            "id": "ASTRON 320",
            "parent": "ASTRON",
            "title": "THE INTERSTELLAR MEDIUM"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for Physics, AMEP, and Astronomy-Physics majors. Mechanics, waves, thermodynamics and statistical mechanics, topics in modern physics; with computation.  A more mathematically rigorous and in-depth introduction to physics than the other introductory physics sequences.",
            "id": "PHYSICS 247",
            "parent": "PHYSICS",
            "title": "A MODERN INTRODUCTION TO PHYSICS"
        }
    },
    {
        "data": {
            "source": "PHYSICS 241",
            "target": "PHYSICS 205"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "EMA 201"
        }
    },
    {
        "data": {
            "source": "ASTRON 103",
            "target": "ASTRON 150"
        }
    },
    {
        "data": {
            "description": "Principles of mechanics, force systems, equilibrium, structures, distributed forces, moments of inertia of areas, and friction.",
            "id": "EMA 201",
            "parent": "EMA",
            "title": "STATICS"
        }
    },
    {
        "data": {
            "source": "PHYSICS 247",
            "target": "ASTRON 200"
        }
    },
    {
        "data": {
            "description": "A basic introduction into astronomical research by undertaking a small observing project with optical and/or radio telescopes. Topics covered are: understanding the astronomical literature, observing and data reduction, writing scientific reports and papers, presenting scientific results, and basics of scientific ethics.",
            "id": "ASTRON 460",
            "parent": "ASTRON",
            "title": "EXPERIENCES IN ASTRONOMICAL OBSERVING"
        }
    },
    {
        "data": {
            "id": "EMA",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Advanced level mentored reading and research for graduate students.",
            "id": "ASTRON 990",
            "parent": "ASTRON",
            "title": "RESEARCH AND THESIS"
        }
    },
    {
        "data": {
            "source": "PHYSICS 249",
            "target": "ASTRON 335"
        }
    },
    {
        "data": {
            "description": "Some of the greatest mysteries of the cosmos reside in what astrophysicists call \"the dark sector\". This course explores the nature of black holes, dark matter, and dark energy, which show us nature at its most extreme, taking you from the warping of spacetime and the launching of plasma beams around black holes to the acceleration of the cosmos that indicates the presence of some yet unknown form of energy. Learn about the fundamental laws of nature that govern everything from GPS satellites that enable navigation apps on your cell phone to the birth and ultimate fate of the universe.",
            "id": "ASTRON 170",
            "parent": "ASTRON",
            "title": "THE DARK SIDE OF THE UNIVERSE: THE GREAT COSMIC MYSTERIES FROM BLACK HOLES TO DARK ENERGY"
        }
    },
    {
        "data": {
            "source": "MATH 375",
            "target": "MATH 376"
        }
    },
    {
        "data": {
            "source": "PHYSICS 248",
            "target": "PHYSICS 249"
        }
    },
    {
        "data": {
            "description": "Properties of solar system objects, solar atmospheric phenomena, physics of planetary atmospheres, results of recent planetary missions, comets, origin of the solar system.",
            "id": "ASTRON 340",
            "parent": "ASTRON",
            "title": "SOLAR SYSTEM ASTROPHYSICS"
        }
    },
    {
        "data": {
            "source": "PHYSICS 249",
            "target": "ASTRON 320"
        }
    },
    {
        "data": {
            "description": "Extragalactic distance scale; groups and clusters of galaxies; distribution of galaxies and radio sources. Introduction to general relativity, cosmological models, microwave background, early universe, galaxy formation.",
            "id": "ASTRON 735",
            "parent": "ASTRON",
            "title": "OBSERVATIONAL COSMOLOGY"
        }
    },
    {
        "data": {
            "description": "Individual study for seniors completing theses for honors in the major as arranged with a faculty member; continuation ofASTRON 681.",
            "id": "ASTRON 682",
            "parent": "ASTRON",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Topics in multi-variable calculus and introduction to differential equations.",
            "id": "MATH 376",
            "parent": "MATH",
            "title": "TOPICS IN MULTI-VARIABLE CALCULUS AND DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "PHYSICS 241",
            "target": "ASTRON 310"
        }
    },
    {
        "data": {
            "description": "An examination of the origin and evolution of life in the universe based on our knowledge of astronomy, biology, and geology. Includes discussions on the search for extraterrestrial life and the history of life in our solar system.",
            "id": "ASTRON/GEOSCI 160",
            "title": "LIFE IN THE UNIVERSE"
        }
    },
    {
        "data": {
            "description": "Physical principles, equilibrium of gaseous spheres, energy transport, energy generation, nucleosynthesis, main sequence red giant and electron degenerate stars. Advanced topics such as origins of stellar variability, binary star evolution, star formation, supernovae explosions, evolution with mass loss.",
            "id": "ASTRON 715",
            "parent": "ASTRON",
            "title": "STELLAR INTERIORS AND EVOLUTION"
        }
    },
    {
        "data": {
            "description": "Individual study for seniors completing theses as arranged with a faculty member.",
            "id": "ASTRON 691",
            "parent": "ASTRON",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Kinematics, force-mass-acceleration relations, work and energy, impulse and momentum, moments of inertia and mass.",
            "id": "EMA 202",
            "parent": "EMA",
            "title": "DYNAMICS"
        }
    },
    {
        "data": {
            "description": "Individual study for seniors completing theses for honors in the major as arranged with a faculty member.",
            "id": "ASTRON 681",
            "parent": "ASTRON",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "source": "EMA 201",
            "target": "EMA 202"
        }
    },
    {
        "data": {
            "description": "Distribution of stars, gas, and dust within our Milky Way, and their motions. Nearby galaxies: our Local Group. Optical, radio, and other techniques for observing galaxies. Composition and motions of other galaxies; galaxies with active nuclei; galaxy formation.",
            "id": "ASTRON 330",
            "parent": "ASTRON",
            "title": "GALAXIES"
        }
    },
    {
        "data": {
            "description": "Introductory mentored independent study as arranged with faculty.",
            "id": "ASTRON 199",
            "parent": "ASTRON",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "A basic introduction into astronomical observations and data analysis techniques by undertaking observational projects with optical and radio telescopes. Topics covered include observation and data reduction, basic calibration of radio and optical telescopes, basics of data analysis and statistics, presenting scientific results, and basics of scientific ethics. Although specific to observational astrophysics, these methods are applicable to any of the physical sciences disciplines.",
            "id": "ASTRON 465",
            "parent": "ASTRON",
            "title": "OBSERVATIONAL ASTRONOMY AND DATA ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Kinetic theory; relativity; experimental origin of quantum theory; atomic structure and spectral lines; topics in solid state, nuclear and particle physics.",
            "id": "PHYSICS 241",
            "parent": "PHYSICS",
            "title": "INTRODUCTION TO MODERN PHYSICS"
        }
    },
    {
        "data": {
            "description": "The cosmos is vast, mysterious, and beautiful. Join us on an exploration of the universe, from the big bang to the birth, life, and death of stars and the warped reality of black holes. Includes lifecycles of stars; supernovae and creation of elements; white dwarfs, pulsars and black holes; the Milky Way and galaxies; distances of stars and galaxies; quasars; expansion of universe; modern big bang cosmology, dark matter, dark energy.",
            "id": "ASTRON 103",
            "parent": "ASTRON",
            "title": "THE EVOLVING UNIVERSE: STARS, GALAXIES, AND COSMOLOGY"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 222"
        }
    },
    {
        "data": {
            "description": "Continuation ofPHYSICS 248. Modern physics: introduction to quantum mechanics, topics from nuclear and particle physics, condensed matter physics, and atomic physics. Three lectures and one discussion per week.",
            "id": "PHYSICS 249",
            "parent": "PHYSICS",
            "title": "A MODERN INTRODUCTION TO PHYSICS"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "source": "MATH 213",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "description": "Vector spaces and linear transformations, differential calculus of scalar and vector fields, determinants, eigenvalues and eigenvectors, multiple integrals, line integrals, and surface integrals. Freshmen students are invited to enroll by the Department of Mathematics.",
            "id": "MATH 375",
            "parent": "MATH",
            "title": "TOPICS IN MULTI-VARIABLE CALCULUS AND LINEAR ALGEBRA"
        }
    },
    {
        "data": {
            "id": "PHYSICS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "PHYSICS 205",
            "target": "ASTRON 310"
        }
    },
    {
        "data": {
            "description": "An introduction to astrophysics data collection. Students will be familiarized with the concepts, techniques, skills and resources needed to plan, obtain, reduce and interpret observations of astronomical objects.",
            "id": "ASTRON 500",
            "parent": "ASTRON",
            "title": "TECHNIQUES OF MODERN OBSERVATIONAL ASTROPHYSICS"
        }
    },
    {
        "data": {
            "description": "Current topics in astrophysics.",
            "id": "ASTRON/PHYSICS 910",
            "title": "SEMINAR IN ASTROPHYSICS"
        }
    },
    {
        "data": {
            "source": "MATH 376",
            "target": "PHYSICS 248"
        }
    },
    {
        "data": {
            "source": "ASTRON 200",
            "target": "ASTRON 103"
        }
    },
    {
        "data": {
            "description": "Current problems; topic changes.",
            "id": "ASTRON 620",
            "parent": "ASTRON",
            "title": "SEMINAR IN ASTROPHYSICAL TOPICS"
        }
    },
    {
        "data": {
            "source": "PHYSICS 205",
            "target": "ASTRON 465"
        }
    },
    {
        "data": {
            "description": "Basic particle and fluid dynamics of stellar and gaseous systems in astrophysics. Review of gravitational dynamics, 2-body relaxation, phase space, basic equations of fluid dynamics, waves, shocks, winds accretion, instabilities.",
            "id": "ASTRON 702",
            "parent": "ASTRON",
            "title": "BASIC ASTROPHYSICS II"
        }
    },
    {
        "data": {
            "source": "PHYSICS 248",
            "target": "PHYSICS 241"
        }
    },
    {
        "data": {
            "description": "Stellar content and dynamics of the Milky Way and other galaxies; galaxy types, evolution of normal galaxies, active nuclei, quasars, radio galaxies.",
            "id": "ASTRON 730",
            "parent": "ASTRON",
            "title": "GALAXIES"
        }
    },
    {
        "data": {
            "description": "Current problems; topic changes.",
            "id": "ASTRON 920",
            "parent": "ASTRON",
            "title": "SEMINAR-ASTROPHYSICAL TOPICS"
        }
    },
    {
        "data": {
            "description": "Introduction to the study of our Universe as a whole. Distribution of matter on the largest scales. Equations for cosmic expansion; making observations in an expanding curved spacetime. Nucleosynthesis and other tests of the Big Bang hypothesis. Gravitational collapse and the growth of structure.",
            "id": "ASTRON 335",
            "parent": "ASTRON",
            "title": "COSMOLOGY"
        }
    },
    {
        "data": {
            "id": "ASTRON",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ASTRON 320",
            "target": "ASTRON 540"
        }
    },
    {
        "data": {
            "description": "The development of astronomical knowledge and cosmological views from the earliest times to the present, viewed in their social, philosophical, and technological contexts.",
            "id": "ASTRON/HISTSCI 206",
            "title": "HISTORY OF ASTRONOMY AND COSMOLOGY"
        }
    },
    {
        "data": {
            "source": "ASTRON 310",
            "target": "ASTRON 500"
        }
    },
    {
        "data": {
            "source": "ASTRON 310",
            "target": "ASTRON 620"
        }
    },
    {
        "data": {
            "source": "EMA 202",
            "target": "ASTRON/EMA 550"
        }
    },
    {
        "data": {
            "description": "Multidisciplinary study of how the distribution of elements in the Universe has changed over the last 10-15 billion years by tracing the history of matter from the Big Bang to the present composition of the Earth. Emphasizes connections between astronomy, geology, and chemistry. Readings will draw both on scientific journals and the popular press to allow us to engage the material on multiple levels.",
            "id": "ASTRON 236",
            "parent": "ASTRON",
            "title": "THE HISTORY OF MATTER IN THE UNIVERSE"
        }
    },
    {
        "data": {
            "description": "Introduction to atomic, solid state, and nuclear physics.",
            "id": "PHYSICS 205",
            "parent": "PHYSICS",
            "title": "MODERN PHYSICS FOR ENGINEERS"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Individual study for seniors completing theses as arranged with a faculty member; continuation ofASTRON 691.",
            "id": "ASTRON 692",
            "parent": "ASTRON",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "PHYSICS 247"
        }
    },
    {
        "data": {
            "source": "PHYSICS 249",
            "target": "PHYSICS 241"
        }
    },
    {
        "data": {
            "description": "Continuation ofPHYSICS 247. Electromagnetism, circuits, optics, additional topics in modern physics; with computation.",
            "id": "PHYSICS 248",
            "parent": "PHYSICS",
            "title": "A MODERN INTRODUCTION TO PHYSICS"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 213"
        }
    },
    {
        "data": {
            "source": "ASTRON 310",
            "target": "ASTRON 540"
        }
    },
    {
        "data": {
            "source": "ASTRON 200",
            "target": "ASTRON 104"
        }
    },
    {
        "data": {
            "description": "Our Galaxy contains about 100 billion stars. Most of these stars have planets as diverse and as fascinating as the worlds in our own neighborhood, the solar system. Learn about the study of planets and exoplanets, probing some of the deepest questions science and philosophy grapple with. Explore the ways in which scientists search for and analyze planets orbiting distant stars, both in the classroom and in hands-on laboratory experiences. From moons to super-Jupiters, this course provides an engrossing introduction into the brand new science of exoplanet research.",
            "id": "ASTRON 140",
            "parent": "ASTRON",
            "title": "EARTH 2.0: THE EXOPLANET REVOLUTION"
        }
    },
    {
        "data": {
            "source": "PHYSICS 241",
            "target": "ASTRON 320"
        }
    },
    {
        "data": {
            "description": "Thermodynamics, atomic and molecular spectra, ionization and excitation, line and continuum opacities. Synchrotron radiation, Compton scattering, X-ray spectra. Radiative transfer, simple model atmospheres, radiative and convective energy transport.",
            "id": "ASTRON 700",
            "parent": "ASTRON",
            "title": "BASIC ASTROPHYSICS I"
        }
    },
    {
        "data": {
            "description": "Observational techniques for interstellar medium studies, overview of the role of interstellar gas in galaxies, dynamics, energetics, major theories of structure and evolution, introduction to star formations and supernova remnant evolution.",
            "id": "ASTRON 720",
            "parent": "ASTRON",
            "title": "THE INTERSTELLAR MEDIUM I: BASIC PROCESSES"
        }
    },
    {
        "data": {
            "description": "Techniques of integration, improper integrals, first order ordinary differential equations, sequences and series, Taylor series, vector geometry in two and three dimensions.",
            "id": "MATH 222",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 2"
        }
    },
    {
        "data": {
            "source": "PHYSICS 247",
            "target": "PHYSICS 248"
        }
    },
    {
        "data": {
            "description": "First order differential equations, introduction to multivariable calculus and constrained optimization, infinite sequences and series, methods of approximation, and a brief introduction to probability. Models and applications from business and the social sciences.",
            "id": "MATH 213",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 2"
        }
    },
    {
        "data": {
            "source": "PHYSICS 249",
            "target": "ASTRON 340"
        }
    },
    {
        "data": {
            "source": "ASTRON 310",
            "target": "ASTRON 330"
        }
    },
    {
        "data": {
            "source": "ASTRON 340",
            "target": "ASTRON 620"
        }
    },
    {
        "data": {
            "source": "ASTRON 340",
            "target": "ASTRON 500"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "description": "Modern astrophysics involves applying physical principles to understand astronomical phenomena. Includes the solar system, stars, nebulae, galaxies, and cosmology, with emphasis on origins and evolution. Some nighttime observation with telescopes required.",
            "id": "ASTRON 200",
            "parent": "ASTRON",
            "title": "THE PHYSICAL UNIVERSE"
        }
    },
    {
        "data": {
            "source": "PHYSICS 241",
            "target": "ASTRON 335"
        }
    },
    {
        "data": {
            "description": "Properties of normal and peculiar stars as found from an analysis of the radiation they emit; introduction to radiation transfer. Theory of stellar atmospheres, interiors, and evolution.",
            "id": "ASTRON 310",
            "parent": "ASTRON",
            "title": "STELLAR ASTROPHYSICS"
        }
    },
    {
        "data": {
            "description": "Intensively study selected topics of modern astronomy. Examples include missions to the planets, formation of stars and planets, end states of stellar evolution (supernovae, white dwarfs, pulsars, black holes), origin and evolution of the universe.",
            "id": "ASTRON 150",
            "parent": "ASTRON",
            "title": "TOPICS IN ASTRONOMY"
        }
    },
    {
        "data": {
            "description": "Over the past several decades, astronomers have discovered thousands of planets orbiting stars other than the Sun. Learn about the various methods (transits, radial velocities, microlensing, and direct imaging) used to detect these exoplanets, the inherent challenges and limitations of current methodologies (data quality, processing, and bias), and theories related to exoplanet formation, atmospheres, and habitability.",
            "id": "ASTRON 540",
            "parent": "ASTRON",
            "title": "EXOPLANETS"
        }
    },
    {
        "data": {
            "description": "Humanity is linked to the solar system in countless ways. Our view of the solar system, how planets form, and how planetary systems evolve has fundamentally changed with the discovery of countless exoplanets around other stars. Join us in exploring the modern view of the solar system and its relation to other planetary worlds. Includes the sky and celestial motions; ancient astronomy; the Copernican revolution; gravity, orbits, and interplanetary travel; formation of solar system; survey of sun, planets and moons; asteroids, meteors and comets; origin of life.",
            "id": "ASTRON 104",
            "parent": "ASTRON",
            "title": "OUR EXPLORATION OF THE SOLAR SYSTEM"
        }
    },
    {
        "data": {
            "description": "Directed study projects for juniors and seniors as arranged with a faculty member.",
            "id": "ASTRON 699",
            "parent": "ASTRON",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Coordinate system transformations, central force motion, two body problem, three and n-body problem, theory of orbital perturbations, artificial satellites, elementary transfer orbits, and elementary rocket dynamics.",
            "id": "ASTRON/EMA 550",
            "title": "ASTRODYNAMICS"
        }
    },
    {
        "data": {
            "source": "PHYSICS 241",
            "target": "ASTRON 340"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Advanced level mentored reading and research for graduate students.",
            "id": "ASTRON 999",
            "parent": "ASTRON",
            "title": "ADVANCED INDEPENDENT READING"
        }
    }
]