[
    {
        "data": {
            "description": "A preparation and introductory math course for students enrolled in the Summer Collegiate Experience program. Includes material from precalculus and calculus and related topics depending on students' results on the math placement exam.",
            "id": "MATH 118",
            "parent": "MATH",
            "title": "SUMMER COLLEGIATE EXPERIENCE MATHEMATICS COURSE"
        }
    },
    {
        "data": {
            "description": "Covers the graphs, properties and geometric significance of trigonometric functions of a real variable. Other topics include trigonometric equations and identities, application, trigonometric form of complex numbers, DeMoivre's theorem, and polar and parametric equations. The course also has a significant number of applications, especially related to other disciplines.",
            "id": "MATH 113",
            "parent": "MATH",
            "title": "TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "Introduction to theory of fluid motions for atmosphere and ocean. Elementary kinematics, fundamental forces, effects of earth's gravity and rotation, concepts and applications of hydrostatic and geostrophic balance.",
            "id": "ATMOCN 310",
            "parent": "ATMOCN",
            "title": "DYNAMICS OF THE ATMOSPHERE AND OCEAN I"
        }
    },
    {
        "data": {
            "description": "Provides synthesis and overview. Research on topic of the student's choosing is presented at the end.",
            "id": "ATMOCN 405",
            "parent": "ATMOCN",
            "title": "AOS SENIOR CAPSTONE SEMINAR"
        }
    },
    {
        "data": {
            "description": "Reviews the past, present, and future of the Arctic and Antarctic regions. Covers the history, geography, atmospheric and ocean circulations, permafrost, ice sheets, glaciers, and future state of the Arctic and Antarctica as projected by earth system models. Also explores the role of the polar regions in the earth's system and associated global climatic feedbacks.",
            "id": "ATMOCN/ENVIRST/GEOG 322",
            "title": "POLAR REGIONS AND THEIR IMPORTANCE IN THE GLOBAL ENVIRONMENT"
        }
    },
    {
        "data": {
            "description": "Water is central to the functioning of planet Earth. As humans increase their impact on Earth's systems and cohabitants, our understanding of the multiple roles of water becomes critical to finding sustainable strategies for human and ecosystem health. Explores the science of Earth's hydrosphere, with constant attention to human uses and impacts.",
            "id": "ATMOCN/SOILSCI 132",
            "title": "EARTH'S WATER: NATURAL SCIENCE AND HUMAN USE"
        }
    },
    {
        "data": {
            "description": "Advanced independent study as arranged with a faculty member.",
            "id": "ATMOCN 999",
            "parent": "ATMOCN",
            "title": "ADVANCED INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Advanced level subjects in dynamics, synoptics, climate-dynamics and atmospheric physics including recent advances.",
            "id": "ATMOCN 801",
            "parent": "ATMOCN",
            "title": "TOPICS IN THEORETICAL METEOROLOGY"
        }
    },
    {
        "data": {
            "description": "Advanced topics in oceanography.",
            "id": "ATMOCN 965",
            "parent": "ATMOCN",
            "title": "SEMINAR-OCEANOGRAPHY"
        }
    },
    {
        "data": {
            "description": "An exploration of the science behind natural disasters including earthquakes, tsunamis, volcanic eruptions, landslides, tornadoes, hurricanes, and floods. Why, where, and when do these events occur, and why are some predictable but others are not? Addresses hazard assessment, forecasting, and mitigation to lessen their impact on society.",
            "id": "ATMOCN/GEOSCI 140",
            "title": "NATURAL HAZARDS AND DISASTERS"
        }
    },
    {
        "data": {
            "description": "An introduction to multiple programming languages and technical computing methods used in the Atmospheric and Oceanic Sciences. Data analysis methods and software development for specialized applications related to the field are also highlighted.",
            "id": "ATMOCN 573",
            "parent": "ATMOCN",
            "title": "COMPUTATIONAL METHODS IN ATMOSPHERIC AND OCEANIC SCIENCES"
        }
    },
    {
        "data": {
            "description": "Application of fundamental dynamics and thermodynamics to cyclone and frontal theory; case studies illustrating the structure and evolution of the frontal cyclone; diagnostic consideration of vertical motions, frontogenesis and potential inversion; computational analysis of fundamental diagnostic equations, analysis of vertical cross sections.",
            "id": "ATMOCN 751",
            "parent": "ATMOCN",
            "title": "THE FRONTAL CYCLONE"
        }
    },
    {
        "data": {
            "description": "Atmospheric problems of global significance. Greenhouse warming, ozone layer, acid rain, climate change. Study based on elementary principles of atmospheric science. Systems approach applied to changing atmospheric composition. Interactions among geochemical cycles, anthropogenic inputs and other parts of the environment.",
            "id": "ATMOCN/ENVIRST 171",
            "title": "GLOBAL CHANGE: ATMOSPHERIC ISSUES AND PROBLEMS"
        }
    },
    {
        "data": {
            "description": "Basic dynamic concepts: equations of motion, basic approximations, Coriolis force, wave motions, normal modes, gravity waves, frictional turbulence and convective processes, geostrophic adjustment, scaling argument, effects of rotation on wave motions. Vorticity and potential vorticity.",
            "id": "ATMOCN 610",
            "parent": "ATMOCN",
            "title": "GEOPHYSICAL FLUID DYNAMICS I"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for Physics, AMEP, and Astronomy-Physics majors. Mechanics, waves, thermodynamics and statistical mechanics, topics in modern physics; with computation.  A more mathematically rigorous and in-depth introduction to physics than the other introductory physics sequences.",
            "id": "PHYSICS 247",
            "parent": "PHYSICS",
            "title": "A MODERN INTRODUCTION TO PHYSICS"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for engineering students. Electricity, magnetism, light, and sound.",
            "id": "PHYSICS 202",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for engineering students. Mechanics: kinematics, statics, dynamics; energy and momentum.",
            "id": "PHYSICS 201",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for students majoring in biological sciences. Mechanics: kinematics, statics, dynamics; energy and momentum. Heat and sound.",
            "id": "PHYSICS 207",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Characteristics of the tropical atmosphere; local and diurnal phenomena; tropical synoptic systems; circulation and energetics; mechanisms of tropical climate variations.",
            "id": "ATMOCN 522",
            "parent": "ATMOCN",
            "title": "TROPICAL METEOROLOGY"
        }
    },
    {
        "data": {
            "description": "Climate change at timescales from the last several million years to the last 100 years, with emphasis on more recent timescales. Examines how climate variability arises from interplay between external forcings, feedbacks within the earth system, and (more recently) human activity.",
            "id": "ATMOCN/ENVIRST/GEOG/GEOSCI 335",
            "title": "CLIMATIC ENVIRONMENTS OF THE PAST"
        }
    },
    {
        "data": {
            "description": "Continuation ofPHYSICS 207: calculus-based introduction to physics intended for students majoring in biological sciences. Electricity, magnetism, light, and modern physics.",
            "id": "PHYSICS 208",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Continuation ofPHYSICS 247. Electromagnetism, circuits, optics, additional topics in modern physics; with computation.",
            "id": "PHYSICS 248",
            "parent": "PHYSICS",
            "title": "A MODERN INTRODUCTION TO PHYSICS"
        }
    },
    {
        "data": {
            "description": "Covers background and modern research methods for the application of chemical analysis tools to understanding of the origin, composition, and the chemical transformations of pollutants that occur in the atmosphere. Emphasis will be directed at the pollutants impacting human health, climate change, and ecosystem degradation. Approximately half of the course materials will be taken from the scientific literature and will provide the opportunity to advance skills in the critical reading of journal articles. The course is directed at graduate students conducting research and interested in air pollution and environmental chemistry. Gain experiences in presenting scientific research methods and results related to course materials.",
            "id": "ATMOCN/CIVENGR 701",
            "title": "THE CHEMISTRY OF AIR POLLUTION"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Covers thermodynamics theory of multiphase systems, thermodynamic analysis of atmosphere, microphysical processes in the atmosphere, atmospheric and oceanic chemical processes, conduction of heat and moisture into the atmosphere from ocean and land surface.",
            "id": "ATMOCN 630",
            "parent": "ATMOCN",
            "title": "INTRODUCTION TO ATMOSPHERIC AND OCEANIC PHYSICS"
        }
    },
    {
        "data": {
            "description": "Cyclone and frontal theory; case studies illustrating the structure and evolution of the frontal cyclone; diagnostic techniques: interpretation of satellite photographs, preparation of vertical cross sections and isentropic analysis.",
            "id": "ATMOCN 452",
            "parent": "ATMOCN",
            "title": "SYNOPTIC LABORATORY I: THE FRONTAL CYCLONE"
        }
    },
    {
        "data": {
            "description": "Describes the basic climate principles governing the climate system. It describes the climate and climate variability at present, climate evolution in the past, and the projected climate change into the future. The scientific principles underlying the natural and anthropogenic greenhouse effect and climate model forecasts are elucidated.",
            "id": "ATMOCN/ENVIRST/GEOSCI 102",
            "title": "CLIMATE AND CLIMATE CHANGE"
        }
    },
    {
        "data": {
            "description": "Discussion of the philosophy of science, communication, and history of atmospheric and oceanic science topics.",
            "id": "ATMOCN 900",
            "parent": "ATMOCN",
            "title": "SEMINAR-METEOROLOGY"
        }
    },
    {
        "data": {
            "description": "Discussions on adapting to graduate school and graduate-level research, history and future of discipline, research ethics, issues of diversity and inclusion.",
            "id": "ATMOCN 901",
            "parent": "ATMOCN",
            "title": "FOUNDATIONS OF ATMOSPHERIC AND OCEANIC SCIENCES RESEARCH"
        }
    },
    {
        "data": {
            "description": "Discussions on philosophy of science, literature review, development of ideas in Atmospheric and Oceanic Sciences, training in proposal writing, and preparation for Ph.D. dissertation proposal in advance of preliminary exam.",
            "id": "ATMOCN 903",
            "parent": "ATMOCN",
            "title": "RESEARCH ADVANCES IN THE ATMOSPHERIC AND OCEANIC SCIENCES"
        }
    },
    {
        "data": {
            "description": "Dynamics, chemistry and radiation of the stratosphere and mesosphere. Structure and composition. Observing techniques. Gravity, Rossby, and Kelvin waves. Wave-mean flow interaction. Instabilities. Tracer transport. Modeling the middle atmosphere. Ozone layer. Greenhouse effect.",
            "id": "ATMOCN 705",
            "parent": "ATMOCN",
            "title": "THE MIDDLE ATMOSPHERE"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "Exploration of a field within atmospheric and oceanic sciences. Exposure to scientific principles, current findings, and career routes as it applies to topics such as meteorology, weather systems and weather forecasting, climate and climate change, atmospheric satellite remote sensing, oceanography, and professional careers in the discipline.",
            "id": "ATMOCN 201",
            "parent": "ATMOCN",
            "title": "EXPLORATIONS OF ATMOSPHERIC AND OCEANIC SCIENCES"
        }
    },
    {
        "data": {
            "description": "Explores the basic science of weather hazards ongoing around the globe and practical issues of Prediction, Risk Reduction, Resilience and Vulnerability (PRRRV) associated with these hazards.",
            "id": "ATMOCN 141",
            "parent": "ATMOCN",
            "title": "NATURAL HAZARDS OF WEATHER"
        }
    },
    {
        "data": {
            "description": "First order differential equations, introduction to multivariable calculus and constrained optimization, infinite sequences and series, methods of approximation, and a brief introduction to probability. Models and applications from business and the social sciences.",
            "id": "MATH 213",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 2"
        }
    },
    {
        "data": {
            "description": "General biological principles. Topics include: evolution, ecology, animal behavior, cell structure and function, genetics and molecular genetics and the physiology of a variety of organ systems emphasizing function in humans.",
            "id": "BIOLOGY/ZOOLOGY 101",
            "title": "ANIMAL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Governing equations for non-hydrostatic dynamics, mixed phase thermodynamics and microphysics. Cumulus parameterization and scale interactions. Application to theoretical and numerical models of thunderstorms (and attendant weather phenomena) and Mesoscale Convective Systems in the extra tropics and tropics.",
            "id": "ATMOCN 718",
            "parent": "ATMOCN",
            "title": "DYNAMICS OF MOIST CONVECTIVE SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Historical climatology with emphasis on the last few centuries.",
            "id": "ATMOCN/ENVIRST 925",
            "title": "SEMINAR-CLIMATOLOGY"
        }
    },
    {
        "data": {
            "description": "How climate systems and biological organisms operate and interact at the global scale and the implications of this for climate change, ecosystem ecology and human land use.",
            "id": "ATMOCN/ENVIRST 520",
            "title": "BIOCLIMATOLOGY"
        }
    },
    {
        "data": {
            "description": "Independent study as arranged with a faculty member.",
            "id": "ATMOCN 698",
            "parent": "ATMOCN",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Independent study as arranged with a faculty member.",
            "id": "ATMOCN 699",
            "parent": "ATMOCN",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Individual mentored study for seniors completing theses for Honors in the Major as arranged with a faculty member.",
            "id": "ATMOCN 681",
            "parent": "ATMOCN",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Individual mentored study for seniors completing theses for Honors in the Major as arranged with a faculty member.",
            "id": "ATMOCN 682",
            "parent": "ATMOCN",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Individual mentored study for seniors completing theses, as arranged with a faculty member.",
            "id": "ATMOCN 691",
            "parent": "ATMOCN",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Individual mentored study for seniors completing theses, as arranged with a faculty member.",
            "id": "ATMOCN 692",
            "parent": "ATMOCN",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Intermediate theory of fluid motions for atmosphere and ocean. Emphasis on large scale applications and basic theory for geophysical wave types. Thermal wind shear, frictional flow, vorticity concepts, Rossby waves, Sverdrup ocean flow.",
            "id": "ATMOCN 311",
            "parent": "ATMOCN",
            "title": "DYNAMICS OF THE ATMOSPHERE AND OCEAN II"
        }
    },
    {
        "data": {
            "description": "Introduces new graduate students to the diversity of ecologists across the UW-Madison campus. Includes discussions of key topics in professional development, research presentations by faculty members, and discussions of assigned papers with senior graduate students.",
            "id": "AGRONOMY/ATMOCN/BOTANY/ENTOM/ENVIRST/F&WECOL/GEOG/ZOOLOGY 953",
            "title": "INTRODUCTION TO ECOLOGY RESEARCH AT UW-MADISON"
        }
    },
    {
        "data": {
            "description": "Introduction to Object-Oriented Programming using classes and objects to solve more complex problems. Introduces array-based and linked data structures: including lists, stacks, and queues. Programming assignments require writing and developing multi-class (file) programs using interfaces, generics, and exception handling to solve challenging real world problems. Topics reviewed include reading/writing data and objects from/to files and exception handling, and command line arguments. Topics introduced: object-oriented design; class vs. object; create and define interfaces and iterators; searching and sorting; abstract data types (List,Stack,Queue,PriorityQueue(Heap),Binary Search Tree); generic interfaces (parametric polymorphism); how to design and write test methods and classes; array based vs. linked node implementations; introduction to complexity analysis; recursion.",
            "id": "COMPSCI 300",
            "parent": "COMPSCI",
            "title": "PROGRAMMING II"
        }
    },
    {
        "data": {
            "description": "Introduction to calculus of functions of several variables; calculus on parameterized curves, derivatives of functions of several variables, multiple integrals, vector calculus.",
            "id": "MATH 234",
            "parent": "MATH",
            "title": "CALCULUS--FUNCTIONS OF SEVERAL VARIABLES"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Introduction to radiation: basic laws, radiative transfer under clear sky conditions, scattering by individual particles, multiple scattering, radiative properties of clouds and aerosols, energy budget, miscellaneous applications.",
            "id": "ATMOCN 640",
            "parent": "ATMOCN",
            "title": "RADIATION IN THE ATMOSPHERE AND OCEAN"
        }
    },
    {
        "data": {
            "description": "Introduction to techniques used in the study of the biology, chemistry, geology, and physics of the marine environment.",
            "id": "ATMOCN/ENVIRST/GEOSCI/ZOOLOGY 750",
            "title": "PROBLEMS IN OCEANOGRAPHY"
        }
    },
    {
        "data": {
            "description": "Introduction to the basic principles and concepts of the biology of plants. an integrative approach stressing evolutionary sequences and the relationship between structure and function at succeeding levels of organization: molecule, cell, organism, population, community. Correlated lectures, laboratories, and discussions.",
            "id": "BIOLOGY/BOTANY 130",
            "title": "GENERAL BOTANY"
        }
    },
    {
        "data": {
            "description": "Introduction to the physics and thermodynamics of the ocean. Learn about the the physical characteristics and properties of the ocean and its circulation. Covers the basic equations of motion including the mathematics of Ekman transport, Sverdrup balance, thermal wind balance, ocean heat, salinity, and momentum conservation and budgets, waves, and tides.",
            "id": "ATMOCN 460",
            "parent": "ATMOCN",
            "title": "FUNDAMENTALS OF PHYSICAL OCEANOGRAPHY"
        }
    },
    {
        "data": {
            "description": "Learn the process of incrementally developing small (200-500 lines) programs along with the fundamental Computer Science topics. These topics include: problem abstraction and decomposition, the edit-compile-run cycle, using variables of primitive and more complex data types, conditional and loop-based flow control, basic testing and debugging techniques, how to define and call functions (methods), and IO processing techniques. Also teaches and reinforces good programming practices including the use of a consistent style, and meaningful documentation. Intended for students who have no prior programming experience.",
            "id": "COMPSCI 200",
            "parent": "COMPSCI",
            "title": "PROGRAMMING I"
        }
    },
    {
        "data": {
            "description": "Links chemistry and meteorology to engineering, law, policy, and public health. Presents key ideas in air quality, with focus on reactive pollutants in the outdoor environment, especially gas and particle phase chemicals that react with human tissue to cause sickness and death. Discusses environmental impacts of these pollutants and regulatory approaches for their control in the U.S. and around the world. Indoor air quality will be included. Non-reactive pollutants, especially carbon dioxide, will be compared and contrasted with reactive air pollutants.",
            "id": "ATMOCN/ENVIRST 355",
            "title": "INTRODUCTION TO AIR QUALITY"
        }
    },
    {
        "data": {
            "description": "Local wind systems, thunderstorms, mesoscale convection systems, interactions with synoptic scale weather. Analysis, prediction, nowcasting and observation of mesoscale weather, including interpretation of satellite and radar information.",
            "id": "ATMOCN 453",
            "parent": "ATMOCN",
            "title": "SYNOPTIC LABORATORY II: MESOSCALE METEOROLOGY"
        }
    },
    {
        "data": {
            "description": "Mathematical and statistical tools applicable to the investigation of climatological problems; nature and treatment of climatological data.",
            "id": "ATMOCN 575",
            "parent": "ATMOCN",
            "title": "CLIMATOLOGICAL ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Nature and behavior of ocean water, interaction of oceans and atmosphere, structure of the ocean floor, life in the oceans, our relationship to the marine environment.",
            "id": "ATMOCN/GEOSCI 105",
            "title": "SURVEY OF OCEANOGRAPHY"
        }
    },
    {
        "data": {
            "description": "Nature and variability of wind, temperature, clouds and precipitation. Storm systems, fronts, thunderstorms, tornadoes and their prediction. Air composition and pollution. Global winds, seasonal changes, climate and climatic change. Includes map analyses and basic quantitative lab exercises.",
            "id": "ATMOCN 101",
            "parent": "ATMOCN",
            "title": "WEATHER AND CLIMATE"
        }
    },
    {
        "data": {
            "description": "Nature and variability of wind, temperature, clouds and precipitation. Storm systems, fronts, thunderstorms, tornadoes and their prediction. Air composition and pollution. Global winds, seasonal changes, climate and climatic change.",
            "id": "ATMOCN 100",
            "parent": "ATMOCN",
            "title": "WEATHER AND CLIMATE"
        }
    },
    {
        "data": {
            "description": "Observations of and theories for boundary layers, turbulence, spectra, plumes, dust devils, convection, terrain effects, and other phenomena in the lowest 2 km of the atmosphere.",
            "id": "ATMOCN 773",
            "parent": "ATMOCN",
            "title": "BOUNDARY LAYER METEOROLOGY"
        }
    },
    {
        "data": {
            "description": "Offers a fundamental understanding of how and why global warming is happening and what to expect in the future. Investigate and discuss the evidence for change, the science that explains these observations, predicted impacts on humans and ecosystems, and the societal debate over  proposed solutions.",
            "id": "ATMOCN/ENVIRST/GEOG 332",
            "title": "GLOBAL WARMING: SCIENCE AND IMPACTS"
        }
    },
    {
        "data": {
            "description": "Overview of physical processes of the atmosphere and its coupling to the ocean and land. Understanding its seasonal climatology and variability. Synthesis through application of junior AOS core dynamics and physics to quantitatively understand diabatic, transport, and dissipative processes. Examples include global warming, air-ocean coupling, ENSO, ozone hole, tropospheric water and chemistry issues, diurnal to interannual time scales.",
            "id": "ATMOCN 425",
            "parent": "ATMOCN",
            "title": "GLOBAL CLIMATE PROCESSES"
        }
    },
    {
        "data": {
            "description": "Physical properties of sea water: ocean climatology, water, salt and heat budget, measurements, ocean circulation and water mass of the world ocean, thermocline, thermohaline, equatorial ocean and southern ocean.",
            "id": "ATMOCN 660",
            "parent": "ATMOCN",
            "title": "INTRODUCTION TO PHYSICAL OCEANOGRAPHY"
        }
    },
    {
        "data": {
            "description": "Physical variables, laws, characteristics and direct measurements for atmosphere and ocean. Thermodynamics and moist atmospheric processes. Basic physics of clouds, precipitation, and chemical constituents.",
            "id": "ATMOCN 330",
            "parent": "ATMOCN",
            "title": "PHYSICS OF THE ATMOSPHERE AND OCEAN I"
        }
    },
    {
        "data": {
            "description": "Plant-environment interactions with particular reference to energy exchanges and water relations. Models are used to provide a quantitative synthesis of information from plant physiology, soil physics, and micrometeorology with some consideration of plant-pest interactions.",
            "id": "AGRONOMY/ATMOCN/SOILSCI 532",
            "title": "ENVIRONMENTAL BIOPHYSICS"
        }
    },
    {
        "data": {
            "description": "Practical experience in planning experiment implementation, performing instrument quality control, conducting computational data analysis, and writing and presenting of meteorological and climatological observations in a team setting.",
            "id": "ATMOCN 404",
            "parent": "ATMOCN",
            "title": "METEOROLOGICAL MEASUREMENTS"
        }
    },
    {
        "data": {
            "description": "Practical training in atmospheric and oceanic sciences. Provides direct hands-on exposure to careers in the discipline. Continues the internship in atmospheric and oceanic science related companies, agencies, and organizations. Develop a portfolio of items necessary for the American Meteorological Society Certified Consulting Meteorology exam.",
            "id": "ATMOCN 811",
            "parent": "ATMOCN",
            "title": "PRACTICAL TRAINING IN ATMOSPHERIC AND OCEANIC SCIENCES II"
        }
    },
    {
        "data": {
            "description": "Practical training in atmospheric and oceanic sciences. Provides direct, hands-on exposure to careers in the discipline. Includes placement into student-designed or existing internship in atmospheric and oceanic science related companies, agencies, and organizations.",
            "id": "ATMOCN 810",
            "parent": "ATMOCN",
            "title": "PRACTICAL TRAINING IN ATMOSPHERIC AND OCEANIC SCIENCES I"
        }
    },
    {
        "data": {
            "description": "Processes of cloud formation, growth, and dissipation from the standpoint of both the cloud particles and the whole cloud as a dynamic entity.",
            "id": "ATMOCN 637",
            "parent": "ATMOCN",
            "title": "CLOUD PHYSICS"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Provides necessary knowledge about radar and satellite meteorology.",
            "id": "ATMOCN 441",
            "parent": "ATMOCN",
            "title": "RADAR AND SATELLITE METEOROLOGY"
        }
    },
    {
        "data": {
            "description": "Quasi-geostrophic motion, potential vorticity equations, E-P fluxes, Rossby waves, boundary layer processes, wind-driven ocean circulation and western boundary currents, barotropic and baroclinic instability, tropical flows.",
            "id": "ATMOCN 611",
            "parent": "ATMOCN",
            "title": "GEOPHYSICAL FLUID DYNAMICS II"
        }
    },
    {
        "data": {
            "description": "Radiation, energy budget, and cloud physics. Scattering, absorption, emission and diabatic heating by shortwave and longwave processes. Introduction to cloud physics including cloud nucleation processes, particle growth, precipitation development, and convective cloud processes.",
            "id": "ATMOCN 340",
            "parent": "ATMOCN",
            "title": "PHYSICS OF THE ATMOSPHERE AND OCEAN II"
        }
    },
    {
        "data": {
            "description": "Research with atmospheric and oceanic science faculty advisors.",
            "id": "ATMOCN 990",
            "parent": "ATMOCN",
            "title": "RESEARCH"
        }
    },
    {
        "data": {
            "description": "Sections in various fields of zoological research.",
            "id": "ATMOCN/BOTANY/CIVENGR/ENVIRST/GEOSCI/ZOOLOGY 911",
            "title": "LIMNOLOGY AND MARINE SCIENCE SEMINAR"
        }
    },
    {
        "data": {
            "description": "Special topics to be given as the need and opportunity arise.",
            "id": "ATMOCN 401",
            "parent": "ATMOCN",
            "title": "TOPICS IN METEOROLOGY"
        }
    },
    {
        "data": {
            "description": "Synthesizes the fundamentals of atmospheric dynamics, thermodynamics and microphysics to explain the theory behind the structure, evolution and prediction of microscale, mesoscale and cloud scale weather. Learn the dynamics, and thermodynamics of mesoscale, fogs, cumulus, and severe storms (including tornadoes), mountain meteorology and convective tropical weather systems (including hurricanes and typhoons) and application of multi-scale numerical methods and models for analysis and prediction.",
            "id": "ATMOCN 753",
            "parent": "ATMOCN",
            "title": "MESOSCALE METEOROLOGY"
        }
    },
    {
        "data": {
            "description": "Techniques of integration, improper integrals, first order ordinary differential equations, sequences and series, Taylor series, vector geometry in two and three dimensions.",
            "id": "MATH 222",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 2"
        }
    },
    {
        "data": {
            "description": "The theory of the general circulation with emphasis on the sources, sinks, and transport of mass, angular momentum, and energy that serve to maintain the circumpolar vortex.",
            "id": "ATMOCN 712",
            "parent": "ATMOCN",
            "title": "GENERAL CIRCULATION OF THE ATMOSPHERE"
        }
    },
    {
        "data": {
            "description": "Topics in earth system science. Emphasis on the coupling between atmospheric, oceanic and land surface systems, involving physical geochemical and biological processes, and including interactions with human systems.",
            "id": "ATMOCN/BOTANY/ENVIRST/F&WECOL/GEOG/GEOSCI/ZOOLOGY 980",
            "title": "EARTH SYSTEM SCIENCE SEMINAR"
        }
    },
    {
        "data": {
            "description": "Topics in multi-variable calculus and introduction to differential equations.",
            "id": "MATH 376",
            "parent": "MATH",
            "title": "TOPICS IN MULTI-VARIABLE CALCULUS AND DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics and selected topics in Animal Physiology.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Topics include: selected topics in plant physiology, a survey of the five major kingdoms of organisms, speciation and evolutionary theory, and ecology at multiple levels of the biological hierarchy.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Use of satellite imagery and measurements in meteorological research and operations; orbital characteristics; navigation; instrumentation.",
            "id": "ATMOCN/ENVIRST 745",
            "title": "METEOROLOGICAL SATELLITE APPLICATIONS"
        }
    },
    {
        "data": {
            "description": "Various aspects of global ocean-atmosphere coupling and climate variability; global surface flux distribution; mixed layer dynamics; tropical dynamics and El Nino and Southern Oscillation; extratropical ocean-atmosphere coupling; interannual to interdecadal climate variability.",
            "id": "ATMOCN 760",
            "parent": "ATMOCN",
            "title": "LARGE-SCALE OCEAN-ATMOSPHERE COUPLING"
        }
    },
    {
        "data": {
            "description": "Vector spaces and linear transformations, differential calculus of scalar and vector fields, determinants, eigenvalues and eigenvectors, multiple integrals, line integrals, and surface integrals. Freshmen students are invited to enroll by the Department of Mathematics.",
            "id": "MATH 375",
            "parent": "MATH",
            "title": "TOPICS IN MULTI-VARIABLE CALCULUS AND LINEAR ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Written and oral communication about topics related to graduate research.",
            "id": "ATMOCN 902",
            "parent": "ATMOCN",
            "title": "SCIENTIFIC COMMUNICATIONS IN THE ATMOSPHERIC AND OCEANIC SCIENCES"
        }
    },
    {
        "data": {
            "id": "ATMOCN",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "COMPSCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "PHYSICS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ATMOCN 100",
            "target": "ATMOCN 101"
        }
    },
    {
        "data": {
            "source": "ATMOCN 101",
            "target": "ATMOCN 100"
        }
    },
    {
        "data": {
            "source": "ATMOCN 101",
            "target": "ATMOCN 201"
        }
    },
    {
        "data": {
            "source": "ATMOCN 101",
            "target": "ATMOCN/ENVIRST 520"
        }
    },
    {
        "data": {
            "source": "ATMOCN 310",
            "target": "ATMOCN 311"
        }
    },
    {
        "data": {
            "source": "ATMOCN 310",
            "target": "ATMOCN 401"
        }
    },
    {
        "data": {
            "source": "ATMOCN 310",
            "target": "ATMOCN 405"
        }
    },
    {
        "data": {
            "source": "ATMOCN 311",
            "target": "ATMOCN 405"
        }
    },
    {
        "data": {
            "source": "ATMOCN 311",
            "target": "ATMOCN 425"
        }
    },
    {
        "data": {
            "source": "ATMOCN 311",
            "target": "ATMOCN 452"
        }
    },
    {
        "data": {
            "source": "ATMOCN 311",
            "target": "ATMOCN 453"
        }
    },
    {
        "data": {
            "source": "ATMOCN 311",
            "target": "ATMOCN 460"
        }
    },
    {
        "data": {
            "source": "ATMOCN 311",
            "target": "ATMOCN 522"
        }
    },
    {
        "data": {
            "source": "ATMOCN 311",
            "target": "ATMOCN 575"
        }
    },
    {
        "data": {
            "source": "ATMOCN 311",
            "target": "ATMOCN 637"
        }
    },
    {
        "data": {
            "source": "ATMOCN 311",
            "target": "ATMOCN 660"
        }
    },
    {
        "data": {
            "source": "ATMOCN 330",
            "target": "ATMOCN 340"
        }
    },
    {
        "data": {
            "source": "ATMOCN 330",
            "target": "ATMOCN 401"
        }
    },
    {
        "data": {
            "source": "ATMOCN 330",
            "target": "ATMOCN 405"
        }
    },
    {
        "data": {
            "source": "ATMOCN 340",
            "target": "ATMOCN 405"
        }
    },
    {
        "data": {
            "source": "ATMOCN 340",
            "target": "ATMOCN 425"
        }
    },
    {
        "data": {
            "source": "ATMOCN 340",
            "target": "ATMOCN 441"
        }
    },
    {
        "data": {
            "source": "ATMOCN 340",
            "target": "ATMOCN 452"
        }
    },
    {
        "data": {
            "source": "ATMOCN 340",
            "target": "ATMOCN 453"
        }
    },
    {
        "data": {
            "source": "ATMOCN 340",
            "target": "ATMOCN 522"
        }
    },
    {
        "data": {
            "source": "ATMOCN 340",
            "target": "ATMOCN 575"
        }
    },
    {
        "data": {
            "source": "ATMOCN 340",
            "target": "ATMOCN 637"
        }
    },
    {
        "data": {
            "source": "ATMOCN 610",
            "target": "ATMOCN 611"
        }
    },
    {
        "data": {
            "source": "ATMOCN 810",
            "target": "ATMOCN 811"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "AGRONOMY/ATMOCN/SOILSCI 532"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 152"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 101"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "target": "ATMOCN/ENVIRST 520"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 151"
        }
    },
    {
        "data": {
            "source": "COMPSCI 200",
            "target": "COMPSCI 300"
        }
    },
    {
        "data": {
            "source": "COMPSCI 300",
            "target": "ATMOCN 573"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 113"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 113",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 213"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 213",
            "target": "MATH 222"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "AGRONOMY/ATMOCN/SOILSCI 532"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 222"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "PHYSICS 201"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "PHYSICS 202"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "PHYSICS 207"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 234"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "PHYSICS 247"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "ATMOCN 310"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "ATMOCN 330"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "ATMOCN 573"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "ATMOCN 610"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "ATMOCN 630"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "ATMOCN 640"
        }
    },
    {
        "data": {
            "source": "MATH 375",
            "target": "MATH 376"
        }
    },
    {
        "data": {
            "source": "MATH 376",
            "target": "ATMOCN 460"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "PHYSICS 201",
            "target": "PHYSICS 202"
        }
    },
    {
        "data": {
            "source": "PHYSICS 201",
            "target": "PHYSICS 207"
        }
    },
    {
        "data": {
            "source": "PHYSICS 202",
            "target": "ATMOCN 610"
        }
    },
    {
        "data": {
            "source": "PHYSICS 202",
            "target": "PHYSICS 208"
        }
    },
    {
        "data": {
            "source": "PHYSICS 207",
            "target": "AGRONOMY/ATMOCN/SOILSCI 532"
        }
    },
    {
        "data": {
            "source": "PHYSICS 207",
            "target": "PHYSICS 201"
        }
    },
    {
        "data": {
            "source": "PHYSICS 207",
            "target": "PHYSICS 208"
        }
    },
    {
        "data": {
            "source": "PHYSICS 208",
            "target": "PHYSICS 202"
        }
    },
    {
        "data": {
            "source": "PHYSICS 247",
            "target": "PHYSICS 248"
        }
    },
    {
        "data": {
            "source": "PHYSICS 248",
            "target": "ATMOCN 310"
        }
    },
    {
        "data": {
            "source": "PHYSICS 248",
            "target": "ATMOCN 330"
        }
    },
    {
        "data": {
            "source": "PHYSICS 248",
            "target": "ATMOCN 630"
        }
    },
    {
        "data": {
            "source": "PHYSICS 248",
            "target": "ATMOCN 640"
        }
    }
]