[
    {
        "data": {
            "id": "MICROBIO",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics and selected topics in Animal Physiology.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Introduction to how life works at a molecular level and the evolutionary paths that led to the great diversity of life on our planet. With this foundation, discuss current topics in the news such as: exploring the human genome to understand our species' history and to diagnose and treat disease; genetic engineering of crops in relation to foods safety and effects on ecosystems; gene editing of insects and mammals including humans; how to determine whether herbal remedies, vaccines, etc. are effective and safe; and current trends in biotechnology and what might be on the horizon. Focus on appreciating the nature of science and becoming better equipped to explore and evaluate scientific topics of interest.",
            "id": "BIOCHEM 104",
            "parent": "BIOCHEM",
            "title": "MOLECULES TO LIFE AND THE NATURE OF SCIENCE"
        }
    },
    {
        "data": {
            "description": "Introductory training in the practical aspects of being a graduate-level scientist and the professional standards and expectations of ethical researchers. Covers a wide variety of professional development topics, including choosing a research laboratory and a thesis mentor, transitioning to self-education, managing stress in graduate school, and the importance of diversity in science. Ethics topics include conflicts of interest, the protection of human subjects, the welfare of laboratory animals and workers, safe laboratory spaces, mentor and mentee responsibilities, collaborative research, peer review, data acquisition and data management practices, research misconduct, responsible authorship and publication, contemporary ethical issues in biomedical research, and the roles of responsible scientists in society. Covers all NIH-recommended topics for Responsible Conduct of Research, thus meeting the requirements for trainees involved in NIH-sponsored research programs.",
            "id": "BIOCHEM/BMOLCHEM 701",
            "title": "RESPONSIBLE CONDUCT IN BIOSCIENCE RESEARCH"
        }
    },
    {
        "data": {
            "description": "First semester of individual study for undergraduate students in an Honors program completing a thesis in the area of Biochemistry, as arranged with a Biochemistry faculty member.",
            "id": "BIOCHEM 681",
            "parent": "BIOCHEM",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Specialized subjects of current interest.",
            "id": "BIOCHEM 729",
            "parent": "BIOCHEM",
            "title": "ADVANCED TOPICS"
        }
    },
    {
        "data": {
            "description": "Introduction to written and visual communication of biochemical research, both to other scientists and to general audiences, including: how to recognize and adapt work to different audiences; how to construct a scientific argument and the different strategies used for research reports, reviews, and proposals; and how to create figures and posters that clearly convey scientific data and concepts. Learn about the peer review process and revision of scientific writing. An intensive writing component, which requires multiple written and visual documentation on topics related to thesis research.",
            "id": "BIOCHEM 721",
            "parent": "BIOCHEM",
            "title": "BIOCHEMICAL COMMUNICATION"
        }
    },
    {
        "data": {
            "description": "Principles of molecular structure and bonding applied to predict and explain the reactivity of alkanes, alkenes, alkynes, alkyl halides, alcohols, and thiols. Emphasis placed on rationalizing the stereochemical and regiochemical outcome of chemical processes.",
            "id": "CHEM 343",
            "parent": "CHEM",
            "title": "ORGANIC CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Introduction to calculus of functions of several variables; calculus on parameterized curves, derivatives of functions of several variables, multiple integrals, vector calculus.",
            "id": "MATH 234",
            "parent": "MATH",
            "title": "CALCULUS--FUNCTIONS OF SEVERAL VARIABLES"
        }
    },
    {
        "data": {
            "source": "GENETICS 466",
            "target": "GENETICS 467"
        }
    },
    {
        "data": {
            "description": "General concepts of animal biology at an introductory level emphasizing the evolutionary relationships between animals. Learn about general body plans and strategies used to accomplish the basic tasks of staying alive in major animal groups using preserved and live animals. Study the diversity within each group of animals by integrating the body plans with the lifestyle and ecology of animals. Dissections of earthworm, freshwater mussel, squid, sea star, and rat aid the study of these general principles.",
            "id": "BIOLOGY/ZOOLOGY 102",
            "title": "ANIMAL BIOLOGY LABORATORY"
        }
    },
    {
        "data": {
            "source": "MATH 376",
            "target": "MATH 415"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 102"
        }
    },
    {
        "data": {
            "description": "Chemistry and biology of proteins, nucleic acids and carbohydrates; application of organic chemistry to problems in cell biology, biotechnology, and biomedicine.",
            "id": "BIOCHEM/CHEM 704",
            "title": "CHEMICAL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Biotechnology Training Program trainees will present their research for critical review by audience.",
            "id": "BIOCHEM/CBE 932",
            "title": "BIOTECHNOLOGY TRAINING PROGRAM SEMINAR"
        }
    },
    {
        "data": {
            "description": "Broad coverage of animal virology taught at molecular level. Topics include virus structure, viral replication/lifecycle, aspects of pathogenesis and prevention.",
            "id": "BIOCHEM/MM&I 575",
            "title": "BIOLOGY OF VIRUSES"
        }
    },
    {
        "data": {
            "description": "Principles and application of chemical equilibrium, coordination chemistry, oxidation-reduction and electrochemistry, kinetics, nuclear chemistry, introduction to organic chemistry, and chemistry laboratory skills.",
            "id": "CHEM 104",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY II"
        }
    },
    {
        "data": {
            "source": "CHEM 345",
            "target": "BIOCHEM 507"
        }
    },
    {
        "data": {
            "description": "Genetics of eukaryotes and prokaryotes. Includes transmission genetics, probability and hypothesis testing, genetic mapping, molecular genetics, gene expression, and genetic engineering. Illustrative material includes viruses, bacteria, plants, fungi, insects, and humans.",
            "id": "GENETICS 467",
            "parent": "GENETICS",
            "title": "GENERAL GENETICS 1"
        }
    },
    {
        "data": {
            "source": "GENETICS 466",
            "target": "BIOCHEM/GENETICS/MICROBIO 612"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 234"
        }
    },
    {
        "data": {
            "source": "GENETICS 468",
            "target": "BIOCHEM/GENETICS 631"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "MATH 340",
            "target": "MATH 415"
        }
    },
    {
        "data": {
            "description": "Accelerated coverage of topics in general chemistry, including introduction to laboratory techniques. Topics include atomic and molecular structure, chemical equilibrium, acid-base chemistry, thermodynamics, kinetics, and electrochemistry.",
            "id": "CHEM 109",
            "parent": "CHEM",
            "title": "ADVANCED GENERAL CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "An introduction to linear algebra and differential equations with emphasis on the relationship between the theory of linear algebra and analytical and numerical techniques for solving differential equations. Linear algebra topics include linear systems, matrices and their algebra, vector spaces and linear transformations, eigenvalues and eigenvectors. Topics from differential equations include first order ODE, homogeneous and nonhomogeneous linear systems, and numerical methods.",
            "id": "MATH 320",
            "parent": "MATH",
            "title": "LINEAR ALGEBRA AND DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "source": "MATH 375",
            "target": "MATH 376"
        }
    },
    {
        "data": {
            "source": "CHEM 343",
            "target": "CHEM 345"
        }
    },
    {
        "data": {
            "description": "Research work for students under direct guidance of a Biochemistry faculty member.  Students are responsible for arranging the work and credits with the supervising instructor.",
            "id": "BIOCHEM 299",
            "parent": "BIOCHEM",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 508",
            "target": "BIOCHEM/GENETICS/MDGENET 620"
        }
    },
    {
        "data": {
            "description": "Core organic chemistry concepts of structure, reactivity, and synthesis with regards to the functional groups commonly found in commercial and biological substances. Covers a selection of topics fromCHEM 343and345.",
            "id": "CHEM 341",
            "parent": "CHEM",
            "title": "ELEMENTARY ORGANIC CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Provides academic credit for research, library, and/or laboratory work under direct guidance of a faculty member. Students are responsible for arranging the work and credits with the supervising faculty member.",
            "id": "BIOCHEM 699",
            "parent": "BIOCHEM",
            "title": "SPECIAL PROBLEMS"
        }
    },
    {
        "data": {
            "description": "Principles underlying the control of metabolism as it applies to macronutrients. Discusses advanced aspects of metabolic control. Metabolism of protein and amino acids, fat, and carbohydrate. Discusses fuel sensing and metabolism in disease.",
            "id": "BIOCHEM/NUTRSCI 619",
            "title": "ADVANCED NUTRITION: INTERMEDIARY METABOLISM OF MACRONUTRIENTS"
        }
    },
    {
        "data": {
            "description": "Genetics in eukaryotes and prokaryotes.  Includes transmission genetics, molecular genetics, evolutionary genetics, genetic engineering, and societal issues associated with genetics.  Illustrative material includes bacteria, plants, insects, and vertebrates.",
            "id": "GENETICS 466",
            "parent": "GENETICS",
            "title": "PRINCIPLES OF GENETICS"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 507",
            "target": "BIOCHEM/BOTANY 621"
        }
    },
    {
        "data": {
            "description": "Introduction to the basic principles and concepts of the biology of plants. an integrative approach stressing evolutionary sequences and the relationship between structure and function at succeeding levels of organization: molecule, cell, organism, population, community. Correlated lectures, laboratories, and discussions.",
            "id": "BIOLOGY/BOTANY 130",
            "title": "GENERAL BOTANY"
        }
    },
    {
        "data": {
            "description": "An introduction to nonlinear dynamical systems including stability, bifurcations and chaos. The course will give underlying mathematical ideas, but emphasize applications from many scientific fields.",
            "id": "MATH 415",
            "parent": "MATH",
            "title": "APPLIED DYNAMICAL SYSTEMS, CHAOS AND MODELING"
        }
    },
    {
        "data": {
            "description": "Topics in multi-variable calculus and introduction to differential equations.",
            "id": "MATH 376",
            "parent": "MATH",
            "title": "TOPICS IN MULTI-VARIABLE CALCULUS AND DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "source": "MM&I 301",
            "target": "BIOCHEM/MM&I 575"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "description": "Provides a rigorous foundation for mathematical modeling of biological systems. Mathematical techniques include dynamical systems and differential equations. Applications to biological pathways, including understanding of bistability within chemical reaction systems, are emphasized.",
            "id": "BIOCHEM/BMI/BMOLCHEM/MATH 609",
            "title": "MATHEMATICAL METHODS FOR SYSTEMS BIOLOGY"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "MATH 415"
        }
    },
    {
        "data": {
            "description": "Research reports, special topics, and reports from recent literature in molecular virology.",
            "id": "BIOCHEM 910",
            "parent": "BIOCHEM",
            "title": "SEMINAR-MOLECULAR VIROLOGY (ADVANCED)"
        }
    },
    {
        "data": {
            "id": "BIOCHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 501",
            "target": "BIOCHEM/NUTRSCI 510"
        }
    },
    {
        "data": {
            "description": "The theory of linear algebra with an introduction to proofs and proof writing. Topics include vector spaces, linear dependence, span, basis, linear transformations, kernel, image, inner products and inner product spaces, geometry, eigenvalues, eigenvectors, standard matrix factorizations. Other content includes basic set theory, logical operations, quantifiers, direct and indirect arguments, and induction. Differential equations [MATH 320] not covered.",
            "id": "MATH 341",
            "parent": "MATH",
            "title": "LINEAR ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Provides an area equivalency for courses taken on Madison Study Abroad Programs that do not equate to existing UW courses. Enrollment in a UW-Madison resident study abroad program",
            "id": "BIOCHEM 400",
            "parent": "BIOCHEM",
            "title": "STUDY ABROAD IN BIOCHEMISTRY"
        }
    },
    {
        "data": {
            "source": "MATH 320",
            "target": "BIOCHEM/BMI/BMOLCHEM/MATH 609"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 501",
            "target": "BIOCHEM 551"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "GENETICS 467"
        }
    },
    {
        "data": {
            "source": "CHEM 345",
            "target": "BIOCHEM 601"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 501",
            "target": "BIOCHEM 625"
        }
    },
    {
        "data": {
            "source": "CHEM 343",
            "target": "CHEM 341"
        }
    },
    {
        "data": {
            "description": "Molecular mechanisms whereby endogenous and environmental regulatory factors control development; emphasis on stimulus perception and primary events in the signal chain leading to modulated gene expression and cellular development.",
            "id": "BIOCHEM/BOTANY/GENETICS 840",
            "title": "REGULATORY MECHANISMS IN PLANT DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Emphasizes the importance of coenzyme and cofactors of enzymes (i.e., vitamins and minerals) in biochemistry. All aspects of the biochemistry of coenzymes will be covered, including their biosynthesis as far as is known, the biochemical reactions they catalyze, their chemical and spectroscopic properties, and the mechanisms by which they facilitate biochemical reactions.",
            "id": "BIOCHEM 625",
            "parent": "BIOCHEM",
            "title": "MECHANISMS OF ACTION OF VITAMINS AND MINERALS"
        }
    },
    {
        "data": {
            "description": "Student-led discussions of RNA-related problems.",
            "id": "BIOCHEM/BMOLCHEM 913",
            "title": "SEMINAR-RIBOGROUP (ADVANCED)"
        }
    },
    {
        "data": {
            "source": "CHEM 115",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "description": "Explores a detailed atomic and molecular view of matter and its interactions, with a specific focus on quantum theory, molecular structure, and chemical bonding. Application required for enrollment.",
            "id": "CHEM 115",
            "parent": "CHEM",
            "title": "CHEMICAL PRINCIPLES I"
        }
    },
    {
        "data": {
            "description": "Presentation of original research results; discussion of recent articles in animal metabolism and nutrition.",
            "id": "BIOCHEM/NUTRSCI 901",
            "title": "SEMINAR-NUTRITION AND METABOLISM (ADVANCED)"
        }
    },
    {
        "data": {
            "description": "Synthetic biology is a burgeoning field encompassing understanding and designing biological systems spanning from biomolecules to ecosystems. It builds on advances in molecular and cellular technologies to revolutionize biological engineering in the same way that organic synthesis transformed chemistry and integrated circuit design transformed computing. Synthetic biology has the potential to address many of society's grand challenges including: understanding human disease, sustainable biomanufacturing, medical diagnostics and therapeutics, programming mammalian cell behaviors, engineering living materials, information storage, carbon sequestration, and energy generation. Latest advances in the field will be reviewed by covering literature including but not limited to biomolecular design, sequence-structure-function relationship, regulatory and signaling networks, metabolic engineering, interactions in microbial communities, cell-based therapeutics and genome design.",
            "id": "BIOCHEM 919",
            "parent": "BIOCHEM",
            "title": "SYNTHETIC BIOLOGY SEMINAR"
        }
    },
    {
        "data": {
            "description": "Genetic analysis, population genetics, evolution and quantitative genetics. Includes mutant screens, pathway analysis, mosaic analysis, reverse genetics, genomics, Hardy-Weinberg  linkage equilibrium, inbreeding, genetic drift, natural selection, population structure, inheritance of complex traits, domestication and human evolution.",
            "id": "GENETICS 468",
            "parent": "GENETICS",
            "title": "GENERAL GENETICS 2"
        }
    },
    {
        "data": {
            "source": "MATH 319",
            "target": "MATH 415"
        }
    },
    {
        "data": {
            "description": "An internship under guidance of a faculty or instructional academic staff member in Biochemistry and internship site supervisor. Students are responsible for arranging the work and credits with the faculty or instructional academic staff member and the internship site supervisor.",
            "id": "BIOCHEM 399",
            "parent": "BIOCHEM",
            "title": "COORDINATIVE INTERNSHIP/COOPERATIVE EDUCATION"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 222"
        }
    },
    {
        "data": {
            "description": "Covers basic and applied biochemical principles related to human disease. Topics such as: cancer, including cell cycle regulation, oncogenes and tumor suppressors, and cellular metabolism; metabolic disorders, including cardiovascular disease, metabolic syndrome, and diabetes;  biotechnology, including metabolomics, CRISPR-based genetic screens, and experimental models of human disease.",
            "id": "BIOCHEM/NUTRSCI 560",
            "title": "PRINCIPLES OF HUMAN DISEASE AND BIOTECHNOLOGY"
        }
    },
    {
        "data": {
            "source": "CHEM 343",
            "target": "BIOCHEM 501"
        }
    },
    {
        "data": {
            "description": "Review of linear differential equations; series solution of linear differential equations; boundary value problems; Laplace transforms; possibly numerical methods and two dimensional autonomous systems.",
            "id": "MATH 319",
            "parent": "MATH",
            "title": "TECHNIQUES IN ORDINARY DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 507",
            "target": "BIOCHEM 625"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 320"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "Principles of molecular structure and bonding applied to predict and explain the reactivity of aromatic systems, benzylic and allylic systems, aryl and vinyl halides, and carbonyl-containing compounds (e.g., ketones, carboxylic acids, esters, acid chlorides, amides). Emphasis placed on rationalizing the stereochemical and regiochemical outcome of chemical processes as well as arguing reaction outcomes from spectroscopic evidence.",
            "id": "CHEM 345",
            "parent": "CHEM",
            "title": "ORGANIC CHEMISTRY II"
        }
    },
    {
        "data": {
            "source": "GENETICS 467",
            "target": "GENETICS 468"
        }
    },
    {
        "data": {
            "description": "Introduces the lab skills and techniques used in biochemistry and molecular biology laboratories. Engineer mutants of the T7 bacteriophage and test the virulence of the bacteriophages on various bacterial strains. Integrate biochemistry, molecular biology, microbiology, genetics, and basic laboratory techniques.",
            "id": "BIOCHEM 207",
            "parent": "BIOCHEM",
            "title": "ENGINEERING BACTERIOPHAGE LABORATORY"
        }
    },
    {
        "data": {
            "id": "BIOCORE",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Vector spaces and linear transformations, differential calculus of scalar and vector fields, determinants, eigenvalues and eigenvectors, multiple integrals, line integrals, and surface integrals. Freshmen students are invited to enroll by the Department of Mathematics.",
            "id": "MATH 375",
            "parent": "MATH",
            "title": "TOPICS IN MULTI-VARIABLE CALCULUS AND LINEAR ALGEBRA"
        }
    },
    {
        "data": {
            "source": "MATH 213",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "CHEM 345",
            "target": "BIOCHEM 625"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "MM&I 301"
        }
    },
    {
        "data": {
            "description": "An introduction to linear algebra. Topics include matrix algebra, linear systems of equations, vector spaces, sub-spaces, linear dependence, span, basis, rank of matrices, determinants, linear transformations, coordinate representations, kernel, range, eigenvalues and eigenvectors, diagonalization, inner products and orthogonal vectors, symmetric matrices. Covers linear algebra topics in greater depth and detail thanMATH 320. Formal techniques in mathematical argument [MATH 341] not covered.",
            "id": "MATH 340",
            "parent": "MATH",
            "title": "ELEMENTARY MATRIX AND LINEAR ALGEBRA"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "MM&I 301"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 101"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 507",
            "target": "BIOCHEM/NUTRSCI 560"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 507",
            "target": "BIOCHEM 601"
        }
    },
    {
        "data": {
            "source": "GENETICS 466",
            "target": "BIOCHEM/GENETICS 631"
        }
    },
    {
        "data": {
            "source": "MATH 415",
            "target": "BIOCHEM/BMI/BMOLCHEM/MATH 609"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 340"
        }
    },
    {
        "data": {
            "description": "Examines various special topics in biochemistry. Topics and content will vary each semester and by section of the course.",
            "id": "BIOCHEM 375",
            "parent": "BIOCHEM",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "Presentations and discussions of recently published research in chemical biology and related areas.",
            "id": "BIOCHEM/CHEM 945",
            "title": "SEMINAR-CHEMICAL BIOLOGY (ADVANCED)"
        }
    },
    {
        "data": {
            "source": "MICROBIO 303",
            "target": "MICROBIO 470"
        }
    },
    {
        "data": {
            "description": "Second semester of individual study for undergraduate students completing a thesis in the area of Biochemistry, as arranged with a Biochemistry faculty member.",
            "id": "BIOCHEM 692",
            "parent": "BIOCHEM",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Medically important bacteria, emphasizing the process of pathogenesis and host/parasite interactions, as well as intervention strategies, immunity and genetics as they apply to the pathogens.",
            "id": "MM&I 301",
            "parent": "MM&I",
            "title": "PATHOGENIC BACTERIOLOGY"
        }
    },
    {
        "data": {
            "description": "Basic biology of microorganisms, including structure, function, physiology, genetics, ecology, diversity, and evolution.",
            "id": "MICROBIO 303",
            "parent": "MICROBIO",
            "title": "BIOLOGY OF MICROORGANISMS"
        }
    },
    {
        "data": {
            "description": "Examines modern microbial genetics and molecular processes. Emphasis on the use of eubacterial and eukaryotic microbes to elucidate cellular function. Discussion of experimental approaches to study microbes and their use in biotechnology, bioremediation, and medicine.",
            "id": "MICROBIO 470",
            "parent": "MICROBIO",
            "title": "MICROBIAL GENETICS & MOLECULAR MACHINES"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "MATH 341"
        }
    },
    {
        "data": {
            "description": "Analysis of recent literature in topics related to prokaryotic and eukaryotic gene regulation, including regulation of transcription, translation, and genome organization.",
            "id": "BIOCHEM/MICROBIO 917",
            "title": "REGULATION OF GENE EXPRESSION (ADVANCED SEMINAR)"
        }
    },
    {
        "data": {
            "description": "A combination of recent literature and original research presentations relating to the use of single molecule techniques in biochemistry including fluorescence microscopy, tethered particle motion, patch-clamping, cryo-electron microscopy, optical trapping, magnetic tweezers, and super resolution microscopy.",
            "id": "BIOCHEM/CHEM 918",
            "title": "SINGLE MOLECULE APPROACHES TO BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Basic principles of ecology and interrelations between individuals, populations, communities, ecosystems and their environment; transmission genetics and introduction to population genetics; origin of life, evolutionary mechanisms, ancestral relationships among species, and the diversity of life.",
            "id": "BIOCORE 381",
            "parent": "BIOCORE",
            "title": "EVOLUTION, ECOLOGY, AND GENETICS"
        }
    },
    {
        "data": {
            "id": "GENETICS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "GENETICS 468",
            "target": "GENETICS 466"
        }
    },
    {
        "data": {
            "description": "Stoichiometry and the mole concept, the behavior of gases, liquids and solids, thermochemistry, electronic structure of atoms and chemical bonding, descriptive chemistry of selected elements and compounds, intermolecular forces, and chemistry laboratory skills.",
            "id": "CHEM 103",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY I"
        }
    },
    {
        "data": {
            "source": "MATH 320",
            "target": "MATH 415"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 507",
            "target": "BIOCHEM/GENETICS/MICROBIO 612"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 501",
            "target": "BIOCHEM/BOTANY 621"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOCHEM/MM&I 575"
        }
    },
    {
        "data": {
            "description": "Lectures in nutrition with a substantial background in biochemistry. Emphasis on biochemical and physiological fundamentals of nutrition. Discussion of protein, fat, carbohydrate, energy, minerals and vitamins and their roles and interrelationships in nutrition and metabolism.",
            "id": "BIOCHEM/NUTRSCI 510",
            "title": "NUTRITIONAL BIOCHEMISTRY AND METABOLISM"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "MATH 375",
            "target": "BIOCHEM/BMI/BMOLCHEM/MATH 609"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 109"
        }
    },
    {
        "data": {
            "description": "Biosynthesis of biological molecules, signal transduction mechanisms, chemistry and metabolism of nucleic acids, protein synthesis, and molecular and cellular biology.",
            "id": "BIOCHEM 508",
            "parent": "BIOCHEM",
            "title": "GENERAL BIOCHEMISTRY II"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 501",
            "target": "BIOCHEM/NUTRSCI 645"
        }
    },
    {
        "data": {
            "description": "General biological principles. Topics include: evolution, ecology, animal behavior, cell structure and function, genetics and molecular genetics and the physiology of a variety of organ systems emphasizing function in humans.",
            "id": "BIOLOGY/ZOOLOGY 101",
            "title": "ANIMAL BIOLOGY"
        }
    },
    {
        "data": {
            "source": "MATH 341",
            "target": "MATH 415"
        }
    },
    {
        "data": {
            "description": "First semester of individual study for undergraduate students completing a thesis in the area of Biochemistry, as arranged with a Biochemistry faculty member.",
            "id": "BIOCHEM 691",
            "parent": "BIOCHEM",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 501",
            "target": "BIOCHEM 601"
        }
    },
    {
        "data": {
            "description": "Various selected topics in contemporary macromolecular or biophysical chemistry.",
            "id": "BIOCHEM/CHEM 872",
            "title": "SELECTED TOPICS IN MACROMOLECULAR AND BIOPHYSICAL CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Examination of various physiological states and how they affect metabolic pathways. Discussion of a number of special topics related to the unique roles of various tissues and to metabolic pathways in disease states, including adipocyte biology, beta-cell biology, epigenetics, inflammation, and aging related diseases.",
            "id": "BIOCHEM/NUTRSCI 645",
            "title": "MOLECULAR CONTROL OF METABOLISM AND METABOLIC DISEASE"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 508",
            "target": "BIOCHEM/NUTRSCI 645"
        }
    },
    {
        "data": {
            "source": "MICROBIO 470",
            "target": "BIOCHEM/GENETICS/MICROBIO 612"
        }
    },
    {
        "data": {
            "source": "CHEM 341",
            "target": "BIOCHEM 501"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 213"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "BIOCHEM/MM&I 575"
        }
    },
    {
        "data": {
            "description": "Independent laboratory research in preparation of a graduate thesis or dissertation under supervision of a faculty member.",
            "id": "BIOCHEM 990",
            "parent": "BIOCHEM",
            "title": "RESEARCH"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 507",
            "target": "BIOCHEM 508"
        }
    },
    {
        "data": {
            "description": "Introduction to the discipline of biochemistry, to the UW Biochemistry Department, to some of the research projects the faculty are pursuing, to the University, and to the career options open to an individual with a biochemistry background.",
            "id": "BIOCHEM 100",
            "parent": "BIOCHEM",
            "title": "BIOCHEMISTRY FRESHMAN SEMINAR"
        }
    },
    {
        "data": {
            "description": "Participants and outside speakers will discuss current research in computation and informatics in biology and medicine. This seminar is required of all CIBM program trainees.",
            "id": "BIOCHEM/BME/BMI/CBE/COMPSCI/GENETICS 915",
            "title": "COMPUTATION AND INFORMATICS IN BIOLOGY AND MEDICINE"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 102",
            "target": "MM&I 301"
        }
    },
    {
        "data": {
            "description": "Techniques of integration, improper integrals, first order ordinary differential equations, sequences and series, Taylor series, vector geometry in two and three dimensions.",
            "id": "MATH 222",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 2"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "GENETICS 467",
            "target": "GENETICS 466"
        }
    },
    {
        "data": {
            "description": "First order differential equations, introduction to multivariable calculus and constrained optimization, infinite sequences and series, methods of approximation, and a brief introduction to probability. Models and applications from business and the social sciences.",
            "id": "MATH 213",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 2"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 343"
        }
    },
    {
        "data": {
            "description": "Second semester of individual study for undergraduate students in an Honors program completing a thesis in the area of Biochemistry, as arranged with a Biochemistry faculty member.",
            "id": "BIOCHEM 682",
            "parent": "BIOCHEM",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Topics covered include protein structure and folding, protein dynamics, biological catalysis, membrane structure and assembly, nucleic acid structure and folding, and bioenergetics. Each topic includes discussion of the primary literature, hypothesis generation, experimental design, data, analysis and interpretation underlying the facts in the textbook.  Supports transition from undergraduate consumers of knowledge to graduate students and future independent scientists who will discover and add new knowledge.",
            "id": "BIOCHEM 719",
            "parent": "BIOCHEM",
            "title": "FROM ATOMS TO MOLECULES"
        }
    },
    {
        "data": {
            "description": "Explore the basic chemical properties of proteins, lipids, carbohydrates, and nucleic acids. Topics to be discussed include protein structure and function, the chemical logic of metabolism, and the mechanisms of DNA replication, DNA transcription, DNA repair, and gene expression. Understand principles and themes in biochemistry that relate to metabolic diseases, drug design, virus infection and vaccination, and gene therapy. Does not cover the foundational material necessary to succeed in additional biochemistry coursework, and is not likely to be acceptable for medical or veterinary school admission.",
            "id": "BIOCHEM 301",
            "parent": "BIOCHEM",
            "title": "SURVEY OF BIOCHEMISTRY"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "description": "Research work for Honors students under direct guidance of a Biochemistry faculty member.  Students are responsible for arranging the work and credits with the supervising instructor.",
            "id": "BIOCHEM 289",
            "parent": "BIOCHEM",
            "title": "HONORS INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Covers the basic concepts of genetics and genomics as applied to plants and their development, including discussions on breeding systems (modes of reproduction, sex determination, self incompatibility and crossing barriers), linkage analysis, genome structure and function (structure, function and evolution of nuclear and organellar chromosomes; haploidy and polyploidy; expression regulation and epigenetics), along with a description of current methodologies used in the analysis of these processes within the context of plant development. The objective is to instigate a broader knowledge and understanding of the principles and methodologies used in plant genetics and their applications in investigations of the molecular mechanisms that modulate plant development.",
            "id": "BIOCHEM/GENETICS 631",
            "title": "PLANT GENETICS AND DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Molecular basis of bacterial physiology and genetics with emphasis on molecular mechanisms; topics include nucleic acid-protein interactions, transcription, translation, replication, recombination, regulation of gene expression.",
            "id": "BIOCHEM/GENETICS/MICROBIO 612",
            "title": "PROKARYOTIC MOLECULAR BIOLOGY"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 319"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 501",
            "target": "BIOCHEM/NUTRSCI 560"
        }
    },
    {
        "data": {
            "id": "MM&I",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Recent literature relating to cellular aspects of the regulation of protein biogenesis including protein synthesis, folding, modification, degradation and trafficking, as well as function of molecular chaperones, will be presented and discussed.",
            "id": "BIOCHEM 916",
            "parent": "BIOCHEM",
            "title": "CELLULAR MECHANISMS OF PROTEIN BIOGENESIS AND TRAFFICKING"
        }
    },
    {
        "data": {
            "description": "Biochemistry of photosynthesis, respiration, cell walls, and other metabolic and biosynthetic processes in plants.",
            "id": "BIOCHEM/BOTANY 621",
            "title": "PLANT BIOCHEMISTRY"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "GENETICS 467"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 151"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "GENETICS 466"
        }
    },
    {
        "data": {
            "description": "Chemistry, nutrition, and metabolism of biological systems.",
            "id": "BIOCHEM 501",
            "parent": "BIOCHEM",
            "title": "INTRODUCTION TO BIOCHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Chemistry of biological materials, intermediary metabolism and protein structure.",
            "id": "BIOCHEM 507",
            "parent": "BIOCHEM",
            "title": "GENERAL BIOCHEMISTRY I"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 501",
            "target": "BIOCHEM/GENETICS/MDGENET 620"
        }
    },
    {
        "data": {
            "source": "MATH 375",
            "target": "MATH 415"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 507",
            "target": "BIOCHEM/NUTRSCI 510"
        }
    },
    {
        "data": {
            "description": "Introduction to modern biochemical laboratory techniques and current biochemical literature. Includes student seminar presentations based upon scientific literature that parallels experiments performed in the lab.",
            "id": "BIOCHEM 551",
            "parent": "BIOCHEM",
            "title": "BIOCHEMICAL METHODS"
        }
    },
    {
        "data": {
            "description": "Focuses on the basic molecular mechanisms that regulate DNA, RNA, and protein metabolism in eukaryotic organisms.",
            "id": "BIOCHEM/GENETICS/MDGENET 620",
            "title": "EUKARYOTIC MOLECULAR BIOLOGY"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "MICROBIO 303"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 501",
            "target": "BIOCHEM 301"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "MICROBIO 303"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "MICROBIO 303"
        }
    },
    {
        "data": {
            "description": "Protein structure and dynamics. Protein folding. Physical organic chemistry of enzymatic catalysis. Analysis of enzyme kinetics and receptor-ligand interactions. Enzymatic reaction mechanisms.",
            "id": "BIOCHEM 601",
            "parent": "BIOCHEM",
            "title": "PROTEIN AND ENZYME STRUCTURE AND FUNCTION"
        }
    },
    {
        "data": {
            "description": "Membrane proteins comprise over a fourth of proteins encoded in any given genome, providing many vital functions to all cells. For example, ion channels and pumps modulate the membrane potential and help conduct information via nerves and other long distance conducting tissue. Transporters mediate the uptake and secretion of molecules. Receptors, such as G protein coupled receptors and receptor protein kinases, transfer information about the environment to the inside of the cell. Membrane proteins also contribute to the shape of the cell, the structure of the membrane and a myriad of other functions.  Structure/function relationships for this critical class of proteins are discussed, addressing questions such as \"how do membrane proteins fold?\", \"how do certain important classes of membrane proteins work?\", \"what are the challenges in studying membrane proteins\" and \"what methods are available for studying their biophysical properties?\"",
            "id": "BIOCHEM 924",
            "parent": "BIOCHEM",
            "title": "MEMBRANE PROTEIN STRUCTURE AND FUNCTION"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    }
]