[
    {
        "data": {
            "description": "Develops mentoring, group facilitation, leadership, and interpersonal skills used in peer learning and leading mentored study groups. Focuses on the pedagogy, skills, and effective techniques used to facilitate learning in small groups. Discuss lower order to higher order cognitive levels using Blooms Taxonomy, and reciprocal mentor observations.",
            "id": "BIOCORE 401",
            "parent": "BIOCORE",
            "title": "PEER MENTORING"
        }
    },
    {
        "data": {
            "description": "Orientation to biology research on campus, work in a research team to investigate a novel research question, and do biology research on a choice of topics: from ecology and physiology to cell biology. Emphasis is on critical thinking required in designing and conducting experiments, analyzing and interpreting data, and communicating findings orally and in writing.",
            "id": "BIOCORE 181",
            "parent": "BIOCORE",
            "title": "BECOMING A SCIENTIST: DOING BIOLOGY RESEARCH"
        }
    },
    {
        "data": {
            "description": "Independent mentored study as arranged with a faculty member",
            "id": "BIOCORE 699",
            "parent": "BIOCORE",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "A capstone course to build on and integrate the knowledge and skills gained in previous Biocore coursework through readings and analysis of primary scientific literature. Work in small groups to analyze current and emerging topics through the lens of scientific research. Topics include signaling pathways, systems biology, genetic disease, and cancer.",
            "id": "BIOCORE 587",
            "parent": "BIOCORE",
            "title": "BIOLOGICAL INTERACTIONS"
        }
    },
    {
        "data": {
            "description": "Writing-intensive with opportunities to make observations and generate and test questions. Includes ecology field trips and research projects that focus on genetics and evolution.",
            "id": "BIOCORE 382",
            "parent": "BIOCORE",
            "title": "EVOLUTION, ECOLOGY, AND GENETICS LABORATORY"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "BIOCORE 383"
        }
    },
    {
        "data": {
            "source": "BIOCORE 383",
            "target": "BIOCORE 485"
        }
    },
    {
        "data": {
            "description": "Experience the process of science by collaborating on  independent experiments to investigate your questions about animal and plant physiology. Emphasis is on critical thinking required in designing and conducting experiments, analyzing and interpreting data, and communicating findings orally and in writing.",
            "id": "BIOCORE 486",
            "parent": "BIOCORE",
            "title": "PRINCIPLES OF PHYSIOLOGY LABORATORY"
        }
    },
    {
        "data": {
            "source": "BIOCORE 383",
            "target": "BIOCORE 384"
        }
    },
    {
        "data": {
            "source": "BIOCORE 382",
            "target": "BIOCORE 401"
        }
    },
    {
        "data": {
            "description": "Basic principles of ecology and interrelations between individuals, populations, communities, ecosystems and their environment; transmission genetics and introduction to population genetics; origin of life, evolutionary mechanisms, ancestral relationships among species, and the diversity of life.",
            "id": "BIOCORE 381",
            "parent": "BIOCORE",
            "title": "EVOLUTION, ECOLOGY, AND GENETICS"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "BIOCORE 382"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "BIOCORE 401"
        }
    },
    {
        "data": {
            "description": "Study the physiology of and consider how plants and animals interact with their environments to survive, obtain nutrients, exchange gases, and reproduce, also how the complex systems of neural and endocrine regulation in animals and hormonal and environmental regulation in plants allow cells and organs to communicate.",
            "id": "BIOCORE 485",
            "parent": "BIOCORE",
            "title": "PRINCIPLES OF PHYSIOLOGY"
        }
    },
    {
        "data": {
            "description": "Cellular and molecular basis of life. The main themes are the structure and function of cells and organelles, the flow of energy in cells, and the storage, expression, and regulation of genetic information.",
            "id": "BIOCORE 383",
            "parent": "BIOCORE",
            "title": "CELLULAR BIOLOGY"
        }
    },
    {
        "data": {
            "source": "BIOCORE 485",
            "target": "BIOCORE 486"
        }
    },
    {
        "data": {
            "id": "BIOCORE",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "BIOCORE 485",
            "target": "BIOCORE 587"
        }
    },
    {
        "data": {
            "description": "Writing-intensive with opportunities to generate and test questions utilizing concepts and procedures of cell biology. Includes research projects in subcellular fractionation, protein structure and enzyme catalysis, molecular genetics of C.elegans worms, and signal transduction in yeast.",
            "id": "BIOCORE 384",
            "parent": "BIOCORE",
            "title": "CELLULAR BIOLOGY LABORATORY"
        }
    }
]