[
    {
        "data": {
            "description": "Advanced directed study as arranged with a faculty member. Open only to students declared in Biology.",
            "id": "BIOLOGY 699",
            "parent": "BIOLOGY",
            "title": "DIRECTED STUDIES"
        }
    },
    {
        "data": {
            "description": "An internship under guidance of a faculty or instructional academic staff member and internship site supervisor. Students are responsible for arranging the work and credits with the faculty or instructional academic staff member and the internship site supervisor. Open only to students declared in Biology.",
            "id": "BIOLOGY 399",
            "parent": "BIOLOGY",
            "title": "INTERNSHIP/FIELD EXPERIENCE"
        }
    },
    {
        "data": {
            "description": "Basic principles of ecology and interrelations between individuals, populations, communities, ecosystems and their environment; transmission genetics and introduction to population genetics; origin of life, evolutionary mechanisms, ancestral relationships among species, and the diversity of life.",
            "id": "BIOCORE 381",
            "parent": "BIOCORE",
            "title": "EVOLUTION, ECOLOGY, AND GENETICS"
        }
    },
    {
        "data": {
            "description": "Evolutionary biology, emphasizing how modern scientists study evolution. Topics include: nature and mechanisms of microevolution, macroevolution, adaptation, speciation; systematics and taxonomy; quantitative genetics and measurement of natural selection; phylogenetic analyses of behavior, physiology, morphology, biochemistry; current controversies in evolution.",
            "id": "ANTHRO/BOTANY/ZOOLOGY 410",
            "title": "EVOLUTIONARY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Exposure to diverse topics in contemporary evolutionary biology and development of critical thinking and communication skills. Most weeks guest lecturers present their own primary research on a specialized topic in evolutionary biology. Seminars include perspectives from genetics, ecology, geoscience, zoology, botany, microbiology, systematics, molecular biology, and integrative research. Some weeks feature special topics and discussions on pedagogical, legal, outreach, or other issues in evolutionary biology. Includes thinking critically about methodology, experimental design and interpretation, and how conclusions are reached in evolutionary biology by reading primary and secondary literature, attending seminars, discussing topics with speakers and other students, and preparing a written report.  The 3-credit version of the course delves deeper into communication of evolutionary biology to researchers, undergraduates, K-12 students, and the general public.",
            "id": "BIOLOGY/GENETICS 522",
            "title": "COMMUNICATING EVOLUTIONARY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "General biological principles. Topics include: evolution, ecology, animal behavior, cell structure and function, genetics and molecular genetics and the physiology of a variety of organ systems emphasizing function in humans.",
            "id": "BIOLOGY/ZOOLOGY 101",
            "title": "ANIMAL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "General concepts of animal biology at an introductory level emphasizing the evolutionary relationships between animals. Learn about general body plans and strategies used to accomplish the basic tasks of staying alive in major animal groups using preserved and live animals. Study the diversity within each group of animals by integrating the body plans with the lifestyle and ecology of animals. Dissections of earthworm, freshwater mussel, squid, sea star, and rat aid the study of these general principles.",
            "id": "BIOLOGY/ZOOLOGY 102",
            "title": "ANIMAL BIOLOGY LABORATORY"
        }
    },
    {
        "data": {
            "description": "Individual study for seniors completing theses as arranged with a faculty member for an Honors program. Open only to students declared in Biology.",
            "id": "BIOLOGY 681",
            "parent": "BIOLOGY",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Individual study for seniors completing theses as arranged with a faculty member for an Honors program. Open only to students declared in Biology.",
            "id": "BIOLOGY 682",
            "parent": "BIOLOGY",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Individual study for seniors completing theses as arranged with a faculty member. Open only to students declared in Biology.",
            "id": "BIOLOGY 691",
            "parent": "BIOLOGY",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Individual study for seniors completing theses as arranged with a faculty member. Open only to students declared in Biology.",
            "id": "BIOLOGY 692",
            "parent": "BIOLOGY",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Introduction to the basic principles and concepts of the biology of plants. an integrative approach stressing evolutionary sequences and the relationship between structure and function at succeeding levels of organization: molecule, cell, organism, population, community. Correlated lectures, laboratories, and discussions.",
            "id": "BIOLOGY/BOTANY 130",
            "title": "GENERAL BOTANY"
        }
    },
    {
        "data": {
            "description": "Introductory directed study as arranged with a faculty member. Open only to students declared in Biology.",
            "id": "BIOLOGY 299",
            "parent": "BIOLOGY",
            "title": "DIRECTED STUDIES"
        }
    },
    {
        "data": {
            "description": "Introductory special topics on contemporary issues relevant to studying biology.",
            "id": "BIOLOGY 375",
            "parent": "BIOLOGY",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics and selected topics in Animal Physiology.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Topics include: selected topics in plant physiology, a survey of the five major kingdoms of organisms, speciation and evolutionary theory, and ecology at multiple levels of the biological hierarchy.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "id": "BIOCORE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "BIOLOGY",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ANTHRO/BOTANY/ZOOLOGY 410",
            "target": "BIOLOGY/GENETICS 522"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "ANTHRO/BOTANY/ZOOLOGY 410"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 152"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 101"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "target": "BIOLOGY/ZOOLOGY 102"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 151"
        }
    }
]