[
    {
        "data": {
            "description": "A preparation and introductory math course for students enrolled in the Summer Collegiate Experience program. Includes material from precalculus and calculus and related topics depending on students' results on the math placement exam.",
            "id": "MATH 118",
            "parent": "MATH",
            "title": "SUMMER COLLEGIATE EXPERIENCE MATHEMATICS COURSE"
        }
    },
    {
        "data": {
            "description": "Are you awed by the amazing biodiversity found in rainforests and coral reefs? See these ecosystems first hand and decide if a career in tropical biology or international conservation is for you. Focuses on the ecology of the world's most biodiverse ecosystems, and their global importance. Learn the physical, chemical, and biological processes that make rainforests and coral reefs function, and the history of human dependence upon these ecosystems. Understand why both of these ecosystems currently are threatened and what actions can and must be taken to protect them.",
            "id": "BOTANY 265",
            "parent": "BOTANY",
            "title": "RAINFORESTS AND CORAL REEFS"
        }
    },
    {
        "data": {
            "description": "Covers the graphs, properties and geometric significance of trigonometric functions of a real variable. Other topics include trigonometric equations and identities, application, trigonometric form of complex numbers, DeMoivre's theorem, and polar and parametric equations. The course also has a significant number of applications, especially related to other disciplines.",
            "id": "MATH 113",
            "parent": "MATH",
            "title": "TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "A broad survey of the diversity of plants in the context of their evolutionary history. Similarities and differences in structure and reproduction among extant bryophytes, lycopods, ferns, gymnosperms, and flowering plants are emphasized along with the study of fossils representing extinct plant lineages.",
            "id": "BOTANY 305",
            "parent": "BOTANY",
            "title": "PLANT MORPHOLOGY AND EVOLUTION"
        }
    },
    {
        "data": {
            "description": "Accelerated coverage of topics in general chemistry, including introduction to laboratory techniques. Topics include atomic and molecular structure, chemical equilibrium, acid-base chemistry, thermodynamics, kinetics, and electrochemistry.",
            "id": "CHEM 109",
            "parent": "CHEM",
            "title": "ADVANCED GENERAL CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Advanced directed research projects as arranged with a faculty member.",
            "id": "BOTANY 698",
            "parent": "BOTANY",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "An in-depth look at plant growth, development, respiration, photosynthesis, mineral nutrition, and water relations. Experimental approaches will be used to demonstrate principles described.",
            "id": "BOTANY 500",
            "parent": "BOTANY",
            "title": "PLANT PHYSIOLOGY"
        }
    },
    {
        "data": {
            "description": "An independent experience in collecting plant specimens, identifying the specimens to species, making labels, and mounting of some specimens.",
            "id": "BOTANY 403",
            "parent": "BOTANY",
            "title": "FIELD COLLECTIONS AND IDENTIFICATION"
        }
    },
    {
        "data": {
            "description": "Application of ecological principles and human dimensions to the conservation of biological diversity. Topics: biodiversity science; conservation planning; population ecology; habitat loss, species exploitation, invasive species, pollution; human attitudes and activities as they affect the biosphere; approaches to monitoring interventions.",
            "id": "BOTANY/ENVIRST/F&WECOL/ZOOLOGY 651",
            "title": "CONSERVATION BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Basic biology of microorganisms, including structure, function, physiology, genetics, ecology, diversity, and evolution.",
            "id": "MICROBIO 303",
            "parent": "MICROBIO",
            "title": "BIOLOGY OF MICROORGANISMS"
        }
    },
    {
        "data": {
            "description": "Basic principles of ecology and interrelations between individuals, populations, communities, ecosystems and their environment; transmission genetics and introduction to population genetics; origin of life, evolutionary mechanisms, ancestral relationships among species, and the diversity of life.",
            "id": "BIOCORE 381",
            "parent": "BIOCORE",
            "title": "EVOLUTION, ECOLOGY, AND GENETICS"
        }
    },
    {
        "data": {
            "description": "Biochemistry of photosynthesis, respiration, cell walls, and other metabolic and biosynthetic processes in plants.",
            "id": "BIOCHEM/BOTANY 621",
            "title": "PLANT BIOCHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Biogeography of plants. Relationship to climate and geology; paleobiogeography, historical biogeography and island biogeography; history and distribution of floras of North America and Wisconsin.",
            "id": "BOTANY 422",
            "parent": "BOTANY",
            "title": "PLANT GEOGRAPHY"
        }
    },
    {
        "data": {
            "description": "Chemistry, nutrition, and metabolism of biological systems.",
            "id": "BIOCHEM 501",
            "parent": "BIOCHEM",
            "title": "INTRODUCTION TO BIOCHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Core organic chemistry concepts of structure, reactivity, and synthesis with regards to the functional groups commonly found in commercial and biological substances. Covers a selection of topics fromCHEM 343and345.",
            "id": "CHEM 341",
            "parent": "CHEM",
            "title": "ELEMENTARY ORGANIC CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Descriptive statistics, probability concepts and distributions, random variables. Hypothesis tests and confidence intervals for one- and two-sample problems. Linear regression, model checking, and inference. Analysis of variance and basic ideas in experimental design. Utilizes the R programming language.",
            "id": "STAT 324",
            "parent": "STAT",
            "title": "INTRODUCTORY APPLIED STATISTICS FOR ENGINEERS"
        }
    },
    {
        "data": {
            "description": "Ecological determinants of plant community structure, dynamics, and diversity from an evolutionary perspective. Relations of vegetation types, physiognomy and phenology to plant adaptation and constraints. Gradient analysis, succession, nutrient cycling, plant-herbivore interactions, species richness.",
            "id": "BOTANY 801",
            "parent": "BOTANY",
            "title": "ADVANCED PLANT COMMUNITY ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Ecology of Wisconsin plant communities: floristic composition, community structure; relationship to history, climate, soil, and geology; response to human perturbation.",
            "id": "BOTANY/F&WECOL 455",
            "title": "THE VEGETATION OF WISCONSIN"
        }
    },
    {
        "data": {
            "description": "Ecology of individual organisms, populations, communities, ecosystems, landscapes, and the biosphere. The interaction of organisms with each other and their physical environment. These relationships are studied, often in quantitative terms, in both field and laboratory settings.",
            "id": "BOTANY/F&WECOL/ZOOLOGY 460",
            "title": "GENERAL ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Emphasizes spatial patterning (its development and importance for ecological processes) and often focuses on large regions. Learn concepts, methods, and applications of landscape ecology.",
            "id": "BOTANY/F&WECOL/ZOOLOGY 879",
            "title": "ADVANCED LANDSCAPE ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Essential and beneficial elements, solutions and soil as nutrient sources, rhizosphere chemistry, nutritional physiology, ion uptake and translocation, functions of elements, nutrient interactions, genetics of plant nutrition.",
            "id": "BOTANY/HORT/SOILSCI 626",
            "title": "MINERAL NUTRITION OF PLANTS"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "Evolutionary biology, emphasizing how modern scientists study evolution. Topics include: nature and mechanisms of microevolution, macroevolution, adaptation, speciation; systematics and taxonomy; quantitative genetics and measurement of natural selection; phylogenetic analyses of behavior, physiology, morphology, biochemistry; current controversies in evolution.",
            "id": "ANTHRO/BOTANY/ZOOLOGY 410",
            "title": "EVOLUTIONARY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Examination of the structure and function of microbial communities that live inside and on host organisms (plants, animals, and humans). Introduction to general concepts of the microbiome and microbiota, and their relationship to host nutrition, health, and disease.",
            "id": "ANSCI/BOTANY/MICROBIO 335",
            "title": "THE MICROBIOME OF PLANTS, ANIMALS, AND HUMANS"
        }
    },
    {
        "data": {
            "description": "Explore research questions that facilitate learning in the field of botany through guidance and mentorship in a research environment.",
            "id": "BOTANY 499",
            "parent": "BOTANY",
            "title": "INTERMEDIATE DIRECTED RESEARCH"
        }
    },
    {
        "data": {
            "description": "Explore research questions that facilitate learning in the field of botany through guidance and mentorship in a research environment.",
            "id": "BOTANY 699",
            "parent": "BOTANY",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Explore some of the most important themes and debates that have permeated evolutionary biology over the last 50 years. Read key papers related to each controversial topic, debate the pros and cons of competing viewpoints, and reflect on the relevance of the issue to contemporary evolutionary biology.",
            "id": "BOTANY/ENTOM/GENETICS/ZOOLOGY 820",
            "title": "FOUNDATIONS OF EVOLUTION"
        }
    },
    {
        "data": {
            "description": "Explores how physical and biological factors affect the distribution of terrestrial biomes, ecosystem types, and biodiversity, as well as the role of disturbance and recent human activities on differences in past and modern day species distributions.",
            "id": "BOTANY/GEOG 338",
            "title": "ENVIRONMENTAL BIOGEOGRAPHY"
        }
    },
    {
        "data": {
            "description": "Explores the interaction between society and plant-associated microbes. Topics include: the Irish potato famine, pesticides in current agriculture, role of economics and consumer preference in crop disease management and the release of genetically engineered organisms.",
            "id": "BOTANY/PLPATH 123",
            "title": "PLANTS, PARASITES, AND PEOPLE"
        }
    },
    {
        "data": {
            "description": "Exposure to  to the changing uses of Wisconsin landscapes: as the home of native peoples; as a source of fur, lead and timber; as part of the new nation of the United States; and as a modern, vibrant collection of communities focused on enterprises as diverse as agriculture and education. Asks what roles science has played in shaping the landscape and in current land use. Covers genetically modified crops, the endangered species act, water use, global change.",
            "id": "BOTANY 211",
            "parent": "BOTANY",
            "title": "UNDERSTANDING CHANGED LANDSCAPES: WISCONSIN"
        }
    },
    {
        "data": {
            "description": "Field experience in restoration as an adaptive process involving field experimentation; baseline data collection on restoration sites; design of experiments to advance restoration science; quantitative evaluation of restoration outcomes. Includes analysis and interpretation of data.",
            "id": "BOTANY/LANDARC 670",
            "title": "ADAPTIVE RESTORATION LAB"
        }
    },
    {
        "data": {
            "description": "Foundational ideas in the field of ecology. Discussion topics trace the development of ecology as a discipline, and the roots of modern ecological thought, as well as the research approaches in ecology.",
            "id": "BOTANY/ENTOM/F&WECOL/ZOOLOGY 821",
            "title": "FOUNDATIONS OF ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Fungal genetics, genomics, and physiology using plant pathogenic fungi and the genetic models Aspergillus nidulans and Neurospora crassa as model systems to explore the current knowledge of fungal genetics and plant/fungal interactions.",
            "id": "BOTANY/GENETICS/MM&I/PLPATH 655",
            "title": "BIOLOGY AND GENETICS OF FUNGI"
        }
    },
    {
        "data": {
            "description": "Gas exchange at the individual plant and community level, energy balance and water relations, nutrient cycling, biomechanical adaptations; growth analysis; adaptations to sun and shade, primary productivity models, physiological ecology of selected plant communities (arctic/alpine, boreal, chaparral, desert, tropical, aquatic).",
            "id": "BOTANY 802",
            "parent": "BOTANY",
            "title": "PHYSIOLOGICAL PLANT ECOLOGY"
        }
    },
    {
        "data": {
            "description": "General biological principles. Topics include: evolution, ecology, animal behavior, cell structure and function, genetics and molecular genetics and the physiology of a variety of organ systems emphasizing function in humans.",
            "id": "BIOLOGY/ZOOLOGY 101",
            "title": "ANIMAL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Growth, development, variability and dispersal of saprophytic, parasitic, and symbiotic fungi, with a consideration of their ecological and economic significance. Develop skills in microscopy with live fungal materials.",
            "id": "BOTANY/PLPATH 332",
            "title": "FUNGI"
        }
    },
    {
        "data": {
            "description": "Growth, development, variability and dispersal of saprophytic, parasitic, and symbiotic fungi, with a consideration of their ecological and economic significance.",
            "id": "BOTANY/PLPATH 333",
            "title": "BIOLOGY OF THE FUNGI"
        }
    },
    {
        "data": {
            "description": "How ecological principles can be used to address contemporary environmental issues such as water quality, invasive species, and population growth. Emphasis on midwestern issues, practical approaches, the role of history, and geographic context.",
            "id": "BOTANY/ZOOLOGY 450",
            "title": "MIDWESTERN ECOLOGICAL ISSUES: A CASE STUDY APPROACH"
        }
    },
    {
        "data": {
            "description": "Identification, ecological characteristics, ranges, adaptations to environment, and uses of evergreen and deciduous woody plants, with emphasis on species native to Wisconsin; lab and field work.",
            "id": "BOTANY/F&WECOL 402",
            "title": "DENDROLOGY: WOODY PLANT IDENTIFICATION AND ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Independent research in the area of Fungal Biology.",
            "id": "BOTANY 993",
            "parent": "BOTANY",
            "title": "RESEARCH: FUNGAL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Independent research in the area of Phycology.",
            "id": "BOTANY 990",
            "parent": "BOTANY",
            "title": "RESEARCH-PHYCOLOGY"
        }
    },
    {
        "data": {
            "description": "Independent research in the area of Plant Ecology.",
            "id": "BOTANY 995",
            "parent": "BOTANY",
            "title": "RESEARCH-PLANT ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Independent research in the area of Plant Physiology.",
            "id": "BOTANY 996",
            "parent": "BOTANY",
            "title": "RESEARCH-PLANT PHYSIOLOGY"
        }
    },
    {
        "data": {
            "description": "Independent research in the area of Plant Systematics.",
            "id": "BOTANY 994",
            "parent": "BOTANY",
            "title": "RESEARCH-PLANT SYSTEMATICS"
        }
    },
    {
        "data": {
            "description": "Individual research for students completing theses as arranged with a faculty member.",
            "id": "BOTANY 691",
            "parent": "BOTANY",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Individual research for students completing theses as arranged with a faculty member.",
            "id": "BOTANY 692",
            "parent": "BOTANY",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Individual research for students completing theses for honors in the Botany major as arranged with a faculty member.",
            "id": "BOTANY 681",
            "parent": "BOTANY",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Individual research for students completing theses for honors in the Botany major as arranged with a faculty member.",
            "id": "BOTANY 682",
            "parent": "BOTANY",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Introduces new graduate students to the diversity of ecologists across the UW-Madison campus. Includes discussions of key topics in professional development, research presentations by faculty members, and discussions of assigned papers with senior graduate students.",
            "id": "AGRONOMY/ATMOCN/BOTANY/ENTOM/ENVIRST/F&WECOL/GEOG/ZOOLOGY 953",
            "title": "INTRODUCTION TO ECOLOGY RESEARCH AT UW-MADISON"
        }
    },
    {
        "data": {
            "description": "Introduces students to research questions and facilitates learning in the field of botany by providing guidance and mentorship in a research environment.",
            "id": "BOTANY 299",
            "parent": "BOTANY",
            "title": "DIRECTED STUDY IN BOTANY"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Introduction to ecology, evolution, systematics, taxonomy, physiology, biochemistry, cell biology, and molecular biology of freshwater, terrestrial and marine algae. Emphasis on techniques for identification, culture, analysis of growth and reproduction, and community composition assessment.",
            "id": "BOTANY 330",
            "parent": "BOTANY",
            "title": "ALGAE"
        }
    },
    {
        "data": {
            "description": "Introduction to modern statistical practice in the life sciences, using the R programming language. Topics include: exploratory data analysis, probability and random variables; one-sample testing and confidence intervals, role of assumptions, sample size determination, two-sample inference; basic ideas in experimental design, analysis of variance, linear regression, goodness-of fit; biological applications.",
            "id": "STAT 371",
            "parent": "STAT",
            "title": "INTRODUCTORY APPLIED STATISTICS FOR THE LIFE SCIENCES"
        }
    },
    {
        "data": {
            "description": "Introduction to the basic principles and concepts of the biology of plants. an integrative approach stressing evolutionary sequences and the relationship between structure and function at succeeding levels of organization: molecule, cell, organism, population, community. Correlated lectures, laboratories, and discussions.",
            "id": "BIOLOGY/BOTANY 130",
            "title": "GENERAL BOTANY"
        }
    },
    {
        "data": {
            "description": "Major emphasis on the roles of plants and microbes in past and present global ecology, and the past and present uses of plants and microbes by humans, including emerging applications of biotechnology.",
            "id": "BOTANY 100",
            "parent": "BOTANY",
            "title": "SURVEY OF BOTANY"
        }
    },
    {
        "data": {
            "description": "Mentored reading and research for dissertators.",
            "id": "BOTANY 999",
            "parent": "BOTANY",
            "title": "INDEPENDENT WORK"
        }
    },
    {
        "data": {
            "description": "Molecular and ecological aspects of the interactions between plants and microorganisms. Explores many of the themes, from genetic to integrative, of modern biology, and illustrates how study of plant-microbe interactions contributes to understanding of fundamental plant science.",
            "id": "BOTANY/ENTOM/PLPATH 505",
            "title": "PLANT-MICROBE INTERACTIONS: MOLECULAR AND ECOLOGICAL ASPECTS"
        }
    },
    {
        "data": {
            "description": "Molecular mechanisms whereby endogenous and environmental regulatory factors control development; emphasis on stimulus perception and primary events in the signal chain leading to modulated gene expression and cellular development.",
            "id": "BIOCHEM/BOTANY/GENETICS 840",
            "title": "REGULATORY MECHANISMS IN PLANT DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Multiple ways in which arthropods exploit plants, plant traits that deter or augment insects, environmental mediation of these interactions, effects on population dynamics, community ecology and co-evolution, and implications to natural resource management, environmental quality, and sustainable development.",
            "id": "BOTANY/ENTOM/ZOOLOGY 473",
            "title": "PLANT-INSECT INTERACTIONS"
        }
    },
    {
        "data": {
            "description": "Plant parts and demonstrations of their utility to humans, origins of domesticated plants, modifications of plants by humans, ecosystem services owed to plants, and reasons to sustain plant diversity.",
            "id": "BOTANY 240",
            "parent": "BOTANY",
            "title": "PLANTS AND HUMANS"
        }
    },
    {
        "data": {
            "description": "Plant science applied to the growth, production, management, distribution and utilization of field crops.",
            "id": "AGRONOMY 100",
            "parent": "AGRONOMY",
            "title": "PRINCIPLES AND PRACTICES IN CROP PRODUCTION"
        }
    },
    {
        "data": {
            "description": "Plant structure and development of seed plants, primarily of flowering plants. Emphasis is placed on structure in relation to function and on the plant body as a structural and functional entity.",
            "id": "BOTANY 300",
            "parent": "BOTANY",
            "title": "PLANT ANATOMY"
        }
    },
    {
        "data": {
            "description": "Plant systematics: the integration of taxonomy (identification, nomenclature, classification emphasizing flowering plants), evolution (speciation, reproductive biology, adaptation, convergence, biogeography), and phylogenetics. Emphasis on representative families and genera of flowering plants in Wisconsin, use of keys, manuals, and iNaturalist, plant collection.",
            "id": "BOTANY 400",
            "parent": "BOTANY",
            "title": "PLANT SYSTEMATICS"
        }
    },
    {
        "data": {
            "description": "Presents an overview of the techniques, biology and underlying theory of plant tissue culture, genetic engineering and genome editing. Overviews of research and commercial applications, and issues/challenges in the area of plant biotechnology are also covered.",
            "id": "AGRONOMY/BOTANY/HORT 340",
            "title": "PLANT CELL CULTURE AND GENETIC ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Principles and application of chemical equilibrium, coordination chemistry, oxidation-reduction and electrochemistry, kinetics, nuclear chemistry, introduction to organic chemistry, and chemistry laboratory skills.",
            "id": "CHEM 104",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Principles of molecular structure and bonding applied to predict and explain the reactivity of alkanes, alkenes, alkynes, alkyl halides, alcohols, and thiols. Emphasis placed on rationalizing the stereochemical and regiochemical outcome of chemical processes.",
            "id": "CHEM 343",
            "parent": "CHEM",
            "title": "ORGANIC CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Principles of molecular structure and bonding applied to predict and explain the reactivity of aromatic systems, benzylic and allylic systems, aryl and vinyl halides, and carbonyl-containing compounds (e.g., ketones, carboxylic acids, esters, acid chlorides, amides). Emphasis placed on rationalizing the stereochemical and regiochemical outcome of chemical processes as well as arguing reaction outcomes from spectroscopic evidence.",
            "id": "CHEM 345",
            "parent": "CHEM",
            "title": "ORGANIC CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Provides an overview of the geography, ecology, and economic importance of the world's forest biomes. Learn how climate influences vegetation and, in-turn, how forests impact global climate. Meet scientists working to understand the astounding biodiversity and ecological complexity of forest ecosystems, and how these ecosystems support human life. Discuss the threats to forest ecosystems around the world, and hear from the people trying to protect them. Emphasizes the forest resources and services upon which humans depend, and how we can maintain these resources into the future. Analyze the idea of \"sustainability\" when it comes to forest management, hear alternative viewpoints about what this word means, and discuss potential trade-offs and conflicts. Look at the many real-world programs in place at the global, national, and local level to sustainably manage forests.",
            "id": "BOTANY/F&WECOL 250",
            "title": "FORESTS AND HUMANS: FROM THE MIDWEST TO MADAGASCAR"
        }
    },
    {
        "data": {
            "description": "Review of recent journal publications in the area of Plant Taxonomy.",
            "id": "BOTANY 941",
            "parent": "BOTANY",
            "title": "PLANT TAXONOMY JOURNAL REVIEW"
        }
    },
    {
        "data": {
            "description": "Scope and objectives of ecosystem ecology; roles of theory, long-term studies, comparative studies, and large-scale experiments; scaling problems; ecosystem services and ecological economics; adaptive ecosystem assessment and management.",
            "id": "BOTANY/ZOOLOGY 725",
            "title": "ECOSYSTEM CONCEPTS"
        }
    },
    {
        "data": {
            "description": "Sections in various fields of zoological research.",
            "id": "ATMOCN/BOTANY/CIVENGR/ENVIRST/GEOSCI/ZOOLOGY 911",
            "title": "LIMNOLOGY AND MARINE SCIENCE SEMINAR"
        }
    },
    {
        "data": {
            "description": "Stoichiometry and the mole concept, the behavior of gases, liquids and solids, thermochemistry, electronic structure of atoms and chemical bonding, descriptive chemistry of selected elements and compounds, intermolecular forces, and chemistry laboratory skills.",
            "id": "CHEM 103",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Structure/function relationships at the cellular level. Topics include the biogenesis of organelles, vesicle traffic, ion transport and signalling processes, and organization of the cytoskeleton and cell wall.",
            "id": "BOTANY 860",
            "parent": "BOTANY",
            "title": "PLANT CELL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Study of the interactions between human cultures and plants. Topics include: traditional resource management and agriculture; crop domestication, evolution, and conservation; archaeobotany; indigenous knowledge; folk taxonomy; plants in symbolism and religion; dietary patterns; phytochemistry; global movement of plants and peoples.",
            "id": "AMERIND/ANTHRO/BOTANY 474",
            "title": "ETHNOBOTANY"
        }
    },
    {
        "data": {
            "description": "Study the importance of past events for current ecosystems. Emphasizes concepts and applications.",
            "id": "BOTANY/F&WECOL/ZOOLOGY 672",
            "title": "HISTORICAL ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Taxonomic survey of the vascular plants of Wisconsin. Emphasis on in forest identification.",
            "id": "BOTANY 401",
            "parent": "BOTANY",
            "title": "VASCULAR FLORA OF WISCONSIN"
        }
    },
    {
        "data": {
            "description": "The relationships of organisms and the environment. Population dynamics and community organization, human-environment relationships, action programs.",
            "id": "BOTANY/ENVIRST/ZOOLOGY 260",
            "title": "INTRODUCTORY ECOLOGY"
        }
    },
    {
        "data": {
            "description": "The two semester sequenceMATH 112-MATH 113covers similar material asMATH 114, but in a slower pace. Not recommended for students with less than an AB inMATH 96.",
            "id": "MATH 114",
            "parent": "MATH",
            "title": "ALGEBRA AND TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "Theory and practice of phylogenetic inference from DNA sequence data.",
            "id": "BOTANY/PLPATH 563",
            "title": "PHYLOGENETIC ANALYSIS OF MOLECULAR DATA"
        }
    },
    {
        "data": {
            "description": "Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Part of a 2-semester sequence withMATH 217; these two courses together are equivalent toMATH 114and221.",
            "id": "MATH 171",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY I"
        }
    },
    {
        "data": {
            "description": "Topics in earth system science. Emphasis on the coupling between atmospheric, oceanic and land surface systems, involving physical geochemical and biological processes, and including interactions with human systems.",
            "id": "ATMOCN/BOTANY/ENVIRST/F&WECOL/GEOG/GEOSCI/ZOOLOGY 980",
            "title": "EARTH SYSTEM SCIENCE SEMINAR"
        }
    },
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics and selected topics in Animal Physiology.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Topics include: selected topics in plant physiology, a survey of the five major kingdoms of organisms, speciation and evolutionary theory, and ecology at multiple levels of the biological hierarchy.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Topics of interest focusing on specific subjects or groups of organisms of plants, algae, or fungi.",
            "id": "BOTANY 575",
            "parent": "BOTANY",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "Topics of interest in the area of Plant Physiology.",
            "id": "BOTANY 858",
            "parent": "BOTANY",
            "title": "SPECIAL TOPICS IN PLANT PHYSIOLOGY"
        }
    },
    {
        "data": {
            "description": "Topics, recent advances  literature in the area of Mycology.",
            "id": "BOTANY/PLPATH 930",
            "title": "SEMINAR-MYCOLOGY"
        }
    },
    {
        "data": {
            "description": "Topics, recent advances  literature in the area of Plant Ecology.",
            "id": "BOTANY 950",
            "parent": "BOTANY",
            "title": "SEMINAR-PLANT ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Topics, recent advances  literature in the area of Plant Physiology.",
            "id": "BOTANY 960",
            "parent": "BOTANY",
            "title": "SEMINAR-PLANT PHYSIOLOGY"
        }
    },
    {
        "data": {
            "description": "Topics, recent advances  literature in the area of Plant Systematics and Evolution.",
            "id": "BOTANY 940",
            "parent": "BOTANY",
            "title": "SEMINAR IN PLANT SYSTEMATICS AND EVOLUTION"
        }
    },
    {
        "data": {
            "description": "Understand factors driving global, continental, regional, and local distribution of grasslands. Discuss how management affects provision of grassland ecosystem goods and services. Compare and contrast plant community and ecosystem dynamics in native prairie and intensively managed pastures.",
            "id": "AGRONOMY/BOTANY/SOILSCI 370",
            "title": "GRASSLAND ECOLOGY"
        }
    },
    {
        "data": {
            "id": "AGRONOMY",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "BIOCHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "BIOCORE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "BOTANY",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MICROBIO",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "STAT",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "AGRONOMY 100",
            "target": "AGRONOMY/BOTANY/SOILSCI 370"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 501",
            "target": "BIOCHEM/BOTANY 621"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "ANTHRO/BOTANY/ZOOLOGY 410"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "AGRONOMY/BOTANY/HORT 340"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "BOTANY 300"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "BOTANY 305"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "BOTANY 330"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "BOTANY 400"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "BOTANY 401"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "BOTANY 422"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "BOTANY 500"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "BOTANY/F&WECOL 455"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "BOTANY/PLPATH 332"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "BOTANY/PLPATH 333"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "BOTANY/PLPATH 563"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 152"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 101"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "target": "BOTANY 575"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "target": "BOTANY/F&WECOL/ZOOLOGY 460"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "target": "BOTANY/ZOOLOGY 450"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 151"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "MICROBIO 303"
        }
    },
    {
        "data": {
            "source": "BOTANY 500",
            "target": "BOTANY/HORT/SOILSCI 626"
        }
    },
    {
        "data": {
            "source": "BOTANY/ENTOM/PLPATH 505",
            "target": "BOTANY/ENTOM/ZOOLOGY 473"
        }
    },
    {
        "data": {
            "source": "BOTANY/F&WECOL/ZOOLOGY 460",
            "target": "BOTANY/ENVIRST/F&WECOL/ZOOLOGY 651"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "AGRONOMY/BOTANY/HORT 340"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 109"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 341"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 343"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "MICROBIO 303"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 341",
            "target": "BIOCHEM 501"
        }
    },
    {
        "data": {
            "source": "CHEM 343",
            "target": "CHEM 345"
        }
    },
    {
        "data": {
            "source": "CHEM 345",
            "target": "CHEM 341"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 113"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 113",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 114",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 114"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "STAT 324"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "CHEM 109"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 114"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "MICROBIO 303",
            "target": "ANSCI/BOTANY/MICROBIO 335"
        }
    },
    {
        "data": {
            "source": "MICROBIO 303",
            "target": "BOTANY/ENTOM/PLPATH 505"
        }
    },
    {
        "data": {
            "source": "STAT 324",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "source": "STAT 371",
            "target": "BOTANY/PLPATH 563"
        }
    },
    {
        "data": {
            "source": "STAT 371",
            "target": "STAT 324"
        }
    }
]