[
    {
        "data": {
            "description": "Covers the graphs, properties and geometric significance of trigonometric functions of a real variable. Other topics include trigonometric equations and identities, application, trigonometric form of complex numbers, DeMoivre's theorem, and polar and parametric equations. The course also has a significant number of applications, especially related to other disciplines.",
            "id": "MATH 113",
            "parent": "MATH",
            "title": "TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "A quantitative treatment of macroscopic phenomena including thermodynamics, chemical equilibria, solution behavior, electrochemistry, and chemical kinetics.",
            "id": "CHEM 116",
            "parent": "CHEM",
            "title": "CHEMICAL PRINCIPLES II"
        }
    },
    {
        "data": {
            "description": "Accelerated coverage of topics in general chemistry, including introduction to laboratory techniques. Topics include atomic and molecular structure, chemical equilibrium, acid-base chemistry, thermodynamics, kinetics, and electrochemistry.",
            "id": "CHEM 109",
            "parent": "CHEM",
            "title": "ADVANCED GENERAL CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Agricultural and life scientists need to creatively apply physical, chemical, and biological principles to address technical, business, and environmental challenges. Many of these challenges involve numerical analyses, including the interpretation of large datasets. The fundamentals of computer coding using numerical software will be taught, using real-world data science challenges from the agricultural and life sciences.",
            "id": "BSE 380",
            "parent": "BSE",
            "title": "INTRODUCTORY DATA SCIENCE FOR THE AGRICULTURAL AND LIFE SCIENCES"
        }
    },
    {
        "data": {
            "description": "An internship under the guidance of a faculty or instructional academic staff member in BSE and internship site supervisor. Students are responsible for arranging the work and credits with the faculty or instructional academic staff member and the internship site supervisor.",
            "id": "BSE 399",
            "parent": "BSE",
            "title": "COORDINATIVE INTERNSHIP/COOPERATIVE EDUCATION"
        }
    },
    {
        "data": {
            "description": "An introduction to land information management through the principles of geospatial technologies and methods for analysis and interpretation of geospatial data. Includes both the basic land surveying technology and advanced remote observation of land resources by airborne and space-based sensors.",
            "id": "BSE 301",
            "parent": "BSE",
            "title": "LAND INFORMATION MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "An introduction to linear algebra and differential equations with emphasis on the relationship between the theory of linear algebra and analytical and numerical techniques for solving differential equations. Linear algebra topics include linear systems, matrices and their algebra, vector spaces and linear transformations, eigenvalues and eigenvectors. Topics from differential equations include first order ODE, homogeneous and nonhomogeneous linear systems, and numerical methods.",
            "id": "MATH 320",
            "parent": "MATH",
            "title": "LINEAR ALGEBRA AND DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "description": "Application of engineering principles to small, ungauged watershed analysis. Application of hydrologic and sedimentologic principles to upland watersheds for run-off and sediment control.",
            "id": "BSE 571",
            "parent": "BSE",
            "title": "SMALL WATERSHED ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Applications of basic engineering principles such as mass and energy balances, psychrometric heat and mass transfer and fluid flow to problems encountered in agricultural and biological systems including grain conditioning, fruit and vegetable storage, food processing, animal housing, and environmental control.",
            "id": "BSE 249",
            "parent": "BSE",
            "title": "ENGINEERING PRINCIPLES FOR BIOLOGICAL SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for engineering students. Mechanics: kinematics, statics, dynamics; energy and momentum.",
            "id": "PHYSICS 201",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Concepts, processes, status quo and future direction of biorefining for production of energy (fuels), chemicals and materials from biomass, with emphases on chemical, biological and engineering aspects of the biorefining.",
            "id": "BSE 460",
            "parent": "BSE",
            "title": "BIOREFINING: ENERGY AND PRODUCTS FROM RENEWABLE RESOURCES"
        }
    },
    {
        "data": {
            "description": "Continuation ofMATH 171. Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Completion ofMATH 217implies completion ofMATH 221and114.",
            "id": "MATH 217",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY II"
        }
    },
    {
        "data": {
            "description": "Core organic chemistry concepts of structure, reactivity, and synthesis with regards to the functional groups commonly found in commercial and biological substances. Covers a selection of topics fromCHEM 343and345.",
            "id": "CHEM 341",
            "parent": "CHEM",
            "title": "ELEMENTARY ORGANIC CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Develop engineering career and life skills in time management, housing selection, financial management, the job search process, professional networking, branding and social media presence, professional development and professional society membership, leadership, professional ethics, and registration/licensure. Understand future trends in digital technology, climate change, diversity, and sustainability and how they affect career opportunities in the engineering field.",
            "id": "BSE 308",
            "parent": "BSE",
            "title": "CAREER MANAGEMENT FOR ENGINEERS"
        }
    },
    {
        "data": {
            "description": "Engineering and management applications of soil-plant-water relationships applied to water management systems and efficient water use.",
            "id": "BSE 473",
            "parent": "BSE",
            "title": "WATER MANAGEMENT SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Engineering design principles of heavy-duty vehicles intended for off-road use: fuels, engine cycles, engine principles and construction, clutches, mechanical and hydrostatic transmissions, final drives, traction systems, traction modeling, dynamic behavior, suspension systems and braking.",
            "id": "BSE/ME 476",
            "title": "ENGINEERING PRINCIPLES OF OFF-ROAD VEHICLES"
        }
    },
    {
        "data": {
            "description": "Engineering design principles of machines for the production, processing and handling of crops for food, fuel, bio-mass and fiber. Environmental and biological factors that influence machine design and operation. Economic and capacity analysis of machines and systems.",
            "id": "BSE/ME 475",
            "title": "ENGINEERING PRINCIPLES OF AGRICULTURAL MACHINERY"
        }
    },
    {
        "data": {
            "description": "Engineering principles of design and analysis of fluid power systems and fluid power components.  Topics include hydraulic fluid properties, fluid flow and, positive displacement pumps, valves for pressure, flow, and directional control, linear and rotary actuators, accumulators, pressure compensation, load sensing, energy management and system efficiency.",
            "id": "BSE/ME 474",
            "title": "FLUID POWER"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "Evaluation techniques for research, development  engineering projects. Covers the time value of money and other cash-flow concepts, capital budgeting, economic practices and techniques used to evaluate and optimize decisions, and research  development project portfolio management techniques.",
            "id": "BSE 310",
            "parent": "BSE",
            "title": "PROJECT ECONOMICS & DECISION ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Explores a detailed atomic and molecular view of matter and its interactions, with a specific focus on quantum theory, molecular structure, and chemical bonding. Application required for enrollment.",
            "id": "CHEM 115",
            "parent": "CHEM",
            "title": "CHEMICAL PRINCIPLES I"
        }
    },
    {
        "data": {
            "description": "First and second laws of thermodynamics; thermodynamic properties of gases, vapors, and gas-vapor mixtures; energy-systems analysis including power cycles, refrigeration cycles and air-conditioning processes. Introduction to thermodynamics of reacting mixtures.",
            "id": "ME 361",
            "parent": "ME",
            "title": "THERMODYNAMICS"
        }
    },
    {
        "data": {
            "description": "Fluid statics and dynamics, dimensional analysis, flow of an ideal fluid, flow of a real fluid--including laminar and turbulent flow, applications to engineering problems.",
            "id": "CIVENGR 310",
            "parent": "CIVENGR",
            "title": "FLUID MECHANICS"
        }
    },
    {
        "data": {
            "description": "Full-time off-campus work experience which combines classroom theory with practical knowledge of operations to provide a background upon which to base a professional career.",
            "id": "BSE 1",
            "parent": "BSE",
            "title": "COOPERATIVE EDUCATION PROGRAM"
        }
    },
    {
        "data": {
            "description": "Hands-on teaching experience through working with a course instructor to improve pedagogical understanding. Guidance will be provided on such aspects as course planning, delivery, student supervision, and evaluation, etc.",
            "id": "BSE 799",
            "parent": "BSE",
            "title": "PRACTICUM IN AGRICULTURAL ENGINEERING TEACHING"
        }
    },
    {
        "data": {
            "description": "Hydrologic, biologic and engineering applications in the design and management of sediment and bio-nutrient control systems.",
            "id": "BSE 472",
            "parent": "BSE",
            "title": "SEDIMENT AND BIO-NUTRIENT ENGINEERING AND MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "In-depth study of a research or design and development problem under the supervision of a faculty member.",
            "id": "BSE 999",
            "parent": "BSE",
            "title": "SPECIAL PROBLEMS"
        }
    },
    {
        "data": {
            "description": "Independent laboratory research in preparation of a graduate thesis under supervision of a faculty member",
            "id": "BSE 990",
            "parent": "BSE",
            "title": "RESEARCH"
        }
    },
    {
        "data": {
            "description": "Individual advanced work in an area of Biological Systems Engineering under the direct guidance of a faculty member.",
            "id": "BSE 699",
            "parent": "BSE",
            "title": "SPECIAL PROBLEMS"
        }
    },
    {
        "data": {
            "description": "Individual or team work on a biological systems engineering design project: problem identification, information retrieval, specification writing, development and analysis of alternative solutions, selection methodology.",
            "id": "BSE 509",
            "parent": "BSE",
            "title": "BIOLOGICAL SYSTEMS ENGINEERING DESIGN PRACTICUM II"
        }
    },
    {
        "data": {
            "description": "Individual study for undergraduate students completing a thesis in the area of Biological Systems Engineering, as arranged with a faculty member.",
            "id": "BSE 691",
            "parent": "BSE",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Individual study for undergraduate students in an Honors program completing a thesis in the area of Biological Systems Engineering, as arranged with a faculty member.",
            "id": "BSE 681",
            "parent": "BSE",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Introduces key concepts of sensor technology used for livestock and companion animal monitoring and veterinary medicine. Describes applications of Artificial Intelligence (AI) systems for livestock animals and veterinary medicine, including animal monitoring, computer-aided diagnosis, and optimized farm management decisions.",
            "id": "ANSCI/BSE 344",
            "title": "DIGITAL TECHNOLOGIES FOR ANIMAL MONITORING"
        }
    },
    {
        "data": {
            "description": "Introduction to calculus of functions of several variables; calculus on parameterized curves, derivatives of functions of several variables, multiple integrals, vector calculus.",
            "id": "MATH 234",
            "parent": "MATH",
            "title": "CALCULUS--FUNCTIONS OF SEVERAL VARIABLES"
        }
    },
    {
        "data": {
            "description": "Introduction to computer aided design (CAD) concepts and techniques, including two- and three-dimensional drawing presentation, methods of graphic communication and design synthesis. Specific topics include parametric solid modeling, part design, survey data and surface construction, orthographic drawings, dimensioning rules and drawing standards, assemblies, and animation.",
            "id": "BSE 270",
            "parent": "BSE",
            "title": "INTRODUCTION TO COMPUTER AIDED DESIGN"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Introduction to heat and mass transfer fundamentals, including transport mechanisms of conduction, convection, radiation, diffusion and evaporation. Development of governing equations and boundary conditions with application to living systems, controlled environments, water systems, and food processing. Introduction to, and application of, finite-difference and finitevolume methods, including computational fluid dynamics (CFD).",
            "id": "BSE 464",
            "parent": "BSE",
            "title": "HEAT AND MASS TRANSFER IN BIOLOGICAL SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Kinematics, force-mass-acceleration relations, work and energy, impulse and momentum, moments of inertia and mass.",
            "id": "EMA 202",
            "parent": "EMA",
            "title": "DYNAMICS"
        }
    },
    {
        "data": {
            "description": "Learn about the state-of-the-art in renewable energy applications including biomass for heat, electric power and liquid fuels as well as geo-energy sources such as wind, solar, and hydro power. Practice engineering calculations of power and energy availability of renewable energy sources and learn about requirements for integrating renewable energy sources into production, distribution and end-use systems.",
            "id": "BSE/ENVIRST 367",
            "title": "RENEWABLE ENERGY SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Mass, momentum, and energy transport; calculation of transport coefficients; solution to problems in viscous flow, heat conduction, and diffusion; dimensional analysis; mass, momentum, and heat transfer coefficients; over-all balances; elementary applications.",
            "id": "CBE 320",
            "parent": "CBE",
            "title": "INTRODUCTORY TRANSPORT PHENOMENA"
        }
    },
    {
        "data": {
            "description": "On-site treatment and dispersal of waste water from homes, commercial sources and small communities. Sources, pretreatment units, nutrient removal units, constructed wetlands, surface and soil dispersal systems, recycle and reuse systems, regulations, alternative collection systems.",
            "id": "BSE/CIVENGR/SOILSCI 372",
            "title": "ON-SITE WASTE WATER TREATMENT AND DISPERSAL"
        }
    },
    {
        "data": {
            "description": "Overview of the engineering design process including problem identification, information retrieval, specification writing, development and analysis of alternative solutions, selection methodology, product safety, standardization, scheduling and cost estimating. Develop design project proposals for real-world design problems.",
            "id": "BSE 508",
            "parent": "BSE",
            "title": "BIOLOGICAL SYSTEMS ENGINEERING DESIGN PRACTICUM I"
        }
    },
    {
        "data": {
            "description": "Presentation, evaluation, and discussion of Biological Systems Engineering graduate student thesis and non-thesis research.",
            "id": "BSE 901",
            "parent": "BSE",
            "title": "GRADUATE RESEARCH SEMINAR"
        }
    },
    {
        "data": {
            "description": "Principles and application of chemical equilibrium, coordination chemistry, oxidation-reduction and electrochemistry, kinetics, nuclear chemistry, introduction to organic chemistry, and chemistry laboratory skills.",
            "id": "CHEM 104",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Principles of how energy and materials are utilized in Cells, organisms and ecosystems.  Mass transfer, heat and energy balances applied to cell metabolism, plants, and ecosystems.  Quantification of biological processes to allow manipulation for human benefit.",
            "id": "BSE 349",
            "parent": "BSE",
            "title": "QUANTITATIVE TECHNIQUES FOR BIOLOGICAL SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Principles of instrumentation and measurement systems, analysis of experimental data, electronic components, instrumentation for measuring various parameters of biological systems (e.g., temperature, force, flow).",
            "id": "BSE 365",
            "parent": "BSE",
            "title": "MEASUREMENTS AND INSTRUMENTATION FOR BIOLOGICAL SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Principles of mechanics, fluid dynamics, and heat and mass transfer as applied to food and bioprocessing operations. Specific focus on unit operations and equipment associated with the products key to Wisconsin industries including pulp and paper, dairy products, ethanol, forage, and grain.",
            "id": "BSE 461",
            "parent": "BSE",
            "title": "FOOD AND BIOPROCESSING OPERATIONS"
        }
    },
    {
        "data": {
            "description": "Principles of mechanics, force systems, equilibrium, structures, distributed forces, moments of inertia of areas, and friction.",
            "id": "EMA 201",
            "parent": "EMA",
            "title": "STATICS"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Provides an area equivalency for courses taken on Madison Study Abroad Programs that do not equate to existing UW courses. Enrollment in a UW-Madison resident study abroad program",
            "id": "BSE 400",
            "parent": "BSE",
            "title": "STUDY ABROAD IN BIOLOGICAL SYSTEMS ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Provides an overview of research-related activities and resources available to graduate students in the department, college, and on campus. Includes library resources, statistical consulting, professional development, research proposal development, thesis writing, technical presentation, etc.",
            "id": "BSE 900",
            "parent": "BSE",
            "title": "SEMINAR"
        }
    },
    {
        "data": {
            "description": "Provides an understanding of how cutting-edge Artificial Intelligence (AI) technologies revolutionize and optimize various aspects of the agricultural sector.  Covers topics related to advanced sensors for data acquisition, data processing and visualization, and machine learning models to inform agricultural decision making. Introduces both theoretical concepts and practical insights into real-world AI implementation in agriculture.",
            "id": "BSE 405",
            "parent": "BSE",
            "title": "ARTIFICIAL INTELLIGENCE IN AGRICULTURE"
        }
    },
    {
        "data": {
            "description": "Rectilinear and curvilinear motion of a particle; force, mass, acceleration; work, potential, and kinetic energy; impulse and momentum; kinematics of rigid bodies; moving coordinate systems with relative motion; general planar rigid body kinematics and kinetics. Applications to linkages, cams and geared systems.",
            "id": "ME 240",
            "parent": "ME",
            "title": "DYNAMICS"
        }
    },
    {
        "data": {
            "description": "Research work for Honors students under direct guidance of a faculty member in an area of Biological Systems Engineering.  Students are responsible for arranging the work and credits with the supervising instructor.",
            "id": "BSE 289",
            "parent": "BSE",
            "title": "HONORS INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Research work for students under direct guidance of a faculty member in an area of Biological Systems Engineering.  Students are responsible for arranging the work and credits with the supervising instructor.",
            "id": "BSE 299",
            "parent": "BSE",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Second semester of individual study for undergraduate students completing a thesis in the area of Biological Systems Engineering, as arranged with a faculty member.",
            "id": "BSE 692",
            "parent": "BSE",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Second semester of individual study for undergraduate students in an Honors program completing a thesis in the area of Biological Systems Engineering, as arranged with a faculty member.",
            "id": "BSE 682",
            "parent": "BSE",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Specialized subject matter of current interest to graduate students.",
            "id": "BSE 875",
            "parent": "BSE",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "Specialized subject matter of current interest to undergraduate students.",
            "id": "BSE 375",
            "parent": "BSE",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "Stoichiometry and the mole concept, the behavior of gases, liquids and solids, thermochemistry, electronic structure of atoms and chemical bonding, descriptive chemistry of selected elements and compounds, intermolecular forces, and chemistry laboratory skills.",
            "id": "CHEM 103",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Study of various physical, mechanical, thermal and other properties of food and biological materials. Importance of such property values on the design and operation of various food and bioprocess engineering systems.",
            "id": "BSE 364",
            "parent": "BSE",
            "title": "ENGINEERING PROPERTIES OF FOOD AND BIOLOGICAL MATERIALS"
        }
    },
    {
        "data": {
            "description": "Techniques of integration, improper integrals, first order ordinary differential equations, sequences and series, Taylor series, vector geometry in two and three dimensions.",
            "id": "MATH 222",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 2"
        }
    },
    {
        "data": {
            "description": "The relationships of organisms and the environment. Population dynamics and community organization, human-environment relationships, action programs.",
            "id": "BOTANY/ENVIRST/ZOOLOGY 260",
            "title": "INTRODUCTORY ECOLOGY"
        }
    },
    {
        "data": {
            "description": "The two semester sequenceMATH 112-MATH 113covers similar material asMATH 114, but in a slower pace. Not recommended for students with less than an AB inMATH 96.",
            "id": "MATH 114",
            "parent": "MATH",
            "title": "ALGEBRA AND TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Part of a 2-semester sequence withMATH 217; these two courses together are equivalent toMATH 114and221.",
            "id": "MATH 171",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY I"
        }
    },
    {
        "data": {
            "description": "Work in small groups to design, fabricate, and test a device that solves a real world problem.  Includes retrieval techniques, specification writing, methods for enhancing creativity, selection methodologies, safety engineering, sustainability in design, shop safety, fabrication equipment and techniques, and oral and written communication.",
            "id": "BSE 170",
            "parent": "BSE",
            "title": "PRODUCT DESIGN PRACTICUM"
        }
    },
    {
        "data": {
            "id": "BSE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CBE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CIVENGR",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "EMA",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ME",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "PHYSICS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "BOTANY/ENVIRST/ZOOLOGY 260",
            "target": "BSE 349"
        }
    },
    {
        "data": {
            "source": "BSE 249",
            "target": "BSE 364"
        }
    },
    {
        "data": {
            "source": "BSE 249",
            "target": "BSE 461"
        }
    },
    {
        "data": {
            "source": "BSE 380",
            "target": "BSE 405"
        }
    },
    {
        "data": {
            "source": "BSE 508",
            "target": "BSE 509"
        }
    },
    {
        "data": {
            "source": "CBE 320",
            "target": "BSE 464"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "BSE 380"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "ME 361"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "BSE 460"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 341"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "BSE/CIVENGR/SOILSCI 372"
        }
    },
    {
        "data": {
            "source": "CHEM 115",
            "target": "CHEM 116"
        }
    },
    {
        "data": {
            "source": "CHEM 116",
            "target": "BSE 349"
        }
    },
    {
        "data": {
            "source": "CHEM 341",
            "target": "BSE 460"
        }
    },
    {
        "data": {
            "source": "CIVENGR 310",
            "target": "BSE/ME 474"
        }
    },
    {
        "data": {
            "source": "EMA 201",
            "target": "EMA 202"
        }
    },
    {
        "data": {
            "source": "EMA 201",
            "target": "ME 240"
        }
    },
    {
        "data": {
            "source": "EMA 201",
            "target": "ME 361"
        }
    },
    {
        "data": {
            "source": "EMA 202",
            "target": "BSE/ME 475"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "BSE/ENVIRST 367"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 113"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 113",
            "target": "BSE 301"
        }
    },
    {
        "data": {
            "source": "MATH 113",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 114",
            "target": "BSE 310"
        }
    },
    {
        "data": {
            "source": "MATH 114",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "ANSCI/BSE 344"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "CHEM 109"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "MATH 217"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "BSE 380"
        }
    },
    {
        "data": {
            "source": "MATH 217",
            "target": "BSE 249"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "BSE 473"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 222"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "PHYSICS 201"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "BSE 349"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "BSE 571"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "EMA 201"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 234"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 320"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "ME 240"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "CIVENGR 310"
        }
    },
    {
        "data": {
            "source": "MATH 320",
            "target": "CBE 320"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 114"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "ME 240",
            "target": "BSE/ME 476"
        }
    },
    {
        "data": {
            "source": "ME 240",
            "target": "CIVENGR 310"
        }
    },
    {
        "data": {
            "source": "ME 361",
            "target": "BSE 364"
        }
    },
    {
        "data": {
            "source": "ME 361",
            "target": "BSE 464"
        }
    },
    {
        "data": {
            "source": "ME 361",
            "target": "BSE/ME 476"
        }
    },
    {
        "data": {
            "source": "PHYSICS 201",
            "target": "CBE 320"
        }
    }
]