[
    {
        "data": {
            "description": "Covers technology, the social forces shaping its development, and social impacts of its adoption. Examine one's assumptions about technology and its relationship to society.",
            "id": "C&ESOC/SOC 245",
            "title": "TECHNOLOGY AND SOCIETY"
        }
    },
    {
        "data": {
            "description": "Issues related to health and health care delivery in our society. Topics include social, cultural and ethical influences on consumer definitions of health and use of medical care, and on the health care system's responses.",
            "id": "C&ESOC/SOC 532",
            "title": "HEALTH CARE ISSUES FOR INDIVIDUALS, FAMILIES AND SOCIETY"
        }
    },
    {
        "data": {
            "description": "A capstone experience involving the application of sociological concepts and methods to concrete social and environmental problems.  Involves working in teams, engaging in problems using approaches such as service learning, community based research, and interdisciplinary approaches.",
            "id": "C&ESOC 500",
            "parent": "C&ESOC",
            "title": "CAPSTONE EXPERIENCE"
        }
    },
    {
        "data": {
            "description": "Advanced study of current research in social change, e.g., democratization in the Global South, labor movements, urban protests, social media campaigns.",
            "id": "C&ESOC/SOC 913",
            "title": "SEMINAR-SOCIAL CHANGE"
        }
    },
    {
        "data": {
            "description": "Advanced study of current research in social stratification, e.g., historical and comparative studies of inequality; mathematical and econometric modeling of mobility and achievement processes; demographic approaches to power and inequality.",
            "id": "C&ESOC/SOC 923",
            "title": "SEMINAR-SOCIAL STRATIFICATION"
        }
    },
    {
        "data": {
            "description": "Advanced study of selected topics related to population and society, including health and inequality across the life course, environmental and spatial demography, biodemography.",
            "id": "C&ESOC/SOC 971",
            "title": "SEMINAR-TOPICS IN DEMOGRAPHY AND ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Advanced topics in sociology. Topics vary.",
            "id": "C&ESOC/SOC 875",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "Advanced topics in the analysis of gender relations in society.",
            "id": "C&ESOC/GEN&WS/SOC 904",
            "title": "SOCIOLOGICAL PERSPECTIVES ON GENDER"
        }
    },
    {
        "data": {
            "description": "Agroecology has blossomed across the world in recent decades as not only a science, but also a practice, and a movement. Employ the multiple disciplines and perspectives that Agroecology affords to analyze our agricultural and food systems wihin a broader context of dynamic social and ecological relationships.",
            "id": "AGROECOL/AGRONOMY/C&ESOC/ENTOM/ENVIRST 103",
            "title": "AGROECOLOGY: AN INTRODUCTION TO THE ECOLOGY OF FOOD AND AGRICULTURE"
        }
    },
    {
        "data": {
            "description": "Alternative research designs and processes, measurement, and analytical techniques in social psychology; experience in developing and utilizing research plans and techniques.",
            "id": "C&ESOC/SOC 960",
            "title": "SEMINAR-CURRENT METHODOLOGICAL ISSUES IN SOCIAL PSYCHOLOGY"
        }
    },
    {
        "data": {
            "description": "An in-depth study of a selection of ethical issues arising from the application of modern biotechnology to microorganisms, plants, non-human animals, and human beings. We will aim at a discussion that is informed by empirical research and by work done in ethical theory, political philosophy, and other relevant disciplines, and whose character is rigorous, clear, nuanced, and unbiased.",
            "id": "AGRONOMY/C&ESOC/MEDHIST/PHILOS 565",
            "title": "THE ETHICS OF MODERN BIOTECHNOLOGY"
        }
    },
    {
        "data": {
            "description": "An internship under guidance of a faculty or instructional academic staff member in Community and Environmental Sociology and internship site supervisor. Students are responsible for arranging the work and credits with the UW-Madison instructor and the internship site supervisor.",
            "id": "C&ESOC 399",
            "parent": "C&ESOC",
            "title": "COORDINATIVE INTERNSHIP/COOPERATIVE EDUCATION"
        }
    },
    {
        "data": {
            "description": "Analysis of recent research and theory, based on reviews of literature and presentations of research in progress.",
            "id": "C&ESOC/SOC 987",
            "title": "RESEARCH: RACE AND ETHNIC STUDIES"
        }
    },
    {
        "data": {
            "description": "Application of scientific methods to the analysis of social phenomena; methodological orientations in sociology; types of research procedure: nature of sociological variables.",
            "id": "C&ESOC/SOC 750",
            "title": "RESEARCH METHODS IN SOCIOLOGY"
        }
    },
    {
        "data": {
            "description": "Application of sociological theory and analysis to environmental issues. Examines the ways in which environmental stewardship and conflict are embedded within broader cultural, social, and political contexts.",
            "id": "C&ESOC/SOC 541",
            "title": "ENVIRONMENTAL STEWARDSHIP AND SOCIAL JUSTICE"
        }
    },
    {
        "data": {
            "description": "Applied linear regression modeling for social scientists. Bivariate and multiple regression, dummy variables, interactions, nonlinear relationships, indirect effects and omitted variable bias, outliers, heteroskedasticity, and mulitcollinearity; associated diagnostics and corrections. Use of Stata and/or SAS for dataset creation and analysis.",
            "id": "C&ESOC/SOC 361",
            "title": "STATISTICS FOR SOCIOLOGISTS II"
        }
    },
    {
        "data": {
            "description": "Basic principles and definitions of sociology. Readings and discussion of the perspectives of sociology, the individual and society, groups and social process, stratification, organizations and power, demography, and social change.",
            "id": "C&ESOC/SOC 211",
            "title": "THE SOCIOLOGICAL ENTERPRISE"
        }
    },
    {
        "data": {
            "description": "Classical theory; Marx, Durkheim, Weber, and other important classical theorists and schools of thought.",
            "id": "C&ESOC/SOC 475",
            "title": "CLASSICAL SOCIOLOGICAL THEORY"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Critical analysis of recent theoretical and methodological issues through presentations of research in progress.",
            "id": "C&ESOC/SOC 985",
            "title": "RESEARCH: COMMUNITY AND ENVIRONMENTAL SOCIOLOGY"
        }
    },
    {
        "data": {
            "description": "Critical examination of theories and research in political sociology. Topics include: power and interests, state-formation, social movements, class and political behavior, revolutions, ideology, and states and social policy.",
            "id": "C&ESOC/SOC 724",
            "title": "INTERMEDIATE POLITICAL SOCIOLOGY"
        }
    },
    {
        "data": {
            "description": "Current literature, emphasis on recent journal articles.",
            "id": "C&ESOC/SOC 965",
            "title": "SEMINAR-RECENT DEVELOPMENTS IN SOCIAL PSYCHOLOGY"
        }
    },
    {
        "data": {
            "description": "Descriptive statistics, probability concepts and distributions, random variables. Hypothesis tests and confidence intervals for one- and two-sample problems. Linear regression, model checking, and inference. Analysis of variance and basic ideas in experimental design. Utilizes the R programming language.",
            "id": "STAT 324",
            "parent": "STAT",
            "title": "INTRODUCTORY APPLIED STATISTICS FOR ENGINEERS"
        }
    },
    {
        "data": {
            "description": "Economic problems of individuals, firms and industries with emphasis on value, price, and distribution of income.",
            "id": "ECON 101",
            "parent": "ECON",
            "title": "PRINCIPLES OF MICROECONOMICS"
        }
    },
    {
        "data": {
            "description": "Engage in ongoing reflection and dialogue on the Wisconsin Idea and how it informs the mission of the University of Wisconsin. Consider the Wisconsin Idea as it has developed since its beginnings, with a focus on what it means today and what it can mean in the future.",
            "id": "C&ESOC/HISTORY/POLISCI/SOC 259",
            "title": "FORWARD? THE WISCONSIN IDEA, PAST AND PRESENT"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "Examine current issues in population and development using conceptual tools of sociology and demography. Critique the motivations of agents and institutions involved in creating population policies and will evaluate the empirical evidence linking population processes and international development in its varied forms. Focus on the impact of international population priorities on the current relationship between population and development, with particular attention to gender, poverty, and health.",
            "id": "C&ESOC/SOC 972",
            "title": "SEMINAR IN POPULATION AND DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Examines theories of community change and different models of community organizing.",
            "id": "C&ESOC/SOC 573",
            "title": "COMMUNITY ORGANIZATION AND CHANGE"
        }
    },
    {
        "data": {
            "description": "Examines topics such as theories of environment and society, the treadmill of production, environmental movements, political ecology, environmental justice, consumption, ecological modernization, sustainability, environmental risk, and the sociology of environmental science.",
            "id": "C&ESOC/SOC 948",
            "title": "SEMINAR: ENVIRONMENTAL SOCIOLOGY"
        }
    },
    {
        "data": {
            "description": "Explores the relationship between humans and wildlife amid diverse landscapes, both historic and contemporary, tropical and temperate. Investigates how humans shape wild animal populations by modifying physical environments, and by hunting, domesticating and introducing species.",
            "id": "C&ESOC/ENVIRST/GEOG 434",
            "title": "PEOPLE, WILDLIFE AND LANDSCAPES"
        }
    },
    {
        "data": {
            "description": "First order differential equations, introduction to multivariable calculus and constrained optimization, infinite sequences and series, methods of approximation, and a brief introduction to probability. Models and applications from business and the social sciences.",
            "id": "MATH 213",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 2"
        }
    },
    {
        "data": {
            "description": "How can education - for children and adults, in school and out - help to address crucial environmental and social sustainability challenges? What ideas and strategies have guided environmental and sustainability education over the years? What can individual people do to address environmental challenges, and what can only be accomplished by people working together? What does sustainability have to do with justice - and vice versa? Examine the principles behind behavior change and empowerment, community action and whole-scale social reform. Drawing on research and theory from across the social sciences, we will explore the uncertain relationship between education and advocacy, seeking the means by which education can have the greatest impact without compromising the core ideals of a democratic society.",
            "id": "C&ESOC/CURRIC/ENVIRST 405",
            "title": "EDUCATION FOR SUSTAINABLE COMMUNITIES"
        }
    },
    {
        "data": {
            "description": "Independent graduate research under supervision of a faculty member.",
            "id": "C&ESOC 990",
            "parent": "C&ESOC",
            "title": "RESEARCH"
        }
    },
    {
        "data": {
            "description": "Independent graduate research under supervision of a faculty member.",
            "id": "C&ESOC 999",
            "parent": "C&ESOC",
            "title": "READING AND RESEARCH"
        }
    },
    {
        "data": {
            "description": "Individual advanced work in an area of Community and Environmental Sociology under the direct guidance of a faculty member.",
            "id": "C&ESOC 699",
            "parent": "C&ESOC",
            "title": "SPECIAL PROBLEMS"
        }
    },
    {
        "data": {
            "description": "Individual study for undergraduate students completing a thesis in the area of Community and Environmental Sociology, as arranged with a faculty member.",
            "id": "C&ESOC 691",
            "parent": "C&ESOC",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Individual study for undergraduate students in an Honors program completing a thesis in the area of Community and Environmental Sociology, as arranged with a faculty member.",
            "id": "C&ESOC 681",
            "parent": "C&ESOC",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Integrated treatment of macroeconomics and microeconomics (seeECON 101andECON 102). Accelerated approach to economics training, especially for Economics: Math Emphasis majors.",
            "id": "ECON 111",
            "parent": "ECON",
            "title": "PRINCIPLES OF ECONOMICS-ACCELERATED TREATMENT"
        }
    },
    {
        "data": {
            "description": "Interdisciplinary inquiry in Latin American society and culture.",
            "id": "AAE/ANTHRO/C&ESOC/GEOG/HISTORY/LACIS/POLISCI/PORTUG/SOC/SPANISH 982",
            "title": "INTERDEPARTMENTAL SEMINAR IN THE LATIN-AMERICAN AREA"
        }
    },
    {
        "data": {
            "description": "Interdisciplinary training workshop on current research in population science from scholars at research and teaching institutions around the world.",
            "id": "C&ESOC/SOC 997",
            "title": "RESEARCH: DEMOGRAPHY AND ECOLOGY TRAINEES"
        }
    },
    {
        "data": {
            "description": "Introduces qualitative, or ethnographic, research methods, emphasizing those suitable for educational and other organizational settings. Considers strengths and limitations of qualitative approaches in relation to varied research problems. Explores methodological procedures from entry into the field through writing.",
            "id": "C&ESOC/EDPOL/SOC 755",
            "title": "METHODS OF QUALITATIVE RESEARCH"
        }
    },
    {
        "data": {
            "description": "Introduces the concerns and principles of sociology  through examination of human interaction with the natural environment. Places environmental issues such as resource depletion, population growth, food production, environmental regulation, and sustainability in national and global perspectives.",
            "id": "C&ESOC/F&WECOL/SOC 248",
            "title": "ENVIRONMENT, NATURAL RESOURCES, AND SOCIETY"
        }
    },
    {
        "data": {
            "description": "Introduction to analysis of economic data. The techniques of descriptive statistics and statistical inference (hypothesis testing and estimation) as directed toward application in economic research.",
            "id": "ECON 310",
            "parent": "ECON",
            "title": "STATISTICS: MEASUREMENT IN ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Introduction to demographic concepts, methods, data, and trends for application in business, government, planning and other applied areas. Emphasis on U.S. census data and their uses.",
            "id": "C&ESOC/SOC 676",
            "title": "APPLIED DEMOGRAPHY: PLANNING AND POLICY"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Introduction to modern statistical practice in the life sciences, using the R programming language. Topics include: exploratory data analysis, probability and random variables; one-sample testing and confidence intervals, role of assumptions, sample size determination, two-sample inference; basic ideas in experimental design, analysis of variance, linear regression, goodness-of fit; biological applications.",
            "id": "STAT 371",
            "parent": "STAT",
            "title": "INTRODUCTORY APPLIED STATISTICS FOR THE LIFE SCIENCES"
        }
    },
    {
        "data": {
            "description": "Introduction to sociology of agriculture in advanced industrial-capitalist societies, including theoretical, historical, and empirical issues of agriculture in the United States.",
            "id": "C&ESOC/SOC 650",
            "title": "SOCIOLOGY OF AGRICULTURE"
        }
    },
    {
        "data": {
            "description": "Introduction to the field of American sociology, its subfields and specialized areas of research, theoretical traditions and research methods.",
            "id": "C&ESOC/SOC 210",
            "title": "SURVEY OF SOCIOLOGY"
        }
    },
    {
        "data": {
            "description": "Introduction to the principles of public health. Using local and global health problems as examples, introduces epidemiology, evidence-based public health practice, evaluation, and communication. Covers the major subject domains of public health including infectious and chronic disease, environmental health, injuries and accidents, and health care systems. Key theoretical models and empirical approaches of public health are discussed.",
            "id": "C&ESOC/POPHLTH 370",
            "title": "INTRODUCTION TO PUBLIC HEALTH"
        }
    },
    {
        "data": {
            "description": "Issues involved in decision-making regarding technological risks and risk management in areas such as nuclear power, hazardous waste disposal, and pollution control. Risk perception and cognitive biases; risk analysis and decision analysis; political issues in risk management; regulatory mechanisms; and risk communication. Selected case studies.",
            "id": "C&ESOC/ISYE/NE/SOC 708",
            "title": "SOCIETAL RISK MANAGEMENT OF TECHNOLOGICAL HAZARDS"
        }
    },
    {
        "data": {
            "description": "Latin American culture and society from an interdisciplinary perspective; historical developments from pre-Columbian times to the present; political movements; economic problems; social change; ecology in tropical Latin America; legal systems; literature and the arts; cultural contrasts involving the US and Latin America; land reform; labor movements; capitalism, socialism, imperialism; mass media.",
            "id": "AFROAMER/ANTHRO/C&ESOC/GEOG/HISTORY/LACIS/POLISCI/SOC/SPANISH 260",
            "title": "LATIN AMERICA: AN INTRODUCTION"
        }
    },
    {
        "data": {
            "description": "Macroeconomic measurement and models of aggregate demand and supply; fiscal and monetary policy for unemployment, inflation, and growth.",
            "id": "ECON 102",
            "parent": "ECON",
            "title": "PRINCIPLES OF MACROECONOMICS"
        }
    },
    {
        "data": {
            "description": "Major social psychological theories and research that focus on the individual in social context. Topics include: perspectives on socialization, the self, social perception and attribution, attitudes, language and nonverbal communication, and attraction and relationships.",
            "id": "C&ESOC/SOC 730",
            "title": "INTERMEDIATE SOCIAL PSYCHOLOGY: THE INDIVIDUAL AND SOCIETY"
        }
    },
    {
        "data": {
            "description": "Major social pychological theories and research that focus on interpersonal relations and group processes. Topics include: social interaction (influence, self-presentation, altruism, agression), groups (cohesion, conformity, leadership, problem-solving, decision making), intergroup relations (conflict, stereotypes), n-person games (dilemmas, coalition formation).",
            "id": "C&ESOC/SOC 731",
            "title": "INTERMEDIATE SOCIAL PSYCHOLOGY: GROUP AND COLLECTIVE PROCESSES"
        }
    },
    {
        "data": {
            "description": "Overview of our current food system and how new technologies and globalization are reshaping it, focusing especially on the implications for workers throughout the food chain. Learn about the ways that social movements are working to reshape commodity chains by promoting local production, fair trade, and labor justice.",
            "id": "C&ESOC/SOC 341",
            "title": "LABOR IN GLOBAL FOOD SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Practical experience in techniques of social research through assignment to a research project for the semester. Focuses on the art and practice of research and the writing of research reports.",
            "id": "C&ESOC/SOC 693",
            "title": "PRACTICUM IN ANALYSIS AND RESEARCH"
        }
    },
    {
        "data": {
            "description": "Presentation of sociological data; descriptive statistics; probability theory and statistical inference; estimation and tests of hypotheses; regression and correlation and the analysis of contingency tables.",
            "id": "C&ESOC/SOC 360",
            "title": "STATISTICS FOR SOCIOLOGISTS I"
        }
    },
    {
        "data": {
            "description": "Presentations of research in progress concerning social and economic change in developing countries.",
            "id": "C&ESOC/SOC 993",
            "title": "RESEARCH: SOCIOLOGY OF ECONOMIC CHANGE TRAINEES"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Provides an area equivalency for courses taken on Madison Study Abroad Programs that do not equate to existing UW courses. Enrollment in a UW-Madison resident study abroad program",
            "id": "C&ESOC 400",
            "parent": "C&ESOC",
            "title": "STUDY ABROAD IN COMMUNITY AND ENVIRONMENTAL SOCIOLOGY"
        }
    },
    {
        "data": {
            "description": "Relevance of the concept of community to American society. Review of several basic theories of community and analysis of the nature of community in the broader political and economic context.",
            "id": "C&ESOC/SOC/URBRPL 645",
            "title": "MODERN AMERICAN COMMUNITIES"
        }
    },
    {
        "data": {
            "description": "Research work for Honors students under direct guidance of a faculty member in an area of Community and Environmental Sociology.  Students are responsible for arranging the work and credits with the supervising instructor.",
            "id": "C&ESOC 289",
            "parent": "C&ESOC",
            "title": "HONORS INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Research work for students under direct guidance of a faculty member in an area of Community and Environmental Sociology.  Students are responsible for arranging the work and credits with the supervising instructor.",
            "id": "C&ESOC 299",
            "parent": "C&ESOC",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Review of ecological theory and research; critical assessment of the ecological complex (population, organization, environment, and technology); problems of measurement.",
            "id": "C&ESOC/SOC 977",
            "title": "SEMINAR-HUMAN ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Review of problems and prospects of so-called \"developing societies.\" Includes theory of economic/social development, political economic organizations of \"developing\" societies, history of colonialism/imperialism, attempts to industrialize and results of those attempts.",
            "id": "C&ESOC/SOC 630",
            "title": "SOCIOLOGY OF DEVELOPING SOCIETIES/THIRD WORLD"
        }
    },
    {
        "data": {
            "description": "Scientific methods in the study of society; procedures for testing sociological theory: problem definition, hypothesis construction, collection and evaluation of data. Practical experience conducting small research projects.",
            "id": "C&ESOC/SOC 357",
            "title": "METHODS OF SOCIOLOGICAL INQUIRY"
        }
    },
    {
        "data": {
            "description": "Second semester of individual study for undergraduate students completing a thesis in the area of Community and Environmental Sociology, as arranged with a faculty member.C&E SOC 691",
            "id": "C&ESOC 692",
            "parent": "C&ESOC",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Second semester of individual study for undergraduate students in an Honors program completing a thesis in the area of Community and Environmental Sociology, as arranged with a faculty member.C&E SOC 681",
            "id": "C&ESOC 682",
            "parent": "C&ESOC",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Selected topics in Marxist theory and research.",
            "id": "C&ESOC/SOC 929",
            "title": "SEMINAR: CLASS ANALYSIS AND HISTORICAL CHANGE"
        }
    },
    {
        "data": {
            "description": "Social and cultural dimensions of food production and consumption. Uses historical and cross-cultural analytical frameworks. Treats a wide variety of topics including indigenous, racial, and ethnic foodways, industrialized food systems, sustainable agriculture, movements for food justice.",
            "id": "C&ESOC/SOC 222",
            "title": "FOOD, CULTURE, AND SOCIETY"
        }
    },
    {
        "data": {
            "description": "Social and economic factors relating to stability, growth, and change in the non-Western areas of the contemporary world.",
            "id": "ANTHRO/C&ESOC/ECON/SOC 925",
            "title": "SEMINAR: SOCIO-ECONOMIC CHANGE IN UNDERDEVELOPED AREAS"
        }
    },
    {
        "data": {
            "description": "Social network analysis is a social scientific approach examining individuals as embedded in networks of social relations. Covers the fundamentals of network thinking, network tools, and the analysis and presentation of social network data. Direct practice with network data using software R.",
            "id": "C&ESOC/SOC 618",
            "title": "SOCIAL NETWORK ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Social, cultural and personality factors influencing community development, with reference to developing countries as well as contemporary rural communities; consideration of theoretical and operational issues.",
            "id": "C&ESOC/SOC/URBRPL 617",
            "title": "COMMUNITY DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Social, cultural, and structural factors in shaping definitions of health and illness, distribution of disparate health outcomes, and the organization of health professions and healthcare.",
            "id": "C&ESOC/SOC 343",
            "title": "SOCIOLOGY OF HEALTH AND MEDICINE"
        }
    },
    {
        "data": {
            "description": "Sociological analysis of relationships among economic growth, environmental sustainability and social justice in the developing world. Considers frameworks for understanding poverty, hunger, educational and technological inequality, and the impact of globalization on prospects for socially and ecologically sustainable development.",
            "id": "C&ESOC/ENVIRST/SOC 540",
            "title": "SOCIOLOGY OF INTERNATIONAL DEVELOPMENT, ENVIRONMENT, AND SUSTAINABILITY"
        }
    },
    {
        "data": {
            "description": "Sociological approaches to community, rural, and public health.  Examines epidemiological evidence for and policy solutions to health issues that impact vulnerable populations in diverse geographic and social settings. Topics include mental health, environmental and occupational health, preventive care, substance abuse.",
            "id": "C&ESOC/SOC 533",
            "title": "PUBLIC HEALTH IN RURAL & URBAN COMMUNITIES"
        }
    },
    {
        "data": {
            "description": "Sociological examination of the linkages between the social and biophysical dimensions of the environment. Key topics include community organizing, local food systems, energy transitions, environmental justice, resource dependence, and sustainable development.",
            "id": "C&ESOC/SOC 140",
            "title": "INTRODUCTION TO COMMUNITY AND ENVIRONMENTAL SOCIOLOGY"
        }
    },
    {
        "data": {
            "description": "Sociological perspectives on the organization of the firm, financial markets, and work, intermediate associations (unions, ethnic economies), the state, and the international economy. Contrast between neoclassical, traditional institutionalist, post-fordist, and neo-fordist perspectives on the nature and evolution of these institutions.",
            "id": "C&ESOC/SOC 652",
            "title": "SOCIOLOGY OF ECONOMIC INSTITUTIONS"
        }
    },
    {
        "data": {
            "description": "Specialized topics in community and environmental sociology. In-depth investigation into the sociological aspects of a variety of community and environmental issues, such as globalization, climate change, social and environmental sustainability, technology.",
            "id": "C&ESOC 375",
            "parent": "C&ESOC",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "The allocation of economic and social rewards in the United States; emphasis on persistently poor regions and communities; analysis of selected minority groups and their poverty statuses; poverty programs and their consequences for structural and cultural changes.",
            "id": "AMERIND/C&ESOC/SOC 578",
            "title": "POVERTY AND PLACE"
        }
    },
    {
        "data": {
            "description": "Theoretical and technical problems in research concerning organizational and socio-psychological aspects of changes in large scale social systems.",
            "id": "C&ESOC/SOC 940",
            "title": "SEMINAR-SOCIOLOGY OF ECONOMIC CHANGE"
        }
    },
    {
        "data": {
            "description": "Theoretical, methodological, and current research problems.",
            "id": "C&ESOC/SOC 922",
            "title": "SEMINAR-RACE AND ETHNIC RELATIONS"
        }
    },
    {
        "data": {
            "description": "Theory and research in alternate semesters in rural aspects of population, stratification, social change, and groups and institutions.",
            "id": "C&ESOC/SOC 945",
            "title": "SEMINAR-RURAL SOCIOLOGY"
        }
    },
    {
        "data": {
            "description": "Understanding the structure of different types of social scientific data, techniques for data evaluation, cleaning, documentation and visual display, merging data from multiple sources, restructuring data for analysis.",
            "id": "C&ESOC/SOC 365",
            "title": "DATA MANAGEMENT FOR SOCIAL SCIENCE RESEARCH"
        }
    },
    {
        "data": {
            "description": "With primary emphasis on the U.S., the course covers social, economic and biological dimensions of food systems. Using classroom and community experience, the course combines academic approaches with practitioner knowledge. A community project is required.",
            "id": "AAE/C&ESOC/SOC 340",
            "title": "ISSUES IN FOOD SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Workshop on social science research methods and professional development, e.g. ethics, communication, data management, novel research methods.",
            "id": "C&ESOC/SOC 995",
            "title": "RESEARCH: METHODOLOGY TRAINEES"
        }
    },
    {
        "data": {
            "id": "C&ESOC",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ECON",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "STAT",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "C&ESOC/F&WECOL/SOC 248",
            "target": "C&ESOC/SOC 541"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 140",
            "target": "AAE/C&ESOC/SOC 340"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 140",
            "target": "AMERIND/C&ESOC/SOC 578"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 140",
            "target": "C&ESOC/ENVIRST/SOC 540"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 140",
            "target": "C&ESOC/SOC 533"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 140",
            "target": "C&ESOC/SOC 541"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 140",
            "target": "C&ESOC/SOC 573"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 140",
            "target": "C&ESOC/SOC 676"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 140",
            "target": "C&ESOC/SOC/URBRPL 617"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 140",
            "target": "C&ESOC/SOC/URBRPL 645"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 210",
            "target": "C&ESOC/SOC 211"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 210",
            "target": "C&ESOC/SOC 357"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 210",
            "target": "C&ESOC/SOC 475"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 210",
            "target": "C&ESOC/SOC 650"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 210",
            "target": "C&ESOC/SOC/URBRPL 645"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 211",
            "target": "C&ESOC/SOC 210"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 211",
            "target": "C&ESOC/SOC 357"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 211",
            "target": "C&ESOC/SOC 475"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 211",
            "target": "C&ESOC/SOC 573"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 211",
            "target": "C&ESOC/SOC 676"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 211",
            "target": "C&ESOC/SOC/URBRPL 617"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 357",
            "target": "C&ESOC/SOC 693"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 360",
            "target": "C&ESOC/SOC 361"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 360",
            "target": "C&ESOC/SOC 365"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 360",
            "target": "C&ESOC/SOC 618"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 361",
            "target": "C&ESOC/SOC 693"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON 310"
        }
    },
    {
        "data": {
            "source": "ECON 102",
            "target": "ECON 111"
        }
    },
    {
        "data": {
            "source": "ECON 102",
            "target": "ECON 310"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON 101"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON 102"
        }
    },
    {
        "data": {
            "source": "ECON 310",
            "target": "C&ESOC/SOC 361"
        }
    },
    {
        "data": {
            "source": "ECON 310",
            "target": "C&ESOC/SOC 618"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 213"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "source": "MATH 213",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "STAT 324",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "source": "STAT 371",
            "target": "C&ESOC/SOC 618"
        }
    },
    {
        "data": {
            "source": "STAT 371",
            "target": "STAT 324"
        }
    }
]