[
    {
        "data": {
            "description": "Equilibrium thermodynamics and chemical kinetics with emphasis on solution behavior and applications to biological macromolecules in solution. Focus on biological applications of physical chemistry.",
            "id": "CHEM 665",
            "parent": "CHEM",
            "title": "BIOPHYSICAL CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Brings cutting-edge topics in the genomic sciences into the reach of those in chemistry, biology, engineering, computer science  statistics fields. Enables biologically-oriented students to deal with advances in analytical science so that they may incorporate new genomic science concepts into their own scientific repertoires.",
            "id": "CHEM/GENETICS 626",
            "title": "GENOMIC SCIENCE"
        }
    },
    {
        "data": {
            "description": "Fundamentals of chemical measurement in chemistry, biology, engineering, geology, and the medical sciences. Topics include equilibria of complex systems, spectroscopy, electrochemistry, separations, and quantitative laboratory technique.",
            "id": "CHEM 327",
            "parent": "CHEM",
            "title": "FUNDAMENTALS OF ANALYTICAL SCIENCE"
        }
    },
    {
        "data": {
            "description": "Study abroad equivalency for introductory chemistry. Enrollment in a UW-Madison resident study abroad program.",
            "id": "CHEM 155",
            "parent": "CHEM",
            "title": "STUDY ABROAD IN INTRODUCTORY CHEMISTRY"
        }
    },
    {
        "data": {
            "source": "CHEM 561",
            "target": "CHEM 563"
        }
    },
    {
        "data": {
            "description": "Principles of molecular structure and bonding applied to predict and explain the reactivity of alkanes, alkenes, alkynes, alkyl halides, alcohols, and thiols. Emphasis placed on rationalizing the stereochemical and regiochemical outcome of chemical processes.",
            "id": "CHEM 343",
            "parent": "CHEM",
            "title": "ORGANIC CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Study abroad equivalency for advanced chemistry. Enrollment in a UW-Madison resident study abroad program.",
            "id": "CHEM 555",
            "parent": "CHEM",
            "title": "STUDY ABROAD IN ADVANCED CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Advanced mentored research project as arranged with a faculty or academic staff member.",
            "id": "CHEM 699",
            "parent": "CHEM",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "source": "CHEM 345",
            "target": "CHEM 547"
        }
    },
    {
        "data": {
            "description": "Chemistry and biology of proteins, nucleic acids and carbohydrates; application of organic chemistry to problems in cell biology, biotechnology, and biomedicine.",
            "id": "BIOCHEM/CHEM 704",
            "title": "CHEMICAL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Principles and application of chemical equilibrium, coordination chemistry, oxidation-reduction and electrochemistry, kinetics, nuclear chemistry, introduction to organic chemistry, and chemistry laboratory skills.",
            "id": "CHEM 104",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY II"
        }
    },
    {
        "data": {
            "source": "CHEM 345",
            "target": "BIOCHEM 507"
        }
    },
    {
        "data": {
            "description": "Elementary bonding theory and its application to understanding molecular geometry and reactivity. Emphasizes qualitative methods applied to the bonding of elements from throughout the periodic table.",
            "id": "CHEM 608",
            "parent": "CHEM",
            "title": "SYMMETRY, BONDING, AND MOLECULAR SHAPES"
        }
    },
    {
        "data": {
            "description": "Stoichiometry and the mole concept, chemical reactions, thermochemistry, electronic structure of atoms, periodic properties, chemical bonding, intermolecular forces, and the behavior of gases, liquids and solids. Equivalent to laboratory-only part ofCHEM 103. Provides a mechanism for awarding credit for experiences with no lecture component. The combination ofCHEM 101andCHEM 105is equivalent toCHEM 103.",
            "id": "CHEM 101",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY I LABORATORY"
        }
    },
    {
        "data": {
            "description": "The role of the teaching assistant in undergraduate chemistry instruction. Effective utilization of instructional aids. Innovations for better teaching.",
            "id": "CHEM 901",
            "parent": "CHEM",
            "title": "SEMINAR-TEACHING OF CHEMISTRY"
        }
    },
    {
        "data": {
            "source": "CHEM 116",
            "target": "CHEM 561"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Interfacial electron transfer and mass transport processes in electrochemistry, with applications to electroanalysis, electrodeposition and electrochemical separations.",
            "id": "CHEM 624",
            "parent": "CHEM",
            "title": "ELECTROCHEMISTRY"
        }
    },
    {
        "data": {
            "source": "CHEM 329",
            "target": "CHEM 575"
        }
    },
    {
        "data": {
            "description": "A survey of spectroscopic methods for inorganic structure determination. Introduces major non-crystallographic techniques with an emphasis on the application to structural analysis. The basic theory and methodology of each form of spectroscopy will be presented. Topics covered include: ligand field theory, electronic absorption, Raman, Mossbauer and EPR stectroscopies, and magnetic susceptibility.",
            "id": "CHEM 606",
            "parent": "CHEM",
            "title": "PHYSICAL METHODS FOR STRUCTURE DETERMINATION"
        }
    },
    {
        "data": {
            "description": "Modern principles of synthetic and mechanistic organic chemistry.",
            "id": "CHEM 547",
            "parent": "CHEM",
            "title": "ADVANCED ORGANIC CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Accelerated coverage of topics in general chemistry, including introduction to laboratory techniques. Topics include atomic and molecular structure, chemical equilibrium, acid-base chemistry, thermodynamics, kinetics, and electrochemistry.",
            "id": "CHEM 109",
            "parent": "CHEM",
            "title": "ADVANCED GENERAL CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Principles and applications of chemical equilibrium, electrochemistry, thermodynamics, kinetics, organic chemistry and other topics that may include nuclear chemistry, biological chemistry and coordination chemistry. Equivalent to lecture-only part ofCHEM 104. Provides a mechanism for awarding credit for experiences with no laboratory component. The combination ofCHEM 102andCHEM 106is equivalent toCHEM 104.",
            "id": "CHEM 106",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY II"
        }
    },
    {
        "data": {
            "source": "MATH 375",
            "target": "MATH 376"
        }
    },
    {
        "data": {
            "source": "CHEM 343",
            "target": "CHEM 345"
        }
    },
    {
        "data": {
            "description": "Core organic chemistry concepts of structure, reactivity, and synthesis with regards to the functional groups commonly found in commercial and biological substances. Covers a selection of topics fromCHEM 343and345.",
            "id": "CHEM 341",
            "parent": "CHEM",
            "title": "ELEMENTARY ORGANIC CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Theory and practice of nuclear magnetic resonance (NMR) spectroscopy.",
            "id": "CHEM 636",
            "parent": "CHEM",
            "title": "TOPICS IN CHEMICAL INSTRUMENTATION: INTRODUCTION TO NMR"
        }
    },
    {
        "data": {
            "description": "Topics in multi-variable calculus and introduction to differential equations.",
            "id": "MATH 376",
            "parent": "MATH",
            "title": "TOPICS IN MULTI-VARIABLE CALCULUS AND DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "description": "Mentored research for students completing a senior thesis.",
            "id": "CHEM 692",
            "parent": "CHEM",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Various topics in chemistry at the advanced level.",
            "id": "CHEM 575",
            "parent": "CHEM",
            "title": "ADVANCED TOPICS IN CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Fundamentals of statistical mechanics; applications to equilibrium and non-equilibrium properties of gases and condensed phases.",
            "id": "CHEM 864",
            "parent": "CHEM",
            "title": "STATISTICAL MECHANICS"
        }
    },
    {
        "data": {
            "source": "CHEM 561",
            "target": "CHEM 665"
        }
    },
    {
        "data": {
            "id": "BIOCHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Polymer chemistry and physics terminologies, structure-property relationship, polymer characterization, polymer synthesis, material requirements for optoelectronics including conjugated polymers, thin film transistors, light emitting diodes, non-linear optical materials, holographic data storage and liquid crystal polymers.",
            "id": "CHEM/MS&E 421",
            "title": "POLYMERIC MATERIALS"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 375"
        }
    },
    {
        "data": {
            "description": "Principles of experimental physical chemistry applied to the acquisition of thermodynamic and kinetic data; use of basic physical laboratory equipment; related computations, analysis of errors, interpretation of results.",
            "id": "CHEM 563",
            "parent": "CHEM",
            "title": "PHYSICAL CHEMISTRY LABORATORY I"
        }
    },
    {
        "data": {
            "description": "Learn the chemistry and chemical engineering that defines societies' standard of living. Commercial chemical processes will be reviewed. Practical realities of how a discovery moves from research to commercial product will be taught through examples and case studies. Financial concepts that guide investment will be reviewed.",
            "id": "CBE/CHEM 505",
            "title": "ASPECTS OF INDUSTRIAL CHEMISTRY AND BUSINESS FUNDAMENTALS"
        }
    },
    {
        "data": {
            "description": "Various topics in chemistry at the intermediate level.",
            "id": "CHEM 375",
            "parent": "CHEM",
            "title": "INTERMEDIATE TOPICS IN CHEMISTRY"
        }
    },
    {
        "data": {
            "source": "CHEM 345",
            "target": "CHEM 344"
        }
    },
    {
        "data": {
            "description": "Fundamentals of chemical measurement in chemistry, biology, engineering, geology, and the medical sciences. Topics include equilibria of complex systems, spectroscopy, electrochemistry, separations, and quantitative laboratory technique. Covers chemical equilibria in greater depth and with greater mathematical rigor thanCHEM 327.",
            "id": "CHEM 329",
            "parent": "CHEM",
            "title": "FUNDAMENTALS OF ANALYTICAL SCIENCE"
        }
    },
    {
        "data": {
            "description": "Topics in physical organic chemistry.",
            "id": "CHEM 641",
            "parent": "CHEM",
            "title": "ADVANCED ORGANIC CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Introduction to thermodynamics, energy balances, applications to steady state and unsteady state processes, behavior of pure fluids, chemical reaction equilibria.",
            "id": "CBE 310",
            "parent": "CBE",
            "title": "CHEMICAL PROCESS THERMODYNAMICS"
        }
    },
    {
        "data": {
            "source": "CHEM 343",
            "target": "CHEM 341"
        }
    },
    {
        "data": {
            "description": "Covers several aspects of state-of-the-art biological and biophysical imaging with an emphasis on instrumentation, beginning with an overview of geometrical optics and optical and fluorescence microscopy. The bulk of the course will focus on advanced imaging techniques including nonlinear optical processes (multi-photon excitation, second harmonic generation, and stimulated Raman processes) and emerging super-resolution methods. Special emphasis will be given to current imaging literature and experimental design. Knowledge of physics-based optics [such asPHYSICS 202] strongly recommended.",
            "id": "BME/CHEM/MEDPHYS 750",
            "title": "BIOLOGICAL OPTICAL MICROSCOPY"
        }
    },
    {
        "data": {
            "source": "CHEM 344",
            "target": "CHEM 342"
        }
    },
    {
        "data": {
            "description": "Various topics in chemistry at the introductory level.",
            "id": "CHEM 175",
            "parent": "CHEM",
            "title": "INTRODUCTORY TOPICS IN CHEMISTRY"
        }
    },
    {
        "data": {
            "source": "CHEM 311",
            "target": "CHEM 512"
        }
    },
    {
        "data": {
            "description": "Basic principles of chemical and biochemical separations by chromatography and electrophoresis.",
            "id": "CHEM 725",
            "parent": "CHEM",
            "title": "SEPARATIONS IN CHEMICAL ANALYSIS"
        }
    },
    {
        "data": {
            "source": "CHEM 115",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "description": "Introduces the basic synthesis, purification, and characterization techniques of organic chemistry, along with critical interpretation of experimental data.",
            "id": "CHEM 344",
            "parent": "CHEM",
            "title": "INTRODUCTORY ORGANIC CHEMISTRY LABORATORY"
        }
    },
    {
        "data": {
            "description": "Explores a detailed atomic and molecular view of matter and its interactions, with a specific focus on quantum theory, molecular structure, and chemical bonding. Application required for enrollment.",
            "id": "CHEM 115",
            "parent": "CHEM",
            "title": "CHEMICAL PRINCIPLES I"
        }
    },
    {
        "data": {
            "description": "Focuses on the chemical mechanisms and kinetics of reactive gases and aerosol in Earth's atmosphere. Fundamental concepts from analytical, physical, and organic chemistry will be used as tools to describe atmospheric processes occurring in both the troposphere and the stratosphere. Specific topics include: Evolution and chemical composition of Earth's atmosphere; applications of the steady-state approximation; residence and renewal time; sources, transformation, transport and deposition of trace gases in the troposphere; air pollution control strategies; stratospheric chemistry.",
            "id": "CHEM 629",
            "parent": "CHEM",
            "title": "ATMOSPHERIC CHEMICAL MECHANISMS"
        }
    },
    {
        "data": {
            "description": "Determination of organic structures and reaction mechanisms using mass spectrometry and nuclear magnetic resonance techniques.",
            "id": "CHEM 605",
            "parent": "CHEM",
            "title": "SPECTROCHEMICAL MEASUREMENTS"
        }
    },
    {
        "data": {
            "source": "CHEM 345",
            "target": "CHEM 605"
        }
    },
    {
        "data": {
            "source": "CHEM 102",
            "target": "CHEM 344"
        }
    },
    {
        "data": {
            "source": "CHEM 345",
            "target": "CHEM 511"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 108"
        }
    },
    {
        "data": {
            "description": "Presentations of recent research in inorganic chemistry and related areas by external and internal speakers.",
            "id": "CHEM 900",
            "parent": "CHEM",
            "title": "SEMINAR-INORGANIC CHEMISTRY"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 361"
        }
    },
    {
        "data": {
            "description": "Basic principles for designing, developing, and using chemical instrumentation and applying these principles in the laboratory. Spectroscopy, separations, and mass spectrometry instruments are emphasized.",
            "id": "CHEM 524",
            "parent": "CHEM",
            "title": "CHEMICAL INSTRUMENTATION"
        }
    },
    {
        "data": {
            "source": "CBE 250",
            "target": "CBE 310"
        }
    },
    {
        "data": {
            "source": "CHEM 327",
            "target": "CHEM 329"
        }
    },
    {
        "data": {
            "source": "CBE 255",
            "target": "CBE 310"
        }
    },
    {
        "data": {
            "source": "CHEM 327",
            "target": "CHEM 524"
        }
    },
    {
        "data": {
            "description": "Theory of structural chemistry, experimental methods involved, applications to problems of chemical interest; use of diffractometric equipment and computer data analysis for an actual structure determination.",
            "id": "CHEM 613",
            "parent": "CHEM",
            "title": "CHEMICAL CRYSTALLOGRAPHY"
        }
    },
    {
        "data": {
            "description": "Lectures of a specialized nature in advanced analytical chemistry.",
            "id": "CHEM 630",
            "parent": "CHEM",
            "title": "SELECTED TOPICS IN ANALYTICAL CHEMISTRY"
        }
    },
    {
        "data": {
            "source": "CHEM 665",
            "target": "CHEM 562"
        }
    },
    {
        "data": {
            "description": "Principles of molecular structure and bonding applied to predict and explain the reactivity of aromatic systems, benzylic and allylic systems, aryl and vinyl halides, and carbonyl-containing compounds (e.g., ketones, carboxylic acids, esters, acid chlorides, amides). Emphasis placed on rationalizing the stereochemical and regiochemical outcome of chemical processes as well as arguing reaction outcomes from spectroscopic evidence.",
            "id": "CHEM 345",
            "parent": "CHEM",
            "title": "ORGANIC CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Basic chemical thermodynamics with applications to chemical and phase equilibria and the study of solutions; introduction to statistical mechanics and calculation of thermodynamic quantities from molecular models; stability and fluctuations.",
            "id": "CHEM 661",
            "parent": "CHEM",
            "title": "CHEMICAL AND STATISTICAL THERMODYNAMICS"
        }
    },
    {
        "data": {
            "description": "Vector spaces and linear transformations, differential calculus of scalar and vector fields, determinants, eigenvalues and eigenvectors, multiple integrals, line integrals, and surface integrals. Freshmen students are invited to enroll by the Department of Mathematics.",
            "id": "MATH 375",
            "parent": "MATH",
            "title": "TOPICS IN MULTI-VARIABLE CALCULUS AND LINEAR ALGEBRA"
        }
    },
    {
        "data": {
            "source": "CBE 310",
            "target": "CHEM 654"
        }
    },
    {
        "data": {
            "description": "Basic principles of quantum chemistry, exactly solvable problems, angular momentum, approximation methods, applications to electronic structure.",
            "id": "CHEM 675",
            "parent": "CHEM",
            "title": "INTRODUCTORY QUANTUM CHEMISTRY"
        }
    },
    {
        "data": {
            "source": "CHEM 561",
            "target": "CHEM 629"
        }
    },
    {
        "data": {
            "source": "CHEM 116",
            "target": "CHEM 665"
        }
    },
    {
        "data": {
            "description": "Molecular theory: quantum chemistry, molecular structure and spectra, statistical mechanics, selected topics in the molecular theory of matter in bulk.",
            "id": "CHEM 562",
            "parent": "CHEM",
            "title": "PHYSICAL CHEMISTRY II"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 329",
            "target": "CHEM 561"
        }
    },
    {
        "data": {
            "description": "Introduction to skills that support conducting research in chemistry.",
            "id": "CHEM 260",
            "parent": "CHEM",
            "title": "ENTERING RESEARCH I"
        }
    },
    {
        "data": {
            "description": "Presentations of recent research in analytical sciences and related areas by external and internal speakers.",
            "id": "CHEM 920",
            "parent": "CHEM",
            "title": "SEMINAR-ANALYTICAL CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Explores the properties, reactions and uses of elements and compounds, with emphasis on coordination chemistry of transition-metal ions, bioinorganic chemistry, solid-state structure and main-group elements. Introduces the synthesis and characterization of inorganic compounds.",
            "id": "CHEM 311",
            "parent": "CHEM",
            "title": "CHEMISTRY ACROSS THE PERIODIC TABLE"
        }
    },
    {
        "data": {
            "description": "Materials chemistry of inorganic solids. Focuses on the application of chemical concepts to an understanding of properties of solids and how these properties are manifested in practical applications.",
            "id": "CHEM 652",
            "parent": "CHEM",
            "title": "CHEMISTRY OF INORGANIC MATERIALS"
        }
    },
    {
        "data": {
            "description": "Focuses on the underlying principles and applications of spectroscopic and microscopy methods employed to solve biological problems at the atomic and molecular level. Techniques covered include electronic absorption and fluorescence spectroscopy, circular dichroism, light scattering, fluorescence microscopy, multidimensional nuclear magnetic resonance and electron spin resonance.",
            "id": "CHEM 668",
            "parent": "CHEM",
            "title": "BIOPHYSICAL SPECTROSCOPY"
        }
    },
    {
        "data": {
            "description": "A quantitative treatment of macroscopic phenomena including thermodynamics, chemical equilibria, solution behavior, electrochemistry, and chemical kinetics.",
            "id": "CHEM 116",
            "parent": "CHEM",
            "title": "CHEMICAL PRINCIPLES II"
        }
    },
    {
        "data": {
            "source": "CHEM 561",
            "target": "CHEM 654"
        }
    },
    {
        "data": {
            "description": "Biological Mass Spectrometry: Fundamentals and Applications.",
            "id": "CHEM 622",
            "parent": "CHEM",
            "title": "ORGANIC ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Introduction to modeling of chemical processes and introduction to using modern computational tools to analyze the models.",
            "id": "CBE 255",
            "parent": "CBE",
            "title": "INTRODUCTION TO CHEMICAL PROCESS MODELING"
        }
    },
    {
        "data": {
            "description": "Presentations and discussions of recently published research in chemical biology and related areas.",
            "id": "BIOCHEM/CHEM 945",
            "title": "SEMINAR-CHEMICAL BIOLOGY (ADVANCED)"
        }
    },
    {
        "data": {
            "description": "Principles of experimental physical chemistry applied to the acquisition and interpretation of basic data on molecular structure and dynamics, and properties of macromolecules; principles and use of spectroscopic and other electronic instrumentation.",
            "id": "CHEM 564",
            "parent": "CHEM",
            "title": "PHYSICAL CHEMISTRY LABORATORY II"
        }
    },
    {
        "data": {
            "description": "Emphasizes the symmetry, structure and bonding of inorganic compounds. Selected topics may include applications in transition metal chemistry, organometallic chemistry, industrial catalysis, advanced bioinorganic chemistry, solid-state chemistry or main group chemistry.",
            "id": "CHEM 511",
            "parent": "CHEM",
            "title": "ADVANCED INORGANIC CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Introduction to solid state materials chemistry, with an emphasis on contemporary topics in the chemistry of nanomaterials. Incorporates fundamental knowledge of solid-state chemistry and traditional materials chemistry with current nanoscale and nanostructural materials research.",
            "id": "CHEM 653",
            "parent": "CHEM",
            "title": "CHEMISTRY OF NANOSCALE MATERIALS"
        }
    },
    {
        "data": {
            "description": "Multi-step synthetic processes. Advanced experimental techniques such as high-vacuum distillation. Independent research projects.",
            "id": "CHEM 346",
            "parent": "CHEM",
            "title": "INTERMEDIATE ORGANIC CHEMISTRY LABORATORY"
        }
    },
    {
        "data": {
            "description": "Synthesis, purification, and characterization of compounds spanning the sub-disciplines of inorganic chemistry, including main-group, transition metal, bioinorganic, organometallic, and solid-state compounds. Laboratory skills developed include Schlenck techniques, glovebox methods, and high-temperature methods, all with an emphasis on chemical safety. Characterization methods may include UV-visible and IR spectroscopy, multi-nuclear NMR spectroscopy, magnetic susceptibility, cyclic voltammetry, mass spectrometry, X-ray diffraction, and chromatographic methods.",
            "id": "CHEM 512",
            "parent": "CHEM",
            "title": "ADVANCED SYNTHESIS AND LABORATORY TECHNIQUES"
        }
    },
    {
        "data": {
            "source": "CHEM 115",
            "target": "CHEM 260"
        }
    },
    {
        "data": {
            "description": "Synthesis of simple and complex organic compounds.",
            "id": "CHEM 841",
            "parent": "CHEM",
            "title": "ADVANCED ORGANIC CHEMISTRY"
        }
    },
    {
        "data": {
            "source": "CHEM 561",
            "target": "CHEM 509"
        }
    },
    {
        "data": {
            "description": "Selected topics in inorganic and organic chemistry. Emphasis is on relevance to biological, environmental and social issues.",
            "id": "CHEM 108",
            "parent": "CHEM",
            "title": "CHEMISTRY IN OUR WORLD"
        }
    },
    {
        "data": {
            "description": "A combination of recent literature and original research presentations relating to the use of single molecule techniques in biochemistry including fluorescence microscopy, tethered particle motion, patch-clamping, cryo-electron microscopy, optical trapping, magnetic tweezers, and super resolution microscopy.",
            "id": "BIOCHEM/CHEM 918",
            "title": "SINGLE MOLECULE APPROACHES TO BIOLOGY"
        }
    },
    {
        "data": {
            "source": "CHEM 116",
            "target": "CHEM 563"
        }
    },
    {
        "data": {
            "source": "CHEM 329",
            "target": "CBE 250"
        }
    },
    {
        "data": {
            "source": "CHEM 563",
            "target": "CHEM 564"
        }
    },
    {
        "data": {
            "description": "Stoichiometry and the mole concept, the behavior of gases, liquids and solids, thermochemistry, electronic structure of atoms and chemical bonding, descriptive chemistry of selected elements and compounds, intermolecular forces, and chemistry laboratory skills.",
            "id": "CHEM 103",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Introduction to the theory and practice of mass spectrometry. Topics include gas chromatography/mass spectrometry (GCMS), electrospray ionization (ESI), matrix assisted laser-desorption ionization (MALDI), liquid chromatography/mass spectrometry (LCMS), imaging mass spectrometry, and ion mobility mass spectrometry.",
            "id": "CHEM 738",
            "parent": "CHEM",
            "title": "INTRODUCTION TO MASS SPECTROMETRY"
        }
    },
    {
        "data": {
            "source": "CHEM 345",
            "target": "CBE/CHEM 505"
        }
    },
    {
        "data": {
            "description": "Presentations of recent research in physical chemistry and related areas by external and internal speakers.",
            "id": "CHEM 960",
            "parent": "CHEM",
            "title": "SEMINAR-PHYSICAL CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Fundamental and applied aspects of organotransition-metal chemistry, including structure and bonding, reactivity, and catalytic applications of organometallic complexes.",
            "id": "CHEM 714",
            "parent": "CHEM",
            "title": "ORGANOMETALLIC CHEMISTRY OF THE TRANSITION ELEMENTS"
        }
    },
    {
        "data": {
            "description": "Stoichiometry and the mole concept, chemical reactions, thermochemistry, electronic structure of atoms, periodic properties, chemical bonding, intermolecular forces, and the behavior of gases, liquids and solids. Equivalent to lecture-only part ofCHEM 103. Provides a mechanism for awarding credit for experiences with no laboratory component. The combination ofCHEM 101andCHEM 105is equivalent toCHEM 103.",
            "id": "CHEM 105",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY I"
        }
    },
    {
        "data": {
            "source": "CHEM 345",
            "target": "CHEM 346"
        }
    },
    {
        "data": {
            "description": "Cross-disciplinary exposure to cutting edge research in genomic sciences. Seminars presented by trainees and other scientists who study genomics using approaches based in chemistry, computer science, biostatistics, engineering and biological and biomedical sciences. Research objectives, findings and future directions are discussed.",
            "id": "CHEM 923",
            "parent": "CHEM",
            "title": "GENOMIC SCIENCES PROGRAM SEMINAR"
        }
    },
    {
        "data": {
            "source": "CBE 310",
            "target": "CHEM 629"
        }
    },
    {
        "data": {
            "description": "Critically read, analyze and discuss the primary literature in chemical biology by focusing on topics associated with macromolecules (largely proteins and nucleic acids).",
            "id": "CHEM 845",
            "parent": "CHEM",
            "title": "MACROMOLECULAR CHEMICAL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Principles and applications of chemical equilibrium, electrochemistry, thermodynamics, kinetics, organic chemistry and other topics that may include nuclear chemistry, biological chemistry and coordination chemistry. Equivalent to laboratory-only part ofCHEM 104. Provides a mechanism for awarding credit for experiences with no lecture component. The combination ofCHEM 102andCHEM 106is equivalent toCHEM 104.",
            "id": "CHEM 102",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY II LABORATORY"
        }
    },
    {
        "data": {
            "source": "CHEM 329",
            "target": "CHEM 524"
        }
    },
    {
        "data": {
            "source": "MATH 376",
            "target": "CBE 255"
        }
    },
    {
        "data": {
            "id": "CBE",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Quantum mechanics of molecular rotation and vibration; principles of group theory; electronic, vibrational, and magnetic resonance spectroscopy in gas and condensed phases.",
            "id": "CHEM 763",
            "parent": "CHEM",
            "title": "INTRODUCTION TO MOLECULAR SPECTROSCOPY"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "CHEM 115",
            "target": "CHEM 361"
        }
    },
    {
        "data": {
            "description": "Aspects of laboratory safety relating to chemical, electrical, optical, mechanical, cryogenic and radiological hazards will be discussed. Safety equipment, techniques (including first aid), and facilities will be introduced.",
            "id": "CHEM 607",
            "parent": "CHEM",
            "title": "LABORATORY SAFETY"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Presentations of recent research in organic chemistry and related areas by external and internal speakers.",
            "id": "CHEM 940",
            "parent": "CHEM",
            "title": "SEMINAR-ORGANIC CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Current spectroscopic methods employed in chemical analysis with applications in atomic and molecular absorption spectroscopy, infrared and Raman vibrational spectroscopy, fluorescence and light scattering; lecture and laboratory projects.",
            "id": "CHEM 623",
            "parent": "CHEM",
            "title": "EXPERIMENTAL SPECTROSCOPY"
        }
    },
    {
        "data": {
            "source": "CHEM 344",
            "target": "CHEM 605"
        }
    },
    {
        "data": {
            "description": "Various selected topics in contemporary inorganic chemistry.",
            "id": "CHEM 801",
            "parent": "CHEM",
            "title": "SELECTED TOPICS IN INORGANIC CHEMISTRY"
        }
    },
    {
        "data": {
            "source": "CHEM 562",
            "target": "CHEM 564"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 109"
        }
    },
    {
        "data": {
            "source": "CHEM 329",
            "target": "CHEM 327"
        }
    },
    {
        "data": {
            "description": "Mentored research for students completing a thesis in an Honors program.",
            "id": "CHEM 681",
            "parent": "CHEM",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "source": "CHEM 341",
            "target": "CHEM/MS&E 421"
        }
    },
    {
        "data": {
            "description": "Polymer classification, synthesis, and molecular architecture; solid state structure and characterization; glassy state and glass transition; polymer rheology in solids and gels; transport, dielectric and optical properties.",
            "id": "CHEM 654",
            "parent": "CHEM",
            "title": "MATERIALS CHEMISTRY OF POLYMERS"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 507",
            "target": "CHEM 665"
        }
    },
    {
        "data": {
            "description": "Various selected topics in contemporary macromolecular or biophysical chemistry.",
            "id": "BIOCHEM/CHEM 872",
            "title": "SELECTED TOPICS IN MACROMOLECULAR AND BIOPHYSICAL CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Chemical instrumentation and instrumental methods of analysis.",
            "id": "CHEM 721",
            "parent": "CHEM",
            "title": "INSTRUMENTAL ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Learn and apply the principles of analog and digital electronics and computer interfaces for controlling and monitoring components of importance to chemical instrumentation.",
            "id": "CHEM 728",
            "parent": "CHEM",
            "title": "ELECTRONICS FOR CHEMICAL INSTRUMENTATION"
        }
    },
    {
        "data": {
            "source": "CHEM 561",
            "target": "CHEM 653"
        }
    },
    {
        "data": {
            "source": "CHEM 561",
            "target": "CHEM 562"
        }
    },
    {
        "data": {
            "description": "Structure, thermodynamics, kinetics, and reactivity of molecules at the interfaces between gases, liquids and solids, with applications to catalysis, atmospheric chemistry, monolayers, and thin films.",
            "id": "CHEM 777",
            "parent": "CHEM",
            "title": "PHYSICAL CHEMISTRY OF SURFACES"
        }
    },
    {
        "data": {
            "description": "An in-depth introduction to the use of machine learning techniques in Chemistry. Topics will include basics of probability theory and statistics, basics of function fitting and parameter inference, basics of optimization, and machine learning techniques. Discuss a selection of Chemistry topics that are particularly amenable to analysis using machine learning. These might include generative models for organic synthesis, force-fields, application to phase transitions, structure and dynamics of molecular systems, and AI-driven drug discovery.",
            "id": "CHEM 361",
            "parent": "CHEM",
            "title": "MACHINE LEARNING IN CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "An introduction to chemistry education research and the theories that underpin it. Develop and refine models of learning on the basis of primary literature. Explore how theories of cognition could and should inform learning objectives and assessments in college chemistry learning environments. Substantial emphasis placed on critically reading and analyzing studies in the chemistry education research literature with an eye toward the implicit and explicit theories of cognition informing the work.",
            "id": "CHEM 758",
            "parent": "CHEM",
            "title": "CHEMISTRY EDUCATION RESEARCH"
        }
    },
    {
        "data": {
            "description": "Advanced methods of nuclear magnetic resonance (NMR) spectroscopy.",
            "id": "CHEM 637",
            "parent": "CHEM",
            "title": "TOPICS IN CHEMICAL INSTRUMENTATION: ADVANCED METHODS IN NMR"
        }
    },
    {
        "data": {
            "description": "Research discussions facilitated by individual faculty members and occurring between all members of the research group.",
            "id": "CHEM 980",
            "parent": "CHEM",
            "title": "SEMINAR: REVIEW OF CURRENT RESEARCH"
        }
    },
    {
        "data": {
            "description": "Various selected topics in contemporary organic chemistry.",
            "id": "CHEM 840",
            "parent": "CHEM",
            "title": "ADVANCED TOPICS IN ORGANIC CHEMISTRY"
        }
    },
    {
        "data": {
            "source": "CHEM 311",
            "target": "CHEM 653"
        }
    },
    {
        "data": {
            "description": "An introduction to the invention of processes for the large scale, low cost processing of materials such as water, chemicals, petroleum products, food, drugs and wastes.",
            "id": "CBE 250",
            "parent": "CBE",
            "title": "PROCESS SYNTHESIS"
        }
    },
    {
        "data": {
            "source": "CHEM 563",
            "target": "CHEM 509"
        }
    },
    {
        "data": {
            "description": "Mentored research for students completing a senior thesis.",
            "id": "CHEM 691",
            "parent": "CHEM",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Oral presentations on thesis research at the chemistry-biology interface. Includes discussions of reproducibility, rigor, and the responsible conduct of research.",
            "id": "CHEM 890",
            "parent": "CHEM",
            "title": "HIGHLIGHTS AT THE CHEMISTRY-BIOLOGY INTERFACE"
        }
    },
    {
        "data": {
            "description": "Mentored research for students completing a thesis in an Honors program.",
            "id": "CHEM 682",
            "parent": "CHEM",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 343"
        }
    },
    {
        "data": {
            "description": "Introduces organic laboratory techniques in synthesis, purification and spectral interpretation.",
            "id": "CHEM 342",
            "parent": "CHEM",
            "title": "ELEMENTARY ORGANIC CHEMISTRY LABORATORY"
        }
    },
    {
        "data": {
            "description": "Various selected topics in contemporary physical chemistry.",
            "id": "CHEM 860",
            "parent": "CHEM",
            "title": "SELECTED TOPICS IN PHYSICAL CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Scientific integrity and professional behavior in the chemical sciences.  Topics include conflict of interest, human and animal subjects in research, mentor and mentee responsibilities, collaborative research, peer review, data acquisition and management, research misconduct, responsible authorship and publication, and societal impacts.",
            "id": "CHEM 701",
            "parent": "CHEM",
            "title": "RESPONSIBLE CONDUCT OF RESEARCH IN THE CHEMICAL SCIENCES"
        }
    },
    {
        "data": {
            "description": "Macroscopic theory:  laws and fundamental equations of thermodynamics, chemical equilibria, phase equilibria, and kinetic theory of gases.",
            "id": "CHEM 561",
            "parent": "CHEM",
            "title": "PHYSICAL CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Study abroad equivalency for intermediate chemistry. Enrollment in a UW-Madison resident study abroad program.",
            "id": "CHEM 355",
            "parent": "CHEM",
            "title": "STUDY ABROAD IN INTERMEDIATE CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "An introduction to computational chemistry. Covers new techniques and developments in the literature, and specific types of calculations that are relevant to current research and needs.",
            "id": "CHEM 635",
            "parent": "CHEM",
            "title": "TOPICS IN COMPUTATIONAL CHEMISTRY"
        }
    },
    {
        "data": {
            "source": "CHEM 344",
            "target": "CHEM 346"
        }
    },
    {
        "data": {
            "description": "Descriptive inorganic chemistry, organometallic chemistry of main-group elements, and organosilicon chemistry.",
            "id": "CHEM 713",
            "parent": "CHEM",
            "title": "INORGANIC AND ORGANOMETALLIC CHEMISTRY OF THE MAIN GROUP ELEMENTS"
        }
    },
    {
        "data": {
            "description": "Synthesize and integrate advanced chemistry knowledge and skills. Through a series of seminars, specific research problems will be identified. Work in groups utilizing the chemical literature to identify routes to the solutions of these problems.",
            "id": "CHEM 509",
            "parent": "CHEM",
            "title": "SENIOR SEMINAR"
        }
    },
    {
        "data": {
            "description": "Fundamental concepts in organic chemistry reactions and mechanisms.",
            "id": "CHEM 843",
            "parent": "CHEM",
            "title": "ADVANCED ORGANIC CHEMISTRY"
        }
    },
    {
        "data": {
            "source": "CHEM 115",
            "target": "CHEM 116"
        }
    },
    {
        "data": {
            "source": "CHEM 345",
            "target": "CHEM 654"
        }
    },
    {
        "data": {
            "description": "Mentored research project as arranged with a faculty or academic staff member.",
            "id": "CHEM 299",
            "parent": "CHEM",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Various selected topics in contemporary chemistry education.",
            "id": "CHEM 858",
            "parent": "CHEM",
            "title": "SPECIAL TOPICS IN CHEMISTRY EDUCATION"
        }
    },
    {
        "data": {
            "description": "Research supervised by individual faculty members.",
            "id": "CHEM 990",
            "parent": "CHEM",
            "title": "RESEARCH"
        }
    },
    {
        "data": {
            "description": "Chemistry of biological materials, intermediary metabolism and protein structure.",
            "id": "BIOCHEM 507",
            "parent": "BIOCHEM",
            "title": "GENERAL BIOCHEMISTRY I"
        }
    },
    {
        "data": {
            "source": "CBE 250",
            "target": "CBE 255"
        }
    },
    {
        "data": {
            "description": "Applications of quantum mechanics to the electronic structure and properties of molecules.",
            "id": "CHEM 775",
            "parent": "CHEM",
            "title": "ELECTRONIC STRUCTURE OF MOLECULES"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 311"
        }
    },
    {
        "data": {
            "description": "Structure, thermodynamics, and dynamics of polymers in solution and in the bulk; theoretical models and experimental methods; polymer characterization.",
            "id": "CHEM 664",
            "parent": "CHEM",
            "title": "PHYSICAL CHEMISTRY OF MACROMOLECULES"
        }
    },
    {
        "data": {
            "source": "CHEM 665",
            "target": "CHEM 561"
        }
    },
    {
        "data": {
            "description": "Origin, nature, classification, and description of intermolecular forces. The hydrophobic effect. Molecular complexes, binding constants, and their measurements. General principles of self-assembly, molecular recognition, complex formation, host design. Supramolecular systems and their dynamics. Micelles, bilayers, vesicles, biological membranes.",
            "id": "CHEM/PHMSCI 766",
            "title": "MOLECULAR RECOGNITION"
        }
    }
]