[
    {
        "data": {
            "description": "An examination of Latinx women's lives, experiences, and activism through the lens of testimonio, life histories, and feminist writings rooted in social justice movements and critical pedagogies.",
            "id": "CHICLA/GEN&WS/GEOG 308",
            "title": "LATINX FEMINISMS: WOMEN'S LIVES, WORK, AND ACTIVISM"
        }
    },
    {
        "data": {
            "description": "Introduction to histories of places that have been called the American West, focusing on the period since 1850. Beginning in the mid nineteenth century, the United States sought to establish power over vast western regions that it claimed on maps but did not in fact control. Moving through the twentieth century to the present day, considers how attention to the American West allows us to reimagine US history more broadly - and how the United States represents just one facet the region's pasts. Learn to think like a historian by analyzing primary sources, evaluating competing narratives, and formulating arguments about the past. Investigate how people, ideas, and infrastructures have transformed a region repeatedly redrawn and consider the ongoing legacies of the past - and the stories we tell about it - in the American West today.",
            "id": "CHICLA/HISTORY 152",
            "title": "THE UNITED STATES WEST SINCE 1850"
        }
    },
    {
        "data": {
            "description": "A critical examination of US-Latin American relations from the colonial era to the present, tracing the emergence and evolution of the United States as a hemispheric and global power and its political and economic impact on Latin America. Primary attention will be focused on US relations with Mexico, Central America and the Caribbean, but other Latin American countries will figure prominently during certain episodes.",
            "id": "CHICLA/HISTORY/LACIS/POLISCI 268",
            "title": "THE U.S. & LATIN AMERICA FROM THE COLONIAL ERA TO THE PRESENT: A CRITICAL SURVEY"
        }
    },
    {
        "data": {
            "description": "A historical introduction to the Puerto Rican experience, from island to mainland. Varieties of colonial rule, social institutions, cultural processes, and ethnic and national identity. Migration to the U.S. and social dynamics of stateside communities.",
            "id": "CHICLA/HISTORY 435",
            "title": "COLONY, NATION, AND MINORITY: THE PUERTO RICANS' WORLD"
        }
    },
    {
        "data": {
            "description": "A study of immigration, crime, and border enforcement, engaging both historical and present-day debates, focusing on Latino immigration and the U.S.-Mexico border.",
            "id": "CHICLA/LEGALST/SOC 443",
            "title": "IMMIGRATION, CRIME, AND ENFORCEMENT"
        }
    },
    {
        "data": {
            "description": "Addresses how members of Latinx communities have used writing for both personal and social change.  Develop a deeper understanding of the political, family, and school contexts in which Latinx peoples in the United States write and read.",
            "id": "CHICLA/CURRIC 306",
            "title": "LATINX LITERACIES"
        }
    },
    {
        "data": {
            "description": "Addresses the ways Chican@s/Latin@s in contemporary U.S. society have engaged in social, cultural, political, and ideological struggles for educational justice. Begins with a broad overview of educational issues and examines major social movements, legal cases, and local and national efforts that have established important precedents. Focus on different enactments of resistance, struggle, resilience, self-determination, and educational justice and focus on how these precedents and enactments pertain to teaching, learning, and curriculum practices that reflect key tenets of educational justice for Chican@/Latin@ students.",
            "id": "CHICLA/CURRIC 321",
            "title": "CHICANO/LATINO EDUCATIONAL JUSTICE"
        }
    },
    {
        "data": {
            "description": "Advanced independent research, readings or projects mentored by faculty.",
            "id": "CHICLA 699",
            "parent": "CHICLA",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Advanced language practice, including intensive writing and work in pertinent areas of grammar and stylistics.",
            "id": "SPANISH 311",
            "parent": "SPANISH",
            "title": "ADVANCED LANGUAGE PRACTICE"
        }
    },
    {
        "data": {
            "description": "An examination of ethnicity, race, and justice, with a specific emphasis on US Latinos, the largest minority group in the United States.",
            "id": "CHICLA/LEGALST/SOC 440",
            "title": "ETHNICITY, RACE, AND JUSTICE"
        }
    },
    {
        "data": {
            "description": "An examination of specific themes in Chicano/a life, ways and culture, with readings drawn primarily from fields related to education, social service, and applied social science.",
            "id": "CHICLA 329",
            "parent": "CHICLA",
            "title": "EDUCATION AND SERVICE TOPICS IN CHICANA/O & LATINA/O STUDIES"
        }
    },
    {
        "data": {
            "description": "An examination of specific themes in Chicano/a life, ways and culture. Topics may include border culture, Chicano/a ethnicity and identity, and Mexican immigration to the United States.",
            "id": "CHICLA 330",
            "parent": "CHICLA",
            "title": "TOPICS IN CHICANO/A STUDIES"
        }
    },
    {
        "data": {
            "description": "An introduction to reading and analyzing literary works, with special emphasis on development of oral and written skills for the discussion of literature. Concentration on methods of analyzing basic literary forms, conventions, genres, and representative short texts in Spanish.",
            "id": "SPANISH 224",
            "parent": "SPANISH",
            "title": "INTRODUCTION TO HISPANIC LITERATURES"
        }
    },
    {
        "data": {
            "description": "Analysis of Latina and Latino popular culture to consider the varied make-up of Latinos, their specific histories, social dynamics and politics through their creative expressions, performances and cultural contestations. Covers key terms and concepts, cultural developments, and diverse interpretations while focusing in the analysis of Latinx music, performance art, film and media, sports, food, and car culture. Other topics include the production, circulation and reception of Latinx popular culture, the use of Spanish and English languages, issues of identity, migration and interculturality, the role of the cultural industry, and the context of globalization. Broadly explores the intersectionality of race, ethnicity, class, gender, sexuality, and nation regarding Latinos. Taught in Spanish.",
            "id": "CHICLA/SPANISH 364",
            "title": "SURVEY OF LATINO AND LATINA POPULAR CULTURE"
        }
    },
    {
        "data": {
            "description": "Chicanxs and Latinxs are frequently imagined in ways that erase the history, presence, and influence of African-descended peoples within these groups. However, this anti-Blackness does not go unanswered in Chicanx and Latinx cultural production. Covers literature, life-writing/autoethnography, visual culture, philosophy/theory, and history that takes up Black Latinx experience and/or that comparatively explores the African American and Latinx convergences, exploring a rich vein of thought and representation in U.S. literatures that is often more transamerican than American and that offers new definitions of both Latinx and Black. Readings on racial paradigms in the Americas, paying attention to the differences between US and Latin American contexts, as well readings on decoloniality, intersectional feminisms, borderlands, and diaspora.",
            "id": "CHICLA/ENGL 460",
            "title": "BLACK AND LATINX IN LITERATURE AND VISUAL CULTURE"
        }
    },
    {
        "data": {
            "description": "Critical and historical survey of the participation and representation of Latino/as in U.S. film, television, and popular culture, with a primary focus on Hispanic representation in Hollywood-produced imagery. The counter-images of Latino and Latina media producers also will be explored.",
            "id": "CHICLA/COMARTS 419",
            "title": "LATINO/AS AND MEDIA"
        }
    },
    {
        "data": {
            "description": "Develop an understanding of immigrant health in the United States from the perspective of social and structural determinants. Applies concepts to a comprehensive framework for the development of health. Describes health assets and risks for specific vulnerable immigrant groups, such as women, children, and undocumented individuals and mixed immigration status families. Provides guidelines for improving immigrant access to quality health care, including language services, provider competence, policy and organizational supports, and community-based collaboration, advocacy, and research.",
            "id": "CHICLA/COUNPSY 331",
            "title": "IMMIGRANT HEALTH AND WELLBEING"
        }
    },
    {
        "data": {
            "description": "Drawing from cultural studies, border studies and/or critical race theory, this course explores through cultural and literary texts the social and political issues regarding migration, contact zones, transculturation, and/or diaspora.",
            "id": "CHICLA/SPANISH 478",
            "title": "BORDER AND RACE STUDIES IN LATIN AMERICA"
        }
    },
    {
        "data": {
            "description": "Drawing from cultural studies, border studies, migration and race theory, explores through cultural and literary texts the social and political issues regarding migration, contact zones, transculturation, and/or diaspora. Considers the various meanings of the word \"border\" or \"frontera\". What is a border geographically speaking? What does it mean in political and legal terms? How do we conceive the border in cultural, literary, linguistic, political, judicial, and personal ways? What is like to live on the border or on the margins? It is said that the border is a contact zone, a meeting point, a way to transfer and share information, an invitation to (in)tolerance and ex/inclusion. Read texts from history, politics, cultural anthropology, literature, and theatre to grasp the vast understanding of what is life on the border. Focus on the humanities, paying close attention to how visual artists (theater, performance, documentaries) understand and confront life on the border.",
            "id": "CHICLA/SPANISH 215",
            "title": "BORDER AND MIGRATION STUDIES OF LATINX AMERICA"
        }
    },
    {
        "data": {
            "description": "Examines educational inequality across the Americas through the lens of imperialism, different forms of colonialism, and capitalism. By exploring the logics and actions of different education stakeholders, critically examine how educational policy across the hemisphere has a shared history of oppression and contestation.",
            "id": "CHICLA/EDPOL/LACIS 342",
            "title": "EDUCATION ACROSS THE AMERICAS: EMPIRE, CAPITALISM, AND RESISTANCE"
        }
    },
    {
        "data": {
            "description": "Examines the construction of whiteness in the United States from the colonial period to the present with an eye to the ways in which Chicanx  Latinx communities have engaged with whiteness. Learn and apply a variety of relevant racial theories to historical cases, exploring the process of racialization through specific racial projects in time and space. Evaluate theories about identity, citizenship, and justice that influence contemporary anti-racist praxis and develop writing skills through essays that take positions on debates within Chicanx  Latinx studies.",
            "id": "CHICLA 315",
            "parent": "CHICLA",
            "title": "RACIAL FORMATION AND WHITENESS"
        }
    },
    {
        "data": {
            "description": "Examines the historical, social, and legal experiences of Latinas/Latinos/Latinxs in the US since the mid-1800s with emphasis on Mexican migrations. Latinxs became an important part of the US population through western expansion, conquest, and immigration. We will learn about the 3 main Latinx groups in the US: Mexicans, Puerto Ricans, and Cubans, but will also learn about other Latinx communities. We begin with an examination of conquest by studying the Treaty of Guadalupe Hidalgo that annexed roughly half of former Mexican territory and the Spanish-American War that resulted in the possession of Puerto Rico. Then, we examine the history of Latinx immigration to understand the experiences of Mexicans, Central Americans, South Americans, and people from the Caribbean who have immigrated to the US in search of economic opportunities and political asylum. This course serves as an introduction to the varied experiences of Latinxs in the US in order to understand their unique histories.",
            "id": "CHICLA/HISTORY 153",
            "title": "LATINA/LATINO/LATINX HISTORY"
        }
    },
    {
        "data": {
            "description": "Examines the history of the making of a people from pre-hispanic time to the present. Examines how people of Mexican and Latin American descent in the United States have come to think of themselves as constituting a collectivity by examining the social, cultural, and political worlds of Chicana/os and Latina/os.",
            "id": "CHICLA 301",
            "parent": "CHICLA",
            "title": "CHICANA/O AND LATINA/O HISTORY"
        }
    },
    {
        "data": {
            "description": "Explores Chicana/o and Latina/o social movement participation and collective action from the 1940s to the contemporary moment. Using interdisciplinary scholarship and mixed media, analyze paradigms, theories, and debates pertaining to the historical and contemporary economic, cultural, and sociopolitical dimensions of the Latina/o position in the United States.  Focuses on social movements and collective action (rooted in labor, community, civil and human rights organizing) and the topics of race and racialization, power and powerlessness, migration, community development, and gender.   Compares the experiences of different Latin@ groups.",
            "id": "CHICLA 501",
            "parent": "CHICLA",
            "title": "CHICAN@ AND LATIN@ SOCIAL MOVEMENTS IN THE U.S."
        }
    },
    {
        "data": {
            "description": "Explores feminist activism in the United States, Canada, the Caribbean, and Latin America. Feminist activism, broadly construed, will be explored through ethnography, interviews, documentaries, public facing scholarship, among other forms of intellectual production. Applies transdisciplinary perspectives to consider work from a range of academic fields and topics to understand the major political, economic, and social issues framing feminist social movements across the Americas.",
            "id": "CHICLA/GEN&WS 334",
            "title": "FEMINIST SOCIAL MOVEMENTS ACROSS THE AMERICAS"
        }
    },
    {
        "data": {
            "description": "Explores the contestation of ongoing histories of injustice, exclusion, and raciolinguistic hierarchies across science, mathematics, and environmental education. Scholarship from Chicane/Latine Studies, raciolinguistic perspectives, and post/de/anticolonial studies will be examined to critically analyze these school subjects and related hierarchies of knowing, languaging, and being. Applies transdisciplinary perspectives to consider how students, educators, and community activists have challenged those hierarchies and worked to repurpose science, mathematics, and environmental pedagogies toward aims of linguistic, racial, educational, and environmental justice.",
            "id": "CHICLA/CURRIC 354",
            "title": "RACE AND LANGUAGE IN STEM AND ENVIRONMENTAL EDUCATION"
        }
    },
    {
        "data": {
            "description": "Explores the history of places that have been called the American West before 1850. We start with Indigenous occupation; continue with European invasion and the creation of two new nations, Mexico and the U.S.; and end with U.S. conquest. We watch Indian lands becoming the object of Spanish, French, and English empires, and then see European incursions giving way to the hopes of new nation-states and newly empowered Indian peoples like Lakotas and Comanches. After studying the trails and trades that brought newcomers west, we reach key converging events: U.S. seizure of the Mexican North, resolution of the Oregon boundary dispute, discovery of western gold, West Coast arrival of Chinese immigrants, and Mormon exodus to the Great Basin. We use economic, environmental, political, cultural, and social analyses, and we attend to the dreams of many westerners: of North American, Latin American, European, African, and Asian origin or descent, and of all genders and class statuses.",
            "id": "CHICLA/HISTORY 151",
            "title": "THE NORTH AMERICAN WEST TO 1850"
        }
    },
    {
        "data": {
            "description": "Explores the multiracial and multicultural reality of Latina societies by becoming familiar with the history and cultures of Chicana, Cuban-American, and Puerto Rican women. Interdisciplinary readings in law, journalism, public policy, history, and self-reflective literature.",
            "id": "CHICLA/GEN&WS 332",
            "title": "LATINAS: SELF IDENTITY AND SOCIAL CHANGE"
        }
    },
    {
        "data": {
            "description": "Focuses on the cultural evolution of Chicanos, Puerto Ricans, Cuban-Americans, and other U.S. Latinos in relation to their countries of origin. Topics vary.",
            "id": "CHICLA/SPANISH 469",
            "title": "TOPICS IN LATINX CULTURE"
        }
    },
    {
        "data": {
            "description": "Focuses on the interplay between schools and society by examining societal and cultural influences on school processes, policies, practices, and pedagogy; or, how society shapes schooling, and conversely, the ways in which schools assist in shaping society. Reflect on the purposes of schools and how these purposes have shifted over time. Examines how assumptions regarding the purposes of schooling interact with debates over how we teach, what we teach, and how we evaluate schools, teachers, and students. Identify the foundations of education in the United States and critically examine the ways in which educational practices and policies impact the lives of students.",
            "id": "EDPOL 300",
            "parent": "EDPOL",
            "title": "SCHOOL AND SOCIETY"
        }
    },
    {
        "data": {
            "description": "Historical, political, and aesthetic roots and directions of Latin@ and Chican@ short stories, novels, poetry, music, plays, films, and essays.",
            "id": "CHICLA/ENGL 368",
            "title": "CHICANA/O AND LATINA/O LITERATURES"
        }
    },
    {
        "data": {
            "description": "Intensive practice in reading, writing, and grammar.",
            "id": "SPANISH 226",
            "parent": "SPANISH",
            "title": "INTERMEDIATE LANGUAGE PRACTICE WITH EMPHASIS ON WRITING AND GRAMMAR"
        }
    },
    {
        "data": {
            "description": "Introduces students to social and demographic analysis and explanations of the historical and present day causes and consequences of migration of the largest immigrant group to the United States in the 20th century.",
            "id": "CHICLA/SOC 470",
            "title": "SOCIODEMOGRAPHIC ANALYSIS OF MEXICAN MIGRATION"
        }
    },
    {
        "data": {
            "description": "Introduces the cultural, economic, social, and political history of Chicanas and Latinas in the U.S. and focuses on four major themes: contact between different ethnic/racial groups; ideas of nation and nationalism; constructions of identity; and struggles for social justice.",
            "id": "CHICLA/GEN&WS/HISTORY 245",
            "title": "CHICANA AND LATINA HISTORY"
        }
    },
    {
        "data": {
            "description": "Introduction to comparative ethnic studies, examining race, ethnicity, and indigeneity within the United States. Includes perspectives from African American, American Indian, Asian American, and Chican@ and Latin@ studies.",
            "id": "AFROAMER/AMERIND/ASIANAM/CHICLA/FOLKLORE 102",
            "title": "INTRODUCTION TO COMPARATIVE US ETHNIC AND AMERICAN INDIAN STUDIES"
        }
    },
    {
        "data": {
            "description": "Introduction to the changing images of race and ethnicity in U.S. entertainment media and popular culture.  Surveys history, key concepts and contemporary debates regarding mediated representation of ethnic minorities. Critical and cultural studies approaches are emphasized.",
            "id": "CHICLA/COMARTS 347",
            "title": "RACE, ETHNICITY, AND MEDIA"
        }
    },
    {
        "data": {
            "description": "Introduction to the cultural worlds of Chicana/os and Latina/os in the U.S. Examines how diverse peoples came to understand themselves as members of a racial, ethnic, and cultural community by exploring the production of music, art, theater, film, television, and literature.",
            "id": "CHICLA 210",
            "parent": "CHICLA",
            "title": "CHICANA/O AND LATINA/O CULTURAL STUDIES"
        }
    },
    {
        "data": {
            "description": "Introduction to the development and implementation of community-engaged research and programming for Latine populations with \"Esperanza,\" an innovative university-community partnership with Centro Hispano of Dane County. Community-engaged research draws on interdisciplinary research and practice across education, psychology and public health that seeks to disrupt, mitigate, and eliminate mental health disparities among local Latine populations. Learn the principles of community-engaged research and apply them through the development of mutually beneficial, reciprocal, effective, equitable, and justice-oriented community-university projects.",
            "id": "CHICLA/COUNPSY 590",
            "title": "ESPERANZA COMMUNITY-ENGAGED RESEARCH WITH LATINES"
        }
    },
    {
        "data": {
            "description": "Introduction to the interdisciplinary study of Chicanas/os in the United States. Become acquainted with recent scholarly literature, paradigms, theories, and debates within Chicana/o studies pertaining to the historical, economic, cultural, and sociopolitical dimensions of the Chicana/o experience in the United States.",
            "id": "CHICLA 201",
            "parent": "CHICLA",
            "title": "INTRODUCTION TO CHICANA/O AND LATINA/O STUDIES"
        }
    },
    {
        "data": {
            "description": "Introduction to the issues which shape the national cultures and the cultural practices of the Hispanic world. Emphasis on diversity, emergence of new imagined communities, cultural hybridity, and social movements within a historical framework.",
            "id": "SPANISH 223",
            "parent": "SPANISH",
            "title": "INTRODUCTION TO HISPANIC CULTURES"
        }
    },
    {
        "data": {
            "description": "Introductory independent research, readings or projects mentored by faculty.",
            "id": "CHICLA 299",
            "parent": "CHICLA",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Offers an introduction to the culture and history of the Mexican and Latin American origin people in the United States. Emphasis on diversity, emergence of new imagined communities, and cultural hybridity. Focusing on key issues such as U.S. imperial expansion, colonialism, nation and community formations, migration, urban spaces, and the dynamics of race, class, gender, ethnicity, and sexuality, study a range of socio-political, historical, literary, and artistic expressions that inform the whole process of culture and reveal the way Latinos and Latinas negotiate their presence, cultural difference, and creativity in the U.S.",
            "id": "CHICLA/SPANISH 222",
            "title": "INTRODUCTION TO LATINX CULTURES"
        }
    },
    {
        "data": {
            "description": "Provides a critical examination of the history of labor and working people in the Americas, from the colonial era to the present. It focuses on the experience of the United States and Mexico, offering a comparative perspective on their distinct but also shared (and increasingly linked) histories. The seminar proceeds chronologically, highlighting major episodes in the evolution of labor systems in the two countries, beginning with the colonial labor systems implemented by the Spanish and British empires following the European conquest of the Western Hemisphere. Among other topics, we will examine the pivotal role of slavery and other forms of forced labor, the impact of the industrial revolution, the emergence and expansion of corporate capitalism and the labor unrest it provoked in the post-civil war U.S., the role of labor in the Mexican Revolution and its aftermath, the impact of the Great Depression and labor incorporation on the post-WWII social and political order of both countries, the breakdown of that order and the move to neo-liberalism in the 1970s and 1980s, and the emergence of an increasingly integrated North American production system and its consequences for labor and working people on both sides of the US-Mexico border.",
            "id": "CHICLA/HISTORY/LACIS/POLISCI 355",
            "title": "LABOR IN THE AMERICAS: US & MEXICO IN COMPARATIVE & HISTORICAL PERSPECTIVE"
        }
    },
    {
        "data": {
            "description": "Provides training for students who aspire to one of the helping, health, or mental health professions and who currently work or who envision themselves working with Latin@ populations. Provides important frameworks for working with Latin@s, including cultural, spiritual, linguistic and historical features relevant to this population and begin to apply their knowledge in service learning placements.",
            "id": "CHICLA/COUNPSY 525",
            "title": "DIMENSIONS OF LATIN@ MENTAL HEALTH SERVICES"
        }
    },
    {
        "data": {
            "description": "Race, ethnicity, and religion as political factors; cultural pluralism, politics, and policy in the United States and selected other multi-cultural politics.",
            "id": "CHICLA/POLISCI 231",
            "title": "POLITICS IN MULTI-CULTURAL SOCIETIES"
        }
    },
    {
        "data": {
            "description": "Students will examine the historical, social, political, economic, and cultural experiences and conditions of Latinos, one of the largest US racial/ethnic minority groups. Course focus is on people who trace their origins to Mexico, the Caribbean, and countries of Latin America.",
            "id": "CHICLA/HISTORY/POLISCI 422",
            "title": "LATINO HISTORY AND POLITICS"
        }
    },
    {
        "data": {
            "description": "Study and reflect on Latinx unequal access to media and the political and social context of media in Latinx communities. Develop research, writing, editing and copyediting, collaboration, and project management skills while contributing to Latinx Studies research. Create content for such online outlets as Latinx Talk, La Bloga, Latinx Project, Wikipedia and UW-Madison publications.",
            "id": "CHICLA 520",
            "parent": "CHICLA",
            "title": "LATINX DIGITAL PUBLICS"
        }
    },
    {
        "data": {
            "description": "Study the literature of Latinos and Latinas in the United States, particularly of writers of Mexican, Puerto Rican, Cuban, Dominican and Central American descent. Examines the impact of race and how individuals and communities negotiate situations of internal colonialism, migration, generational conflicts, tensions between assimilation and cultural preservation, gender roles, literary traditions, and transnational situations. Considers the linguistic, cultural and formal singularity of Latinx literature, the use of Spanish and English languages, the advent of feminist and queer writing, and the vision of the United States in their works regarding its past, its present and its future. Explores the intersectionality of race, ethnicity, class, gender, sexuality, and literary forms. Diverse theories and ways to read literary texts will be explored. Literary texts - novels, short stories, poetry and essays - will be read in English or Spanish, or a combination of both. Taught in Spanish",
            "id": "CHICLA/SPANISH 467",
            "title": "US LATINO LITERATURE"
        }
    },
    {
        "data": {
            "description": "This class examines the major problems and issues in Mexican-American politics since World War II. An emphasis will be placed on the ways in which race, class and culture have structured politics for the Mexican origin people. Not open to students with credit for POLI SCI 464 prior to fall 2017",
            "id": "CHICLA/POLISCI 302",
            "title": "MEXICAN-AMERICAN POLITICS"
        }
    },
    {
        "data": {
            "description": "Topics in Chicano/a Studies: An examination of specific themes in Chicano/a life, ways and culture, with readings drawn primarily from the arts and humanities.",
            "id": "CHICLA 328",
            "parent": "CHICLA",
            "title": "CULTURES AND HISTORIES TOPICS IN CHICANA/O & LATINA/O STUDIES"
        }
    },
    {
        "data": {
            "description": "Topics vary each semester, but may include history, literature, media, political science, culture, social work, etc., as they relate to Chicana/os and Latina/os in the United States.",
            "id": "CHICLA 530",
            "parent": "CHICLA",
            "title": "ADVANCED TOPICS IN CHICANA/O AND LATINA/O STUDIES"
        }
    },
    {
        "data": {
            "description": "Urban design in the 21st century American city explores a new understanding of urban placemaking and development. Explores the intersections of culture, place, and design to critically address how the socioeconomic dynamics that underlie demographic shifts in the U.S. are influencing urban change in the American landscape. Focuses on the evolution and ways by which Latinos shape the built environment, both in the public realm and in the home.",
            "id": "CHICLA/LANDARC 475",
            "title": "LATINO URBANISM: DESIGN AND ENGAGEMENT IN THE AMERICAN CITY"
        }
    },
    {
        "data": {
            "id": "CHICLA",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "EDPOL",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "SPANISH",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "CHICLA 201",
            "target": "CHICLA 501"
        }
    },
    {
        "data": {
            "source": "CHICLA 201",
            "target": "CHICLA 520"
        }
    },
    {
        "data": {
            "source": "CHICLA 201",
            "target": "CHICLA/LEGALST/SOC 440"
        }
    },
    {
        "data": {
            "source": "CHICLA 201",
            "target": "CHICLA/LEGALST/SOC 443"
        }
    },
    {
        "data": {
            "source": "CHICLA 201",
            "target": "CHICLA/SOC 470"
        }
    },
    {
        "data": {
            "source": "CHICLA 210",
            "target": "CHICLA/SOC 470"
        }
    },
    {
        "data": {
            "source": "CHICLA/COUNPSY 525",
            "target": "CHICLA/COUNPSY 590"
        }
    },
    {
        "data": {
            "source": "CHICLA/SPANISH 215",
            "target": "CHICLA/SPANISH 478"
        }
    },
    {
        "data": {
            "source": "CHICLA/SPANISH 222",
            "target": "CHICLA/SPANISH 469"
        }
    },
    {
        "data": {
            "source": "CHICLA/SPANISH 222",
            "target": "CHICLA/SPANISH 478"
        }
    },
    {
        "data": {
            "source": "CHICLA/SPANISH 364",
            "target": "CHICLA/SPANISH 469"
        }
    },
    {
        "data": {
            "source": "EDPOL 300",
            "target": "CHICLA/EDPOL/LACIS 342"
        }
    },
    {
        "data": {
            "source": "SPANISH 223",
            "target": "CHICLA/SPANISH 364"
        }
    },
    {
        "data": {
            "source": "SPANISH 223",
            "target": "CHICLA/SPANISH 467"
        }
    },
    {
        "data": {
            "source": "SPANISH 223",
            "target": "CHICLA/SPANISH 469"
        }
    },
    {
        "data": {
            "source": "SPANISH 224",
            "target": "CHICLA/SPANISH 364"
        }
    },
    {
        "data": {
            "source": "SPANISH 224",
            "target": "CHICLA/SPANISH 467"
        }
    },
    {
        "data": {
            "source": "SPANISH 226",
            "target": "CHICLA/SPANISH 222"
        }
    },
    {
        "data": {
            "source": "SPANISH 226",
            "target": "SPANISH 223"
        }
    },
    {
        "data": {
            "source": "SPANISH 226",
            "target": "SPANISH 224"
        }
    },
    {
        "data": {
            "source": "SPANISH 226",
            "target": "SPANISH 311"
        }
    },
    {
        "data": {
            "source": "SPANISH 311",
            "target": "SPANISH 226"
        }
    }
]