[
    {
        "data": {
            "description": "A preparation and introductory math course for students enrolled in the Summer Collegiate Experience program. Includes material from precalculus and calculus and related topics depending on students' results on the math placement exam.",
            "id": "MATH 118",
            "parent": "MATH",
            "title": "SUMMER COLLEGIATE EXPERIENCE MATHEMATICS COURSE"
        }
    },
    {
        "data": {
            "description": "Covers the graphs, properties and geometric significance of trigonometric functions of a real variable. Other topics include trigonometric equations and identities, application, trigonometric form of complex numbers, DeMoivre's theorem, and polar and parametric equations. The course also has a significant number of applications, especially related to other disciplines.",
            "id": "MATH 113",
            "parent": "MATH",
            "title": "TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "Energy resources are an essential element of the world's business, political, technical and environmental landscape. Analytic tools provided by the discipline of economics expands our understanding of this critical issue. Energy supply markets reviewed include both fossil fuels and renewable resources. Energy demand sectors include residential, commercial, industrial and transportation. Electricity represents an intermediate energy market. The interactions among these markets participants indicate how scarce resources are allocated among competing needs in the world economy.",
            "id": "AAE/CIVENGR/ENVIRST/URBRPL 561",
            "title": "ENERGY MARKETS"
        }
    },
    {
        "data": {
            "description": "Interdisciplinary team of students and staff working with agency personnel, citizen groups, and/or private sector representatives on the analysis of a contemporary, problem-oriented water resource issue. Physical, biological, economic and social aspects of the issue analyzed. Comprehensive written report results, practicum's findings and management recommendations.",
            "id": "CIVENGR/ENVIRST/URBRPL 719",
            "title": "WATER RESOURCES MANAGEMENT SUMMER PRACTICUM"
        }
    },
    {
        "data": {
            "description": "Legal principles and institutions germane to engineering practice; formation and performance of engineer-client and owner-contractor relationships; preparation of technical specifications; surety bonds and insurance; construction liens; contract administration; construction contract remedies; intellectual property of engineers; engineers' obligations to society and their fellow engineers.",
            "id": "CIVENGR 491",
            "parent": "CIVENGR",
            "title": "LEGAL ASPECTS OF ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Overview of the public health profession and the role of environmental  sanitary engineers in public health. Introduction to chemical and microbial contaminants of public health concern - their routes of exposure and development of regulatory standards for drinking water, air, hazardous wastes, and industrial workplaces. Introduction to occurrence, toxicity, and virulence as components of public health risk and the engineer's role in identifying occurrence and design of engineering controls for public health protection.",
            "id": "CIVENGR 422",
            "parent": "CIVENGR",
            "title": "ELEMENTS OF PUBLIC HEALTH ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Principles of estimating and scheduling for the construction industry, engineer's preliminary and final estimates' quantity take offs and cost and duration determinations for major items related to a construction project; use manual and computer techniques.",
            "id": "CIVENGR 492",
            "parent": "CIVENGR",
            "title": "INTEGRATED PROJECT ESTIMATING AND SCHEDULING"
        }
    },
    {
        "data": {
            "description": "A quantitative treatment of chemical and biological processes controlling the speciation and partitioning of inorganic compounds in natural waters. Particular attention will be paid to heterogeneous reaction mechanisms, and kinetics controlling inorganic compounds in aqueous environments. Discuss in-situ techniques for measurement of environmental reactions. For those interested in environmental chemistry, chemistry, limnology, geology, environmental microbiology, soil science, and environmental modeling.",
            "id": "CIVENGR 703",
            "parent": "CIVENGR",
            "title": "ENVIRONMENTAL GEOCHEMISTRY"
        }
    },
    {
        "data": {
            "description": "A quantitative treatment of macroscopic phenomena including thermodynamics, chemical equilibria, solution behavior, electrochemistry, and chemical kinetics.",
            "id": "CHEM 116",
            "parent": "CHEM",
            "title": "CHEMICAL PRINCIPLES II"
        }
    },
    {
        "data": {
            "description": "A survey of architectural design theory through research analysis and criticism of works and ideas of significant architects and architectural theorists.",
            "id": "CIVENGR 150",
            "parent": "CIVENGR",
            "title": "INTRODUCTION TO ARCHITECTURAL THEORY"
        }
    },
    {
        "data": {
            "description": "A systematic introduction to the application of the first and second laws of thermodynamics to systems relevant to environmental engineering. Energy balances used to solve environmental engineering problems in flowing and non-flowing systems. Examines the relationship between energy, heat and work using theoretical and practical models. Chemical reactions as well as gas and fluid mixing from a thermodynamics perspective. Performance limits imposed by the second law of thermodynamics on devices used in power generation, fluid flow, refrigeration, and air conditioning.",
            "id": "CIVENGR 324",
            "parent": "CIVENGR",
            "title": "ENVIRONMENTAL ENGINEERING THERMODYNAMICS"
        }
    },
    {
        "data": {
            "description": "Accelerated coverage of topics in general chemistry, including introduction to laboratory techniques. Topics include atomic and molecular structure, chemical equilibrium, acid-base chemistry, thermodynamics, kinetics, and electrochemistry.",
            "id": "CHEM 109",
            "parent": "CHEM",
            "title": "ADVANCED GENERAL CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Advanced theory and applications of biological systems for the treatment of wastes; lab techniques to assess treatability and to provide design parameters. Introductory knowledge of Environmental Engineering [such asCIV ENGR 320] is required.",
            "id": "CIVENGR 821",
            "parent": "CIVENGR",
            "title": "ENVIRONMENTAL ENGINEERING: BIOLOGICAL TREATMENT PROCESSES"
        }
    },
    {
        "data": {
            "description": "Advanced theory and applications of chemical and physical-chemical processes for the treatment of water and wastewater; lab techniques to assess design requirements and treatability. Introductory knowledge of Environmental Engineering [such asCIV ENGR 320] is required.",
            "id": "CIVENGR 822",
            "parent": "CIVENGR",
            "title": "ENVIRONMENTAL ENGINEERING: PHYSICAL/CHEMICAL TREATMENT PROCESS"
        }
    },
    {
        "data": {
            "description": "Advanced topics of special interest to graduate students in structural engineering.",
            "id": "CIVENGR 749",
            "parent": "CIVENGR",
            "title": "SPECIAL TOPICS IN STRUCTURAL ENGINEERING"
        }
    },
    {
        "data": {
            "description": "An introduction to the design of engineering structures which control and/or utilize runoff, emphasizing the sizing of structures to meet hydrologic uncertainty. Applies principles and techniques from several disciplines, including hydrology, hydraulics, probability and statistics. Specific techniques include flood frequency analysis; risk analysis; design storm and historic storm techniques; rainfall-runoff modeling.",
            "id": "CIVENGR 414",
            "parent": "CIVENGR",
            "title": "HYDROLOGIC DESIGN"
        }
    },
    {
        "data": {
            "description": "An introduction to the use of Building Information Modeling (BIM) technology in the construction industry. Gain experience in using 3D  4D modeling software to model and coordinate building designs.",
            "id": "CIVENGR 392",
            "parent": "CIVENGR",
            "title": "BUILDING INFORMATION MODELING (BIM)"
        }
    },
    {
        "data": {
            "description": "Analysis and characteristics of flow in open channels (natural and artificial); channel design considerations including uniform flow (rivers, sewers), flow measuring devices (weirs, flumes), gradually varied flow (backwater and other flow profiles, flood routing), rapidly varied flow (hydraulic jump, spillways), and channel design problems (geometric considerations, scour, channel stabilization, sediment transport).",
            "id": "CIVENGR 411",
            "parent": "CIVENGR",
            "title": "OPEN CHANNEL HYDRAULICS"
        }
    },
    {
        "data": {
            "description": "Analysis and design of prestressed concrete members, including working stress and ultimate strength analysis and design for flexure; shear design; prestress losses, deflections, and composite beams. Knowledge of Concrete Structures [such asCIV ENGR 447] required.",
            "id": "CIVENGR 643",
            "parent": "CIVENGR",
            "title": "PRESTRESSED CONCRETE"
        }
    },
    {
        "data": {
            "description": "Analysis of statically determinate and indeterminate beams, trusses, and rigid frames; deflections by virtual-work, moment-area; influence lines; force methods; structural design loads, introduction to structural design, approximate methods.",
            "id": "CIVENGR 340",
            "parent": "CIVENGR",
            "title": "STRUCTURAL ANALYSIS I"
        }
    },
    {
        "data": {
            "description": "Analysis of structures by displacement methods with computer solutions. Slope deflection and moment distribution methods. Derivation of stiffness matrices for two-dimensional frames. Introduction to commercial structural analysis software. Shear deformations.",
            "id": "CIVENGR 440",
            "parent": "CIVENGR",
            "title": "STRUCTURAL ANALYSIS II"
        }
    },
    {
        "data": {
            "description": "Application of fluid mechanics to understand the mixing and transport of contaminants, pollutants, and other solutes in the environment. Introduction to chemical and biochemical transformation processes as well as boundary interactions at the air-water and sediment-water interfaces. Transport phenomena: diffusive processes, advective processes, turbulent diffusion, and shear flow dispersion. Introduction to both analytical and computational solutions with applications to mixing and transport in rivers, lakes, the atmosphere, and coastal waters.",
            "id": "CIVENGR/GLE 511",
            "title": "MIXING AND TRANSPORT IN THE ENVIRONMENT"
        }
    },
    {
        "data": {
            "description": "Application of geology to problems resulting from the ever more intense use of the earth and its resources.",
            "id": "ENVIRST/GEOSCI 106",
            "title": "ENVIRONMENTAL GEOLOGY"
        }
    },
    {
        "data": {
            "description": "Applications of physiochemical, mineralogical and environmental considerations to the engineering behavior of soils. Soil composition, formation, fabric, pore fluid chemistry and interaction of phases. The particulate nature of soils and the fabric-engineering property (volume change, strength, deformation and conduction) relationships. Knowledge of Soil Mechanics [such asCIV ENGR/​G L E  330] is required.",
            "id": "CIVENGR/GLE 733",
            "title": "PHYSICOCHEMICAL BASIS OF SOIL BEHAVIOR"
        }
    },
    {
        "data": {
            "description": "Basic biology of microorganisms, including structure, function, physiology, genetics, ecology, diversity, and evolution.",
            "id": "MICROBIO 303",
            "parent": "MICROBIO",
            "title": "BIOLOGY OF MICROORGANISMS"
        }
    },
    {
        "data": {
            "description": "Basic concepts in designing, evaluating, and operating solid wastes storage, collection, and disposal systems; waste reduction, resource recovery, incineration and land disposal methods; hazardous wastes engineering; legal, political, and administrative considerations.",
            "id": "CIVENGR 427",
            "parent": "CIVENGR",
            "title": "SOLID AND HAZARDOUS WASTES ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Basic electricity, utility systems, standards and codes, electrical construction materials, branch circuit design, motor branch circuit design, feeder and service design, estimating and management concepts in electrical contracting, grounding, lighting, telecommunications.",
            "id": "CIVENGR 496",
            "parent": "CIVENGR",
            "title": "ELECTRICAL SYSTEMS FOR CONSTRUCTION"
        }
    },
    {
        "data": {
            "description": "Basic principles of soil mechanics and fundamentals of application in engineering practice; soil composition and texture; classification; permeability and seepage; consolidation; settlement; shear strength; lateral earth pressures and retaining structures, shallow and deep foundations, slope stability; subsurface exploration; laboratory characterization of physical and engineering properties of soils.",
            "id": "CIVENGR/GLE 330",
            "title": "SOIL MECHANICS"
        }
    },
    {
        "data": {
            "description": "Behavior of reinforced concrete structural elements; concepts of design and proportioning sections for strength and serviceability; background of specification requirements; strength design applied to beams, columns, and members under combined axial load and bending; continuous beams.",
            "id": "CIVENGR 447",
            "parent": "CIVENGR",
            "title": "CONCRETE STRUCTURES I"
        }
    },
    {
        "data": {
            "description": "Biological principles important to diagnosing and controlling pollution through environmental engineering applications such as fate and transport of contaminants in the environment, eutrophication, water treatment for human consumption, biological waste treatment for pollution control and bioenergy generation.",
            "id": "CIVENGR 721",
            "parent": "CIVENGR",
            "title": "BIOLOGICAL PRINCIPLES OF ENVIRONMENTAL ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for engineering students. Electricity, magnetism, light, and sound.",
            "id": "PHYSICS 202",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for engineering students. Mechanics: kinematics, statics, dynamics; energy and momentum.",
            "id": "PHYSICS 201",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for students majoring in biological sciences. Mechanics: kinematics, statics, dynamics; energy and momentum. Heat and sound.",
            "id": "PHYSICS 207",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Canonical buildings since 1800 alongside their accompanying theoretical texts are evaluated within the discipline and allied fields of inquiry.",
            "id": "CIVENGR 155",
            "parent": "CIVENGR",
            "title": "ARCHITECTURAL THINKING"
        }
    },
    {
        "data": {
            "description": "Characteristics of Construction Industry; project organizations; the design and construction process; labor, material, and equipment utilization; cost estimation; construction pricing and contracting; construction planning; cost control, monitoring accounting; and management systems construction.",
            "id": "CIVENGR 498",
            "parent": "CIVENGR",
            "title": "CONSTRUCTION PROJECT MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Characteristics of transportation supply and demand; measuring and estimating demand; social and environmental impacts; planning of transportation systems; characteristics of transportation modes; interaction between modes; mode interfaces; transportation technology; economics; public policy, implementation and management.",
            "id": "CIVENGR 370",
            "parent": "CIVENGR",
            "title": "TRANSPORTATION ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Classification of rock masses, stress and strain in rock, linear and non-linear behavior of rock, failure mechanisms, state of stress in rock masses, lab testing, geological and engineering applications.",
            "id": "CIVENGR/GEOSCI/GLE/MS&E 474",
            "title": "ROCK MECHANICS"
        }
    },
    {
        "data": {
            "description": "Combination of theory and laboratory practice to study basic unit operations and processes in environmental engineering. Emphasis on water and wastewater treatment processes, such as coagulation/flocculation, chemical precipitation, filtration, adsorption, activated sludge, anaerobic digestion, and substrate utilization kinetics.",
            "id": "CIVENGR 322",
            "parent": "CIVENGR",
            "title": "ENVIRONMENTAL ENGINEERING PROCESSES"
        }
    },
    {
        "data": {
            "description": "Composite construction; composite vs. non-composite behavior; shored vs. unshored construction; stability of frames; elastic analysis of frames including second order effects; strength of members subject to combined flexure and axial compression; plate girders; vertical flange buckling; flexural and shear strength; flexure and shear interaction; stiffener requirements.",
            "id": "CIVENGR 545",
            "parent": "CIVENGR",
            "title": "STEEL STRUCTURES II"
        }
    },
    {
        "data": {
            "description": "Comprehensive overview of vehicular traffic flow theory and its use in evaluating congestion and determining control strategies.  Starting from the basic concepts defining traffic streams, existing theories are presented at different scales, including car-following (microsimulation) models, lane-changing models, cellular automata models, the kinematic wave model, and macroscopic/network fundamental diagram.  Techniques for empirical analysis. Connected and automated vehicles.",
            "id": "CIVENGR 577",
            "parent": "CIVENGR",
            "title": "TRAFFIC FLOW THEORY"
        }
    },
    {
        "data": {
            "description": "Comprehensive systems approach to civil infrastructure and asset management with emphasis on transportation facilities. Social, political, economic factors that influence transportation planning, design, construction, maintenance and operation. Needs assessment, information management, performance measurement, life cycle cost and benefits analysis, prioritization and optimization, budgeting and finance.",
            "id": "CIVENGR/PUBAFFR 694",
            "title": "MANAGEMENT OF CIVIL INFRASTRUCTURE SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Concepts of sustainability in Civil Engineering with an emphasis on construction materials. Introduction to life-cycle assessment approach to evaluating the impact of infrastructure development. Current sustainable practices in construction projects. Connecting values to clients, stakeholders, and societal needs. Sustainability rating programs, such as LEED, Envision, and INVEST.",
            "id": "CIVENGR 495",
            "parent": "CIVENGR",
            "title": "SUSTAINABLE BUILDING AND MATERIALS"
        }
    },
    {
        "data": {
            "description": "Connected vehicle and automated vehicle technologies; comprehensive studies of sensing, trajectory planning, and vehicle control within the context of the automated vehicle; consideration of pertinent development and technologies in this field.",
            "id": "CIVENGR 570",
            "parent": "CIVENGR",
            "title": "CONNECTED AND AUTOMATED TRANSPORTATION SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Continuation ofMATH 171. Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Completion ofMATH 217implies completion ofMATH 221and114.",
            "id": "MATH 217",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY II"
        }
    },
    {
        "data": {
            "description": "Continuation ofPHYSICS 103. Principles of electricity and magnetism, light, optics, and modern physics, with applications to a number of different fields. Not recommended for students in the physical sciences and engineering.",
            "id": "PHYSICS 104",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Continuation ofPHYSICS 207: calculus-based introduction to physics intended for students majoring in biological sciences. Electricity, magnetism, light, and modern physics.",
            "id": "PHYSICS 208",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Covers background and modern research methods for the application of chemical analysis tools to understanding of the origin, composition, and the chemical transformations of pollutants that occur in the atmosphere. Emphasis will be directed at the pollutants impacting human health, climate change, and ecosystem degradation. Approximately half of the course materials will be taken from the scientific literature and will provide the opportunity to advance skills in the critical reading of journal articles. The course is directed at graduate students conducting research and interested in air pollution and environmental chemistry. Gain experiences in presenting scientific research methods and results related to course materials.",
            "id": "ATMOCN/CIVENGR 701",
            "title": "THE CHEMISTRY OF AIR POLLUTION"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Covers the principles of stress and strain analyses in typical highway pavement structures due to loading from traffic and climate.  Also covers the most commonly used analysis and design procedures/software to determine thickness of pavement layers and prediction of performance.",
            "id": "CIVENGR 576",
            "parent": "CIVENGR",
            "title": "ADVANCED PAVEMENT DESIGN"
        }
    },
    {
        "data": {
            "description": "Critical evaluation of the sustainability of engineering projects, considering roles as designers, citizens, and collaborators in creating the infrastructure of the future. Consider the impact of climate change on sustainability, an urgent topic, through case studies in water supply, flood management, water quality, materials recovery and recycling, mobility, buildings and structures, and energy generation and distribution.",
            "id": "CIVENGR 525",
            "parent": "CIVENGR",
            "title": "CASE STUDIES EXPLORING INFRASTRUCTURE SUSTAINABILITY AND CLIMATE CHANGE"
        }
    },
    {
        "data": {
            "description": "Current problems and research developments in transportation, highways, traffic engineering, and transportation planning and systems analysis.",
            "id": "CIVENGR 579",
            "parent": "CIVENGR",
            "title": "SEMINAR-TRANSPORTATION ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Current research and literature on water, wastewater, water pollution control, solid wastes engineering and management.",
            "id": "CIVENGR 929",
            "parent": "CIVENGR",
            "title": "SEMINAR-ENVIRONMENTAL ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Current research and review of literature in theoretical and applied fluid mechanics and hydraulic engineering.",
            "id": "CIVENGR 919",
            "parent": "CIVENGR",
            "title": "SEMINAR-HYDRAULIC ENGINEERING AND FLUID MECHANICS"
        }
    },
    {
        "data": {
            "description": "Current research in environmental chemistry and technology.",
            "id": "CIVENGR 909",
            "parent": "CIVENGR",
            "title": "GRADUATE SEMINAR - ENVIRONMENTAL CHEMISTRY & TECHNOLOGY"
        }
    },
    {
        "data": {
            "description": "Data processing, tension/compression tests, creep stress concentrations, fatigue, fracture, composite materials, combined stress, beam flexure, dynamic loads, buckling.",
            "id": "EMA/ME 307",
            "title": "MECHANICS OF MATERIALS LAB"
        }
    },
    {
        "data": {
            "description": "Deflections under short duration and sustained loads; compression members with emphasis on stability and secondary bending moments; two-way slab systems; prestressed concrete including prestress losses; design of shear walls, special topics in strut and tie modelling, compression field theory and design for torsion may be covered; flexure analysis; design of sections; and shear strength.",
            "id": "CIVENGR 547",
            "parent": "CIVENGR",
            "title": "CONCRETE STRUCTURES II"
        }
    },
    {
        "data": {
            "description": "Descriptive statistics, probability concepts and distributions, random variables. Hypothesis tests and confidence intervals for one- and two-sample problems. Linear regression, model checking, and inference. Analysis of variance and basic ideas in experimental design. Utilizes the R programming language.",
            "id": "STAT 324",
            "parent": "STAT",
            "title": "INTRODUCTORY APPLIED STATISTICS FOR ENGINEERS"
        }
    },
    {
        "data": {
            "description": "Design loads, codes, specifications and standards; philosophies of design; load and resistance factor design (LRFD); allowable stress design (ASD); properties and types of structural steel; residual stresses; behavior and LRFD design criteria for tension members, compression; laterally braced and unbraced beams; essentials of bolted and welded connections.",
            "id": "CIVENGR 445",
            "parent": "CIVENGR",
            "title": "STEEL STRUCTURES I"
        }
    },
    {
        "data": {
            "description": "Design, implementation and use of automated procedures for storage, analysis and display of spatial information. Covers data bases, information manipulation and display techniques, software systems and management issues. Case studies.",
            "id": "CIVENGR/ENVIRST/GEOG 377",
            "title": "AN INTRODUCTION TO GEOGRAPHIC INFORMATION SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Determination and interpretation of soil properties for engineering purposes; physio-chemical properties of soil-water systems, permeability and capillarity, compression characteristics of soils, measurement of soil properties in the triaxial test, properties of frozen soils and permafrost.",
            "id": "CIVENGR/GLE 730",
            "title": "ENGINEERING PROPERTIES OF SOILS"
        }
    },
    {
        "data": {
            "description": "Development of precise standards of drawing and the history and techniques of descriptive and analytical drawing.",
            "id": "CIVENGR 250",
            "parent": "CIVENGR",
            "title": "ARCHITECTURAL VISUALIZATION"
        }
    },
    {
        "data": {
            "description": "Dynamic analysis and behavior of structures; basic principles and  application of engineering seismology; determination of earthquake-induced loads for earthquake-resistant design; and analysis and design of reinforced concrete and steel buildings subjected to ground motion. Knowledge of analysis and design of reinforced concrete and structural steel buildings [such asCIV ENGR 440,445, and447] required.",
            "id": "CIVENGR 744",
            "parent": "CIVENGR",
            "title": "STRUCTURAL DYNAMICS AND EARTHQUAKE ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Elements of fresh and marine water chemistry; acid-base, precipitation, complexation, oxidation-reduction, adsorption, and biochemical reactions in natural waters and water treatment processes.",
            "id": "CIVENGR 500",
            "parent": "CIVENGR",
            "title": "WATER CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Engineering approaches to measurement, control and conveyance of water and wastewater flows, emphasizing analysis, design, characteristics and selection of: measurement devices, distribution and collection pipe systems, and pumps and turbines with consideration of plant, quality, economic, reliability, and security aspects.",
            "id": "CIVENGR 410",
            "parent": "CIVENGR",
            "title": "HYDRAULIC ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Engineering design project applied to environmental engineering solutions involving environmental chemistry, environmental quality, physical-chemical treatment processes, biological treatment processes, solid and hazardous waste engineering, energy, resource recovery, economic analysis, hydrology, and/or hydraulics and applied fluid mechanics.",
            "id": "CIVENGR 823",
            "parent": "CIVENGR",
            "title": "ENVIRONMENTAL ENGINEERING DESIGN PROJECT"
        }
    },
    {
        "data": {
            "description": "Engineering fundamentals of groundwater flow. Focus is on developing and implementing 2-D, steady-state, analytical models of groundwater flow. Also introduces transient groundwater flow modeling, hydraulic testing methods, and numerical modeling.",
            "id": "CIVENGR 412",
            "parent": "CIVENGR",
            "title": "GROUNDWATER HYDRAULICS"
        }
    },
    {
        "data": {
            "description": "Engineering principles of unsaturated soils as they apply to geotechnical and geoenvironmental systems. Effect of soil water suction and stress on hydraulic conductivity, shear strength, and compressibility of soils in the context of geoengineering problems of flow and stability. Knowledge of Soil Mechanics [such asCIV ENGR/​G L E  330] is required.",
            "id": "CIVENGR/GLE 732",
            "title": "UNSATURATED SOIL GEOENGINEERING"
        }
    },
    {
        "data": {
            "description": "Environmental impact must be quantified systematically and rigorously in order to inform decision making, process improvement, and policy. Life cycle assessment will be utilized in a project-based framework to evaluate the environmental impacts of products and process across multiple environmental impact categories.",
            "id": "CIVENGR 729",
            "parent": "CIVENGR",
            "title": "ENVIRONMENTAL SUSTAINABILITY TOOLS"
        }
    },
    {
        "data": {
            "description": "Environmental regulations, remediation site characterization, contaminant characterization, detailed engineering and management considerations related to the design and operation of hazardous waste remediation systems involving water pollution, air pollution, solid waste, and groundwater pollution.",
            "id": "CIVENGR 522",
            "parent": "CIVENGR",
            "title": "HAZARDOUS WASTE MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "Explores a detailed atomic and molecular view of matter and its interactions, with a specific focus on quantum theory, molecular structure, and chemical bonding. Application required for enrollment.",
            "id": "CHEM 115",
            "parent": "CHEM",
            "title": "CHEMICAL PRINCIPLES I"
        }
    },
    {
        "data": {
            "description": "First order differential equations, introduction to multivariable calculus and constrained optimization, infinite sequences and series, methods of approximation, and a brief introduction to probability. Models and applications from business and the social sciences.",
            "id": "MATH 213",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 2"
        }
    },
    {
        "data": {
            "description": "Fluid statics and dynamics, dimensional analysis, flow of an ideal fluid, flow of a real fluid--including laminar and turbulent flow, applications to engineering problems.",
            "id": "CIVENGR 310",
            "parent": "CIVENGR",
            "title": "FLUID MECHANICS"
        }
    },
    {
        "data": {
            "description": "Fundamental molecular processes that govern the fate and transformation of organic contaminants in natural environmental systems and engineered treatment processes. Emphasizes the kinetics describing these processes and focuses on transformation mechanisms of organic contaminants in aquatic systems. Specific topics include partitioning between air, water, and solids; chemical kinetics; substitution, hydrolysis, and redox reactions; oxidation reactions encountered in ozone and chlorine-based disinfection systems; and photochemical and biological transformations. Knowledge of water chemistry [such asCIV ENGR 500] required.",
            "id": "CIVENGR 704",
            "parent": "CIVENGR",
            "title": "ENVIRONMENTAL CHEMICAL KINETICS"
        }
    },
    {
        "data": {
            "description": "Fundamental sanitary aspects of environmental engineering. Role of the engineer in the control of the environment; water supply and wastewater problems; solid waste disposal; air pollution; and administration in environmental engineering.",
            "id": "CIVENGR 320",
            "parent": "CIVENGR",
            "title": "ENVIRONMENTAL ENGINEERING"
        }
    },
    {
        "data": {
            "description": "General biological principles. Topics include: evolution, ecology, animal behavior, cell structure and function, genetics and molecular genetics and the physiology of a variety of organ systems emphasizing function in humans.",
            "id": "BIOLOGY/ZOOLOGY 101",
            "title": "ANIMAL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Geologic processes; structure and history of the earth; earthquakes, volcanos, glaciers, groundwater, minerals, rocks, deserts, fossils; topographic and geologic maps; climate change on geologic and human time scales.",
            "id": "GEOSCI 100",
            "parent": "GEOSCI",
            "title": "INTRODUCTORY GEOLOGY: HOW THE EARTH WORKS"
        }
    },
    {
        "data": {
            "description": "Geotechnical analysis, design, and construction.",
            "id": "CIVENGR 939",
            "parent": "CIVENGR",
            "title": "GEOTECHNICAL ENGINEERING SEMINAR"
        }
    },
    {
        "data": {
            "description": "Geotechnical practice for remediation of sites containing contaminated soil and groundwater is discussed. Topics include non-invasive and invasive subsurface exploration techniques, methods to monitor for the presence of contaminants in the saturated and unsaturated zones, and geotechnically-oriented remedial action technologies.",
            "id": "CIVENGR/GLE 635",
            "title": "REMEDIATION GEOTECHNICS"
        }
    },
    {
        "data": {
            "description": "Global positioning system surveying for field applications. Signals. Coordinate systems. Datums. Cartographic projections. Satellite orbits. Choosing hardware. Strategies for data collection and analysis. Assessing uncertainty. Geocoding satellite images. Integrating data with Geographic Information Systems. Emerging technologies.",
            "id": "CIVENGR/ENVIRST/GEOSCI/GLE 444",
            "title": "PRACTICAL APPLICATIONS OF GPS SURVEYING"
        }
    },
    {
        "data": {
            "description": "Graphical communication including lettering, drawing equipment and techniques; geometric constructions, orthographic projections, technical sketching, isometric views, descriptive geometry, and computer-aided design drawing, with applications specific to civil engineering.",
            "id": "CIVENGR 159",
            "parent": "CIVENGR",
            "title": "CIVIL ENGINEERING GRAPHICS"
        }
    },
    {
        "data": {
            "description": "Inelastic behavior and modeling of reinforced concrete members, with emphasis on response to earthquake-type loading. Knowledge of concrete structures [such asCIV ENGR 447] required.",
            "id": "CIVENGR 647",
            "parent": "CIVENGR",
            "title": "CONCRETE STRUCTURES III"
        }
    },
    {
        "data": {
            "description": "Introduction to architecture and architectural making. 2D and 3D form and space tested through the theoretical, pragmatic, and contextual issues that influence architecture.",
            "id": "CIVENGR 151",
            "parent": "CIVENGR",
            "title": "ARCHITECTURAL MAKING I"
        }
    },
    {
        "data": {
            "description": "Introduction to assessment tools of transportation operations and fundamental concepts in flow theory, flow control, observation and measurement techniques, and scheduled transportation. Applied to various modes of transportation.  Emphasis on logic rather than recipe-oriented practice.",
            "id": "CIVENGR 572",
            "parent": "CIVENGR",
            "title": "TRANSPORTATION OPERATIONS"
        }
    },
    {
        "data": {
            "description": "Introduction to building design, its methods, tools and processes and the interface with other professionals in building design and construction.  Buildings as an integrated system of components, assemblies and sub-systems, including: structure, enclosure, internal finish and furnishing, circulation, conveyance and mechanical systems.  Pragmatic design elements that make a project sustainable, energy efficient and comfortable, including; fenestration options, daylighting, passive heating and cooling, energy efficiency and other lower impact approaches identified in LEED standards.",
            "id": "CIVENGR 451",
            "parent": "CIVENGR",
            "title": "ARCHITECTURAL DESIGN"
        }
    },
    {
        "data": {
            "description": "Introduction to building mechanical systems. Plumbing, heating, ventilation, air conditioning, fire protection, automation/controls and process systems. Introduction to mechanical systems design and cost estimating. Mechanical system management.",
            "id": "CIVENGR 497",
            "parent": "CIVENGR",
            "title": "MECHANICAL SYSTEMS FOR CONSTRUCTION"
        }
    },
    {
        "data": {
            "description": "Introduction to calculus of functions of several variables; calculus on parameterized curves, derivatives of functions of several variables, multiple integrals, vector calculus.",
            "id": "MATH 234",
            "parent": "MATH",
            "title": "CALCULUS--FUNCTIONS OF SEVERAL VARIABLES"
        }
    },
    {
        "data": {
            "description": "Introduction to data sensing and analysis technologies for the onsite data capture, analysis and visualization in construction projects. Experience of using close range remote sensors and computing tools to facilitate construction engineering and management tasks. Focus on 1) project 3D as-built modeling and documentation, 2) visual detection, tracking and activity recognition of construction equipment and personnel, and 3) virtual construction inspection and site tour in mixed reality.",
            "id": "CIVENGR 465",
            "parent": "CIVENGR",
            "title": "DATA SENSING AND ANALYSIS IN CONSTRUCTION"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Introduction to economic ways of thinking about a wide range of problems and issues. Topics include consumption, production, prices, markets, finance, trade, pollution, growth, farms, taxes, and development.",
            "id": "AAE 101",
            "parent": "AAE",
            "title": "INTRODUCTION TO AGRICULTURAL AND APPLIED ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Introduction to engineering computations with emphasis on computer tools and computer based measurement, data collection, and processing. Tools will include computer aided design, spreadsheets, other engineering computation tools, and hardware and software for laboratory and spatial measurements.",
            "id": "CIVENGR/GLE 291",
            "title": "PROBLEM SOLVING USING COMPUTER TOOLS"
        }
    },
    {
        "data": {
            "description": "Introduction to modern statistical practice in the life sciences, using the R programming language. Topics include: exploratory data analysis, probability and random variables; one-sample testing and confidence intervals, role of assumptions, sample size determination, two-sample inference; basic ideas in experimental design, analysis of variance, linear regression, goodness-of fit; biological applications.",
            "id": "STAT 371",
            "parent": "STAT",
            "title": "INTRODUCTORY APPLIED STATISTICS FOR THE LIFE SCIENCES"
        }
    },
    {
        "data": {
            "description": "Introduction to physics at the non-calculus level. Principles of mechanics, heat, and waves, with applications to a number of different fields. Not recommended for students in the physical sciences and engineering.",
            "id": "PHYSICS 103",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Introduction to probability and statistics and application to the analysis and modeling of real-world problems in hydrology, water resources engineering, and environmental data analysis.",
            "id": "CIVENGR 516",
            "parent": "CIVENGR",
            "title": "HYDROLOGIC DATA ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Introduction to probability, random variables, and random processes. Confidence intervals, introduction to experimental design and hypothesis testing. Statistical averages, correlation, and spectral analysis for wide sense stationary processes. Random signals and noise in linear systems.",
            "id": "ECE 331",
            "parent": "ECE",
            "title": "INTRODUCTION TO RANDOM SIGNAL ANALYSIS AND STATISTICS"
        }
    },
    {
        "data": {
            "description": "Introduction to the Earth as viewed from above, focusing on use of aerial photography and satellite imagery to study the environment. Includes physical processes of electromagnetic radiation, data types and sensing capabilities, methods for interpretation, analysis and mapping, and applications.",
            "id": "ENVIRST/F&WECOL/GEOG/GEOSCI/GLE/LANDARC 371",
            "title": "INTRODUCTION TO ENVIRONMENTAL REMOTE SENSING"
        }
    },
    {
        "data": {
            "description": "Introduction to the design language of Frank Lloyd Wright. Beginning understanding of his architectural design process, his methods, tools and processes in building design and construction.",
            "id": "CIVENGR 352",
            "parent": "CIVENGR",
            "title": "FRANK LLOYD WRIGHT - DESIGN SEMINAR"
        }
    },
    {
        "data": {
            "description": "Introduction to the parts and pieces of a building at the construction level. How a building is built from start to finish, and how the individual building systems affect one another. Systems, how they interact, design and construction, cost implications, schedule implications.",
            "id": "CIVENGR 360",
            "parent": "CIVENGR",
            "title": "CONSTRUCTION SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Introduction to the signals, information, and computational techniques in electrical engineering.",
            "id": "ECE 203",
            "parent": "ECE",
            "title": "SIGNALS, INFORMATION, AND COMPUTATION"
        }
    },
    {
        "data": {
            "description": "Introduction to the water cycle, its relationship to the environment and human attempts to conserve, control, and utilize water judiciously. Fundamentals of hydrology, hydraulics, coastal engineering and water resources engineering.",
            "id": "CIVENGR 311",
            "parent": "CIVENGR",
            "title": "HYDROSCIENCE"
        }
    },
    {
        "data": {
            "description": "Introduction to theory and approaches commonly used in geotechnical engineering practice for design and analysis of slopes and earth retaining structures.",
            "id": "CIVENGR/GLE 430",
            "title": "INTRODUCTION TO SLOPE STABILITY AND EARTH RETENTION"
        }
    },
    {
        "data": {
            "description": "Introduction to theory and approaches commonly used in geotechnical engineering practice for design and analysis of slopes and earth retaining structures.",
            "id": "CIVENGR/GLE 432",
            "title": "INTRODUCTION TO SHALLOW AND DEEP FOUNDATION SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Introduction to various strategies for integrating climate science into water resources, specifically addressing climatic influences on hydrologic variables, the prospects for prediction, and the implications on water management and development. Consider both space and time variability of hydrological processes in the context of sub-seasonal, seasonal, and climate change time-scales.",
            "id": "CIVENGR 515",
            "parent": "CIVENGR",
            "title": "HYDROCLIMATOLOGY FOR WATER RESOURCES MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Key scientific concepts related to fossil and renewable energy resources. Apply the fundamentals of thermodynamics and chemical kinetics at solid interfaces to better understand the science behind using fossil and renewable energy resources. Evaluate the impacts of existing and emerging energy technologies on the environment.",
            "id": "CIVENGR/GLE 520",
            "title": "REACTIVE PROCESSES FOR SUSTAINABLE ENERGY AND RESOURCE PRODUCTION"
        }
    },
    {
        "data": {
            "description": "Mathematical treatment of the physical principles governing the flow of groundwater; emphasis on well hydraulics and flow system analysis.",
            "id": "GEOSCI/GLE 627",
            "title": "HYDROGEOLOGY"
        }
    },
    {
        "data": {
            "description": "Microbial interactions in soils, water, extreme environments and biofilms. Modern methods for studying microbial ecology. Role of microbes in nutrient cycles and biogeochemistry. Use of microbes for mitigating human-made environmental problems of industrial, agricultural, and domestic origin. Emphasis on engineered systems.",
            "id": "CIVENGR 425",
            "parent": "CIVENGR",
            "title": "ENVIRONMENTAL ENGINEERING MICROBIOLOGY"
        }
    },
    {
        "data": {
            "description": "Modeling for wastewater treatment plant evaluation and design using a commercial modeling program. Focus on biological treatment processes and the kinetics of biological growth and substrate degradation. Set up and calibrate model, configure and size plant processes, and explore the impact of configuration and kinetic parameters on treatment efficiency. Evaluate impacts and tradeoffs for advanced treatment scenarios with regards to chemical use, energy needs, sludge production, and plant footprint.",
            "id": "CIVENGR 621",
            "parent": "CIVENGR",
            "title": "BIOLOGICAL TREATMENT PROCESS MODELING"
        }
    },
    {
        "data": {
            "description": "Mutual interactions between the hydrologic cycle and ecosystems, including hydrologic mechanisms that underlie ecological patterns and processes, movement of water and energy through the soil-plant-atmosphere continuum, application and development of models for simulating ecohydrologic processes, and case studies on ecohydrologic function and ecosystem services of varied environments.",
            "id": "CIVENGR/GLE 612",
            "title": "ECOHYDROLOGY"
        }
    },
    {
        "data": {
            "description": "Nature, sources, distribution, and fate of contaminants in air, water, soil, and food and potential for harmful exposure.",
            "id": "CIVENGR/M&ENVTOX/SOILSCI 631",
            "title": "TOXICANTS IN THE ENVIRONMENT: SOURCES, DISTRIBUTION, FATE, & EFFECTS"
        }
    },
    {
        "data": {
            "description": "On-site treatment and dispersal of waste water from homes, commercial sources and small communities. Sources, pretreatment units, nutrient removal units, constructed wetlands, surface and soil dispersal systems, recycle and reuse systems, regulations, alternative collection systems.",
            "id": "BSE/CIVENGR/SOILSCI 372",
            "title": "ON-SITE WASTE WATER TREATMENT AND DISPERSAL"
        }
    },
    {
        "data": {
            "description": "Physical properties and mechanical behavior of polymer, metal, ceramic, cementitious, cellulosic and biological composite systems; micro- and macro-mechanics; lamination and strength analyses; static and transient loading; fabrication; recycling; design; analytical-experimental correlation; applications.",
            "id": "CIVENGR/EMA/ME 508",
            "title": "COMPOSITE MATERIALS"
        }
    },
    {
        "data": {
            "description": "Planning, designing, and managing civil and environmental engineering systems. Fundamentals of the systems approach; marginal analysis; optimization techniques; decision analysis; economic analysis; cost-effectiveness analysis. Case study applications.",
            "id": "CIVENGR 494",
            "parent": "CIVENGR",
            "title": "CIVIL AND ENVIRONMENTAL ENGINEERING DECISION MAKING"
        }
    },
    {
        "data": {
            "description": "Practical aspects of nondestructive evaluation (NDE) techniques for identifying physical properties and damage within civil and geologic materials and structures. Data analyses and data science for wave propagation, arrival picking, distributed fiber optic sensing, and visualization tools such as augmented/mixed/virtual reality.",
            "id": "CIVENGR/GLE 534",
            "title": "NONDESTRUCTIVE EVALUATION"
        }
    },
    {
        "data": {
            "description": "Practical aspects of seepage effects and ground water flow. Stability of natural and man-made slopes under various loading conditions. Design and construction of earth dams and embankments. Flow net and its use; wells; filters; total and effective stress methods of slope analysis; selection of pertinent soil parameters.",
            "id": "CIVENGR/GLE 530",
            "title": "SEEPAGE AND SLOPES"
        }
    },
    {
        "data": {
            "description": "Preliminary studies and design of water treatment processes and subordinate plant facilities; project control of design project; unit operations in water treatment; groundwater treatment; preliminary cost estimates; introduction of computer-aided design concept; site visits to water treatment plants.",
            "id": "CIVENGR 428",
            "parent": "CIVENGR",
            "title": "WATER TREATMENT PLANT DESIGN"
        }
    },
    {
        "data": {
            "description": "Present research in Construction Engineering Management, discuss ideas and results. Receive feedback on research and presentation style.",
            "id": "CIVENGR 760",
            "parent": "CIVENGR",
            "title": "RESEARCH METHODS IN CONSTRUCTION ENGINEERING MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Principles and application of chemical equilibrium, coordination chemistry, oxidation-reduction and electrochemistry, kinetics, nuclear chemistry, introduction to organic chemistry, and chemistry laboratory skills.",
            "id": "CHEM 104",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Principles and applications of chemical and instrumental methods for the chemical analysis of water.",
            "id": "CIVENGR 501",
            "parent": "CIVENGR",
            "title": "WATER ANALYSIS-INTERMEDIATE"
        }
    },
    {
        "data": {
            "description": "Principles of energy applied to environmental engineering such as energy resources, sustainability concerns, work and power, thermodynamics, system and process efficiencies, energy production from waste, heat transfer, and heating and cooling of systems.",
            "id": "CIVENGR 723",
            "parent": "CIVENGR",
            "title": "ENERGY PRINCIPLES OF ENVIRONMENTAL ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Principles of general, physical, equilibrium, colloid and biochemistry applied to environmental engineering processes such as evaluating environmental quality and treating water, air and soil to meet environmental standards.",
            "id": "CIVENGR 722",
            "parent": "CIVENGR",
            "title": "CHEMICAL PRINCIPLES OF ENVIRONMENTAL ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Principles of hydraulics and fluid mechanics applied to environmental engineering systems that convey, control, and measure the flow of liquids, solid-liquid slurries, and gases.",
            "id": "CIVENGR 820",
            "parent": "CIVENGR",
            "title": "HYDRAULICS AND APPLIED FLUID MECHANICS FOR ENVIRONMENTAL ENGINEERS"
        }
    },
    {
        "data": {
            "description": "Principles of mechanics, force systems, equilibrium, structures, distributed forces, moments of inertia of areas, and friction.",
            "id": "EMA 201",
            "parent": "EMA",
            "title": "STATICS"
        }
    },
    {
        "data": {
            "description": "Principles of planning, evaluation, selection, adoption, financing, and implementation of alternative urban transportation systems; formulation of community goals and objectives, inventory of existing conditions; transportation modeling--trip generation, distribution, modal choice, assignment, technological characteristics and operation of modern transit and other movement systems.",
            "id": "CIVENGR 571",
            "parent": "CIVENGR",
            "title": "URBAN TRANSPORTATION PLANNING"
        }
    },
    {
        "data": {
            "description": "Problems in ground transportation facility design; generation, capacity, location and design; rural and urban at-grade intersection design; grade separations; interchanges; parking lots and terminals.",
            "id": "CIVENGR 573",
            "parent": "CIVENGR",
            "title": "GEOMETRIC DESIGN OF TRANSPORT FACILITIES"
        }
    },
    {
        "data": {
            "description": "Properties and tests of materials used in the initial construction or repair of facilities (including buildings, transportation systems, utility systems, and reinforced earth). Introduction to laboratory and field measurement techniques to assess material performance capabilities. Technical report preparation.",
            "id": "CIVENGR/EMA 395",
            "title": "MATERIALS FOR CONSTRUCTED FACILITIES"
        }
    },
    {
        "data": {
            "description": "Properties and tests of materials used in the treatment and conveyance of water and air. Introduction to laboratory and field measurement techniques to assess material performance capabilities. Technical report preparation.",
            "id": "CIVENGR 325",
            "parent": "CIVENGR",
            "title": "ENVIRONMENTAL ENGINEERING MATERIALS"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Rectilinear and curvilinear motion of a particle; force, mass, acceleration; work, potential, and kinetic energy; impulse and momentum; kinematics of rigid bodies; moving coordinate systems with relative motion; general planar rigid body kinematics and kinetics. Applications to linkages, cams and geared systems.",
            "id": "ME 240",
            "parent": "ME",
            "title": "DYNAMICS"
        }
    },
    {
        "data": {
            "description": "Sections in various fields of zoological research.",
            "id": "ATMOCN/BOTANY/CIVENGR/ENVIRST/GEOSCI/ZOOLOGY 911",
            "title": "LIMNOLOGY AND MARINE SCIENCE SEMINAR"
        }
    },
    {
        "data": {
            "description": "Shallow and deep foundations. Analysis and design of footings, mats, piers and piles, and related fill and excavation operations. Consolidation settlement, time rate of settlement, stress distribution, elastic (immediate) settlement, load bearing capacity; methods to reduce settlements and increase shear strength; the selection of a foundation system.",
            "id": "CIVENGR/GLE 532",
            "title": "FOUNDATIONS"
        }
    },
    {
        "data": {
            "description": "Soils, soil stabilization, aggregates, bituminous materials and mixtures, general highway materials and construction of rigid and flexible pavements.",
            "id": "CIVENGR 575",
            "parent": "CIVENGR",
            "title": "ADVANCED HIGHWAY MATERIALS AND CONSTRUCTION"
        }
    },
    {
        "data": {
            "description": "Stochastic methods in turbulent heat and momentum transfer; fully developed turbulence; numerical methods including model applications to boundary layers, reacting flows, mass transfer, and unsteady flows; linear and non-linear stability and transition; emphasis on applications of interest to Mechanical, Aerospace, and Environmental Engineers. Knowledge of fluid mechanics [such asM E 363orCBE 320] strongly encouraged.",
            "id": "CIVENGR/EMA/ME 775",
            "title": "TURBULENT HEAT AND MOMENTUM TRANSFER"
        }
    },
    {
        "data": {
            "description": "Stoichiometry and the mole concept, the behavior of gases, liquids and solids, thermochemistry, electronic structure of atoms and chemical bonding, descriptive chemistry of selected elements and compounds, intermolecular forces, and chemistry laboratory skills.",
            "id": "CHEM 103",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Stress and strain, torsion, bending of beams, shearing stresses in beams, compound stresses, principal stresses, deflections of beams, statically indeterminate members, columns. For civil engineers.",
            "id": "EMA 303",
            "parent": "EMA",
            "title": "MECHANICS OF MATERIALS"
        }
    },
    {
        "data": {
            "description": "Stress and strain, torsion, bending of beams, shearing stresses in beams, compound stresses, principal stresses, deflections of beams, statically indeterminate members, columns.",
            "id": "ME 306",
            "parent": "ME",
            "title": "MECHANICS OF MATERIALS"
        }
    },
    {
        "data": {
            "description": "Structural analysis, design, and construction.",
            "id": "CIVENGR 949",
            "parent": "CIVENGR",
            "title": "SEMINAR-STRUCTURAL ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Subsurface stress; rock failure criteria; openings in competent rock; openings in layered rocks; plastic behavior around openings in weak rock; stereographic projections and stereonet; block theory; rock bolts; stabilization methods and design.",
            "id": "CIVENGR/GLE 434",
            "title": "INTRODUCTION TO UNDERGROUND OPENINGS ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Survey and application of twentieth century design techniques in architecture.",
            "id": "CIVENGR 152",
            "parent": "CIVENGR",
            "title": "ARCHITECTURAL MAKING II"
        }
    },
    {
        "data": {
            "description": "Techniques of enhancement and quantification of remote sensing imagery. Emphasis on processing and analyzing data gathered by airborne and satellite sensors. Techniques to quantitatively analyze data from photography, electro-optical scanners, satellite systems, and radar and passive microwave systems. Applications to: agriculture and forestry, geology and soils, water quality, and urban and regional planning.",
            "id": "CIVENGR/ENVIRST/LANDARC 556",
            "title": "REMOTE SENSING DIGITAL IMAGE PROCESSING"
        }
    },
    {
        "data": {
            "description": "Techniques of integration, improper integrals, first order ordinary differential equations, sequences and series, Taylor series, vector geometry in two and three dimensions.",
            "id": "MATH 222",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 2"
        }
    },
    {
        "data": {
            "description": "The application of theoretically and academically acquired knowledge to a civil and environmental engineering problem in as near \"real-world\" as possible.",
            "id": "CIVENGR 578",
            "parent": "CIVENGR",
            "title": "SENIOR CAPSTONE DESIGN"
        }
    },
    {
        "data": {
            "description": "The effect of natural forces associated with storms, hurricanes, and water-level variations on the coastal zone, and efforts made to combat these forces. Wave and storm-surge prediction, the change of waves as they approach shore, and wave forces on the shore; shore erosion and littoral drift; nearshore pollution in lakes and oceans; harbor, breakwater, and revetment design.",
            "id": "CIVENGR 514",
            "parent": "CIVENGR",
            "title": "COASTAL ENGINEERING"
        }
    },
    {
        "data": {
            "description": "The first of two seminars for planning the activities of the practicum.",
            "id": "CIVENGR/ENVIRST/URBRPL 717",
            "title": "WATER RESOURCES MANAGEMENT PRACTICUM PLANNING SEMINAR I"
        }
    },
    {
        "data": {
            "description": "The influence of man-caused pollution on the atmosphere, globally and locally. Evaluation of human health, economic, and aesthetic effects of air pollution. Techniques for measurement of atmosphere pollutant concentrations and determination of local and regional air quality. Detailed presentation of air pollution sources and methods for their control. The role of local, state and federal government in air pollution control.",
            "id": "CIVENGR 423",
            "parent": "CIVENGR",
            "title": "AIR POLLUTION EFFECTS, MEASUREMENT AND CONTROL"
        }
    },
    {
        "data": {
            "description": "The second of two seminars for planning the field work, analysis, and reporting of the practicum.",
            "id": "CIVENGR/ENVIRST/URBRPL 718",
            "title": "WATER RESOURCES MANAGEMENT PRACTICUM PLANNING SEMINAR II"
        }
    },
    {
        "data": {
            "description": "The two semester sequenceMATH 112-MATH 113covers similar material asMATH 114, but in a slower pace. Not recommended for students with less than an AB inMATH 96.",
            "id": "MATH 114",
            "parent": "MATH",
            "title": "ALGEBRA AND TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "Theoretical and practical perspectives of traffic flow modeling with a focus on micro-simulation. Simulation software, such as CORSIM, VISSIM, and PARAMICS. Develop and calibrate a set of base models of existing conditions, extend the models to include design alternatives (generally using traffic demands projected for future years), and then generate conclusions on the basis of the modeling results.",
            "id": "CIVENGR 678",
            "parent": "CIVENGR",
            "title": "ADVANCED TRAFFIC MODELING AND COMPUTER SIMULATION"
        }
    },
    {
        "data": {
            "description": "Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Part of a 2-semester sequence withMATH 217; these two courses together are equivalent toMATH 114and221.",
            "id": "MATH 171",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY I"
        }
    },
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics and selected topics in Animal Physiology.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Topics vary.",
            "id": "CIVENGR 609",
            "parent": "CIVENGR",
            "title": "SPECIAL TOPICS IN WATER CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Topics vary.",
            "id": "CIVENGR 618",
            "parent": "CIVENGR",
            "title": "SPECIAL TOPICS IN HYDRAULICS AND FLUID MECHANICS"
        }
    },
    {
        "data": {
            "description": "Topics vary.",
            "id": "CIVENGR 619",
            "parent": "CIVENGR",
            "title": "SPECIAL TOPICS IN HYDROLOGY"
        }
    },
    {
        "data": {
            "description": "Topics vary.",
            "id": "CIVENGR 629",
            "parent": "CIVENGR",
            "title": "SPECIAL TOPICS IN ENVIRONMENTAL ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Topics vary.",
            "id": "CIVENGR 639",
            "parent": "CIVENGR",
            "title": "SPECIAL TOPICS IN GEOTECHNICAL ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Topics vary.",
            "id": "CIVENGR 649",
            "parent": "CIVENGR",
            "title": "SPECIAL TOPICS IN STRUCTURAL ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Topics vary.",
            "id": "CIVENGR 669",
            "parent": "CIVENGR",
            "title": "SPECIAL TOPICS IN CONSTRUCTION ENGINEERING AND MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Topics vary.",
            "id": "CIVENGR 679",
            "parent": "CIVENGR",
            "title": "SPECIAL TOPICS IN TRANSPORTATION AND CITY PLANNING"
        }
    },
    {
        "data": {
            "description": "Traffic data collection studies; measures of effectiveness and evaluation of traffic system performance; design and application of traffic control devices; design of traffic signal systems; operational controls and traffic management strategies.",
            "id": "CIVENGR 574",
            "parent": "CIVENGR",
            "title": "TRAFFIC CONTROL"
        }
    },
    {
        "data": {
            "description": "Under faculty supervision.",
            "id": "CIVENGR 299",
            "parent": "CIVENGR",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Under faculty supervision.",
            "id": "CIVENGR 699",
            "parent": "CIVENGR",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Under faculty supervision.",
            "id": "CIVENGR 790",
            "parent": "CIVENGR",
            "title": "MASTER'S RESEARCH OR THESIS"
        }
    },
    {
        "data": {
            "description": "Under faculty supervision.",
            "id": "CIVENGR 890",
            "parent": "CIVENGR",
            "title": "PRE-DISSERTATOR'S RESEARCH"
        }
    },
    {
        "data": {
            "description": "Under faculty supervision.",
            "id": "CIVENGR 990",
            "parent": "CIVENGR",
            "title": "THESIS"
        }
    },
    {
        "data": {
            "description": "Under faculty supervision.",
            "id": "CIVENGR 999",
            "parent": "CIVENGR",
            "title": "ADVANCED INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Undergrad honors research projects supervised by faculty members.",
            "id": "CIVENGR 489",
            "parent": "CIVENGR",
            "title": "HONORS IN RESEARCH"
        }
    },
    {
        "data": {
            "description": "Unit operations in wastewater treatment; physical, chemical, and biological processes for treatment of wastewater; sludge treatment and disposal; design of a wastewater treatment plant; site visits to wastewater treatment plants.",
            "id": "CIVENGR 426",
            "parent": "CIVENGR",
            "title": "DESIGN OF WASTEWATER TREATMENT PLANTS"
        }
    },
    {
        "data": {
            "description": "Uses the three paradigms of sustainability (environmental, social, and economic) for strategic environmental initiatives in an engineering setting. Proactive environmental management opportunities, including practices of pollution prevention, industrial ecology, and design for the environment. A systems approach to manufacturing, examining the life cycle of products, incorporating total cost accounting, extended producer responsibility, and design for end-of-life.",
            "id": "CIVENGR/GLE 421",
            "title": "ENVIRONMENTAL SUSTAINABILITY ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Water cycle as related to air mass properties and movement, precipitation, evaporation, snowmelt, infiltration, streamflow, watershed dynamics, and hydrologic extremes. Physics-based representations of hydrological processes. Basics of hydrologic modeling including calibration and validation.",
            "id": "CIVENGR 415",
            "parent": "CIVENGR",
            "title": "HYDROLOGY"
        }
    },
    {
        "data": {
            "description": "Water supply and demand are increasingly stressed by climate, population, land-use, policy, etc. Presents a variety of systems analysis techniques for water resources planning and management. Deterministic and stochastic optimization and simulation models will be developed and applied. Problems addressed include water supply, water quality, and river basin development.",
            "id": "CIVENGR 416",
            "parent": "CIVENGR",
            "title": "WATER RESOURCES SYSTEMS ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Wind Energy Development and Balance-of-Plant Design. Up-front coverage includes the science and mechanics of wind energy including turbine basics, wind resource assessment, energy production, and economic return. Balance-of-plant design aspects include site layout and micro-siting, foundation systems, collector systems and interconnection, site civil and electrical infrastructure, and structural tower analysis. Development includes environmental due diligence and permitting, stakeholder engagement, energy policy and markets, and levelized cost of energy (LCOE).",
            "id": "CIVENGR/GLE 535",
            "title": "WIND ENERGY BALANCE-OF-PLANT DESIGN"
        }
    },
    {
        "data": {
            "description": "Work experience that combines classroom theory with practical knowledge of operations to provide a background on which to develop and enhance a professional career. The work experience is tailored for MS students from within the U.S. as well as eligible international students.",
            "id": "CIVENGR 702",
            "parent": "CIVENGR",
            "title": "GRADUATE COOPERATIVE EDUCATION PROGRAM"
        }
    },
    {
        "data": {
            "description": "Work experience which combines classroom theory with practical knowledge of operations to provide students with a background upon which to base a professional career.",
            "id": "CIVENGR 1",
            "parent": "CIVENGR",
            "title": "COOPERATIVE EDUCATION PROGRAM"
        }
    },
    {
        "data": {
            "id": "AAE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CIVENGR",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ECE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "EMA",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "GEOSCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ME",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MICROBIO",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "PHYSICS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "STAT",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "AAE 101",
            "target": "AAE/CIVENGR/ENVIRST/URBRPL 561"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 101"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 151"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "MICROBIO 303"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 109"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CIVENGR 320"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CIVENGR 324"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CIVENGR 500"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CIVENGR 501"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CIVENGR/GLE 421"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CIVENGR/GLE 520"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "MICROBIO 303"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "BSE/CIVENGR/SOILSCI 372"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 115",
            "target": "CHEM 116"
        }
    },
    {
        "data": {
            "source": "CHEM 116",
            "target": "CIVENGR/M&ENVTOX/SOILSCI 631"
        }
    },
    {
        "data": {
            "source": "CIVENGR 159",
            "target": "CIVENGR 392"
        }
    },
    {
        "data": {
            "source": "CIVENGR 310",
            "target": "CIVENGR 410"
        }
    },
    {
        "data": {
            "source": "CIVENGR 310",
            "target": "CIVENGR 411"
        }
    },
    {
        "data": {
            "source": "CIVENGR 310",
            "target": "CIVENGR/GLE 511"
        }
    },
    {
        "data": {
            "source": "CIVENGR 311",
            "target": "CIVENGR 414"
        }
    },
    {
        "data": {
            "source": "CIVENGR 311",
            "target": "CIVENGR 416"
        }
    },
    {
        "data": {
            "source": "CIVENGR 311",
            "target": "CIVENGR 514"
        }
    },
    {
        "data": {
            "source": "CIVENGR 311",
            "target": "CIVENGR/GLE 612"
        }
    },
    {
        "data": {
            "source": "CIVENGR 320",
            "target": "CIVENGR 322"
        }
    },
    {
        "data": {
            "source": "CIVENGR 320",
            "target": "CIVENGR 325"
        }
    },
    {
        "data": {
            "source": "CIVENGR 320",
            "target": "CIVENGR 422"
        }
    },
    {
        "data": {
            "source": "CIVENGR 320",
            "target": "CIVENGR/GLE 520"
        }
    },
    {
        "data": {
            "source": "CIVENGR 340",
            "target": "CIVENGR 440"
        }
    },
    {
        "data": {
            "source": "CIVENGR 340",
            "target": "CIVENGR 445"
        }
    },
    {
        "data": {
            "source": "CIVENGR 340",
            "target": "CIVENGR 447"
        }
    },
    {
        "data": {
            "source": "CIVENGR 370",
            "target": "CIVENGR 570"
        }
    },
    {
        "data": {
            "source": "CIVENGR 370",
            "target": "CIVENGR 571"
        }
    },
    {
        "data": {
            "source": "CIVENGR 370",
            "target": "CIVENGR 572"
        }
    },
    {
        "data": {
            "source": "CIVENGR 370",
            "target": "CIVENGR 573"
        }
    },
    {
        "data": {
            "source": "CIVENGR 370",
            "target": "CIVENGR 574"
        }
    },
    {
        "data": {
            "source": "CIVENGR 370",
            "target": "CIVENGR 678"
        }
    },
    {
        "data": {
            "source": "CIVENGR 414",
            "target": "CIVENGR 578"
        }
    },
    {
        "data": {
            "source": "CIVENGR 415",
            "target": "CIVENGR 515"
        }
    },
    {
        "data": {
            "source": "CIVENGR 426",
            "target": "CIVENGR 621"
        }
    },
    {
        "data": {
            "source": "CIVENGR 445",
            "target": "CIVENGR 545"
        }
    },
    {
        "data": {
            "source": "CIVENGR 447",
            "target": "CIVENGR 547"
        }
    },
    {
        "data": {
            "source": "CIVENGR 494",
            "target": "CIVENGR/PUBAFFR 694"
        }
    },
    {
        "data": {
            "source": "CIVENGR/EMA 395",
            "target": "CIVENGR 495"
        }
    },
    {
        "data": {
            "source": "CIVENGR/EMA 395",
            "target": "CIVENGR 575"
        }
    },
    {
        "data": {
            "source": "CIVENGR/EMA 395",
            "target": "CIVENGR 576"
        }
    },
    {
        "data": {
            "source": "CIVENGR/ENVIRST/URBRPL 718",
            "target": "CIVENGR/ENVIRST/URBRPL 719"
        }
    },
    {
        "data": {
            "source": "CIVENGR/GEOSCI/GLE/MS&E 474",
            "target": "CIVENGR/GLE 434"
        }
    },
    {
        "data": {
            "source": "CIVENGR/GLE 291",
            "target": "CIVENGR 414"
        }
    },
    {
        "data": {
            "source": "CIVENGR/GLE 291",
            "target": "CIVENGR 465"
        }
    },
    {
        "data": {
            "source": "CIVENGR/GLE 291",
            "target": "CIVENGR/GLE 511"
        }
    },
    {
        "data": {
            "source": "CIVENGR/GLE 330",
            "target": "CIVENGR/GLE 430"
        }
    },
    {
        "data": {
            "source": "CIVENGR/GLE 330",
            "target": "CIVENGR/GLE 432"
        }
    },
    {
        "data": {
            "source": "CIVENGR/GLE 330",
            "target": "CIVENGR/GLE 530"
        }
    },
    {
        "data": {
            "source": "CIVENGR/GLE 330",
            "target": "CIVENGR/GLE 532"
        }
    },
    {
        "data": {
            "source": "CIVENGR/GLE 330",
            "target": "CIVENGR/GLE 635"
        }
    },
    {
        "data": {
            "source": "ECE 203",
            "target": "ECE 331"
        }
    },
    {
        "data": {
            "source": "ECE 331",
            "target": "CIVENGR 570"
        }
    },
    {
        "data": {
            "source": "ECE 331",
            "target": "CIVENGR 572"
        }
    },
    {
        "data": {
            "source": "EMA 201",
            "target": "CIVENGR 325"
        }
    },
    {
        "data": {
            "source": "EMA 201",
            "target": "CIVENGR/GEOSCI/GLE/MS&E 474"
        }
    },
    {
        "data": {
            "source": "EMA 201",
            "target": "CIVENGR/GLE 535"
        }
    },
    {
        "data": {
            "source": "EMA 201",
            "target": "EMA 303"
        }
    },
    {
        "data": {
            "source": "EMA 201",
            "target": "ME 240"
        }
    },
    {
        "data": {
            "source": "EMA 201",
            "target": "ME 306"
        }
    },
    {
        "data": {
            "source": "EMA 303",
            "target": "CIVENGR/EMA 395"
        }
    },
    {
        "data": {
            "source": "EMA 303",
            "target": "CIVENGR/GLE 330"
        }
    },
    {
        "data": {
            "source": "EMA/ME 307",
            "target": "CIVENGR 340"
        }
    },
    {
        "data": {
            "source": "ENVIRST/F&WECOL/GEOG/GEOSCI/GLE/LANDARC 371",
            "target": "CIVENGR/ENVIRST/LANDARC 556"
        }
    },
    {
        "data": {
            "source": "ENVIRST/GEOSCI 106",
            "target": "GEOSCI 100"
        }
    },
    {
        "data": {
            "source": "ENVIRST/GEOSCI 106",
            "target": "GEOSCI/GLE 627"
        }
    },
    {
        "data": {
            "source": "GEOSCI 100",
            "target": "ENVIRST/GEOSCI 106"
        }
    },
    {
        "data": {
            "source": "GEOSCI/GLE 627",
            "target": "CIVENGR 412"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 113"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 113",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 114",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 114"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "ENVIRST/F&WECOL/GEOG/GEOSCI/GLE/LANDARC 371"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "MATH 217"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "CIVENGR/ENVIRST/GEOSCI/GLE 444"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 213"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "STAT 324"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "source": "MATH 213",
            "target": "MATH 222"
        }
    },
    {
        "data": {
            "source": "MATH 217",
            "target": "CIVENGR 415"
        }
    },
    {
        "data": {
            "source": "MATH 217",
            "target": "ECE 203"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "CHEM 109"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "CIVENGR 494"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "CIVENGR 516"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "CIVENGR 525"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "CIVENGR/GLE 421"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "CIVENGR/GLE 520"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "CIVENGR/M&ENVTOX/SOILSCI 631"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "GEOSCI/GLE 627"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 222"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "PHYSICS 201"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "PHYSICS 202"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "PHYSICS 207"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "CIVENGR 311"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "CIVENGR/GLE 291"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "EMA 201"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "EMA 303"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 234"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "ME 240"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "ME 306"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "CIVENGR 310"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "CIVENGR 324"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 114"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "ME 240",
            "target": "CIVENGR 310"
        }
    },
    {
        "data": {
            "source": "ME 306",
            "target": "CIVENGR 340"
        }
    },
    {
        "data": {
            "source": "ME 306",
            "target": "CIVENGR/EMA/ME 508"
        }
    },
    {
        "data": {
            "source": "ME 306",
            "target": "EMA/ME 307"
        }
    },
    {
        "data": {
            "source": "MICROBIO 303",
            "target": "CIVENGR 425"
        }
    },
    {
        "data": {
            "source": "PHYSICS 103",
            "target": "PHYSICS 104"
        }
    },
    {
        "data": {
            "source": "PHYSICS 104",
            "target": "CIVENGR/M&ENVTOX/SOILSCI 631"
        }
    },
    {
        "data": {
            "source": "PHYSICS 201",
            "target": "CIVENGR 324"
        }
    },
    {
        "data": {
            "source": "PHYSICS 201",
            "target": "CIVENGR 360"
        }
    },
    {
        "data": {
            "source": "PHYSICS 201",
            "target": "CIVENGR/GLE 534"
        }
    },
    {
        "data": {
            "source": "PHYSICS 201",
            "target": "PHYSICS 103"
        }
    },
    {
        "data": {
            "source": "PHYSICS 201",
            "target": "PHYSICS 202"
        }
    },
    {
        "data": {
            "source": "PHYSICS 201",
            "target": "PHYSICS 207"
        }
    },
    {
        "data": {
            "source": "PHYSICS 202",
            "target": "CIVENGR 496"
        }
    },
    {
        "data": {
            "source": "PHYSICS 202",
            "target": "CIVENGR 497"
        }
    },
    {
        "data": {
            "source": "PHYSICS 202",
            "target": "PHYSICS 104"
        }
    },
    {
        "data": {
            "source": "PHYSICS 202",
            "target": "PHYSICS 208"
        }
    },
    {
        "data": {
            "source": "PHYSICS 207",
            "target": "PHYSICS 201"
        }
    },
    {
        "data": {
            "source": "PHYSICS 207",
            "target": "PHYSICS 208"
        }
    },
    {
        "data": {
            "source": "PHYSICS 208",
            "target": "PHYSICS 202"
        }
    },
    {
        "data": {
            "source": "STAT 324",
            "target": "CIVENGR 370"
        }
    },
    {
        "data": {
            "source": "STAT 324",
            "target": "CIVENGR 516"
        }
    },
    {
        "data": {
            "source": "STAT 324",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "source": "STAT 371",
            "target": "STAT 324"
        }
    }
]