[
    {
        "data": {
            "description": "An exploration of African and Black Diaspora interpretations of biblical literature (Hebrew and Greek Testaments). Includes a survey of Sub-Saharan Africans' roles in the Bible; studies the translation of the Bible in the 4th - 5th centuries CE in Axumite Ethiopia; follows the movement of biblical interpretation across the Middle Passage; explores the intellectual dimensions of Black Diaspora biblical interpretation in North America and the Caribbean. Discuss hermeneutics and reading strategies, the interplay of colonialist and post-colonialist dynamics of reading, and methods of reading scriptural texts.",
            "id": "CLASSICS 315",
            "parent": "CLASSICS",
            "title": "AFRICANA APPROACHES TO BIBLICAL INTERPRETATION"
        }
    },
    {
        "data": {
            "description": "Explores the history and culture of ancient Palmyra. Topics considered during the first half of the course will include the city-state's art, architecture, economy, religion, and foreign relations - including with the Roman and Sassanian Empires. Also explores issues of identity and reception centered on the following questions: How did Palmyrenes in the service of the Roman army retain their ethnic identity while also integrating into Roman society? How is ancient Palmyrene society remembered and used by modern cultures to promote diverse political goals? and What effects do museum collection and display and academic publication have on our perception of ancient Palmyra?",
            "id": "CLASSICS 523",
            "parent": "CLASSICS",
            "title": "PALMYRA AND THE PALMYRENES"
        }
    },
    {
        "data": {
            "description": "Explores the legacy of ancient Greek and Roman Civilization in modern culture. Reflect on the roots of western civilization and understand and interpret reflections of antiquity in today's society.",
            "id": "CLASSICS 100",
            "parent": "CLASSICS",
            "title": "LEGACY OF GREECE AND ROME IN MODERN CULTURE"
        }
    },
    {
        "data": {
            "description": "Aims to improve research skills, help develop important expertise not gained in general coursework, and to engage with topics that make CANES graduates distinctive when applying for positions after the PhD.",
            "id": "CLASSICS 900",
            "parent": "CLASSICS",
            "title": "ADVANCED SEMINAR IN THEORY AND METHODOLOGY"
        }
    },
    {
        "data": {
            "description": "An examination of current problems, methods, and trends in archaeological research in the lands of the Bible.",
            "id": "CLASSICS/JEWISH 451",
            "title": "BIBLICAL ARCHAEOLOGY"
        }
    },
    {
        "data": {
            "description": "An examination of the evolution of the human community in the Mediterranean Basin, from the beginning of the earliest civilizations in the Near East (3,000 B.C.E.) until the collapse of the Roman Empire in the West (500 C.E.).",
            "id": "CLASSICS/HISTORY 110",
            "title": "THE ANCIENT MEDITERRANEAN"
        }
    },
    {
        "data": {
            "description": "An exploration of the literary and historical aspects of the text of 1-2 Samuel + 1 Kings 1-2; the history and archaeology of Jerusalem during the tenth century B.C.E.; and the varieties of ways in which the figure of King David has been received in subsequent religious and secular literature, visual art, music, television, and cinema.",
            "id": "CLASSICS/JEWISH/RELIGST 335",
            "title": "KING DAVID IN HISTORY AND TRADITION"
        }
    },
    {
        "data": {
            "description": "An introduction to the literature, history, and culture of Greece, Rome, and the Ancient Near East. Topics vary.",
            "id": "CLASSICS 101",
            "parent": "CLASSICS",
            "title": "TOPICS IN CLASSICAL AND ANCIENT NEAR EASTERN STUDIES"
        }
    },
    {
        "data": {
            "description": "An introduction to the study of Ancient Egypt, analyzing its political clout through two millennia of history, its society and economy, its variegated religious systems, the art and literature it produced, and its reception in the modern period.",
            "id": "CLASSICS 321",
            "parent": "CLASSICS",
            "title": "THE EGYPTIANS:  HISTORY, SOCIETY, AND LITERATURE"
        }
    },
    {
        "data": {
            "description": "An introduction to the study of the Bible as literature and of biblical reception in the medium of film, from early Hollywood to the present day. Explores the way in which the Bible (including both Hebrew and Greek Testaments), one of the foundational literary corpora of American society, has been interpreted, reinterpreted, and misinterpreted through the medium of film over the past century. We will begin each segment of the course by reading portions of the biblical text that have experienced significant interpretation, in order to understand the literary text that has been received in film.  How beholden are filmmakers to the interpretations of communities that view these texts as authoritative, and where are they free to depart from their sources? Is it possible to \"translate\" biblical narratives into film without losing something in the translation? These questions will focus our study on ways the literature has been interpreted in this new medium.",
            "id": "CLASSICS/JEWISH/RELIGST 323",
            "title": "THE BIBLE AND FILM: LITERATURE AND MEDIA"
        }
    },
    {
        "data": {
            "description": "An introduction to the thought, literature, and history of the prophets of ancient Israel (in English).",
            "id": "CLASSICS/HEBR-BIB/JEWISH/LITTRANS/RELIGST 332",
            "title": "PROPHETS OF THE BIBLE"
        }
    },
    {
        "data": {
            "description": "An overview of archaeology and its relationship to understanding the biblical world.",
            "id": "CLASSICS/JEWISH 241",
            "title": "INTRODUCTION TO BIBLICAL ARCHAEOLOGY"
        }
    },
    {
        "data": {
            "description": "Ancient monsters were forces of chaos that threatened the natural order of the universe: they had to be contained, banished to the edges of the world or destroyed. But the Greeks and Romans also believed them to be magical beings that held the promise of special knowledge - of the past, of dangers to be faced, of musical arts - or which, like the Sphinx, possessed an enigmatic intelligence capable of fooling all but the most cunning of mortals. Investigate these contrasting aspects of ancient monsters, drawing directly on texts (in translation) and works of art through which the Greeks and Romans explored the monstrous and its place in their world. Compare ancient representations with those in modern artistic media - comics, games, stories and movies - considering both how our notions of the monstrous are influenced by or contrast with those of our ancient predecessors, and how our very identities are created by and enacted through our depictions of monsters.",
            "id": "CLASSICS 150",
            "parent": "CLASSICS",
            "title": "ANCIENT GREEK AND ROMAN MONSTERS"
        }
    },
    {
        "data": {
            "description": "Ancient religions in their political, social and cultural contexts; topics include ritual, literary and artistic representations, religious persecutions, and/or modern approaches to the study of ancient religions. Chronological and geographical focus will vary between Greece, Rome, Judaea and Egypt.",
            "id": "CLASSICS/HISTORY/RELIGST 517",
            "title": "RELIGIONS OF THE ANCIENT MEDITERRANEAN"
        }
    },
    {
        "data": {
            "description": "Classical myths and their influence on later literature and art.",
            "id": "CLASSICS 270",
            "parent": "CLASSICS",
            "title": "CLASSICAL MYTHOLOGY"
        }
    },
    {
        "data": {
            "description": "Constructions of gender and sexuality in the classical world through art, literature and archaeology.",
            "id": "CLASSICS/GEN&WS 351",
            "title": "WOMEN AND GENDER IN THE CLASSICAL WORLD"
        }
    },
    {
        "data": {
            "description": "Demonstrate knowledge of Classical and ancient Near Eastern societies and cultures through examination and interpretation of ancient texts in translation. Learn to compare and critique ancient Greek, Roman, and/or Near Eastern societies and cultures to other societies and cultures. Produce an original scholarly project based on ancient Greek, Roman, or Near Eastern society and culture.",
            "id": "CLASSICS 591",
            "parent": "CLASSICS",
            "title": "UNDERGRADUATE SEMINAR: APPROACHES TO THE CLASSICAL WORLD"
        }
    },
    {
        "data": {
            "description": "Discover the elements of Latin and Greek that are most commonly used in modern medicine. Learn a great deal about the cultural influences that lie behind the linguistic developments, and explore some of the striking contrasts between ancient and modern medicine.",
            "id": "CLASSICS 205",
            "parent": "CLASSICS",
            "title": "GREEK AND LATIN ORIGINS OF MEDICAL TERMS"
        }
    },
    {
        "data": {
            "description": "Examine ways in which the ancient Greeks and Romans interacted with their Mediterranean environments and the various conceptions of the natural world that they developed in poetry, prose and visual art. Explore a number of general topics that will underpin the course as a whole: the characteristics of the Mediterranean environment, the effect of nature on humankind, and the impact of humankind on nature. Study aspects of Greek and Roman engagements with nature, such as agriculture, hunting, sacrifice, the contested relationship between the natural and the civilized, and representations of human beings using terms drawn from the natural world (\"bears\" of Artemis, cannibalistic \"wolves\"). Consider how these aspects of the ancient world relate to modern treatments of such themes. (NB: All Greek and Latin texts will be read in English translation.)",
            "id": "CLASSICS/ENVIRST 488",
            "title": "GREEKS, ROMANS AND THE NATURAL ENVIRONMENT"
        }
    },
    {
        "data": {
            "description": "Examines central literary and cultural issues in classical antiquity from both Greek and Roman perspectives.",
            "id": "CLASSICS 970",
            "parent": "CLASSICS",
            "title": "CLASSICAL LITERATURE AND CULTURE"
        }
    },
    {
        "data": {
            "description": "Examines the intersections of sex and violence in biblical and related literature. Read through a variety of lenses, including feminist interpretation, queer theory, and post-colonial theory. Consider how, why, and for whom texts depicting gender violence worked in the ancient world. Explore the reception of such texts in art, fiction, and film and their impact on modern society.",
            "id": "CLASSICS 308",
            "parent": "CLASSICS",
            "title": "SEX AND VIOLENCE IN THE ANCIENT NEAR EAST"
        }
    },
    {
        "data": {
            "description": "Explores how classical antiquity has been adapted, translated, and reimagined in the modern world through a variety of media and critical approaches.",
            "id": "CLASSICS 420",
            "parent": "CLASSICS",
            "title": "ANCIENT TEXTS, MODERN CONTEXTS"
        }
    },
    {
        "data": {
            "description": "Explores key issues in the ideology and practice of Athenian democracy. Examines democratic values, institutions, rhetoric, and sociology in order to provide the basic tools to understand democracy in its ancient context.  Engages with a variety of source material (literary, archaeological, epigraphic) in order to develop multiple skills of interpretation. Some questions examined include: What are the key features of Athenian democracy, how did it change over time, and how did it differ from modern democracy? How did the Athenians justify and critique this political system? How did they reconcile citizen egalitarianism with social inequalities of wealth, gender, and status? To what extent were women, foreigners, slaves, or the poor included or excluded from politics? Was Athenian democracy a robust political system or a system in crisis?",
            "id": "CLASSICS/HISTORY/POLISCI 362",
            "title": "ATHENIAN DEMOCRACY"
        }
    },
    {
        "data": {
            "description": "Explores the art and archaeology of ancient Greece from the Bronze Age through the Hellenistic period.",
            "id": "ARTHIST/CLASSICS 300",
            "title": "THE ART AND ARCHAEOLOGY OF ANCIENT GREECE"
        }
    },
    {
        "data": {
            "description": "Explores the art and archaeology of ancient Greece from the Bronze Age through the Hellenistic period.",
            "id": "ARTHIST/CLASSICS 700",
            "title": "THE ART AND ARCHAEOLOGY OF ANCIENT GREECE"
        }
    },
    {
        "data": {
            "description": "Explores the art and archaeology of ancient Italy, the Roman Republic, and the Roman Empire from the Iron Age to Late Antiquity.",
            "id": "ARTHIST/CLASSICS 304",
            "title": "THE ART AND ARCHAEOLOGY OF ANCIENT ROME"
        }
    },
    {
        "data": {
            "description": "Explores the art and archaeology of ancient Italy, the Roman Republic, and the Roman Empire from the Iron Age to Late Antiquity.",
            "id": "ARTHIST/CLASSICS 704",
            "title": "THE ART AND ARCHAEOLOGY OF ANCIENT ROME"
        }
    },
    {
        "data": {
            "description": "Explores the legacy of ancient Greek, Roman, and Near Eastern art and science in later historical periods of Western culture. Identify, analyze and critique the roots of western culture and to understand and interpret how classical cultures influence global arts and sciences past and present.",
            "id": "CLASSICS 206",
            "parent": "CLASSICS",
            "title": "CLASSICAL INFLUENCES ON WESTERN ART AND SCIENCE"
        }
    },
    {
        "data": {
            "description": "Explores topics in the archaeology of ancient Greece and Rome, such as the Seven Wonders of the Ancient World, the archaeology of Greek and Roman religion, or Late Antique Palaces.",
            "id": "CLASSICS 430",
            "parent": "CLASSICS",
            "title": "TOPICS IN CLASSICAL ARCHAEOLOGY"
        }
    },
    {
        "data": {
            "description": "General principles of reading ancient literature in translation. Topics include: genres and forms of ancient literature, oral and written cultures, social context of ancient literature, ancient and modern practices of linguistic translation, interactions between literary texts and other media, ancient literature and modern categories.",
            "id": "CLASSICS 102",
            "parent": "CLASSICS",
            "title": "TOPICS IN CLASSICAL AND ANCIENT NEAR EASTERN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Greek literature in translation with emphasis on its social background.",
            "id": "CLASSICS 320",
            "parent": "CLASSICS",
            "title": "THE GREEKS"
        }
    },
    {
        "data": {
            "description": "In depth study of key works of Roman political thought, along with recent and classic scholarship in political theory, history, philosophy, classics, and literature.",
            "id": "CLASSICS/POLISCI 834",
            "title": "ROMAN POLITICAL THOUGHT"
        }
    },
    {
        "data": {
            "description": "Independent study as arranged with a faculty member.",
            "id": "CLASSICS 699",
            "parent": "CLASSICS",
            "title": "DIRECTED READING"
        }
    },
    {
        "data": {
            "description": "Individual mentored study for seniors completing theses for Honors in the Major as arranged with a faculty member.",
            "id": "CLASSICS 681",
            "parent": "CLASSICS",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Individual mentored study for seniors completing theses for Honors in the Major as arranged with a faculty member.",
            "id": "CLASSICS 682",
            "parent": "CLASSICS",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Individual mentored study for seniors completing theses, as arranged with a faculty member.",
            "id": "CLASSICS 691",
            "parent": "CLASSICS",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Individual mentored study for seniors completing theses, as arranged with a faculty member.",
            "id": "CLASSICS 692",
            "parent": "CLASSICS",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Interrogates the phenomenon and notion of \"conspiracy\" within the political, social, and religious spheres of the ancient Roman world. Explores the structure of the traditional Roman household, including the preeminence of the paterfamilias and the challenges that women, children, and/or slaves pose to his notional \"tyranny\". Considers a number of prominent religions that came into conflict with Roman authorities - especially the mystery cults surrounding Bacchus as well as early Christianity. Apply insights from the ancient world to the modern one in our consideration of conspiracies such as the Salem Witch Trials, the Red Scare of the '50s, the Kennedy Assassination, and the Watergate Conspiracy.",
            "id": "CLASSICS 340",
            "parent": "CLASSICS",
            "title": "CONSPIRACY IN THE ANCIENT AND MODERN WORLDS"
        }
    },
    {
        "data": {
            "description": "Introduction to the text, development, history, and social context of the Hebrew Bible/Old Testament. Covers the Torah (Pentateuch), Neviim (Former and Latter Prophets), and Ketuvim (Writings), and provides a brief introduction to early Jewish literature (Pseudepigrapha/Apocrypha). Discusses various methods of analysis and theories of composition. Addresses major theological claims made of the text by Jewish and Christian communities. Explores contextualized interpretations in the ancient and modern day.",
            "id": "CLASSICS/JEWISH/LITTRANS/RELIGST 227",
            "title": "INTRODUCTION TO BIBLICAL LITERATURE (IN ENGLISH)"
        }
    },
    {
        "data": {
            "description": "Jewish literature from 350 BCE to 150 CE. The Greek and Hebrew sources include stories, religious poetry, wisdom books and apocalyptic texts. Readings (in translation) from the Apocrypha, Pseudepigrapha, and the Dead Sea Scrolls in their historical, cultural and literary setting.",
            "id": "CLASSICS/JEWISH/RELIGST 346",
            "title": "JEWISH LITERATURE OF THE GRECO-ROMAN PERIOD"
        }
    },
    {
        "data": {
            "description": "Latin literature in translation with emphasis on its social background.",
            "id": "CLASSICS 322",
            "parent": "CLASSICS",
            "title": "THE ROMANS"
        }
    },
    {
        "data": {
            "description": "Selected aspects of Classical culture (e.g., sports, women, the family, warfare ), with emphasis on literary remains.",
            "id": "CLASSICS 373",
            "parent": "CLASSICS",
            "title": "TOPICS IN CLASSICAL CULTURE"
        }
    },
    {
        "data": {
            "description": "Selected aspects of Greek culture (e.g., sports, women, the family, warfare), with emphasis on literary remains.",
            "id": "CLASSICS 371",
            "parent": "CLASSICS",
            "title": "TOPICS IN GREEK CULTURE"
        }
    },
    {
        "data": {
            "description": "Sex as a source of domination and liberation in Ancient Greek and Roman literature and modern European and North American theory and practice, including questions of sexual orientation, gender identity, violence, and self-realization.",
            "id": "CLASSICS/GEN&WS 361",
            "title": "SEX AND POWER IN GREECE AND ROME"
        }
    },
    {
        "data": {
            "description": "Special problems in Greek and Roman history.",
            "id": "CLASSICS/HISTORY 801",
            "title": "SEMINAR-ANCIENT HISTORY"
        }
    },
    {
        "data": {
            "description": "What do we mean when we talk about nature? What does it mean to call something natural? Are humans part of nature, and is human difference a product of nature or culture? An introduction to the concepts of nature, culture, and race in both the ancient Mediterranean and contemporary US society with an emphasis on how ancient accounts of human difference have shaped-and continue to shape-modern discourse. Approaching the topics of race, nature, and the environment using critical resources afforded by the humanities, consider how the nature/culture binary is deployed in definitions for race and ethnicity, and show how the experiences of racially marginalized groups in the United States are impacted by ancient debates surrounding nature and human difference, as well as their re-articulation over the intervening millennia.",
            "id": "CLASSICS 103",
            "parent": "CLASSICS",
            "title": "NATURE, RACE, AND HUMAN DIFFERENCE"
        }
    },
    {
        "data": {
            "id": "CLASSICS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "CLASSICS/JEWISH/LITTRANS/RELIGST 227",
            "target": "CLASSICS/HEBR-BIB/JEWISH/LITTRANS/RELIGST 332"
        }
    }
]