[
    {
        "data": {
            "description": "Analysis from a financial planner's perspective of the process of planning the accumulation, conservation, and distribution of an estate, in the manner that most effectively and efficiently accomplishes an individual's personal tax and non-tax objectives.",
            "id": "CNSRSCI 635",
            "parent": "CNSRSCI",
            "title": "ESTATE PLANNING FOR FINANCIAL PLANNERS"
        }
    },
    {
        "data": {
            "description": "Analysis of consumer policies enacted and proposed at federal, state, and municipal levels; application of economic analysis to consumer laws, public policies and regulations; study of the process of creating and enforcing legislation and impacts on consumers' well-being.",
            "id": "CNSRSCI 579",
            "parent": "CNSRSCI",
            "title": "CONSUMER POLICY ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Analysis of the consumer's market, consumer's behavior, and government policies affecting the consumer in the American economy.",
            "id": "CNSRSCI 477",
            "parent": "CNSRSCI",
            "title": "THE CONSUMER AND THE MARKET"
        }
    },
    {
        "data": {
            "description": "As the saying goes, money can't buy happiness -- but in modern America, we certainly try. This course will provide an overview of the study of happiness and well-being, examine how consumers engage in consumption in pursuit of happiness, as well as explore the emergence of the experience economy, and the intersection of money and well-being. Students will read academic and popular pieces on positive psychology, prosocial spending and explore the psychology of persuasion in the promises associated with this industry. In addition to integrating visual media, students will have the opportunity to experience first-hand whether the advice works in their own lives.",
            "id": "CNSRSCI/RELIGST 173",
            "title": "CONSUMING HAPPINESS"
        }
    },
    {
        "data": {
            "description": "Covers the graphs, properties and geometric significance of trigonometric functions of a real variable. Other topics include trigonometric equations and identities, application, trigonometric form of complex numbers, DeMoivre's theorem, and polar and parametric equations. The course also has a significant number of applications, especially related to other disciplines.",
            "id": "MATH 113",
            "parent": "MATH",
            "title": "TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "A supervised internship providing hands-on training in a professional experience in consumer science related fields.",
            "id": "CNSRSCI 601",
            "parent": "CNSRSCI",
            "title": "CONSUMER SCIENCE INTERNSHIP"
        }
    },
    {
        "data": {
            "description": "A supervised internship providing hands-on training in a professional experience in retailing related fields.",
            "id": "CNSRSCI 603",
            "parent": "CNSRSCI",
            "title": "RETAILING INTERNSHIP"
        }
    },
    {
        "data": {
            "description": "Analyses from social and psychological perspectives. Motivation, perception, learning and attitude formation. Effects of social class, family structure, cultural backgrounds and reference groups.",
            "id": "CNSRSCI 657",
            "parent": "CNSRSCI",
            "title": "CONSUMER BEHAVIOR"
        }
    },
    {
        "data": {
            "description": "Analysis of consumer patterns of spending and saving from a lifecycle perspective. Introduces consumption theory and economic, social and psychological factors affecting consumption patterns.",
            "id": "CNSRSCI 527",
            "parent": "CNSRSCI",
            "title": "CONSUMER SPENDING AND SAVING OVER THE LIFECYCLE"
        }
    },
    {
        "data": {
            "description": "Analysis of objectives of public policies specifically concerned with the economic welfare of families as expressed or proposed in federal and state legislation; appraisal of their economic and social consequences; and analysis of the issue.",
            "id": "CNSRSCI 575",
            "parent": "CNSRSCI",
            "title": "FAMILY ECONOMICS AND PUBLIC POLICY"
        }
    },
    {
        "data": {
            "description": "Analysis of the family as a unique economic unit in the changing American economy.",
            "id": "CNSRSCI 475",
            "parent": "CNSRSCI",
            "title": "FAMILY ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Application of advanced analytical techniques to examine household financial risk. Implications for financial planning of changes in family structure and earnings. Private and social insurance that guard against economic consequences of death, disability, ill health, retirement, marital dissolution. Use of financial planning software.",
            "id": "CNSRSCI 665",
            "parent": "CNSRSCI",
            "title": "HOUSEHOLD RISK MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Applied personal finance in college and after graduation. Financial values and behaviors, debt and credit, housing, transportation, retirement planning, investing, spending and saving plans.",
            "id": "CNSRSCI 111",
            "parent": "CNSRSCI",
            "title": "FINANCIAL LIFE SKILLS"
        }
    },
    {
        "data": {
            "description": "Behavior, including its development, motivation, frustrations, emotion, intelligence, learning, forgetting, personality, language, thinking, and social behavior.",
            "id": "PSYCH 202",
            "parent": "PSYCH",
            "title": "INTRODUCTION TO PSYCHOLOGY"
        }
    },
    {
        "data": {
            "description": "Build fundamental skills and processes to develop a strong foundation in business analysis utilizing Excel. Learn the fundamentals of data construction, manipulation, summarization, analysis and presentation.",
            "id": "GENBUS 106",
            "parent": "GENBUS",
            "title": "FOUNDATIONAL SKILLS FOR BUSINESS ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Developing store image through visual merchandising, advertising, sales, and other promotional activities.",
            "id": "CNSRSCI 560",
            "parent": "CNSRSCI",
            "title": "RETAIL PROMOTION"
        }
    },
    {
        "data": {
            "description": "Develops professional skills. Provides opportunities for presenting research and respectfully critiquing the work of others.",
            "id": "CNSRSCI 920",
            "parent": "CNSRSCI",
            "title": "CONSUMER SCIENCE GRADUATE WORKSHOP"
        }
    },
    {
        "data": {
            "description": "Directed study projects as arranged with a faculty member.",
            "id": "CNSRSCI 699",
            "parent": "CNSRSCI",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Directed study projects as arranged with a faculty member.",
            "id": "CNSRSCI 999",
            "parent": "CNSRSCI",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Directed study projects for freshmen and sophomores as arranged with a faculty member.",
            "id": "CNSRSCI 299",
            "parent": "CNSRSCI",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Economic problems of individuals, firms and industries with emphasis on value, price, and distribution of income.",
            "id": "ECON 101",
            "parent": "ECON",
            "title": "PRINCIPLES OF MICROECONOMICS"
        }
    },
    {
        "data": {
            "description": "Examine student learning and development to become effective peer educators in the Badger$ense Financial Life Skills program. Learn about common financial issues college students face. Develop knowledge and skills related to interpersonal and group communication, the impact of leadership, group learning and how to create a positive financial learning experience.",
            "id": "CNSRSCI 390",
            "parent": "CNSRSCI",
            "title": "FINANCIAL LIFE SKILLS: PEER EDUCATION TECHNIQUES"
        }
    },
    {
        "data": {
            "description": "Examines both financial and managerial accounting for business decisions. Emphasizes preparation and interpretation of financial statements, analysis of financial information, determination of costs for products and services, and use of accounting information for planning and control of business operations.",
            "id": "ACCTIS 300",
            "parent": "ACCTIS",
            "title": "ACCOUNTING PRINCIPLES"
        }
    },
    {
        "data": {
            "description": "Examines generally accepted accounting principles for measurement and reporting of financial information in a balance sheet, income statement, and statement of cash flows; introduction to analysis and interpretation of financial accounting data for decision-making purposes.",
            "id": "ACCTIS 100",
            "parent": "ACCTIS",
            "title": "INTRODUCTORY FINANCIAL ACCOUNTING"
        }
    },
    {
        "data": {
            "description": "Examines how consumers influence sustainability and social justice through their purchases and how policy and globalization influence their choices.",
            "id": "CNSRSCI 360",
            "parent": "CNSRSCI",
            "title": "SUSTAINABLE AND SOCIALLY JUST CONSUMPTION"
        }
    },
    {
        "data": {
            "description": "Examines how local communities inform family economic well-being. Explores the intersection of people and organizations using quantitative and qualitative techniques.",
            "id": "CNSRSCI 830",
            "parent": "CNSRSCI",
            "title": "FAMILIES AND HOUSEHOLDS IN COMMUNITIES"
        }
    },
    {
        "data": {
            "description": "Experience the current financial services market from the perspective of real families. Design, develop and evaluate innovative solutions to improve service or address unmet needs.",
            "id": "CNSRSCI 255",
            "parent": "CNSRSCI",
            "title": "CONSUMER FINANCIAL SERVICES INNOVATION"
        }
    },
    {
        "data": {
            "description": "Explores the interrelationships of health, health insurance, the health care system, and financial well-being. Provides an in-depth understanding of how the financing and delivery of health care affects consumer financial health, as well as consumer financial health as a central determinant of individual health.",
            "id": "CNSRSCI 820",
            "parent": "CNSRSCI",
            "title": "HEALTH AND FINANCIAL WELL-BEING"
        }
    },
    {
        "data": {
            "description": "Exploring applications of consumer behavior and insights in developing strategies for consumer engagement.",
            "id": "CNSRSCI 561",
            "parent": "CNSRSCI",
            "title": "CONSUMER ENGAGEMENT STRATEGIES"
        }
    },
    {
        "data": {
            "description": "Financial coaching is an approach influenced by the fields of positive psychology and behavioral economics to help individuals build financial capability. This experiential course will prepare students for financial, social work, and asset building services.",
            "id": "CNSRSCI 355",
            "parent": "CNSRSCI",
            "title": "FINANCIAL COACHING"
        }
    },
    {
        "data": {
            "description": "For the majority of Americans, money and family life is intertwined. Learn about the basics of relationship formation and dissolution, gender and family dynamics and the psychology of money with the goal of encouraging financial equality among members of families of all types.",
            "id": "CNSRSCI 273",
            "parent": "CNSRSCI",
            "title": "FINANCES & FAMILIES"
        }
    },
    {
        "data": {
            "description": "Foundational knowledge of the retail industry including the retail process, the evolution of the industry, key drivers and trends to provide a framework and set of concepts that will support the remainder of the core retail courses.",
            "id": "CNSRSCI 257",
            "parent": "CNSRSCI",
            "title": "INTRODUCTION TO RETAIL"
        }
    },
    {
        "data": {
            "description": "Independent research and writing under the supervision of a faculty member.",
            "id": "CNSRSCI 990",
            "parent": "CNSRSCI",
            "title": "RESEARCH AND THESIS"
        }
    },
    {
        "data": {
            "description": "Individual study as arranged with a faculty member.",
            "id": "CNSRSCI 690",
            "parent": "CNSRSCI",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Individual study in honors as arranged with a faculty member.",
            "id": "CNSRSCI 680",
            "parent": "CNSRSCI",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Integrated treatment of macroeconomics and microeconomics (seeECON 101andECON 102). Accelerated approach to economics training, especially for Economics: Math Emphasis majors.",
            "id": "ECON 111",
            "parent": "ECON",
            "title": "PRINCIPLES OF ECONOMICS-ACCELERATED TREATMENT"
        }
    },
    {
        "data": {
            "description": "Introduction to consumer finance and the concepts and methods used in consumer planning and financial management. Topics covered include budgeting, credit, investing, insurance, taxes, retirement, estate planning, mortgages, and an introduction to behavioral finance. Discuss methods for calculating, planning, and allocating resources to attain specific financial objectives.",
            "id": "CNSRSCI 175",
            "parent": "CNSRSCI",
            "title": "INTRODUCTION TO CONSUMER FINANCE"
        }
    },
    {
        "data": {
            "description": "Introduction to consumer finance covering techniques of personal sector cash flow, asset and liability management, life cycle financial planning, investment management, tax planning, retirement, and estate planning. Analysis and evaluation related to personal financial planning.",
            "id": "CNSRSCI 275",
            "parent": "CNSRSCI",
            "title": "INTRODUCTION TO PERSONAL FINANCIAL PLANNING"
        }
    },
    {
        "data": {
            "description": "Introduction to data analysis for social scientists using spreadsheets software - with specific applications to economics, business and finance - including data management and manipulation; formulas and calculations; data visualization and presentation using charts and graphics; statistical and visual analysis of economic indicators using tables, functions, graphs and descriptive statistics; and optimization of functions with economic and financial data.",
            "id": "AAE 335",
            "parent": "AAE",
            "title": "INTRODUCTION TO DATA ANALYSIS USING SPREADSHEETS"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Introduction to empirical consumer science research methods, with an emphasis on application. Covers different types of data structures commonly encountered, statistical properties of data, bivariate and multivariate linear regression models.",
            "id": "CNSRSCI 768",
            "parent": "CNSRSCI",
            "title": "INTRODUCTION TO QUANTITATIVE METHODS IN SOCIAL SCIENCE"
        }
    },
    {
        "data": {
            "description": "Introduction to research at the intersection of family and poverty studies. Learn how family behaviors vary by socioeconomic status; how romantic relationships, childbearing, and childrearing may be implicated in poverty; what the consequences of poverty are for family functioning and children; and about the role of policy in influencing families and poverty.",
            "id": "CNSRSCI/HDFS 465",
            "title": "FAMILIES & POVERTY"
        }
    },
    {
        "data": {
            "description": "Key issues in international retailing with consideration of the global consumer.",
            "id": "CNSRSCI 562",
            "parent": "CNSRSCI",
            "title": "THE GLOBAL CONSUMER"
        }
    },
    {
        "data": {
            "description": "Learn how to assess and prevent household financial problems and improve financial security. Based on the context of vulnerable households, financial services and public policy,  focus on skills related to managing cash flow, credit and debt, saving for emergencies and long-term goals.",
            "id": "CNSRSCI 340",
            "parent": "CNSRSCI",
            "title": "BUILDING FINANCIAL ASSETS AND CAPABILITY FOR VULNERABLE FAMILIES"
        }
    },
    {
        "data": {
            "description": "Leverage data analysis to drive consumer business decisions via the telling of a compelling, evidence-based story. Structured to 1) provide you with a core process by which data analysis can produce effective business actions, 2) build your analytical abilities to execute the process and 3) establish a method by which analytical results can be transformed into effective stories. The process and methods studied will have application across a broad range of careers.",
            "id": "CNSRSCI 301",
            "parent": "CNSRSCI",
            "title": "CONSUMER ANALYTICS"
        }
    },
    {
        "data": {
            "description": "Leveraging a combination of design thinking and strategic planning, students will design a clear plan of action with compelling evidence for expected outcomes, implement the proposed plan with contingencies for the inevitable challenges and adjustments, and evaluate impact relative to goals with objective recommendations for future action.",
            "id": "CNSRSCI 555",
            "parent": "CNSRSCI",
            "title": "CONSUMER DESIGN STRATEGIES & EVALUATION"
        }
    },
    {
        "data": {
            "description": "Measures of central tendency, variability; probability, sampling distributions; hypothesis testing, confidence intervals; t-tests; Chi-square; regression and correlation (linear) and introduction to analysis of variance (1-way).",
            "id": "PSYCH 210",
            "parent": "PSYCH",
            "title": "BASIC STATISTICS FOR PSYCHOLOGY"
        }
    },
    {
        "data": {
            "description": "Merchandise product development planning through market trend analysis, assortment planning  sourcing production.",
            "id": "CNSRSCI 567",
            "parent": "CNSRSCI",
            "title": "PRODUCT DEVELOPMENT STRATEGIES IN RETAILING"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Provide a broad-based knowledge of the consumer behavior literature. Develop skills to be an active researcher in fields that require an understanding of consumer research.",
            "id": "CNSRSCI 888",
            "parent": "CNSRSCI",
            "title": "ADVANCED CONSUMER BEHAVIOR"
        }
    },
    {
        "data": {
            "description": "Provides an overview of major theories in household finance, financial literacy, financial capability. Evaluates programs and strategies designed to improve consumer well-being by changing household financial behaviors, building household financial assets, and regulation of consumer financial markets.",
            "id": "CNSRSCI 775",
            "parent": "CNSRSCI",
            "title": "HOUSEHOLD FINANCE AND WELL-BEING"
        }
    },
    {
        "data": {
            "description": "Provides basic training in quantitative data analysis, with an emphasis on descriptive and inferential statistics with consumer research applications.",
            "id": "CNSRSCI 201",
            "parent": "CNSRSCI",
            "title": "CONSUMER INSIGHTS"
        }
    },
    {
        "data": {
            "description": "Provides broad knowledge of major quantitative measures of consumer well-being. Investigates construction of and literature on well-being measures across various domains.",
            "id": "CNSRSCI 851",
            "parent": "CNSRSCI",
            "title": "MEASURING HOUSEHOLD AND COMMUNITY WELL-BEING"
        }
    },
    {
        "data": {
            "description": "Provides detailed examination of careers in the financial services industry. High level industry experts from leading companies in the financial services industry participate as guest speakers and panel members.",
            "id": "CNSRSCI 251",
            "parent": "CNSRSCI",
            "title": "FINANCIAL SERVICES LEADERSHIP SYMPOSIUM"
        }
    },
    {
        "data": {
            "description": "Provides detailed examination of careers in the retailing industry. High level industry experts from leading companies in the retailing industry participate as guest speakers and panel members.",
            "id": "CNSRSCI 250",
            "parent": "CNSRSCI",
            "title": "RETAIL LEADERSHIP SYMPOSIUM"
        }
    },
    {
        "data": {
            "description": "Provides tools for planning and analyzing retail financial performance. Includes elements of retail financial statements, pricing, purchasing terms and conditions, merchandise planning, inventory control, and economic factors that impact retail businesses.",
            "id": "CNSRSCI 564",
            "parent": "CNSRSCI",
            "title": "RETAIL FINANCIAL ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Research on the application of modern econometric techniques commonly used in empirical consumer research with an emphasis on causal inference.",
            "id": "CNSRSCI 778",
            "parent": "CNSRSCI",
            "title": "CAUSAL MODELS IN HOUSEHOLD AND CONSUMER RESEARCH"
        }
    },
    {
        "data": {
            "description": "Specialized subject matter of current interest.",
            "id": "CNSRSCI 501",
            "parent": "CNSRSCI",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "Specialized subject matter of current interest.",
            "id": "CNSRSCI 901",
            "parent": "CNSRSCI",
            "title": "GRADUATE SPECIAL TOPICS IN CONSUMER SCIENCE"
        }
    },
    {
        "data": {
            "description": "Studies family behavior and family outcomes using an economic framework. Covers theoretical models of consumption, fertility, household production, time allocation, and household formation. Knowledge of microeconomic theory [such asECON 301] recommended.",
            "id": "CNSRSCI 748",
            "parent": "CNSRSCI",
            "title": "THE ECONOMIC ORGANIZATION OF THE HOUSEHOLD"
        }
    },
    {
        "data": {
            "description": "Studies financial markets and instruments from the perspective of individual consumers and their portfolio decisions over their lifetime.",
            "id": "CNSRSCI 627",
            "parent": "CNSRSCI",
            "title": "ADVANCED CONSUMER FINANCE"
        }
    },
    {
        "data": {
            "description": "Studies the intersection of behavioral economics and public policy. Explores the effect of deviations from rational economic behavior on consumer well-being. Analyzes the impact of policy design on consumer well-being across a variety of policy domains.",
            "id": "CNSRSCI 852",
            "parent": "CNSRSCI",
            "title": "ADVANCED CONSUMER POLICY"
        }
    },
    {
        "data": {
            "description": "Systems approach to family financial management, stressing development of interpersonal techniques by professionals who will assist individuals and families to become responsible financial managers.",
            "id": "CNSRSCI 675",
            "parent": "CNSRSCI",
            "title": "FAMILY FINANCIAL COUNSELING"
        }
    },
    {
        "data": {
            "description": "Topics on family economic well-being and the social and consumer policies that influence economic behavior and family economic status.",
            "id": "CNSRSCI 930",
            "parent": "CNSRSCI",
            "title": "SEMINAR IN FAMILY ECONOMIC POLICY"
        }
    },
    {
        "data": {
            "id": "AAE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ACCTIS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CNSRSCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ECON",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "GENBUS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "PSYCH",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "AAE 335",
            "target": "CNSRSCI 201"
        }
    },
    {
        "data": {
            "source": "ACCTIS 100",
            "target": "ACCTIS 300"
        }
    },
    {
        "data": {
            "source": "ACCTIS 300",
            "target": "ACCTIS 100"
        }
    },
    {
        "data": {
            "source": "ACCTIS 300",
            "target": "CNSRSCI 564"
        }
    },
    {
        "data": {
            "source": "CNSRSCI 111",
            "target": "CNSRSCI 390"
        }
    },
    {
        "data": {
            "source": "CNSRSCI 201",
            "target": "CNSRSCI 301"
        }
    },
    {
        "data": {
            "source": "CNSRSCI 257",
            "target": "CNSRSCI 560"
        }
    },
    {
        "data": {
            "source": "CNSRSCI 257",
            "target": "CNSRSCI 562"
        }
    },
    {
        "data": {
            "source": "CNSRSCI 257",
            "target": "CNSRSCI 564"
        }
    },
    {
        "data": {
            "source": "CNSRSCI 257",
            "target": "CNSRSCI 567"
        }
    },
    {
        "data": {
            "source": "CNSRSCI 275",
            "target": "CNSRSCI 627"
        }
    },
    {
        "data": {
            "source": "CNSRSCI 275",
            "target": "CNSRSCI 635"
        }
    },
    {
        "data": {
            "source": "CNSRSCI 275",
            "target": "CNSRSCI 665"
        }
    },
    {
        "data": {
            "source": "CNSRSCI 275",
            "target": "CNSRSCI 675"
        }
    },
    {
        "data": {
            "source": "CNSRSCI 627",
            "target": "CNSRSCI 675"
        }
    },
    {
        "data": {
            "source": "CNSRSCI 657",
            "target": "CNSRSCI 555"
        }
    },
    {
        "data": {
            "source": "CNSRSCI 657",
            "target": "CNSRSCI 561"
        }
    },
    {
        "data": {
            "source": "CNSRSCI 768",
            "target": "CNSRSCI 778"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "CNSRSCI 475"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "CNSRSCI 477"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "CNSRSCI 575"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "CNSRSCI 665"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON 101"
        }
    },
    {
        "data": {
            "source": "GENBUS 106",
            "target": "CNSRSCI 564"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 113"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 113",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "ECON 111"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "PSYCH 202",
            "target": "PSYCH 210"
        }
    },
    {
        "data": {
            "source": "PSYCH 210",
            "target": "CNSRSCI 201"
        }
    }
]