[
    {
        "data": {
            "description": "A survey of rhetorical criticism methods. Apply  methods to landmark historical and contemporary texts - from presidential war discourse to women's suffrage rhetoric to timely political debates.",
            "id": "COMARTS 476",
            "parent": "COMARTS",
            "title": "NATURE OF CRITICISM-THE PUBLIC ARTS OF COMMUNICATION"
        }
    },
    {
        "data": {
            "description": "Children's and adolescents' use of mass media and mass media effects on them. Particular attention is given to changes in comprehension and other cognitive activities that give insights into media use and effects.",
            "id": "COMARTS/HDFS/JOURN 616",
            "title": "MASS MEDIA AND YOUTH"
        }
    },
    {
        "data": {
            "description": "Digital media, devices, and networks are deeply embedded in our cultural fabric and are reshaping cultures worldwide. While networks enable instant communication and sharing, they aren't neutral, and their benefits aren't evenly distributed. Examine how digital environments affect global cultures differently, and how local differences shape the use of technology. Explore what being 'global' means in the context of rapid, technologically facilitated changes and analyze how these technologies impact offline experiences within communities based on nationality, region, race, gender, and class.",
            "id": "COMARTS 379",
            "parent": "COMARTS",
            "title": "GLOBAL TECHNOLOGY & DIGITAL CULTURE"
        }
    },
    {
        "data": {
            "description": "Examine problem solving within complex organizations. Study communication pitfalls, decision-making biases, and problem-solving blind spots that negatively affect one's ability to communicate. Learn to innovate in teams and make high-quality decisions.",
            "id": "COMARTS 575",
            "parent": "COMARTS",
            "title": "COMMUNICATION IN COMPLEX ORGANIZATIONS"
        }
    },
    {
        "data": {
            "description": "Examines sports media using the frameworks of media and cultural studies. The relationship between sports and popular culture provides an important site for understanding and critiquing the media's relationships to social, cultural, economic, and political structures. Topics for discussion will include sports media industries and technologies; representations of race, class, gender, sexual orientation, nationality, and other identities; and the intersection of sports media cultures with such issues as activism and social change, ethics and morality, gambling and fantasy sports, celebrity athletes, and fandom.",
            "id": "COMARTS 359",
            "parent": "COMARTS",
            "title": "SPORTS MEDIA"
        }
    },
    {
        "data": {
            "description": "India is home to one of the largest film industries in the world, Bollywood. Beyond Bollywood, India has a thriving film culture that caters to its many regional languages. Explore India's diverse, yet interconnected film and media cultures as well as the global resonances of Indian- and South-Asian-inflected media elsewhere. Examine questions of diasporic identity through media produced by the South Asian American community. Consider questions of genre, style and auteurship, ethnicity, decolonization, gender non-conformity, caste, settler colonialism, censorship and linguistic nationalism that shape cinematic discourses in the country and its intersection with South Asian diaspora in the United States.",
            "id": "ASIAN/COMARTS 443",
            "title": "INDIAN CINEMA IN THE U.S. AND BEYOND"
        }
    },
    {
        "data": {
            "description": "Influences of industrial structure, trade policies, foreign markets and censorship on Hollywood's production practices up to 1948.",
            "id": "COMARTS 556",
            "parent": "COMARTS",
            "title": "THE AMERICAN FILM INDUSTRY IN THE ERA OF THE STUDIO SYSTEM"
        }
    },
    {
        "data": {
            "description": "One of the most widely debated and consequential issues of our time is how social media use affects users' well-being. Examine the ways in which social media use can promote well-being (e.g., by being a source of self-affirmation, social support, and social capital) and hinder it (e.g., by provoking envy and fear-of-missing out). Special attention is paid to how users' well-being deficits (e.g., low self-esteem, depression, anxiety) prompt them to use social media in beneficial or harmful ways.",
            "id": "COMARTS 344",
            "parent": "COMARTS",
            "title": "SOCIAL MEDIA & WELL-BEING"
        }
    },
    {
        "data": {
            "description": "Study social influence and persuasion. Learn how to improve your persuasive and social influence skills, lower an audience's resistance to a persuasive message, and be a savvier consumer of persuasive messages and techniques. Explore nonconscious and emotional social influence processes in social media and other settings, especially in the context of influencers, marketing, advertising, and communication campaigns. Create a persuasion campaign, with both online and interpersonal components.",
            "id": "COMARTS 368",
            "parent": "COMARTS",
            "title": "PERSUASION AND SOCIAL INFLUENCE"
        }
    },
    {
        "data": {
            "description": "Traces the Internet's history, reception, audience, industries, rhetorics, fictional and filmic narratives, and potential as a purveyor and transmitter of culture and values.",
            "id": "COMARTS 346",
            "parent": "COMARTS",
            "title": "CRITICAL INTERNET STUDIES"
        }
    },
    {
        "data": {
            "description": "A course carried with a UW-Madison study abroad program which has no equivalent on this campus.  Current enrollment in a UW-Madison study abroad program",
            "id": "COMARTS 213",
            "parent": "COMARTS",
            "title": "INTRODUCTORY TOPIC IN COMMUNICATION ARTS: STUDY ABROAD"
        }
    },
    {
        "data": {
            "description": "A course carried with a UW-Madison study abroad program which has no equivalent on this campus. Enrollment in a UW-Madison resident study abroad program",
            "id": "COMARTS 513",
            "parent": "COMARTS",
            "title": "TOPICS IN COMMUNICATION ARTS: STUDY ABROAD"
        }
    },
    {
        "data": {
            "description": "A critical review of theoretical developments in social scientific studies of communication and its psychological and/or social impact.",
            "id": "COMARTS 970",
            "parent": "COMARTS",
            "title": "SEMINAR IN COMMUNICATION SCIENCE"
        }
    },
    {
        "data": {
            "description": "A humanities-oriented analysis of cultural representations of women and men within the social and historical contexts of race, class, gender and sexuality; engages with a range of traditions and modes of representation including literature, mass media and popular culture.",
            "id": "GEN&WS 101",
            "parent": "GEN&WS",
            "title": "GENDER, WOMEN, AND CULTURAL REPRESENTATION"
        }
    },
    {
        "data": {
            "description": "A review of English grammar through intensive written and oral practice to promote accurate and appropriate language use for students who have already studied grammar extensively and need to refine the ability to produce acceptable academic English. Not open to auditors",
            "id": "ESL 115",
            "parent": "ESL",
            "title": "GRAMMAR FOR ACADEMIC USE"
        }
    },
    {
        "data": {
            "description": "A review of recent and ongoing theoretical developments in rhetorical theory.",
            "id": "COMARTS 969",
            "parent": "COMARTS",
            "title": "SEMINAR: CONTEMPORARY RHETORICAL THEORY"
        }
    },
    {
        "data": {
            "description": "Academic writing, critical reading and argumentation, documentation, and style and organization of research papers; oral communication skills for effective class participation and presentations. Not open to auditors.",
            "id": "ESL 118",
            "parent": "ESL",
            "title": "ACADEMIC WRITING II"
        }
    },
    {
        "data": {
            "description": "Advanced level project under the direction of  faculty member e.g., independent reading with research paper, production project, or member of research team. Graded on a credit/no credit basis.",
            "id": "COMARTS 698",
            "parent": "COMARTS",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Advanced level project under the direction of  faculty member e.g., independent reading with research paper, production project, or member of research team. Graded on a letter basis.",
            "id": "COMARTS 699",
            "parent": "COMARTS",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Advanced level seminar that involves critical analysis of conceptual and methodological issues underlying empirical research on how social media affect and are affected by adolescent development, provides a venue for feedback on design of research studies involving youth and social media, and fosters interdisciplinary approaches to studying connections between youth development and social media use.",
            "id": "COMARTS/EDPSYCH 626",
            "title": "YOUTH DEVELOPMENT AND SOCIAL MEDIA: INTERDISCIPLINARY TRAINING SEMINAR"
        }
    },
    {
        "data": {
            "description": "Advanced research in rhetorical theory and criticism, and in the history of public address.",
            "id": "COMARTS 905",
            "parent": "COMARTS",
            "title": "RHETORIC COLLOQUIUM"
        }
    },
    {
        "data": {
            "description": "An advanced review and exploration of theoretical and methodological developments in media studies.",
            "id": "COMARTS 950",
            "parent": "COMARTS",
            "title": "SEMINAR-RADIO TELEVISION FILM"
        }
    },
    {
        "data": {
            "description": "An examination of a specific television genre, analyzing it as a narrative, economic, cultural, and political entity and exploring its role in perpetuating and/or challenging ideas of what society is or could be.",
            "id": "COMARTS 540",
            "parent": "COMARTS",
            "title": "TELEVISION GENRES"
        }
    },
    {
        "data": {
            "description": "An examination of contemporary Hollywood films focusing on the interrelations of cinematic narrative, style, technology, and institutions. Survey the work of major directors and consider the box office impact of key genres and film cycles.",
            "id": "COMARTS 552",
            "parent": "COMARTS",
            "title": "CONTEMPORARY HOLLYWOOD CINEMA"
        }
    },
    {
        "data": {
            "description": "An examination of current theoretical and/or practical problems in communication and/or public address.",
            "id": "COMARTS 967",
            "parent": "COMARTS",
            "title": "SEMINAR-PROBLEMS IN COMMUNICATION AND PUBLIC ADDRESS"
        }
    },
    {
        "data": {
            "description": "An examination of historical and/or ongoing developments in methodological and analytic approaches to rhetorical studies.",
            "id": "COMARTS 976",
            "parent": "COMARTS",
            "title": "SEMINAR IN RHETORICAL CRITICISM"
        }
    },
    {
        "data": {
            "description": "An examination of the forms, practices, economies, institutions, politics, and modes of engagement that make digital games an important site of culture and power.",
            "id": "COMARTS 547",
            "parent": "COMARTS",
            "title": "DIGITAL GAME CULTURES"
        }
    },
    {
        "data": {
            "description": "An exploration of the comedy genre, examining theories of humor in film; introducing conceptual tools for critical appreciation and analysis; and investigating different subgenres and tendencies prominent in various phases and traditions of popular film comedy.",
            "id": "COMARTS 300",
            "parent": "COMARTS",
            "title": "FILM COMEDY"
        }
    },
    {
        "data": {
            "description": "An introduction to digital communication and how it shapes our everyday lives. Develop digital communication skills, explore digital media tools and trends, and examine expressions of power online.",
            "id": "COMARTS 200",
            "parent": "COMARTS",
            "title": "INTRODUCTION TO DIGITAL COMMUNICATION"
        }
    },
    {
        "data": {
            "description": "An introduction to social science research methods and statistical analyses applicable to the study of communication research and mass media effects.",
            "id": "COMARTS 361",
            "parent": "COMARTS",
            "title": "INTRODUCTION TO QUANTITATIVE RESEARCH IN COMMUNICATION"
        }
    },
    {
        "data": {
            "description": "An introduction to the study of rhetoric in politics and culture. Explores the interrelationship of theory, criticism, and practice. Students gain an understanding of rhetoric as a social force emerging from political and cultural contexts and as an influence on those contexts.",
            "id": "COMARTS 360",
            "parent": "COMARTS",
            "title": "INTRODUCTION TO RHETORIC IN POLITICS AND CULTURE"
        }
    },
    {
        "data": {
            "description": "Analysis of artistic and expressive communication in social media as forms of literature.",
            "id": "COMARTS 335",
            "parent": "COMARTS",
            "title": "SOCIAL MEDIA AS LITERATURE"
        }
    },
    {
        "data": {
            "description": "Analysis of media systems, practices and uses from a global perspective.",
            "id": "COMARTS 458",
            "parent": "COMARTS",
            "title": "GLOBAL MEDIA CULTURES"
        }
    },
    {
        "data": {
            "description": "Analysis of selected television programming, interpretation of contemporary television programs, and survey of existing critical approaches.",
            "id": "COMARTS 451",
            "parent": "COMARTS",
            "title": "TELEVISION CRITICISM"
        }
    },
    {
        "data": {
            "description": "Analyze The Walt Disney Company and its prominence as a purveyor of narratives, consumer products, and dreams in global culture. Examine the business and culture of Disney to reveal how creators, capitalists, and consumers all relate to the corporate media empires that shape everyday life.",
            "id": "COMARTS 323",
            "parent": "COMARTS",
            "title": "THE BUSINESS AND CULTURE OF DISNEY"
        }
    },
    {
        "data": {
            "description": "Application of communication concepts to problems in such professional field settings as business organizations, media firms, political offices and organizations, and governmental agencies. Must be declared in Communication Arts.",
            "id": "COMARTS 614",
            "parent": "COMARTS",
            "title": "FIELD EXPERIENCE IN COMMUNICATION"
        }
    },
    {
        "data": {
            "description": "Application of communication concepts to problems in such professional field settings as business organizations, media firms, political offices and organizations, and governmental agencies. Must be declared in Communication Arts.",
            "id": "COMARTS 615",
            "parent": "COMARTS",
            "title": "SECOND FIELD EXPERIENCE IN COMMUNICATION"
        }
    },
    {
        "data": {
            "description": "Approach the U.S. presidential election from a rhetorical perspective. Analyze how individual candidates and political parties use and abuse language and other symbols to 1) identify with U.S. voters; 2) advance an agenda to address a current need; 3) present a particular narrative of U.S. history, identity, and national purpose; and 4) convince U.S. citizens to support their candidacy and policies on Election Day.",
            "id": "COMARTS 369",
            "parent": "COMARTS",
            "title": "RHETORIC OF THE U.S. PRESIDENTIAL ELECTION"
        }
    },
    {
        "data": {
            "description": "Basic elements of academic writing, emphasizing improved fluency and accuracy, paragraph structure, summarizing and paraphrasing, short essays, and a final research project. Not open to auditors.",
            "id": "ESL 117",
            "parent": "ESL",
            "title": "ACADEMIC WRITING I"
        }
    },
    {
        "data": {
            "description": "Basic introduction to the elements of a successful dramatic screenplay. Particular emphasis placed on story concept, dramatic structure, character development, dialogue, and visual storytelling.",
            "id": "COMARTS 466",
            "parent": "COMARTS",
            "title": "WRITING FOR TELEVISION AND FILM"
        }
    },
    {
        "data": {
            "description": "Concepts and processes relevant to the study of communication and human behavior including approaches to communication inquiry, the dynamics of face-to-face interaction, and the pragmatic and artistic functions of public communication.",
            "id": "COMARTS 260",
            "parent": "COMARTS",
            "title": "COMMUNICATION AND HUMAN BEHAVIOR"
        }
    },
    {
        "data": {
            "description": "Create an online portfolio integrating material learned throughout the certificate program. Explore opportunities for professional and personal growth. Must be declared in Digital Studies Certificate with senior standing.",
            "id": "COMARTS 605",
            "parent": "COMARTS",
            "title": "DIGITAL STUDIES CAPSTONE"
        }
    },
    {
        "data": {
            "description": "Critical and historical survey of the participation and representation of Latino/as in U.S. film, television, and popular culture, with a primary focus on Hispanic representation in Hollywood-produced imagery. The counter-images of Latino and Latina media producers also will be explored.",
            "id": "CHICLA/COMARTS 419",
            "title": "LATINO/AS AND MEDIA"
        }
    },
    {
        "data": {
            "description": "Critical overview of the cultural industries driving television in the United States, from broadcast networks and cable to downloading and streaming, focusing on economic and regulatory structures, programming practices, labor, globalization, audiences, and adaptations to changing conditions in the digital age.",
            "id": "COMARTS 351",
            "parent": "COMARTS",
            "title": "TELEVISION INDUSTRIES"
        }
    },
    {
        "data": {
            "description": "Current research in cultural studies, audience effects, broadcast regulation, history of broadcasting and comparative national systems.",
            "id": "COMARTS 903",
            "parent": "COMARTS",
            "title": "MEDIA AND CULTURAL STUDIES COLLOQUIUM"
        }
    },
    {
        "data": {
            "description": "Develop skills for viewing and interrogating entertainment media through the lens of ethical theory and to articulate their own ethical stance on a diverse range of media, including documentary film, sports entertainment, reality television, and digital media. By approaching ethics from a media studies perspective, ask questions about how media are produced, how audiences are created and engaged, how communities and cultures are represented, and how we should respond to these different forms of media and the ethical questions that they raise.",
            "id": "COMARTS 375",
            "parent": "COMARTS",
            "title": "ETHICS OF ENTERTAINMENT MEDIA"
        }
    },
    {
        "data": {
            "description": "Development and history of documentary film and video from Lumiere to the present.",
            "id": "COMARTS 358",
            "parent": "COMARTS",
            "title": "HISTORY OF DOCUMENTARY FILM"
        }
    },
    {
        "data": {
            "description": "Development of cinema as a communication medium and art form from its origins to the 1960s. Attention given to national cinemas and international trends through the study of landmark films.",
            "id": "COMARTS 352",
            "parent": "COMARTS",
            "title": "FILM HISTORY TO 1960"
        }
    },
    {
        "data": {
            "description": "Development of fundamental skills in the preparation, delivery, and evaluation of the common forms of public address.",
            "id": "COMARTS 105",
            "parent": "COMARTS",
            "title": "PUBLIC SPEAKING"
        }
    },
    {
        "data": {
            "description": "Effective communication requires awareness of how gender influences communication and our capacity to build lasting and meaningful relationships. Learn about theories and concepts to understand how gender influences our interpersonal, professional, and social lives. Topics include terms and concepts relevant to the study of how we communicate about gender, sex and sexuality, including identity, language and nonverbal behavior, socialization, close personal relationships, education, work, violence, media and social movements.",
            "id": "COMARTS/GEN&WS 316",
            "title": "GENDER AND COMMUNICATION"
        }
    },
    {
        "data": {
            "description": "Elementary level directed study project(s) under supervision of faculty member. Graded on a credit/no credit basis.",
            "id": "COMARTS 198",
            "parent": "COMARTS",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Elementary level directed study project(s) under supervision of faculty member. Graded on a lettered basis.",
            "id": "COMARTS 199",
            "parent": "COMARTS",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Epistemological and methodological principles of behavioral and social scientific research of particular relevance to communication research, including various research designs and modes of observation, casual inferences, and basic hands-on experiences in empirical research.",
            "id": "COMARTS 762",
            "parent": "COMARTS",
            "title": "COMMUNICATION RESEARCH METHODS"
        }
    },
    {
        "data": {
            "description": "Examination of the various roles that film, television, and other media play in creating, challenging, and negotiating national and global identities.",
            "id": "COMARTS 448",
            "parent": "COMARTS",
            "title": "MEDIA AND NATIONAL IDENTITY"
        }
    },
    {
        "data": {
            "description": "Examine the Cold War from a rhetorical perspective. Consider key texts, orators, movements, and foreign policy themes that have come to define the Cold War (1945-1991). Trace how these rhetorical strategies laid the groundwork for the contemporary moment, the \"New Cold War.\"",
            "id": "COMARTS 474",
            "parent": "COMARTS",
            "title": "RHETORIC OF THE COLD WAR"
        }
    },
    {
        "data": {
            "description": "Examines core questions related to the impacts of digital media (including but not limited to the Internet) on processes of political communication and the health of democratic governance in advanced industrialized democracies.",
            "id": "COMARTS 509",
            "parent": "COMARTS",
            "title": "DIGITAL MEDIA AND POLITICAL COMMUNICATION"
        }
    },
    {
        "data": {
            "description": "Examines how people form their identities and manage their personal relationships using new communication technologies (social network sites, online dating, video games). Emphasis will be placed on how humans adapt to technology and use it for social purposes.",
            "id": "COMARTS 577",
            "parent": "COMARTS",
            "title": "DYNAMICS OF ONLINE RELATIONSHIPS"
        }
    },
    {
        "data": {
            "description": "Examines how personal relationships unfold in online communication contexts (social network sites, online dating, mobile computing). Topics include impression formation and management, deception and trust, self-perception and identity, social support and relationship maintenance.",
            "id": "COMARTS 345",
            "parent": "COMARTS",
            "title": "ONLINE COMMUNICATION AND PERSONAL RELATIONSHIPS"
        }
    },
    {
        "data": {
            "description": "Examines images of gender and sexuality in the media, with a focus on contemporary media in the U.S. Using theories from cultural studies, film and media studies, gender studies, and communication explore different processes and practices of gender and sexuality. Look at the way that gender and sexuality are constructed through social, cultural, and economic forces, and the way that these identities intersect with other social identities such as race, ethnicity, and class. Consider the way that media impact our understanding of feminism and post-feminism, violence, celebrity, consumer culture, subcultures and activism.",
            "id": "COMARTS/GEN&WS 418",
            "title": "GENDER, SEXUALITY, AND THE MEDIA"
        }
    },
    {
        "data": {
            "description": "Examines intra- and interpersonal theories of the causes and functions of conflict. Focuses on message strategies for conflict resolution and/or management. Both theoretical and applied issues.",
            "id": "COMARTS 371",
            "parent": "COMARTS",
            "title": "COMMUNICATION AND CONFLICT RESOLUTION"
        }
    },
    {
        "data": {
            "description": "Examines representations of Asian American in American media using historical, analytical, and critical approaches. Issues of cultural production, identity, race, politics, and gender are linked to examinations of specific media forms.",
            "id": "ASIANAM/COMARTS 420",
            "title": "ASIAN AMERICANS AND MEDIA"
        }
    },
    {
        "data": {
            "description": "Examines the history and aesthetics of avant-garde/experimental film from its beginnings in the late 1910s to the present. Studies key aesthetic programs and their relations to adjacent movements in art and critical theory.",
            "id": "COMARTS 463",
            "parent": "COMARTS",
            "title": "AVANT-GARDE FILM"
        }
    },
    {
        "data": {
            "description": "Examines the interaction between disability and media in modern society. Explore representations of disability in various forms of mass media, including television and film, social media, advertising, and others. Analyze how these representations affect disabled people directly, including the development of their identities, as well as how they influence disability attitudes and stigma throughout society. Discuss overt and casual ableism within media, as well as how the disability community uses media for activism. Discuss issues of access for disabled people (e.g., assistive technology, captions, audio descriptions), as well as the future of disability representations within media.",
            "id": "COMARTS/JOURN/RP&SE 312",
            "title": "DISABILITY AND THE MEDIA"
        }
    },
    {
        "data": {
            "description": "Examines the role of communication in health, how the revolution in information technology has affected health communication, and the assumptions about health information and communication that drive current efforts to use technologies.",
            "id": "COMARTS/JOURN/LSC 617",
            "title": "HEALTH COMMUNICATION IN THE INFORMATION AGE"
        }
    },
    {
        "data": {
            "description": "Examines themes, genres, and significant instances of contemporary political discourse, as well as issues and concerns that arise in public discussions of political discourse. Case studies and theoretical analyses are considered.",
            "id": "COMARTS 470",
            "parent": "COMARTS",
            "title": "CONTEMPORARY POLITICAL DISCOURSE"
        }
    },
    {
        "data": {
            "description": "Explains how films work using classics such as \"Citizen Kane,\" \"Vertigo,\" \"Battleship Potemkin,\" and \"Do The Right Thing.\" Study film as an art form and a medium, cover all the major film types (silent, classical, and contemporary narrative cinema, art cinema, animation, documentary, and experimental film), and get introduced to two basic approaches to film criticism: authorship criticism and genre criticism. Learn to recognize film techniques--mise-en-scène, cinematography, editing, and sound--and to analyze how filmmakers make us watch, think, and feel.",
            "id": "COMARTS 350",
            "parent": "COMARTS",
            "title": "INTRODUCTION TO FILM"
        }
    },
    {
        "data": {
            "description": "Explore everyday communication in social media. Learn digital recording technologies for documenting everyday communication and the use of digital content in social media.",
            "id": "COMARTS/FOLKLORE 522",
            "title": "DIGITAL STORYTELLING FOR SOCIAL MEDIA"
        }
    },
    {
        "data": {
            "description": "Explore the complexities of what it means to be a media audience. Consider how audiences engage media thoughtfully and actively. Approach audiences both qualitatively and theoretically, focusing on how audiencehood becomes more than just a position of watching, listening, and downloading the intended message. Study audiencehood as a site of voice, agency, identity construction, play, activism, and meaning-making across various media audience types - fans, haters, casual viewers; television, film, social media, games, and other media consumers; watchers, listeners, readers, gamers, and users; networked communities and isolated individuals. Analyze the different worlds, affective positions, practices, and socialities that make up \"the audience.\"",
            "id": "COMARTS 545",
            "parent": "COMARTS",
            "title": "MEDIA AUDIENCE CULTURES"
        }
    },
    {
        "data": {
            "description": "Explore the diversity of health experiences and the ways in which health communication affects our lives, whether it is through interpersonal conversations about health issues, exposure to health information in the media, or through our personal involvement with the healthcare system.",
            "id": "COMARTS 318",
            "parent": "COMARTS",
            "title": "INTRODUCTION TO HEALTH COMMUNICATION"
        }
    },
    {
        "data": {
            "description": "Explore the rapidly evolving landscape of communication technologies, with a particular focus on generative artificial intelligence (AI), and discuss its role in communication contexts. Examine the transformative effects of these emerging technologies on individual, social, and professional lives. Consider the potential dark sides of AI, including ethical concerns, biases, and the implications of over-reliance on technology in communication.",
            "id": "COMARTS 343",
            "parent": "COMARTS",
            "title": "HUMAN COMMUNICATION IN THE AGE OF ARTIFICIAL INTELLIGENCE (AI)"
        }
    },
    {
        "data": {
            "description": "Explore the role of communication as a contributor to existing health inequalities and a means of helping to reduce them. Consider social scientific theories and research on a wide array of topics including communication inequalities and public discourse around social determinants of health.",
            "id": "COMARTS 518",
            "parent": "COMARTS",
            "title": "COMMUNICATION AND HEALTH INEQUALITIES"
        }
    },
    {
        "data": {
            "description": "Explore topics in communication science and rhetoric, with a digital focus.",
            "id": "COMARTS 377",
            "parent": "COMARTS",
            "title": "TOPICS IN DIGITAL STUDIES (COMMUNICATION SCIENCE & RHETORIC)"
        }
    },
    {
        "data": {
            "description": "Explore topics related to emerging communication practices and experiences, including those related to new information and communication technologies or new applications of such technologies.",
            "id": "COMARTS 309",
            "parent": "COMARTS",
            "title": "TOPICS IN COMMUNICATION AND SOCIAL DYNAMICS"
        }
    },
    {
        "data": {
            "description": "Explore various topics in film and media studies, history, and theory.",
            "id": "COMARTS 313",
            "parent": "COMARTS",
            "title": "TOPICS IN FILM AND MEDIA STUDIES"
        }
    },
    {
        "data": {
            "description": "Explore various topics in rhetoric or communication science.",
            "id": "COMARTS 310",
            "parent": "COMARTS",
            "title": "TOPICS IN RHETORIC AND COMMUNICATION SCIENCE"
        }
    },
    {
        "data": {
            "description": "Explores and analyzes Internet communication as a magnifier, transmitter, and limiter of power for both individual people and institutions with special attention to the roles of politics, social issues, and justice. Use rhetorical analysis to engage in the critical assessment of Internet media content that exerts power in their lives.",
            "id": "COMARTS 478",
            "parent": "COMARTS",
            "title": "RHETORIC AND POWER ON THE INTERNET"
        }
    },
    {
        "data": {
            "description": "Explores political, economic and cultural relationships between new media of communication and society, including issues of history, race, gender, class, globalization, national identity and everyday life.",
            "id": "COMARTS 459",
            "parent": "COMARTS",
            "title": "NEW MEDIA AND SOCIETY"
        }
    },
    {
        "data": {
            "description": "Explores six major film genres -- musical; thriller; comedy; horror; drama; and melodrama -- investigating their narrative and stylistic conventions and the principles underlying them. Critical, historical, and theoretical approaches examine definitional criteria and ambiguities; key elements, functions, goals, and effects; and significant subgenres, cycles, and trends.",
            "id": "COMARTS 354",
            "parent": "COMARTS",
            "title": "FILM GENRES"
        }
    },
    {
        "data": {
            "description": "Focus on the theory and practice of video editing and post-production. Gain a thorough understanding of narrative editing techniques, color correction, audio post-production and the requisite software. Discusses the art of post-production and how post-production affects narrative function in moving picture media (including films, music videos, and television).",
            "id": "COMARTS 465",
            "parent": "COMARTS",
            "title": "EDITING AND POST-PRODUCTION FOR VIDEO AND FILM"
        }
    },
    {
        "data": {
            "description": "General survey of Italian cinema and of the relationship between film and the other arts. Consideration of the Italian and European socio-political context and developments in film theory.",
            "id": "COMARTS/ITALIAN 460",
            "title": "ITALIAN FILM"
        }
    },
    {
        "data": {
            "description": "History of American independent narrative cinema with particular attention to the impact various art movements and subcultures have had on its development over the past 60 years.",
            "id": "COMARTS 462",
            "parent": "COMARTS",
            "title": "AMERICAN INDEPENDENT CINEMA"
        }
    },
    {
        "data": {
            "description": "Important filmmakers from 1910 to the present; their relation to German cultural and social history of the period.",
            "id": "COMARTS/GERMAN 655",
            "title": "GERMAN FILM"
        }
    },
    {
        "data": {
            "description": "In the wake of World War Two, European directors began making films that employed location shooting, ambiguity, psychological realism, and unfamiliar stylistic flourishes. Such films drew on literary modernism, experimenting with time shifting, extreme duration, subjectivity, and reflexivity. \"Art cinema,\" as it came to be called, is now the dominant storytelling mode of the contemporary film festival circuit and constitutes a robust alternative to mainstream genre cinema. Explores art cinema from a variety of national and transnational contexts, analyzing its narratives, styles, and cultural contexts. Investigates the work of directors from the first generation of art cinema, including Michelangelo Antonioni, Robert Bresson, Ingmar Bergman, and Agnès Varda, and more recent work by Aki Kaurismäki, Abbas Kiarostami, Wong Kar-wai, and Claire Denis.",
            "id": "COMARTS 461",
            "parent": "COMARTS",
            "title": "GLOBAL ART CINEMA"
        }
    },
    {
        "data": {
            "description": "In-depth review and evaluation of behavioral and social scientific theories of human communication.",
            "id": "COMARTS 760",
            "parent": "COMARTS",
            "title": "ADVANCES IN COMMUNICATION THEORIES"
        }
    },
    {
        "data": {
            "description": "Independent research and writing under the supervision of an instructor.",
            "id": "COMARTS 799",
            "parent": "COMARTS",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Independent research and writing under the supervision of an instructor.",
            "id": "COMARTS 990",
            "parent": "COMARTS",
            "title": "RESEARCH AND THESIS"
        }
    },
    {
        "data": {
            "description": "Intensive analysis of selected films, using contemporary critical theories and methods.",
            "id": "COMARTS 454",
            "parent": "COMARTS",
            "title": "CRITICAL FILM ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Intermediate level project under the direction of faculty member e.g., independent reading with research paper, production project, or member of research team. Graded on a credit/no credit basis.",
            "id": "COMARTS 298",
            "parent": "COMARTS",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Intermediate level project under the direction of faculty member e.g., independent reading with research paper, production project, or member of research team. Graded on a letter basis.",
            "id": "COMARTS 299",
            "parent": "COMARTS",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Introduces key stages in the processes of gathering and analyzing data for decision making, including tasks, methods, and tools used at each stage. Topics include developing the research question from organizational goals, choosing appropriate data collection methods, sampling, basics of measurement and question design, managing and visualizing data, descriptive statistics and basic inferential statistics such as correlations, regressions, and ANOVA.",
            "id": "COMARTS/LIS 705",
            "title": "INTRODUCTORY ANALYTICS FOR DECISION MAKING"
        }
    },
    {
        "data": {
            "description": "Introduction to basic concepts in global and transnational rhetorical studies and provided with the analytic tools to examine discourses about globalization and transnationalism produced by key global actors including transnational corporations, states, global institutions such as the World Bank, media producers, human rights advocates, and activists.",
            "id": "COMARTS 573",
            "parent": "COMARTS",
            "title": "RHETORIC OF GLOBALIZATION AND TRANSNATIONALISM"
        }
    },
    {
        "data": {
            "description": "Introduction to the changing images of race and ethnicity in U.S. entertainment media and popular culture.  Surveys history, key concepts and contemporary debates regarding mediated representation of ethnic minorities. Critical and cultural studies approaches are emphasized.",
            "id": "CHICLA/COMARTS 347",
            "title": "RACE, ETHNICITY, AND MEDIA"
        }
    },
    {
        "data": {
            "description": "Introduction to the historical, sociological, anthropological, political, and cultural study of Americans of Asian ancestry.",
            "id": "ASIANAM 101",
            "parent": "ASIANAM",
            "title": "INTRODUCTION TO ASIAN AMERICAN STUDIES"
        }
    },
    {
        "data": {
            "description": "Investigate how the concept of health is rhetorically constructed and deployed in a number of different contexts. Explore how language and argument shape our understanding of health, how health is positioned in opposition to illness and disability, and how the meaning of health has become a site of argument and controversy.",
            "id": "COMARTS 317",
            "parent": "COMARTS",
            "title": "RHETORIC AND HEALTH"
        }
    },
    {
        "data": {
            "description": "Investigate the ways in which individuals use, create, and respond to media content in the context of increasingly blurred boundaries between \"mass\" and \"interpersonal\" media. We will consider social scientific theories and research on a wide array of topics, including media uses and effects with regard to social connection, learning, judgments, perceptions, stereotypes, violence, consumption, and political participation.",
            "id": "COMARTS 325",
            "parent": "COMARTS",
            "title": "MEDIA AND HUMAN BEHAVIOR"
        }
    },
    {
        "data": {
            "description": "Key concepts for the critical analysis of television, film, radio, and digital media. Focusing primarily on meanings, aesthetics, technology, media industries, representations, and audiences.",
            "id": "COMARTS 250",
            "parent": "COMARTS",
            "title": "SURVEY OF CONTEMPORARY MEDIA"
        }
    },
    {
        "data": {
            "description": "Learn how to give effective oral presentations in a variety of public speaking situations and to become better consumers of written and oral discourse. Learn basic composition and outlining skills as well as library research techniques.",
            "id": "COMARTS 100",
            "parent": "COMARTS",
            "title": "INTRODUCTION TO SPEECH COMPOSITION"
        }
    },
    {
        "data": {
            "description": "Learn the fundamentals of short-film production, including cinematography, lighting, and sound recording. With an emphasis on dramatic storytelling, produce scenes from existing scripts, rotating through crew positions. Directing, editing, and color grading will be covered, with casting, location scouting, and production design incorporated to successfully produce each scene. Gain an understanding of the inner-workings of a film crew, the operation of digital cinema technologies, and visual and aural storytelling aesthetics and techniques.",
            "id": "COMARTS 467",
            "parent": "COMARTS",
            "title": "CINEMATOGRAPHY AND SOUND RECORDING"
        }
    },
    {
        "data": {
            "description": "Post-structuralist historical theory, historiographical methods, and issues in historiography for students of media history. Introduction to archival research.",
            "id": "COMARTS 955",
            "parent": "COMARTS",
            "title": "MEDIA HISTORY AND HISTORIOGRAPHY"
        }
    },
    {
        "data": {
            "description": "Practice in preparation and delivery of various types of argumentative speeches and debates.",
            "id": "COMARTS 262",
            "parent": "COMARTS",
            "title": "THEORY AND PRACTICE OF ARGUMENTATION AND DEBATE"
        }
    },
    {
        "data": {
            "description": "Producing Internet television and video (which encompasses a wide range of media content, from expensive Netflix and Amazon shows to low-budget YouTube channels). With its focus on \"producing\" and the role of the producer, combines the hands-on production work of writing, shooting, and editing videos with an emphasis on entrepreneurship and the innovation of sustainable business models.",
            "id": "COMARTS 468",
            "parent": "COMARTS",
            "title": "PRODUCING FOR INTERNET TV AND VIDEO"
        }
    },
    {
        "data": {
            "description": "Provides an an in-depth look into entertainment media, including its effects on individuals, social groups, and society. The focus on entertainment content is across platforms - from \"mass\" to social media. Emphasis will be paid to psychological, individual-level effects.",
            "id": "COMARTS/JOURN/LSC 831",
            "title": "PSYCHOLOGY OF ENTERTAINMENT MEDIA"
        }
    },
    {
        "data": {
            "description": "Provides an immersive experience in the art of cinematic storytelling. This capstone workshop is structured around the creation of a half-hour finished film, planned and completed as a group, with roles matching those of a professional crew. Working with an existing script and using state-of-the-art digital tools, students gain knowledge in a wide variety of motion-picture production skills. Most importantly, explore the meanings and nuances of a script, making the artistic choices necessary to bring the story to the screen. Present a completed film in a public, campus screening.",
            "id": "COMARTS 659",
            "parent": "COMARTS",
            "title": "ADVANCED MOTION PICTURE PRODUCTION WORKSHOP"
        }
    },
    {
        "data": {
            "description": "Public discourse as it affects and reflects the process of dynamic social change. Historical and contemporary instances of rhetorical processes.",
            "id": "COMARTS 372",
            "parent": "COMARTS",
            "title": "RHETORIC OF CAMPAIGNS AND REVOLUTIONS"
        }
    },
    {
        "data": {
            "description": "Reading strategies for academic work; reading with increased comprehension and speed, vocabulary expansion, and summary writing. Not open to auditors.",
            "id": "ESL 116",
            "parent": "ESL",
            "title": "ACADEMIC READING AND VOCABULARY SKILLS"
        }
    },
    {
        "data": {
            "description": "Remote video production in both documentary and narrative genres.",
            "id": "COMARTS 651",
            "parent": "COMARTS",
            "title": "ADVANCED VIDEO PRODUCTION AND DIRECTION"
        }
    },
    {
        "data": {
            "description": "Research and preparation for the writing of the senior thesis under the direction of a faculty member.",
            "id": "COMARTS 691",
            "parent": "COMARTS",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Research and preparation for writing senior Honors in the Major thesis under the direction of a faculty member.",
            "id": "COMARTS 681",
            "parent": "COMARTS",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Rhetorical character of religious controversy and sectarian persuasion in Western religion.",
            "id": "COMARTS/RELIGST 374",
            "title": "THE RHETORIC OF RELIGION"
        }
    },
    {
        "data": {
            "description": "Selected issues in the history of rhetoric, concentrating on classical theories of invention, and their importance for contemporary issues in composition theory.",
            "id": "COMARTS/ENGL 704",
            "title": "INTELLECTUAL SOURCES OF CONTEMPORARY COMPOSITION THEORY I-CLASSICAL"
        }
    },
    {
        "data": {
            "description": "Semi-intensive course in intermediate English language skills. A multi-skills focus on reading, writing, and communication skills essential in an academic setting. Not open to auditors",
            "id": "ESL 114",
            "parent": "ESL",
            "title": "INTERMEDIATE ENGLISH LANGUAGE SKILLS"
        }
    },
    {
        "data": {
            "description": "Seminar probes theoretical questions concerning nature of historical knowledge, examines scholarly models and introduces methodologies and resources for research on the history of cinema.",
            "id": "COMARTS 958",
            "parent": "COMARTS",
            "title": "SEMINAR IN FILM HISTORY"
        }
    },
    {
        "data": {
            "description": "Significant speeches from throughout history, generally from the United States. Speakers studied include Pericles, Abraham Lincoln, Elizabeth Cady Stanton, Frederick Douglass, Emma Watson, John F. Kennedy, Barbara Jordan, Nelson Mandela.",
            "id": "COMARTS 370",
            "parent": "COMARTS",
            "title": "GREAT SPEAKERS AND SPEECHES"
        }
    },
    {
        "data": {
            "description": "Social scientific approaches to the study of interpersonal communication and media effects.",
            "id": "COMARTS 904",
            "parent": "COMARTS",
            "title": "COMMUNICATION SCIENCE COLLOQUIUM"
        }
    },
    {
        "data": {
            "description": "Sound plays a crucial but understudied role in experiences of media and cultural life. From the mundane sounds of our daily routines to the irresistible refrains of our favorite songs, sound (in its various guises as noise, music, echo, vibration, etc.) is fundamental to communications media and, more broadly, to our perceptions of the world around us. An introduction to the emerging field of sound studies and an investigation into the role sound and music (or lack thereof) play in various communications media. Through audio assignments such as the creation of podcasts, learn the basics of digital audio recording and editing software and how to present and distribute audio content via the Internet, specifically as podcasts. Gain practical skills for creating digital audio projects and a deeper appreciation for how paying attention to sound leads to unique understandings of history, culture, and media technologies.",
            "id": "COMARTS 449",
            "parent": "COMARTS",
            "title": "SOUND CULTURES: PODCASTING AND MUSIC"
        }
    },
    {
        "data": {
            "description": "Specialized advanced subject matter in film, video or digital media production.",
            "id": "COMARTS 609",
            "parent": "COMARTS",
            "title": "SPECIAL TOPICS IN PRODUCTION"
        }
    },
    {
        "data": {
            "description": "Specialized subject matter of current interest in communication theory and research.",
            "id": "COMARTS 612",
            "parent": "COMARTS",
            "title": "SPECIAL TOPICS IN COMMUNICATION SCIENCE"
        }
    },
    {
        "data": {
            "description": "Specialized subject matter of current interest in rhetoric and public address.",
            "id": "COMARTS 610",
            "parent": "COMARTS",
            "title": "SPECIAL TOPICS IN RHETORIC AND PUBLIC ADDRESS"
        }
    },
    {
        "data": {
            "description": "Specialized topics and issues in film history, theory, and criticism.",
            "id": "COMARTS 613",
            "parent": "COMARTS",
            "title": "SPECIAL TOPICS IN FILM"
        }
    },
    {
        "data": {
            "description": "Specialized topics and issues in media and cultural studies.",
            "id": "COMARTS 608",
            "parent": "COMARTS",
            "title": "SPECIAL TOPICS IN MEDIA AND CULTURAL STUDIES"
        }
    },
    {
        "data": {
            "description": "Structure and dynamics of small group decision-making. Critical and creative problems in group interaction processes.",
            "id": "COMARTS 266",
            "parent": "COMARTS",
            "title": "THEORY AND PRACTICE OF GROUP DISCUSSION"
        }
    },
    {
        "data": {
            "description": "Studies in advanced research in film history, theory and criticism.",
            "id": "COMARTS 902",
            "parent": "COMARTS",
            "title": "FILM COLLOQUIUM"
        }
    },
    {
        "data": {
            "description": "Study of major theories of rhetoric from their origins in ancient Greece to Bacon, including theories of Plato, Aristotle, Cicero, Quintilian, Longinus, St. Augustine, and others.",
            "id": "COMARTS 570",
            "parent": "COMARTS",
            "title": "CLASSICAL RHETORICAL THEORY"
        }
    },
    {
        "data": {
            "description": "Survey of French cinema from 1895 to the present. Emphasis on aesthetic trends, film movements, film industry, and cultural context.",
            "id": "COMARTS 455",
            "parent": "COMARTS",
            "title": "FRENCH FILM"
        }
    },
    {
        "data": {
            "description": "Survey of concepts, theories, and research concerning communication across all phases of interpersonal relationships, focusing on both theoretical and practical applications.",
            "id": "COMARTS 272",
            "parent": "COMARTS",
            "title": "INTRODUCTION TO INTERPERSONAL COMMUNICATION"
        }
    },
    {
        "data": {
            "description": "Survey of concepts, theories, and research concerning communication across all phases of interpersonal relationships, focusing on both theoretical and practical applications.",
            "id": "COMARTS 273",
            "parent": "COMARTS",
            "title": "THEORY AND PRACTICE OF INTERPERSONAL COMMUNICATION"
        }
    },
    {
        "data": {
            "description": "Survey of significant trends within both classical and contemporary film theory. Designed for those interested in reading, analyzing, and evaluating the central concepts and intellectual history of writings about film, particularly with respect to film as a medium presenting an array of aesthetic, psychological, and social potentialities. Whereas classical film theory attempts to treat cinema as a unique art form, contemporary film theory addresses issues related to cinema as a mode of communication, a source of visual pleasure, and as an ideological tool. Much contemporary theory attempts to incorporate the insights of other critical and analytical paradigms, such as semiotics, psychoanalysis, feminism, queer theory, critical race theory, postmodernism, and cognitive science. Questions regarding the ontology of cinema, its relation to existing theories of art, its effects on spectators, and the various ways in which its formal properties create meaning are considered.",
            "id": "COMARTS 669",
            "parent": "COMARTS",
            "title": "FILM THEORY"
        }
    },
    {
        "data": {
            "description": "Survey of the development of animation as a motion picture production technique, as a film genre, a part of the Hollywood classical cinema, and an independent art form.",
            "id": "COMARTS 357",
            "parent": "COMARTS",
            "title": "HISTORY OF THE ANIMATED FILM"
        }
    },
    {
        "data": {
            "description": "Surveys the past 20 years of digital technology and communications culture on the African continent, cross-referenced with discourse on technology experiences in other parts of the developing world, through the framework of development studies. Readings include case studies of micro-tech practices as well as political and social use of new media, and government and NGO-led tech interventions. Information Communication Technology for Development (ICT4D) is a key area of focus. Cross-discipline areas include communications and media studies, African, Latin American and International area studies, as well as the social anthropology of technology and science, and design. Think critically about technology use in the context of different tech cultures from around the world. Apply this perspective towards new media solutions to social problems.",
            "id": "AFRICAN/COMARTS/LIS 444",
            "title": "TECHNOLOGY AND DEVELOPMENT IN AFRICA AND BEYOND"
        }
    },
    {
        "data": {
            "description": "Teaches the skills needed to produce, engage with, and understand new and emerging technologies within the context of communication and creative expression. Become a more critical consumer and producer of digital media.",
            "id": "COMARTS 155",
            "parent": "COMARTS",
            "title": "INTRODUCTION TO DIGITAL MEDIA PRODUCTION"
        }
    },
    {
        "data": {
            "description": "The popular music industries are a vital part of the media industries. Music is the soundtrack to our lives. It provides the score to our quietest moments alone and our loudest parties with friends. Music helps us create and understand our identities and those of others. It is both a form of subversive activism and one of the most commercially valuable commodities in the media industries. Explore the contemporary popular music industries and the roles businesses, artists, audiences, fans, and technologies play in shaping music as a media industry. Focus specifically on the disruption that the internet, digital technologies, and social media have ushered in over the last two decades and the new ways artists, listeners, and businesses are discovering, promoting, sharing and experiencing music. Talk about the music you love, how it gets made, and why that matters for how we understand creative industries, ourselves, and each other.",
            "id": "COMARTS 330",
            "parent": "COMARTS",
            "title": "MUSIC INDUSTRIES AND POPULAR CULTURE"
        }
    },
    {
        "data": {
            "description": "The process of oral communication; principles of effective speaking; application of principles in selected speaking and reading projects.",
            "id": "COMARTS 181",
            "parent": "COMARTS",
            "title": "ELEMENTS OF SPEECH-HONORS COURSE"
        }
    },
    {
        "data": {
            "description": "The relation of communication processes to interethnic and interracial attitudes and behavior. Social and psychological foundations of interethnic communication and conflict, group identification and communication processes, interpersonal communication and culture, communication about race and ethnicity, mass media content and effects.",
            "id": "COMARTS 565",
            "parent": "COMARTS",
            "title": "COMMUNICATION AND INTERETHNIC BEHAVIOR"
        }
    },
    {
        "data": {
            "description": "The role and function of information processing in human communication behavior.",
            "id": "COMARTS 402",
            "parent": "COMARTS",
            "title": "THE PSYCHOLOGY OF COMMUNICATION"
        }
    },
    {
        "data": {
            "description": "The transnational movement of people, goods, and discourses blurs the boundaries between the local and global, making intercultural communication and rhetoric essential to our personal and public lives. We explore how rhetoric and communication function between and across cultures and examine how culture, history, and power constitute our cultural identities, our modes of communication, and how we engage with others.",
            "id": "COMARTS 373",
            "parent": "COMARTS",
            "title": "INTERCULTURAL COMMUNICATION & RHETORIC"
        }
    },
    {
        "data": {
            "description": "Theory and practice of media production and screenwriting.",
            "id": "COMARTS 355",
            "parent": "COMARTS",
            "title": "INTRODUCTION TO MEDIA PRODUCTION"
        }
    },
    {
        "data": {
            "description": "Traces the development of broadcasting as a cultural institution, examining the emergence of radio and television within the context of national identity and globalization.",
            "id": "COMARTS 450",
            "parent": "COMARTS",
            "title": "CULTURAL HISTORY OF BROADCASTING"
        }
    },
    {
        "data": {
            "description": "Video games can be powerful experiences that take us to new worlds, teach us about complex systems, and provoke a range of emotions. Games transform us while we play, and some of these changes can be hard to predict and understand. Games can disrupt our sense of self, reshape our pleasures and feelings, lead us to question deeply held values, and allow us to experience new forms of embodiment through an avatar. A growing body of research in game studies engages with this potential for expansive change by focusing on player experience from a variety of methodological perspectives, including phenomenological, feminist and queer theory, critical disability studies, learning sciences, ecocriticism, and media archeology.",
            "id": "COMARTS/CURRIC 914",
            "title": "HOW GAMES CHANGE US"
        }
    },
    {
        "data": {
            "description": "Writing and completion of senior Honors in the Major thesis begun inCOM ARTS 681under the direction of a faculty member.",
            "id": "COMARTS 682",
            "parent": "COMARTS",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Writing and completion of senior thesis begun inCOM ARTS 691under the direction of a faculty member.",
            "id": "COMARTS 692",
            "parent": "COMARTS",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "id": "ASIANAM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "COMARTS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ESL",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "GEN&WS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ASIANAM 101",
            "target": "ASIANAM/COMARTS 420"
        }
    },
    {
        "data": {
            "source": "COMARTS 100",
            "target": "COMARTS 105"
        }
    },
    {
        "data": {
            "source": "COMARTS 155",
            "target": "COMARTS 355"
        }
    },
    {
        "data": {
            "source": "COMARTS 155",
            "target": "COMARTS 468"
        }
    },
    {
        "data": {
            "source": "COMARTS 250",
            "target": "COMARTS 350"
        }
    },
    {
        "data": {
            "source": "COMARTS 250",
            "target": "COMARTS 351"
        }
    },
    {
        "data": {
            "source": "COMARTS 250",
            "target": "COMARTS 359"
        }
    },
    {
        "data": {
            "source": "COMARTS 250",
            "target": "COMARTS 448"
        }
    },
    {
        "data": {
            "source": "COMARTS 250",
            "target": "COMARTS 450"
        }
    },
    {
        "data": {
            "source": "COMARTS 250",
            "target": "COMARTS 540"
        }
    },
    {
        "data": {
            "source": "COMARTS 250",
            "target": "COMARTS 545"
        }
    },
    {
        "data": {
            "source": "COMARTS 250",
            "target": "COMARTS 547"
        }
    },
    {
        "data": {
            "source": "COMARTS 250",
            "target": "COMARTS 608"
        }
    },
    {
        "data": {
            "source": "COMARTS 260",
            "target": "COMARTS 360"
        }
    },
    {
        "data": {
            "source": "COMARTS 260",
            "target": "COMARTS 369"
        }
    },
    {
        "data": {
            "source": "COMARTS 260",
            "target": "COMARTS 370"
        }
    },
    {
        "data": {
            "source": "COMARTS 272",
            "target": "COMARTS 273"
        }
    },
    {
        "data": {
            "source": "COMARTS 273",
            "target": "COMARTS 272"
        }
    },
    {
        "data": {
            "source": "COMARTS 325",
            "target": "COMARTS/HDFS/JOURN 616"
        }
    },
    {
        "data": {
            "source": "COMARTS 346",
            "target": "COMARTS 547"
        }
    },
    {
        "data": {
            "source": "COMARTS 350",
            "target": "COMARTS 352"
        }
    },
    {
        "data": {
            "source": "COMARTS 350",
            "target": "COMARTS 354"
        }
    },
    {
        "data": {
            "source": "COMARTS 350",
            "target": "COMARTS 358"
        }
    },
    {
        "data": {
            "source": "COMARTS 350",
            "target": "COMARTS 454"
        }
    },
    {
        "data": {
            "source": "COMARTS 350",
            "target": "COMARTS 455"
        }
    },
    {
        "data": {
            "source": "COMARTS 350",
            "target": "COMARTS 461"
        }
    },
    {
        "data": {
            "source": "COMARTS 350",
            "target": "COMARTS 462"
        }
    },
    {
        "data": {
            "source": "COMARTS 350",
            "target": "COMARTS 463"
        }
    },
    {
        "data": {
            "source": "COMARTS 350",
            "target": "COMARTS 552"
        }
    },
    {
        "data": {
            "source": "COMARTS 350",
            "target": "COMARTS 613"
        }
    },
    {
        "data": {
            "source": "COMARTS 350",
            "target": "COMARTS 669"
        }
    },
    {
        "data": {
            "source": "COMARTS 350",
            "target": "COMARTS/GERMAN 655"
        }
    },
    {
        "data": {
            "source": "COMARTS 351",
            "target": "COMARTS 451"
        }
    },
    {
        "data": {
            "source": "COMARTS 351",
            "target": "COMARTS 458"
        }
    },
    {
        "data": {
            "source": "COMARTS 351",
            "target": "COMARTS 540"
        }
    },
    {
        "data": {
            "source": "COMARTS 351",
            "target": "COMARTS 556"
        }
    },
    {
        "data": {
            "source": "COMARTS 355",
            "target": "COMARTS 465"
        }
    },
    {
        "data": {
            "source": "COMARTS 355",
            "target": "COMARTS 466"
        }
    },
    {
        "data": {
            "source": "COMARTS 355",
            "target": "COMARTS 467"
        }
    },
    {
        "data": {
            "source": "COMARTS 355",
            "target": "COMARTS 609"
        }
    },
    {
        "data": {
            "source": "COMARTS 355",
            "target": "COMARTS 651"
        }
    },
    {
        "data": {
            "source": "COMARTS 360",
            "target": "COMARTS 570"
        }
    },
    {
        "data": {
            "source": "COMARTS 467",
            "target": "COMARTS 659"
        }
    },
    {
        "data": {
            "source": "ESL 114",
            "target": "ESL 115"
        }
    },
    {
        "data": {
            "source": "ESL 115",
            "target": "ESL 116"
        }
    },
    {
        "data": {
            "source": "ESL 116",
            "target": "ESL 117"
        }
    },
    {
        "data": {
            "source": "ESL 117",
            "target": "ESL 118"
        }
    },
    {
        "data": {
            "source": "ESL 118",
            "target": "COMARTS 100"
        }
    },
    {
        "data": {
            "source": "ESL 118",
            "target": "COMARTS 181"
        }
    },
    {
        "data": {
            "source": "GEN&WS 101",
            "target": "COMARTS/GEN&WS 418"
        }
    }
]