[
    {
        "data": {
            "description": "Advanced directed study projects as arranged with a faculty member.",
            "id": "COMPLIT 699",
            "parent": "COMPLIT",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Advanced level mentored reading and research for students with dissertator status",
            "id": "COMPLIT 990",
            "parent": "COMPLIT",
            "title": "RESEARCH AND THESIS"
        }
    },
    {
        "data": {
            "description": "Topics will vary and cover a wide range of comparative topics - literary, cultural, philosophical, historical, legal - with connections to traditional disciplines of comparativist faculty.",
            "id": "COMPLIT 500",
            "parent": "COMPLIT",
            "title": "THE COMPARATIVE IN AND BEYOND COMPARATIVE LITERATURE"
        }
    },
    {
        "data": {
            "id": "COMPLIT",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Critical study of modern literature, from the 15th century to the 20th century; broad survey covering many national literatures, stressing cross-cultural literary relations and including emergent literatures.",
            "id": "COMPLIT 202",
            "parent": "COMPLIT",
            "title": "INTRODUCTION TO MODERN AND CONTEMPORARY LITERATURE"
        }
    },
    {
        "data": {
            "description": "Comparative study of literatures of historical periods, international and inter-linguistic relations, flux of ideas, forms, styles; literary movements and trends, principles linking literary texts, their diversity and variation, their connection to relevant debates in aesthetics, philosophy, or other fields.",
            "id": "COMPLIT 370",
            "parent": "COMPLIT",
            "title": "COMPARATIVE PROBLEMS IN PERIODS AND MOVEMENTS"
        }
    },
    {
        "data": {
            "description": "Comparative study - historical, theoretical, critical - of literatures and literary studies in their interaction with cultural themes, with social formations, with seminal concepts and ideas, with non-literary disciplines as they inform reading and analysis of literature.",
            "id": "COMPLIT 750",
            "parent": "COMPLIT",
            "title": "PROBLEMS IN COMPARATIVE LITERATURES AND CULTURES"
        }
    },
    {
        "data": {
            "description": "Introduction to the critical study of specific literary forms (e.g., comedy, short story) and the connections between literary forms and other cultural and artistic phenomena (e.g., cinema, TV, music, visual arts).",
            "id": "COMPLIT 203",
            "parent": "COMPLIT",
            "title": "INTRODUCTION TO CROSS-CULTURAL LITERARY FORMS"
        }
    },
    {
        "data": {
            "description": "Study of the changes and development of the systematics, theoretics, and mechanics of literary form and utterance.",
            "id": "COMPLIT 475",
            "parent": "COMPLIT",
            "title": "POETICS AND LITERARY THEORY"
        }
    },
    {
        "data": {
            "description": "Critical study of pre-modern literatures from the ancient worlds to the Middle Ages; broad survey covering many national literatures, stressing cross-cultural literary relations and their impact on the modern world.",
            "id": "COMPLIT 201",
            "parent": "COMPLIT",
            "title": "INTRODUCTION TO PRE-MODERN LITERATURES/IMPACT ON THE MODERN WORLD"
        }
    },
    {
        "data": {
            "description": "Comparative study - historical, theoretical, critical - of literatures and literary studies in their interaction with cultural themes, with social formations, with seminal concepts and ideas, with non-literary disciplines as they inform reading and analysis of literature.",
            "id": "COMPLIT 350",
            "parent": "COMPLIT",
            "title": "PROBLEMS IN COMPARATIVE LITERATURES AND CULTURES"
        }
    },
    {
        "data": {
            "description": "Comparative study of the nature and substance of genre distinctions; relations between genre and mode in diverse literatures; critical analysis of texts in the context of literary distinctions of genre and mode - with attention to cross-cultural, transnational and historical perspectives.",
            "id": "COMPLIT 358",
            "parent": "COMPLIT",
            "title": "PROBLEMS IN TRANSNATIONAL GENRE AND MODE"
        }
    }
]