[
    {
        "data": {
            "description": "",
            "id": "COMPBIO 675",
            "parent": "COMPBIO",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "A comparative approach to the morphological and physiological properties of the central nervous system of animals, particularly those of veterinary importance.",
            "id": "COMPBIO 505",
            "parent": "COMPBIO",
            "title": "VETERINARY NEUROANATOMY AND NEUROPHYSIOLOGY"
        }
    },
    {
        "data": {
            "description": "A detailed consideration of gross anatomical structure with emphasis on major anatomical patterns present in species important to veterinary medicine. The dog is used as a model domestic mammal and comparisons with other species are considered. All body systems are dissected. Clinical implications of these dissections are emphasized.",
            "id": "COMPBIO 500",
            "parent": "COMPBIO",
            "title": "FUNDAMENTAL PRINCIPLES OF VETERINARY ANATOMY"
        }
    },
    {
        "data": {
            "description": "A study of the horse and the ox with special emphasis on the anatomical specializations of these species with extensive comparisons to the anatomy of the small domestic animals. Other large domestic animals, including swine, will be considered as appropriate to demonstrate anatomical variation.",
            "id": "COMPBIO 550",
            "parent": "COMPBIO",
            "title": "ANATOMY OF THE LARGE DOMESTIC ANIMALS"
        }
    },
    {
        "data": {
            "description": "Basic pharmacology of various drug classes used in veterinary medicine together with examples of clinical drug use. Important species variations in drug use and drug response will be stressed.",
            "id": "COMPBIO 556",
            "parent": "COMPBIO",
            "title": "VETERINARY PHARMACOLOGY"
        }
    },
    {
        "data": {
            "description": "Covers comparative veterinary physiology covering digestive, endocrine, and reproductive systems.",
            "id": "COMPBIO 506",
            "parent": "COMPBIO",
            "title": "VETERINARY PHYSIOLOGY B"
        }
    },
    {
        "data": {
            "description": "Covers comparative veterinary physiology covering electrophysiology, and muscle, cardiovascular, respiratory, renal and acid-base physiology.",
            "id": "COMPBIO 551",
            "parent": "COMPBIO",
            "title": "VETERINARY PHYSIOLOGY A"
        }
    },
    {
        "data": {
            "description": "Covers metabolism with a more advanced incorporation of concepts of chemistry, cell biology and physiology. Clinical correlations in veterinary medicine are also covered.",
            "id": "COMPBIO 502",
            "parent": "COMPBIO",
            "title": "MOLECULAR AND METABOLIC BASIS OF MEDICINE"
        }
    },
    {
        "data": {
            "description": "Light and digital microscopy are used to study the anatomy of organs and tissues at the cellular level. Microanatomic features of all major organ systems are identified, and pertinent physiologic concepts are discussed to correlate structure with function. Mammalian systems are emphasized, and comparisons to non-mammalian species are considered. Direct applications to clinical medicine are included.",
            "id": "COMPBIO 501",
            "parent": "COMPBIO",
            "title": "VETERINARY HISTOLOGY"
        }
    },
    {
        "data": {
            "description": "Offers opportunities for faculty coordinated experience in the veterinary medical profession outside School of Veterinary Medicine.",
            "id": "COMPBIO 775",
            "parent": "COMPBIO",
            "title": "EXTERNSHIP"
        }
    },
    {
        "data": {
            "description": "Principles of development and organogeneses in domestic animals. Normal developmental patterns are related to adult anatomy. Clinical implications of common congenital defects are discussed.",
            "id": "COMPBIO 503",
            "parent": "COMPBIO",
            "title": "VETERINARY DEVELOPMENTAL ANATOMY"
        }
    },
    {
        "data": {
            "description": "Projects in the laboratory and/or through library work in specific subject area under the direct guidance of faculty member.",
            "id": "COMPBIO 699",
            "parent": "COMPBIO",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Provides instruction in principles and concepts of research ethics through presentations and discussion of case studies. Topics pertinent to development of a successful career in research are also included.",
            "id": "COMPBIO/PATH-BIO 812",
            "title": "RESEARCH ETHICS AND CAREER DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Research.",
            "id": "COMPBIO 990",
            "parent": "COMPBIO",
            "title": "RESEARCH"
        }
    },
    {
        "data": {
            "description": "Science of toxicology as it relates to veterinary practice. The principles of toxicology and the mechanism and treatment of toxicants commonly encountered in small and large animals will be presented.",
            "id": "COMPBIO 555",
            "parent": "COMPBIO",
            "title": "VETERINARY TOXICOLOGY"
        }
    },
    {
        "data": {
            "id": "COMPBIO",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    }
]