[
    {
        "data": {
            "description": "Registration for Ph.D. students who have successfully defended the dissertation and are in the process of completing the required predoctoral internship.",
            "id": "COUNPSY/EDPSYCH/PSYCH/RP&SE 995",
            "title": "PREDOCTORAL INTERNSHIP"
        }
    },
    {
        "data": {
            "source": "COUNPSY 650",
            "target": "COUNPSY 655"
        }
    },
    {
        "data": {
            "description": "History  development of profession; professional ethics; credentialing; major theories  models; roles; and principles including prevention, intervention, consultation, education, advocacy,  systems promoting mental health and well-being.",
            "id": "COUNPSY 791",
            "parent": "COUNPSY",
            "title": "FOUNDATIONS OF CLINICAL MENTAL HEALTH COUNSELING"
        }
    },
    {
        "data": {
            "description": "Introduction to the development and implementation of community-engaged research and programming for Latine populations with \"Esperanza,\" an innovative university-community partnership with Centro Hispano of Dane County. Community-engaged research draws on interdisciplinary research and practice across education, psychology and public health that seeks to disrupt, mitigate, and eliminate mental health disparities among local Latine populations. Learn the principles of community-engaged research and apply them through the development of mutually beneficial, reciprocal, effective, equitable, and justice-oriented community-university projects.",
            "id": "CHICLA/COUNPSY 590",
            "title": "ESPERANZA COMMUNITY-ENGAGED RESEARCH WITH LATINES"
        }
    },
    {
        "data": {
            "description": "Historical and philosophical foundations of counseling. Examination of individual counseling theories, research, roles and practices within the counseling profession.",
            "id": "COUNPSY 800",
            "parent": "COUNPSY",
            "title": "THEORIES OF COUNSELING"
        }
    },
    {
        "data": {
            "description": "Theoretical bases for conducting interviews; types of interviewing; introduction to counseling and interviewing techniques. Limited opportunity to practice.",
            "id": "COUNPSY 650",
            "parent": "COUNPSY",
            "title": "THEORY AND PRACTICE IN INTERVIEWING"
        }
    },
    {
        "data": {
            "description": "Introduction to and development of new skills and behaviors to assist with academic and personal goals. Focus on social competencies, values clarification, and problem-solving to support short- and long-term goals for students on academic probation.",
            "id": "COUNPSY 101",
            "parent": "COUNPSY",
            "title": "ACADEMIC ENHANCEMENT SEMINAR"
        }
    },
    {
        "data": {
            "description": "Instruction and/or practice in specialized counseling approaches, strategies, and techniques; working with various populations of clients served by counselors.",
            "id": "COUNPSY 620",
            "parent": "COUNPSY",
            "title": "SPECIAL TOPICS IN COUNSELING AND GUIDANCE"
        }
    },
    {
        "data": {
            "description": "Supervision of Master's internship counseling experience.",
            "id": "COUNPSY 808",
            "parent": "COUNPSY",
            "title": "SUPERVISED INTERNSHIP IN COUNSELING"
        }
    },
    {
        "data": {
            "description": "Provides training for students who aspire to one of the helping, health, or mental health professions and who currently work or who envision themselves working with Latin@ populations. Provides important frameworks for working with Latin@s, including cultural, spiritual, linguistic and historical features relevant to this population and begin to apply their knowledge in service learning placements.",
            "id": "CHICLA/COUNPSY 525",
            "title": "DIMENSIONS OF LATIN@ MENTAL HEALTH SERVICES"
        }
    },
    {
        "data": {
            "description": "",
            "id": "COUNPSY 999",
            "parent": "COUNPSY",
            "title": "INDEPENDENT READING"
        }
    },
    {
        "data": {
            "description": "Examine the mental health treatment and practice implications of working with Spanish-speaking Latinxs through a culturally affirming, linguistically appropriate, and strengths-based approach. Evaluate different counseling strategies and develop skills to understand and assess Latinx mental health to appropriately guide treatment. Foster reflexivity and examine one's own sociopolitical positionality and influence on the process of psychotherapy with Latinxs.",
            "id": "COUNPSY 575",
            "parent": "COUNPSY",
            "title": "LATINX FOUNDATIONAL PRACTICUM: CASE CONCEPTUALIZATION"
        }
    },
    {
        "data": {
            "description": "A critical analysis of the experiences of Black people through the lens of psychology and the role of advocacy rooted in the establishment of the  field of Black psychology. Explore a broad range of topics relating to Black people experiences in the United States including the history of Black Psychology, Black identity development, intersectionality theory, gender, as well as Black advocacy. Special emphasis will be given to acknowledging the sociohistorical and political contexts of Black people in the diaspora and how time and space impacts how psychologists study the well-being and psychological outcomes of Black people, understanding positionality, and envisioning the future of Black psychology.",
            "id": "COUNPSY 334",
            "parent": "COUNPSY",
            "title": "BLACK PSYCHOLOGY"
        }
    },
    {
        "data": {
            "description": "",
            "id": "COUNPSY 699",
            "parent": "COUNPSY",
            "title": "INDEPENDENT READING"
        }
    },
    {
        "data": {
            "description": "Develop an understanding of immigrant health in the United States from the perspective of social and structural determinants. Applies concepts to a comprehensive framework for the development of health. Describes health assets and risks for specific vulnerable immigrant groups, such as women, children, and undocumented individuals and mixed immigration status families. Provides guidelines for improving immigrant access to quality health care, including language services, provider competence, policy and organizational supports, and community-based collaboration, advocacy, and research.",
            "id": "CHICLA/COUNPSY 331",
            "title": "IMMIGRANT HEALTH AND WELLBEING"
        }
    },
    {
        "data": {
            "description": "We are all engaged with, and affected by, the world of work. Career development is a lifelong process that includes tasks and decision-making related to: selecting our dream job at age five, planning our major in college, transitioning to a new field, working as career counselors, and planning for retirement. Surveys foundational and emerging career development theories and interventions. A key component includes exploration of how knowledge from career development scholarship can be applied to students' own lives within a changing socioeconomic context. Requires reflection on personal development (e.g., personalities, identities, life experiences, cultures, interests, skills, needs, and values) and apply this self-knowledge to engage career exploration and planning.",
            "id": "COUNPSY 665",
            "parent": "COUNPSY",
            "title": "CAREER DEVELOPMENT THROUGHOUT THE LIFE SPAN"
        }
    },
    {
        "data": {
            "source": "COUNPSY 237",
            "target": "COUNPSY 372"
        }
    },
    {
        "data": {
            "description": "Counseling approaches that effectively address crises and trauma, exploring the impact of trauma and crisis and potential neurobiological responses, the development of skills and techniques for assessment and intervention in specific crisis or trauma situations including suicide assessment and intervention.",
            "id": "COUNPSY 777",
            "parent": "COUNPSY",
            "title": "CRISIS AND TRAUMA COUNSELING"
        }
    },
    {
        "data": {
            "description": "Intended to strengthen students' identities as counseling psychologists. Includes examination of (a) historical and contemporary issues that have affected psychology; (b) training and practice guidelines; and (c) ethical and legal issues, including the American Psychological Association ethics code and ethical decision-making.",
            "id": "COUNPSY 926",
            "parent": "COUNPSY",
            "title": "SEMINAR IN ETHICAL AND PROFESSIONAL ISSUES IN COUNSELING PSYCHOLOGY"
        }
    },
    {
        "data": {
            "description": "Develop proficiency in conducting basic psychotherapeutic helping skills in Spanish through role-plays and specialized training that integrates Latinx psychological theories into practical clinical interventions.  Demonstrate advanced Spanish proficiency on ACTFL Proficiency Placement Exam",
            "id": "COUNPSY 550",
            "parent": "COUNPSY",
            "title": "STRENGTHENING LATINXS"
        }
    },
    {
        "data": {
            "description": "Provides students with an overview of the personal, interpersonal and broader social factors that contribute to the health and well-being of individuals and populations in the United States. Examinations of contemporary approaches to health education and health behavior interventions including: Foundations of health education and health behavior programs, health indicators, social and structural determinants of health and health disparities, models of health education/health behavior that support interventions for individuals and communities.",
            "id": "KINES 150",
            "parent": "KINES",
            "title": "FOUNDATIONS OF HEALTH BEHAVIOR AND HEALTH EQUITY"
        }
    },
    {
        "data": {
            "description": "Advanced practicum and topical seminar in counseling psychology.",
            "id": "COUNPSY 903",
            "parent": "COUNPSY",
            "title": "COUNSELING PSYCHOLOGY PRACTICUM--ADVANCED"
        }
    },
    {
        "data": {
            "description": "Theory and research in vocational behavior and career development.",
            "id": "COUNPSY 956",
            "parent": "COUNPSY",
            "title": "SEMINAR: RESEARCH IN VOCATIONAL PSYCHOLOGY AND CAREER DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Explore history, theory, and research related to the psychology of gender and sexuality. A feminist approach is used to deconstruct gender and sexuality within the field of psychology and other mental health fields. Discussions include challenging the current system of psychology, while also integrating concepts to work within the system. An applied approach is used to encourage participation in activities to integrate activism and knowledge into professional identity, bringing in experiences from field placements, internship, and/or places of employment.",
            "id": "COUNPSY 332",
            "parent": "COUNPSY",
            "title": "GENDER AND QUEER ISSUES IN PSYCHOLOGY"
        }
    },
    {
        "data": {
            "description": "Advanced training in counseling psychology assessment, intervention, and/or supervision.",
            "id": "COUNPSY 904",
            "parent": "COUNPSY",
            "title": "COUNSELING PSYCHOLOGY EXTERNSHIP"
        }
    },
    {
        "data": {
            "description": "Provides a broad understanding of professional counselor roles and functions. Also provides a broad understanding of the ethical and legal standards for professional counselors. Gain familiarity with the ACA Code of Ethics, as well as with credentialing standards and organizations relevant to the practice of mental health counseling.",
            "id": "COUNPSY/RP&SE 730",
            "title": "PROFESSIONAL COUNSELING ORIENTATION"
        }
    },
    {
        "data": {
            "description": "Designed to increase knowledge, awareness, and skills of students interested in working on mental health matters within diverse identity groups and communities. Conceptualize mental health and well-being across communities in terms of (a) intersectional identities (individual and groups), (b) mental health and access and utilization of services, and (c) social determinants of health in different contexts and settings. Engage in reflective exercises to understand how their social identities influence their work in different types of communities.",
            "id": "COUNPSY 237",
            "parent": "COUNPSY",
            "title": "MENTAL HEALTH, SELF-AWARENESS, AND SOCIAL JUSTICE: WORKING IN DIVERSE COMMUNITIES"
        }
    },
    {
        "data": {
            "description": "Community-engaged scholarship (CES) captures a broad understanding of the possibilities to learn, teach, and do research through academic-community collaboration. CES encompasses the interaction known as \"service-learning\" or \"community-based learning\" (CBL) as well as complex models of academic-community engagement known as \"community-based research\" or \"participatory action research.\" Staff members from the Morgridge Center for Public Service (MCPS) will introduce the concepts and models of CES, discuss the importance of building and maintaining community relationships, identify challenges and solutions in implementing CES, and assist you in creating your own course, project, or proposal.",
            "id": "COUNPSY 601",
            "parent": "COUNPSY",
            "title": "BEST PRACTICES IN COMMUNITY-ENGAGED SCHOLARSHIP"
        }
    },
    {
        "data": {
            "description": "Review of empirical and theoretical research on ethnic/racial diversity in social development across childhood, adolescence and early adulthood with emphasis on implications for counseling and school psychology.",
            "id": "COUNPSY/EDPSYCH/HDFS 726",
            "title": "ETHNIC AND RACIAL DIVERSITY IN SOCIAL DEVELOPMENT"
        }
    },
    {
        "data": {
            "source": "EDPSYCH 761",
            "target": "COUNPSY 755"
        }
    },
    {
        "data": {
            "description": "History, ethical and professional issues and problems, and current status of the psychological specialty of counseling psychology.",
            "id": "COUNPSY/RP&SE 925",
            "title": "SEMINAR IN COUNSELING PSYCHOLOGY"
        }
    },
    {
        "data": {
            "description": "Seminar in the psychology of individual differences, providing broad and general coverage of theory and research related to individual and cultural differences.",
            "id": "COUNPSY/EDPSYCH/RP&SE 736",
            "title": "SEMINAR IN PSYCHOLOGY OF INDIVIDUAL DIFFERENCES"
        }
    },
    {
        "data": {
            "description": "Exploration of personal, institutional, and community resources that optimize academic success and persistence. Utilizes didactic and experiential methods to develop higher level learning, skill, and understanding.",
            "id": "COUNPSY 115",
            "parent": "COUNPSY",
            "title": "HUMAN RESOURCES DEVELOPMENT: EDUCATIONAL EFFECTIVENESS"
        }
    },
    {
        "data": {
            "source": "EDPSYCH 760",
            "target": "EDPSYCH 761"
        }
    },
    {
        "data": {
            "id": "KINES",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Introduction to psychotherapy. See volunteer clients and receive individual and group supervision related to their work with volunteer clients. Receive specialized training in case conceptualization and integrating theory into the specific interventions they are using with their volunteer clients.",
            "id": "COUNPSY 806",
            "parent": "COUNPSY",
            "title": "SUPERVISED PRACTICUM IN COUNSELING"
        }
    },
    {
        "data": {
            "source": "COUNPSY 950",
            "target": "COUNPSY 960"
        }
    },
    {
        "data": {
            "source": "COUNPSY/CURRIC/EDPOL/EDPSYCH/ELPA/RP&SE 719",
            "target": "COUNPSY/CURRIC/EDPOL/EDPSYCH/ELPA/RP&SE 788"
        }
    },
    {
        "data": {
            "description": "Introduction to mental health concerns and wellbeing, protective and risk factors, and the design and outcomes of evidence-based intervention and prevention programs to promote behavioral and emotional wellbeing across the lifespan. Focus on individual, family, and community health, with particular attention to socioeconomic, cultural, social, and structural mechanisms. Provides an overview of mental health outcomes and prevention programs or interventions aimed to prevent or ameliorate mental illness and distress, and promote positive mental health across the lifespan, including description of issues related to the design, implementation, and evaluation of prevention and intervention programs.",
            "id": "COUNPSY 531",
            "parent": "COUNPSY",
            "title": "PREVENTION AND INTERVENTION IN MENTAL HEALTH ACROSS THE LIFESPAN"
        }
    },
    {
        "data": {
            "description": "Seminar in the history of psychology, providing broad and general coverage of the development of psychology as a scientific discipline. Includes coverage of philosophy of science and systems of psychological inquiry, with applications to current research in psychology.",
            "id": "COUNPSY/EDPSYCH/RP&SE 737",
            "title": "SEMINAR IN HISTORY AND SYSTEMS OF PSYCHOLOGY"
        }
    },
    {
        "data": {
            "description": "Focus on data analysis and translation of finds and implications. Gain theoretical and practical knowledge and skills regarding coding and analysis techniques, use of qualitative analytic tools, strategies for sharing findings with audiences beyond research team.",
            "id": "COUNPSY/CURRIC/EDPOL/EDPSYCH/ELPA/RP&SE 789",
            "title": "QUALITATIVE RESEARCH METHODS IN EDUCATION: FIELD METHODS II"
        }
    },
    {
        "data": {
            "description": "Supervised research experience in the field of counseling psychology. Read about, discuss, and practice research skills that are critical at various phases of the research design and implementation process.",
            "id": "COUNPSY 905",
            "parent": "COUNPSY",
            "title": "RESEARCH PRACTICUM IN COUNSELING PSYCHOLOGY"
        }
    },
    {
        "data": {
            "description": "The foundation structure for first-year Master's students to complete their required 40 hours of practicum. Develop the conceptual and administrative skills to complete practicum hours in collaboration with Counseling Psychology courses and their specific activities. Focuses on gaining the requisite developmental skills to prepare for and practice individual counseling-like interviews with student volunteers.",
            "id": "COUNPSY 700",
            "parent": "COUNPSY",
            "title": "PRACTICUM ACTIVITIES"
        }
    },
    {
        "data": {
            "description": "Provides a theoretical and research framework for understanding suicide, to develop understanding of the experiences of those who are suicidal, and to introduce prevention, assessment, and treatment approaches. Topics will include common myths related to suicide, and research challenging those myths; suicide assessment, intervention, and prevention strategies; suicide bereavement; ethical and legal issues related to suicide; and the experiences of populations disproportionately affected by suicide.",
            "id": "COUNPSY 371",
            "parent": "COUNPSY",
            "title": "PSYCHOLOGY OF SUICIDE"
        }
    },
    {
        "data": {
            "source": "KINES 150",
            "target": "COUNPSY 531"
        }
    },
    {
        "data": {
            "description": "Use personal experiences, readings, and discussions as frameworks for interrogating social, cultural, and political inequities. Engage in dialogues and experiential activities about social differences to promote critical consciousness and intercultural competence across disciplines.",
            "id": "COUNPSY 325",
            "parent": "COUNPSY",
            "title": "SEMINAR: STUDENTS SEEKING EDUCATIONAL EQUITY AND DIVERSITY (SEED)"
        }
    },
    {
        "data": {
            "description": "Examine the treatment and practice implications of different mental health diagnoses and adjustment disorders. Reviews advanced principles of mental health diagnoses based on DSM 5 and ICD 10 nomenclatures and contextualizes this review for the practice of counseling applied and adapted for a diversity of clients and communities. Additionally, counseling strategies are reviewed for challenges with adjustment within various sociocultural contexts. Review empirically supported interventions for specific disorders as well as common factors that have been empirically supported as efficacious across disorders. Includes an examination of the cultural foundation of the counseling profession's and clients' explanatory models for (a) psychological and mental health distress as well as (b) healing and treatment strategies.",
            "id": "COUNPSY 745",
            "parent": "COUNPSY",
            "title": "CLINICAL MENTAL HEALTH COUNSELING: DIAGNOSIS AND TREATMENT PLANNING FOR COUNSELORS"
        }
    },
    {
        "data": {
            "description": "Provides an opportunity to understand and practice the process of consultation and to experience how the role of a consulting psychologist differs from other professional roles (i.e., clinician, supervisor, administrator). Includes a review of consultation models and theories for individuals, groups, and organizations, the fundamentals of program development and evaluation, and considerations for working within communities as a consulting psychologist. Additionally, students will begin to explore the role of the clinical supervisor, supervisor development, and models of supervision.",
            "id": "COUNPSY 850",
            "parent": "COUNPSY",
            "title": "MENTAL HEALTH CONSULTATION IN HEALTH SERVICE PSYCHOLOGY"
        }
    },
    {
        "data": {
            "description": "Methods commonly employed by counseling psychologists in the assessment of the problems of living of normal adults. Diagnostic assessment and assessment of career interests, personality, behavior, and social environment. Development of written individual assessment reports.",
            "id": "COUNPSY 890",
            "parent": "COUNPSY",
            "title": "ADVANCED ASSESSMENT TECHNIQUES IN COUNSELING PSYCHOLOGY"
        }
    },
    {
        "data": {
            "description": "Didactic and experiential learning and exploration to provide basic understanding of inter- and intrapersonal relations. Topics include values clarification, information acquisition, skill acquisition, human relations, self-understanding, self-development, and self-evaluation.",
            "id": "COUNPSY 105",
            "parent": "COUNPSY",
            "title": "HUMAN RESOURCES DEVELOP: AWARENESS PROCESSES-CNSL&GUID PERSPECTIVE"
        }
    },
    {
        "data": {
            "source": "COUNPSY 550",
            "target": "COUNPSY 575"
        }
    },
    {
        "data": {
            "description": "Examine transition to UW-Madison through exploration of the research university and the Wisconsin Experience. A variety of texts, including a novel and textbook, will provide a context for discussion, writing, and experiential assignments.",
            "id": "COUNPSY 125",
            "parent": "COUNPSY",
            "title": "THE WISCONSIN EXPERIENCE SEMINAR"
        }
    },
    {
        "data": {
            "description": "Practicum in supervising counselor trainees in laboratory and field settings.",
            "id": "COUNPSY 902",
            "parent": "COUNPSY",
            "title": "COUNSELING PSYCHOLOGY PRACTICUM IN SUPERVISION"
        }
    },
    {
        "data": {
            "source": "COUNPSY 950",
            "target": "COUNPSY 951"
        }
    },
    {
        "data": {
            "source": "COUNPSY 575",
            "target": "COUNPSY 580"
        }
    },
    {
        "data": {
            "description": "Examines the personality and mental health issues of Asian Americans. Special emphasis is given to how minority group status, adaptation processes, and bicultural development influence various aspects of psychological functioning.  Specific topics include stereotypes and racism, acculturation and enculturation, cultural values/behavioral norms, family roles, ethnic identity development, communication styles, gender and interracial relationships, academic and career achievement, stressors and social support systems within Asian communities, psychopathology, and culturally competent mental health treatment and service delivery.",
            "id": "COUNPSY 333",
            "parent": "COUNPSY",
            "title": "ASIAN AMERICAN PSYCHOLOGY"
        }
    },
    {
        "data": {
            "description": "Full-time involvement. Various assignments. Requires participation in a concurrent seminar.",
            "id": "COUNPSY 810",
            "parent": "COUNPSY",
            "title": "PROFESSIONAL DEVELOPMENT AND CLINICAL PRACTICE"
        }
    },
    {
        "data": {
            "description": "Examine the mental health treatment and practice implications of working with Spanish-speaking Latinxs through a culturally affirming, linguistically appropriate, and strengths-based approach. Evaluate different counseling strategies and develop skills to understand and assess Latinx mental health to appropriately guide treatment. Foster reflexivity and examine one's own sociopolitical positionality and influence on the process of psychotherapy with Latinxs.",
            "id": "COUNPSY 580",
            "parent": "COUNPSY",
            "title": "LATINX ADVANCED PRACTICUM: TREATMENT PLANNING & INTERVENTIONS"
        }
    },
    {
        "data": {
            "description": "An introduction to the intersectionality framework in the United States to enhance skills necessary for culturally responsive awareness and interactions, with specific emphasis on how to think critically about and hold multiple perspectives and how to prepare for service learning. In addition to learning how contexts and social histories matter to situate an understanding of experience, develop self-awareness and understanding of social location as well as learn how contextual factors shape identity, opportunities, and barriers for others. Relevant for all students of different identities, backgrounds, and experiences, who are interested in developing their awareness, knowledge and skills with multiculturalism and diversity.",
            "id": "COUNPSY 225",
            "parent": "COUNPSY",
            "title": "INTERSECTIONALITIES, SELF ­AWARENESS, AND SOCIAL ACTIONS FOR SOCIAL CHANGE"
        }
    },
    {
        "data": {
            "description": "Theoretical and practical foundations relating to the practice of lifestyle and career counseling, career guidance, and career development.",
            "id": "COUNPSY 865",
            "parent": "COUNPSY",
            "title": "LIFESTYLE AND CAREER DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Approaches to counseling intervention for families across the life-cycle. Specific attention paid to family stress.",
            "id": "COUNPSY 825",
            "parent": "COUNPSY",
            "title": "COUNSELING PSYCHOLOGY TECHNIQUES WITH FAMILIES"
        }
    },
    {
        "data": {
            "description": "Covers the research and theory of abnormal psychology, including etiology, manifestation, and diagnosis of mental health disorders. Emphasizes research on developmental psychopathology and cultural issues in assessment and diagnosis.",
            "id": "COUNPSY 740",
            "parent": "COUNPSY",
            "title": "ABNORMAL BEHAVIOR AND PSYCHOPATHOLOGY"
        }
    },
    {
        "data": {
            "source": "CHICLA/COUNPSY 525",
            "target": "COUNPSY 575"
        }
    },
    {
        "data": {
            "description": "Introductory descriptive statistics and statistical inference; measures of central tendency and variability, confidence intervals, theory of hypothesis testing, correlation techniques.",
            "id": "EDPSYCH 760",
            "parent": "EDPSYCH",
            "title": "STATISTICAL METHODS APPLIED TO EDUCATION I"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Provide the philosophical foundations and ethical considerations for delivering culturally- and linguistically-appropriate mental health support to multilingual Latinx communities. Build a foundational knowledge of liberatory philosophy, community-engaged work that promotes radical healing, review the ethical codes relevant to their field of study, and discuss how professional values and ethical mandates relate to Latinx cultural values and multilingual psychological service delivery.",
            "id": "COUNPSY 500",
            "parent": "COUNPSY",
            "title": "RADICAL HEALING AND ETHICS OF BILINGUAL LATINX TRAINING"
        }
    },
    {
        "data": {
            "description": "Understanding and development of basic and advanced helping, interviewing, and counseling skills; consultation theory and application; development of counselor and client self understanding; facilitation of client or consultee change.",
            "id": "COUNPSY 805",
            "parent": "COUNPSY",
            "title": "HELPING RELATIONSHIPS AND TECHNIQUES"
        }
    },
    {
        "data": {
            "description": "Advanced training in research methods in counseling psychology to build skills in conceptualization, research design, data analysis and interpretation.",
            "id": "COUNPSY 960",
            "parent": "COUNPSY",
            "title": "RESEARCH METHODS IN COUNSELING PSYCHOLOGY, II"
        }
    },
    {
        "data": {
            "description": "Exploration and vocational development through didactic and experiential learning. Career education concerns the place and value of work in the individual's life span and style--development and assessment of self, an understanding of the world of work, and facilitation of decision-making, planning, and preparation.",
            "id": "COUNPSY 110",
            "parent": "COUNPSY",
            "title": "HUMAN RESOURCES DEVELOPMENT: CAREER STRATEGIES"
        }
    },
    {
        "data": {
            "id": "EDPSYCH",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Provides preparation for application to predoctoral internship in Health Service Psychology. Includes modules designed to provide knowledge, skills, and information regarding the application, interview, and decision-making process.",
            "id": "COUNPSY 908",
            "parent": "COUNPSY",
            "title": "PRE-DOCTORAL INTERNSHIP IN HEALTH SERVICE PSYCHOLOGY PREPARATION SEMINAR"
        }
    },
    {
        "data": {
            "description": "",
            "id": "COUNPSY 990",
            "parent": "COUNPSY",
            "title": "RESEARCH OR THESIS"
        }
    },
    {
        "data": {
            "description": "Theory and research related to the counseling dyad.",
            "id": "COUNPSY 951",
            "parent": "COUNPSY",
            "title": "COUNSELING PSYCHOLOGY RESEARCH IN INDIVIDUAL INTERVENTION"
        }
    },
    {
        "data": {
            "description": "Intensive examination of theoretical conceptions in contemporary social psychology, including learning-theoretic, reinforcement, incentive, cognitive, and psychodynamic approaches, and research in selected topic areas reflecting these approaches, such as aggression, attitude formation and change, conformity, limitation and modeling, interpersonal attraction, perception of others, prosocial behavior, and social influence.",
            "id": "COUNPSY/PSYCH/RP&SE 729",
            "title": "ADVANCED SOCIAL PSYCHOLOGY"
        }
    },
    {
        "data": {
            "description": "Explore perspectives related to human flourishing from the sciences and humanities; investigate themes such as transformation, resilience, compassion, diversity, gratitude, community; expand self-awareness, enhanced social connectivity, and ability to change; formulate a sense of what it means to lead a flourishing life that sustains meaningful and fulfilling engagement with studies, relationships, community, and career.",
            "id": "ASIAN/COUNPSY/EDPSYCH/PSYCH 120",
            "title": "THE ART AND SCIENCE OF HUMAN FLOURISHING"
        }
    },
    {
        "data": {
            "description": "Reviews practice, theory, and research on group development, dynamics, and group counseling theories; group leadership styles; basic and advanced group counseling methods and skills; and other group approaches.",
            "id": "COUNPSY 802",
            "parent": "COUNPSY",
            "title": "GROUP DYNAMICS PROCESSING AND COUNSELING"
        }
    },
    {
        "data": {
            "source": "COUNPSY/CURRIC/EDPOL/EDPSYCH/ELPA/RP&SE 788",
            "target": "COUNPSY/CURRIC/EDPOL/EDPSYCH/ELPA/RP&SE 789"
        }
    },
    {
        "data": {
            "description": "Life-span perspective on studying individual development from conception to death. Emphasis on multidisciplinary, multidirectional, and contextual approaches to physical, psychological, social, and intellectual developmental processes.",
            "id": "COUNPSY/EDPSYCH 723",
            "title": "DEVELOPMENTAL PROCESSES ACROSS THE LIFE SPAN"
        }
    },
    {
        "data": {
            "description": "Focus on meta-analysis, a set of techniques for synthesizing the results of multiple studies addressing the same research question. Conduct a \"mini\" meta-analysis in an area of interest.",
            "id": "COUNPSY 755",
            "parent": "COUNPSY",
            "title": "SEMINAR ON META-ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Provides an overview of qualitative inquiry, examining assumptions, standards, and methods for generating and communicating interpretations. Methodological and theoretical works illustrate case study, ethnography, narrative, and action research. Does not include a field method component.",
            "id": "COUNPSY/CURRIC/EDPOL/EDPSYCH/ELPA/RP&SE 719",
            "title": "INTRODUCTION TO QUALITATIVE RESEARCH"
        }
    },
    {
        "data": {
            "description": "Theories and research concerning the reasons for sexuality and gender mental health disparities; the significance of contemporary and historical debates over inequality; policies and practices to reduce inequality in health care for LGBTQ+ people.",
            "id": "COUNPSY 200",
            "parent": "COUNPSY",
            "title": "LGBTQ+ PEOPLE AND MENTAL HEALTH EQUITY"
        }
    },
    {
        "data": {
            "id": "COUNPSY",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "An academic and experiential introduction to mindfulness meditation framed within the perspective of psychology is provided. Scientific research and modern meditation instructions that have formed the basis of a variety of secular mindfulness-based interventions are reviewed. Readings will adopt a variety of perspectives and methodologies, including conceptual/theoretical work, clinical trials, review articles including meta-analyses (i.e., aggregating findings across studies), and measurement-oriented studies. Key topics include: Buddhist and historical underpinnings of secular mindfulness-based stress reduction (MBSR) and similar interventions (e.g., lovingkindness and compassion-based meditation), and empirical literature pertaining to neuroscientific and clinical effects of mindfulness training and related interventions.",
            "id": "COUNPSY 372",
            "parent": "COUNPSY",
            "title": "PSYCHOLOGY OF MINDFULNESS"
        }
    },
    {
        "data": {
            "description": "Introductory field methods experience in qualitative research. Learn to define good research questions, determine which methods of data collection and analysis are useful for addressing those questions, engage in these methods, reflect on their utility in education research.",
            "id": "COUNPSY/CURRIC/EDPOL/EDPSYCH/ELPA/RP&SE 788",
            "title": "QUALITATIVE RESEARCH METHODS IN EDUCATION: FIELD METHODS I"
        }
    },
    {
        "data": {
            "description": "Foundational practicum and seminar in counseling psychology.",
            "id": "COUNPSY 900",
            "parent": "COUNPSY",
            "title": "COUNSELING PSYCHOLOGY PRACTICUM--FOUNDATIONAL"
        }
    },
    {
        "data": {
            "description": "Review of theory and research into social identity and cultural foundations of counseling including: (a) the societal context for bias, discrimination and differential treatment of sociocultural groups including but not limited to diversity of sexual orientation, gender expression, social class, cultural/ethnic/racial groups, ability status among other groups; (b) human diversity in social norms, cultural values, social identities, as well as intergroup and intragroup relations; (c) counselors' roles in developing cultural competence, reducing bias and discriminatory treatment of subgroups, and advocating for social justice; and (d) the practice implications of for providing cultural competence in serving across forms of sociocultural diversity.",
            "id": "COUNPSY 860",
            "parent": "COUNPSY",
            "title": "SOCIAL AND CULTURAL FOUNDATIONS OF COUNSELING"
        }
    },
    {
        "data": {
            "description": "Children's psychological experience of racial, ethnic and cultural (REC) status, development of their understandings of REC, and implications of this development for discussing, dialoguing, and working with REC diversity with an emphasis on educational contexts.",
            "id": "COUNPSY 230",
            "parent": "COUNPSY",
            "title": "RACE AND THE DEVELOPING CHILD"
        }
    },
    {
        "data": {
            "description": "Historical, philosophical, descriptive, experimental, case-study and other models of research in counseling psychology.",
            "id": "COUNPSY 950",
            "parent": "COUNPSY",
            "title": "RESEARCH METHODS IN COUNSELING PSYCHOLOGY"
        }
    },
    {
        "data": {
            "description": "Examines various special topics in Counseling and Counseling Psychology. Students need to submit an application and have sophomore standing in order to be considered for this class.",
            "id": "COUNPSY 300",
            "parent": "COUNPSY",
            "title": "SPECIAL TOPICS: COUNSELING AND COUNSELING PSYCHOLOGY"
        }
    },
    {
        "data": {
            "description": "Designed to help students develop an understanding of the clinical communication process, introduce applications of this process in a variety of contexts, and practice and develop clinical communication skills. Gain familiarity with research and theory on communication in a variety of clinical settings. Provides didactic and experiential training in developing basic competencies in clinical communication and listening skills, including personal and cultural characteristics that impact the communication process.",
            "id": "COUNPSY 655",
            "parent": "COUNPSY",
            "title": "CLINICAL COMMUNICATION SKILLS"
        }
    },
    {
        "data": {
            "description": "Analysis of variance and covariance, multiple linear regression; chi-square and various nonparametric techniques.",
            "id": "EDPSYCH 761",
            "parent": "EDPSYCH",
            "title": "STATISTICAL METHODS APPLIED TO EDUCATION II"
        }
    },
    {
        "data": {
            "source": "CHICLA/COUNPSY 525",
            "target": "CHICLA/COUNPSY 590"
        }
    },
    {
        "data": {
            "description": "Supervised practice in group counseling, consultation, and/or college teaching with a focus on psychosocial development and human relations.",
            "id": "COUNPSY 901",
            "parent": "COUNPSY",
            "title": "COUNS PSYCH PRACT: GROUP COUNSELING, CONSULTATION, COLLEGE TEACHING"
        }
    }
]