[
    {
        "data": {
            "description": "A preparation and introductory math course for students enrolled in the Summer Collegiate Experience program. Includes material from precalculus and calculus and related topics depending on students' results on the math placement exam.",
            "id": "MATH 118",
            "parent": "MATH",
            "title": "SUMMER COLLEGIATE EXPERIENCE MATHEMATICS COURSE"
        }
    },
    {
        "data": {
            "description": "Covers the graphs, properties and geometric significance of trigonometric functions of a real variable. Other topics include trigonometric equations and identities, application, trigonometric form of complex numbers, DeMoivre's theorem, and polar and parametric equations. The course also has a significant number of applications, especially related to other disciplines.",
            "id": "MATH 113",
            "parent": "MATH",
            "title": "TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "Develop clinical knowledge and skills necessary to care for patients in Pediatrics and Obstetrics and Gynecology, with emphasis on unique skills such as taking care of vulnerable populations as identified in women's and child health and working with caregivers in addition to the patient themselves. Increase knowledge of fundamental science concepts introduced in Human Family Tree during Phase 1 of the curriculum, such as embryology and teratology, genetic testing, and neurodevelopment. Clinical experiences will occur in a range of representative inpatient, outpatient and surgical settings. In structured educational sessions, compare and contrast selected topics in pediatric, obstetric, and gynecologic patient populations, highlighting the relevant physiology, pathophysiology, basic science, and public health topics.",
            "id": "MEDSC-M 810",
            "parent": "MEDSC-M",
            "title": "SPECIALIZED CARE OF OBSTETRIC, GYNECOLOGIC, AND PEDIATRIC PATIENTS (SCOPE)"
        }
    },
    {
        "data": {
            "description": "Focus on assessing patients with urgent medical conditions, providing acute inpatient care, and transitioning patients to other care settings or home under the care of other professionals. Provide acute care in inpatient and outpatient urgent care settings as well as on the inpatient wards, and develop acute management plans and subsequent transition of care plans. Clinical experiences in acute care settings such as the emergency department and inpatient medicine (both general and subspecialty), psychiatry, and neurology. Builds upon fundamental science concepts introduced in Body in Balance and Mind and Motion, including Ohm's Law, acid-base balance, and volume regulation. Organ system-based approach employing varied modalities. Complete an integrated patient-centered experience by participating in the care of a patient from an urgent admission through inpatient treatment and discharge.",
            "id": "MEDSC-M 812",
            "parent": "MEDSC-M",
            "title": "ACUTE CARE"
        }
    },
    {
        "data": {
            "description": "Gain in-depth knowledge of the fundamentals of stem cell and regenerative biology. This knowledge forms the basis for novel translational research and both diagnostic and therapeutic options. Topics to be covered include the origins of embryonic stem cells (ESCs) and induced pluripotent stem cells (iPSCs) and how they are being used for both research and for clinical applications. Read, discuss, and present cutting-edge literature on how iPSCs are being used to model a variety of human diseases and how stem cell therapies are being used to treat autoimmune disorders such as Lupus Erythematosus, Multiple Sclerosis, and Crohn's disease. Participate in the Stem Cell and Regenerative Medicine Center weekly seminar, and hear from top UW researchers about how they are using stem cells to develop therapies for bone and vascular repair.",
            "id": "CRB 850",
            "parent": "CRB",
            "title": "FUNDAMENTALS OF STEM CELL AND REGENERATIVE BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Accelerated coverage of topics in general chemistry, including introduction to laboratory techniques. Topics include atomic and molecular structure, chemical equilibrium, acid-base chemistry, thermodynamics, kinetics, and electrochemistry.",
            "id": "CHEM 109",
            "parent": "CHEM",
            "title": "ADVANCED GENERAL CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Addresses issues related to the development and manufacture of products for human health, including medical devices and human therapeutics. Topics include regulatory affairs, quality control and validation, clinical and nonclinical studies.",
            "id": "CRB 820",
            "parent": "CRB",
            "title": "BIOTECHNOLOGY OPERATIONS"
        }
    },
    {
        "data": {
            "description": "An intensive workshop that will teach biotechniques, biotechnology product development, and biotechnology applications interfaced with analytical, communication and teaching skills. Simulates the corporate and academic biotechnology setting.",
            "id": "CRB 803",
            "parent": "CRB",
            "title": "MOLECULAR TECHNOLOGIES I"
        }
    },
    {
        "data": {
            "description": "An intensive workshop that will teach biotechniques, biotechnology product development, and biotechnology applications interfaced with analytical, communication and teaching skills. Simulates the corporate and academic biotechnology setting.",
            "id": "CRB 824",
            "parent": "CRB",
            "title": "MOLECULAR TECHNOLOGIES II"
        }
    },
    {
        "data": {
            "description": "An introductory survey course of the political, legal, and ethical issues that have driven the development of the biotechnology industry. Special emphasis is given to FDA regulation of new drugs, devices, and biologics, and to federal regulation and ethics of human subjects research. Come away with an enhanced ability to understand how regulation and politics interact with business and finance to influence the formation and growth of biotechnology companies. Introduction to the ethical issues that help shape public policy regarding applications of biotechnology.",
            "id": "CRB 804",
            "parent": "CRB",
            "title": "BIOTECHNOLOGY REGULATION AND ETHICS"
        }
    },
    {
        "data": {
            "description": "Care of adults and children undergoing an operation or procedure, including perioperative preparation, operative care, and post-operative cares for core clinical conditions in the specialties of anesthesia, neurosurgery, ophthalmology, general surgery, otolaryngology, urology, cardiothoracic surgery, peripheral vascular surgery, orthopedics, plastic and reconstructive surgery, and gynecology, as well as interventional radiology, procedural cardiology and gastroenterology. Basic science concepts include cerebral spinal fluid production and flow, fluids and electrolytes, consciousness, inflammation and wound healing, and cancer biology. Anatomic approach using case discussions, podcasts, curated independent reading, online nationally supported modules, and simulation skills. Longitudinal patient care experience integrating communication, evidence based medicine, health information technology, quality improvement  patient safety, professionalism, scientific inquiry, and public health.",
            "id": "MEDSC-M 813",
            "parent": "MEDSC-M",
            "title": "SURGICAL AND PROCEDURAL CARE"
        }
    },
    {
        "data": {
            "description": "Chemistry, nutrition, and metabolism of biological systems.",
            "id": "BIOCHEM 501",
            "parent": "BIOCHEM",
            "title": "INTRODUCTION TO BIOCHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Clinically relevant methods of scientific thought, inquiry and analysis via the presentation of specific research topics. Emerging concepts in developmental genetics and embryonic stem (ES) cell biology are used as a means of introducing the participants to the critical importance of identifying the \"right\" question, selecting the \"best\" tools to answer the question, using the appropriate logic to interpret experimental results and finally, constructing appropriate conclusions.  Application of the literature of mouse genetics and laboratory research to biomedical health decisions. Strong emphasis on the tools used in the research literature and to 'get your hands dirty' learning the basics of the laboratory techniques involved.",
            "id": "CRB 810",
            "parent": "CRB",
            "title": "MOUSE GENETICS AND EMBRYONIC STEM CELLS: LAB IMMERSION AND UNDERSTANDING CURRENT LITERATURE"
        }
    },
    {
        "data": {
            "description": "Comprehensive course on modern aspects of cell biology.",
            "id": "ZOOLOGY 570",
            "parent": "ZOOLOGY",
            "title": "CELL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Core organic chemistry concepts of structure, reactivity, and synthesis with regards to the functional groups commonly found in commercial and biological substances. Covers a selection of topics fromCHEM 343and345.",
            "id": "CHEM 341",
            "parent": "CHEM",
            "title": "ELEMENTARY ORGANIC CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Covers a broad range of topics in animal development, with an emphasis on molecular mechanisms. Focuses on common themes, with the goal of understanding and analyzing current research in developmental biology and genetics.",
            "id": "CRB/GENETICS 710",
            "title": "DEVELOPMENTAL GENETICS"
        }
    },
    {
        "data": {
            "description": "Covers the most current knowledge of the principles of organogenesis. Focuses on the molecular and cellular pathways leading to normal tissue and organ development and regeneration, including in depth discussions of specification and differentiation processes.",
            "id": "CRB 650",
            "parent": "CRB",
            "title": "MOLECULAR AND CELLULAR ORGANOGENESIS"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Covers topics and concepts in the drug discovery process, with emphasis on laboratory assays and methods used in primary, secondary, and in vitro ADMETox (Absorption, Distribution, Metabolism, Excretion, Toxicity) drug screening. In addition, students build communication and critical thinking skills while working on team projects and analyzing scientific results.",
            "id": "CRB 834",
            "parent": "CRB",
            "title": "MOLECULAR TECHNOLOGIES III"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "Examine how companies gain and sustain competitive advantages.",
            "id": "CRB 842",
            "parent": "CRB",
            "title": "BUSINESS OF BIOTECHNOLOGY: SUSTAINING GROWTH"
        }
    },
    {
        "data": {
            "description": "Examines various special topics in Cell and Regenerative Biology.",
            "id": "CRB 675",
            "parent": "CRB",
            "title": "TOPICS IN CELL AND REGENERATIVE BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Examines various special topics in stem cell and regenerative medicine research.",
            "id": "CRB 625",
            "parent": "CRB",
            "title": "STEM CELL SEMINAR"
        }
    },
    {
        "data": {
            "description": "Exposure to business principles as applied to the operation of biotechnology companies and serve as a foundation for the more advanced business curriculum. Lays the groundwork to fully appreciate the challenges inherent in translating scientific discoveries into a successful business.",
            "id": "CRB 802",
            "parent": "CRB",
            "title": "BUSINESS OF BIOTECHNOLOGY: FUNDAMENTALS OF PRODUCT DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Focus on effective management and career development. Learn and practice the applied skills needed for effective managers that lead to synergistic team success within a biotechnology company. Different communication styles will be explored that are used to engage and assess employees. Professional development will be explored to expand career pathways through networking and by generating professional resumes and interviewing skills.",
            "id": "CRB 845",
            "parent": "CRB",
            "title": "PROFESSIONAL DEVELOPMENT AND EFFECTIVE MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Focuses on molecular, genetic, embryologic, hormonal, anatomical and physiological factors that govern fertility, cell growth, fetal development, and pregnancy as well as the congenital anomalies that can occur when those processes are aberrant. Encompasses the full life-cycle spectrum including childhood growth and development, young adulthood/puberty, issues affecting adolescents and young adults, genetic basis of human disease, reproductive health, menopause, aging, unregulated cell growth (cancer) and end of life issues. Significant content from other competency domains, or \"longitudinal threads\", such as public health, advocacy, ethics, patient care/communication and clinical skills.",
            "id": "MEDSC-M 773",
            "parent": "MEDSC-M",
            "title": "HUMAN FAMILY TREE"
        }
    },
    {
        "data": {
            "description": "Focuses on state-of-the-art topics of global importance in biotechnology. Skills and knowledge from previous courses are integrated and applied to achieve a new level of synthesis and depth of understanding about important programs in biotechnology today. Deepen technical understanding of novel technologies and broaden awareness of ethical and regulatory issues in biotechnology globally. Increase awareness of opportunities for intellectual collaboration and entrepreneurship.",
            "id": "CRB 844",
            "parent": "CRB",
            "title": "ADVANCED BIOTECHNOLOGY: GLOBAL PERSPECTIVES"
        }
    },
    {
        "data": {
            "description": "General biological principles. Topics include: evolution, ecology, animal behavior, cell structure and function, genetics and molecular genetics and the physiology of a variety of organ systems emphasizing function in humans.",
            "id": "BIOLOGY/ZOOLOGY 101",
            "title": "ANIMAL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Goal is to identify a global biotechnology problem, find a technical solution, and analyze all aspects from a business, regulatory, and scientific perspective.",
            "id": "CRB 846",
            "parent": "CRB",
            "title": "BIOTECHNOLOGY CAPSTONE"
        }
    },
    {
        "data": {
            "description": "Identify the roles of physicians, interdisciplinary providers, health care systems, and communities in screening, treating, and preventing common, chronic conditions. Activities are centered on health promotion, outpatient-based chronic disease management, and community health. Clinical experiences will occur in primary care, behavioral health, and other ambulatory and community-based settings that focus on chronic disease management.",
            "id": "MEDSC-M 811",
            "parent": "MEDSC-M",
            "title": "CHRONIC AND PREVENTIVE CARE"
        }
    },
    {
        "data": {
            "description": "Integrated examination of how the immune system interacts with foreign microbes, the normal micro biome, and self tissues, both normal and malignant. Examines inflammation and the impacts of this type of response on normal cells, in wound healing, infectious disease, and inflammatory diseases including autoimmune disease and dermatologic conditions, including neoplasia of the skin. Covers the development of adaptive immune responses from vaccination, infectious processes, and organ transplantation. Covers the basic biology and pathophysiology of \"invaders\" of the human body, including viruses, fungi, and bacteria, along with their clinical diagnosis and therapy. Addresses malignant transformation of the immune effector cells themselves, including cancers of mature lymphoid cells and bone marrow derived malignancies.",
            "id": "MEDSC-M 774",
            "parent": "MEDSC-M",
            "title": "INVADERS AND DEFENSE"
        }
    },
    {
        "data": {
            "description": "Introduction to concepts of health and disease, which vary from patient to patient and through time. View health from a population standpoint, with an introduction to basic public health concepts as well as how physicians may positively impact both individual and population level health. Woven within that framework are introductions to key aspects of professionalism, patient-centered history- taking, and core communication skills.",
            "id": "MEDSC-M 770",
            "parent": "MEDSC-M",
            "title": "PATIENTS, PROFESSIONALISM AND PUBLIC HEALTH"
        }
    },
    {
        "data": {
            "description": "Introduction to core basic science, pathophysiologic, and diagnostic principles requisite for the care and treatment of patients with musculoskeletal, neurologic, and psychiatric presentations and disorders. Basic science concepts include those from the traditional disciplines of cell biology, histology, biochemistry, anatomy, embryology, neuroscience, and behavioral science. Regular integration of these topics with their pathologic and pathophysiologic counterparts. Integration of content related to other competency domains, or \"longitudinal threads\", that include patient care  communication, evidence based medicine, health information technology, quality improvement  patient safety, professionalism, scientific inquiry and public health.",
            "id": "MEDSC-M 775",
            "parent": "MEDSC-M",
            "title": "MIND & MOTION"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Landmark discoveries, as well as current knowledge and controversies in human health, with an emphasis on cancer biology.",
            "id": "CRB/MEDICINE 701",
            "title": "CELL SIGNALING AND HUMAN DISEASE"
        }
    },
    {
        "data": {
            "description": "One-on-one learning experience allowing undergraduates to work with a faculty adviser to develop research projects and skills.",
            "id": "CRB 699",
            "parent": "CRB",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Organized around biomedical themes including nutrients, the digestive system, the biochemistry and endocrine control of metabolism, exercise and fitness and the removal of waste products and toxins to present an integrated picture of how these systems function together to maintain homeostasis. Integrates developmental content from competency domains, or \"longitudinal threads\", including communication, patient care, ethics, health information technology, public health, professionalism, quality improvement, patient safety, and scientific inquiry.",
            "id": "MEDSC-M 772",
            "parent": "MEDSC-M",
            "title": "FOOD, FASTING & FITNESS"
        }
    },
    {
        "data": {
            "description": "Organized around physiological themes, the course includes material related to the cardiovascular system, hematology, nephrology, and pulmonology to present an integrated picture of how these systems function together to maintain homeostasis. In addition, there is significant content from other competency domains such as public health, ethics, evidence-based medicine, patient care/communication and clinical skills.",
            "id": "MEDSC-M 771",
            "parent": "MEDSC-M",
            "title": "BODY IN BALANCE"
        }
    },
    {
        "data": {
            "description": "Presents contemporary issues in the business of biotechnology where students apply concepts critical to the success of modern biotechnology firms. Topics focus on modern problem-solving, including issues relating to leadership and management, product development and negotiation and licensing.",
            "id": "CRB 841",
            "parent": "CRB",
            "title": "BUSINESS OF BIOTECHNOLOGY: CONTEMPORARY CHALLENGES AND APPLICATIONS"
        }
    },
    {
        "data": {
            "description": "Presents diverse topics in contemporary heart biology to facilitate understanding of biological, mechanistic, and experimental concepts of cardiac physiology, disease, and regeneration. Learn cellular and molecular mechanisms underlying heart physiology, function, disease and regenerative ability in various model systems. Includes thinking critically about methodology, experimental design and interpretation, and how conclusions are reached in heart biology through cutting-edge literature.",
            "id": "BME/CRB 670",
            "title": "BIOLOGY OF HEART DISEASE AND REGENERATION"
        }
    },
    {
        "data": {
            "description": "Presents important core concepts, including intellectual property, patent law, trademarks, copyrights, trade secrets, licensing and patent litigation, all specific to the field of biotechnology. Covers the types of intellectual property and how they fit together to protect a product or service. Covers the fundamentals of licensing and technology transfer and the important role of patent examines. Explores the unique aspects of early-stage intellectual property, including market dynamics, pricing and valuation.",
            "id": "CRB 800",
            "parent": "CRB",
            "title": "INTELLECTUAL PROPERTY, PATENTS AND LICENSING"
        }
    },
    {
        "data": {
            "description": "Principles and application of chemical equilibrium, coordination chemistry, oxidation-reduction and electrochemistry, kinetics, nuclear chemistry, introduction to organic chemistry, and chemistry laboratory skills.",
            "id": "CHEM 104",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Principles of molecular structure and bonding applied to predict and explain the reactivity of alkanes, alkenes, alkynes, alkyl halides, alcohols, and thiols. Emphasis placed on rationalizing the stereochemical and regiochemical outcome of chemical processes.",
            "id": "CHEM 343",
            "parent": "CHEM",
            "title": "ORGANIC CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Principles of molecular structure and bonding applied to predict and explain the reactivity of aromatic systems, benzylic and allylic systems, aryl and vinyl halides, and carbonyl-containing compounds (e.g., ketones, carboxylic acids, esters, acid chlorides, amides). Emphasis placed on rationalizing the stereochemical and regiochemical outcome of chemical processes as well as arguing reaction outcomes from spectroscopic evidence.",
            "id": "CHEM 345",
            "parent": "CHEM",
            "title": "ORGANIC CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Proteomics and metabolomics are playing an increasingly important role in biology and medicine. Many biology labs are now starting to use proteomics and metabolomics in their research projects. Includes the essential fundamentals and applications in mass spectrometry-based proteomics and metabolomics to address biological/medical problems. Design of proteomics/metabolomics experiments, troubleshooting, and proper interpretation of the results.",
            "id": "CRB 630",
            "parent": "CRB",
            "title": "PROTEOMICS APPROACHES FOR BIOLOGISTS"
        }
    },
    {
        "data": {
            "description": "Provides a foundation to understand fundamental biological, mechanistic, and experimental concepts in the field of stem cell and regenerative biology.",
            "id": "CRB 640",
            "parent": "CRB",
            "title": "FUNDAMENTALS OF STEM CELL AND REGENERATIVE BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Provides an overview of the early drug discovery process, including target identification and validation, generation of diverse chemical libraries, assay development and high throughput screening, lead optimization by compound profiling, and drug targeting and delivery.",
            "id": "CRB 830",
            "parent": "CRB",
            "title": "EARLY DRUG DISCOVERY"
        }
    },
    {
        "data": {
            "description": "Research and Thesis.",
            "id": "CRB 990",
            "parent": "CRB",
            "title": "RESEARCH AND THESIS"
        }
    },
    {
        "data": {
            "description": "Stoichiometry and the mole concept, the behavior of gases, liquids and solids, thermochemistry, electronic structure of atoms and chemical bonding, descriptive chemistry of selected elements and compounds, intermolecular forces, and chemistry laboratory skills.",
            "id": "CHEM 103",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Study of regenerative medicine and stem cell research within social, ethical and political contexts.",
            "id": "CRB/MEDHIST 615",
            "title": "REGENERATIVE MEDICINE ETHICS AND SOCIETY"
        }
    },
    {
        "data": {
            "description": "The molecular and cellular development of the heart and of its regenerative potential. This knowledge forms the basis for novel translational research and both diagnostic and therapeutic options. Topics to be covered include the genetics underlying normal heart development as well as cardiac tissue specification and differentiation with a focus on molecular signals, associated signal transduction pathways, and transcriptional regulation. Read, discuss, and present cutting-edge literature on the genetic contributions to congenital heart defects and adult heart disease and on cardiac stem cells and the regenerative capacity of the heart. Participate in Adult and Pediatric Cardiology Grand Rounds, the Madison Perinatology Conference, learn about cutting-edge molecular diagnostics for fetal, pediatric and adult cardiac disease, and learn when and how to perform an adult echocardiogram.",
            "id": "CRB 860",
            "parent": "CRB",
            "title": "THE BEAT GOES ON: GENERATION AND REGENERATION OF THE HEART"
        }
    },
    {
        "data": {
            "description": "The two semester sequenceMATH 112-MATH 113covers similar material asMATH 114, but in a slower pace. Not recommended for students with less than an AB inMATH 96.",
            "id": "MATH 114",
            "parent": "MATH",
            "title": "ALGEBRA AND TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Part of a 2-semester sequence withMATH 217; these two courses together are equivalent toMATH 114and221.",
            "id": "MATH 171",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY I"
        }
    },
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics and selected topics in Animal Physiology.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Topics include: selected topics in plant physiology, a survey of the five major kingdoms of organisms, speciation and evolutionary theory, and ecology at multiple levels of the biological hierarchy.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "With a focus on the biotechnology and medical device industries, provides an opportunity to share experiences and information and to practice leadership and project management knowledge and skills. Focuses upon understanding and developing a Project Management Plan. Addresses the issues and various situations faced by Project Managers and their effective response.",
            "id": "CRB 843",
            "parent": "CRB",
            "title": "PROJECT MANAGEMENT AND LEADERSHIP"
        }
    },
    {
        "data": {
            "id": "BIOCHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CRB",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MEDSC-M",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ZOOLOGY",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 501",
            "target": "BME/CRB 670"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 501",
            "target": "CRB 630"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 152"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 101"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BME/CRB 670"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "CRB 650"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "CRB 675"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "ZOOLOGY 570"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "target": "CRB 675"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 151"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 109"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 341"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 343"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 341",
            "target": "BIOCHEM 501"
        }
    },
    {
        "data": {
            "source": "CHEM 343",
            "target": "CHEM 345"
        }
    },
    {
        "data": {
            "source": "CHEM 345",
            "target": "CHEM 341"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 113"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 113",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 114",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 114"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "CHEM 109"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 114"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 770",
            "target": "MEDSC-M 810"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 771",
            "target": "MEDSC-M 810"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 772",
            "target": "MEDSC-M 810"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 773",
            "target": "MEDSC-M 810"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 774",
            "target": "MEDSC-M 810"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 775",
            "target": "MEDSC-M 810"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 810",
            "target": "CRB 810"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 810",
            "target": "CRB 850"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 810",
            "target": "CRB 860"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 811",
            "target": "CRB 810"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 811",
            "target": "CRB 850"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 811",
            "target": "CRB 860"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 812",
            "target": "CRB 810"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 812",
            "target": "CRB 850"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 812",
            "target": "CRB 860"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "CRB 810"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "CRB 850"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "CRB 860"
        }
    },
    {
        "data": {
            "source": "ZOOLOGY 570",
            "target": "CRB 640"
        }
    }
]