[
    {
        "data": {
            "description": "Specialized subject matter of current interest.",
            "id": "CSCS 801",
            "parent": "CSCS",
            "title": "SPECIAL TOPICS IN CIVIL SOCIETY AND COMMUNITY RESEARCH"
        }
    },
    {
        "data": {
            "description": "Provides opportunities for learning about some of the \"nuts and bolts\" of nonprofit organizations. Through studying high- impact organizations, interacting with local experts, and through an independent investigation of the work of a local nonprofit organization, develop uniquely tailored understandings and skills for nonprofit leadership.",
            "id": "CSCS 460",
            "parent": "CSCS",
            "title": "CIVIL SOCIETY AND COMMUNITY LEADERSHIP"
        }
    },
    {
        "data": {
            "description": "Applied, methodologically focused seminar that aims to develop capacities for action-oriented mixed-methods research design, as well as basic understanding of an array of methodological tools. Readings, discussions, assignments, and class projects are all oriented toward developing this capacity and understanding.",
            "id": "CSCS 812",
            "parent": "CSCS",
            "title": "MIXED-METHODS IN COMMUNITY-BASED RESEARCH"
        }
    },
    {
        "data": {
            "description": "Learn the concepts and tools to analyze the broad environment in which nonprofits operate and assess the impact of this environment at the community and individual organizational level.",
            "id": "CSCS 300",
            "parent": "CSCS",
            "title": "NONPROFIT SECTOR: OVERVIEW AND FOUNDATIONS"
        }
    },
    {
        "data": {
            "description": "Individual study in honors as arranged with a faculty member.",
            "id": "CSCS 680",
            "parent": "CSCS",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Explores the philosophy of fundraising and development, its bearing on the nonprofit sector, as well as the practical strategies employed by nonprofits in their fundraising efforts to secure time, talent and treasure for sustaining their work. Nonprofit sector organizations (NPO) seek to thrive in their efforts to have a positive impact in bringing social change - to individuals, families, and communities and, indeed, the world. To sustain these noble efforts, these dynamic organizations must attract and garner the time, talent and treasure necessary to develop and grow. Fundraising programs are a significant part of a NPO's work in bringing resources to support their fund development/institutional advancement. Development is a mindset - a way to frame the NPO's thinking and behaviors in providing a comprehensive approach to broad mission support.",
            "id": "CSCS 430",
            "parent": "CSCS",
            "title": "FUNDRAISING & DEVELOPMENT FOR NONPROFIT ORGANIZATIONS"
        }
    },
    {
        "data": {
            "description": "Comprehensive communication strategies for individuals, families, and communities.",
            "id": "CSCS 335",
            "parent": "CSCS",
            "title": "COMMUNICATING WITH KEY AUDIENCES"
        }
    },
    {
        "data": {
            "description": "Directed study projects as arranged with a faculty member.",
            "id": "CSCS 999",
            "parent": "CSCS",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "A supervised internship providing hands-on training in a professional experience in community and nonprofit leadership related fields.",
            "id": "CSCS 601",
            "parent": "CSCS",
            "title": "INTERNSHIP"
        }
    },
    {
        "data": {
            "description": "Specialized subject matter of current interest.",
            "id": "CSCS 375",
            "parent": "CSCS",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "Individual study as arranged with a faculty member.",
            "id": "CSCS 690",
            "parent": "CSCS",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Examine contemporary issues with an emphasis on the role that individuals and communities play in achieving positive social change. Develop the mindsets and communication skills necessary to work in diverse community contexts. Specific themes may shift based on current events, but often include education reform, racial justice, health equity, alternative economies, food systems, and sustainability.",
            "id": "CSCS 125",
            "parent": "CSCS",
            "title": "COMMUNITY AND SOCIAL CHANGE"
        }
    },
    {
        "data": {
            "description": "Theoretical and practical background in designing and writing grant proposals. Develop skills to locate funding opportunities, summarize program elements, create budgets, and write competitively. Emphasizes writing skills, budget creation, building collaborative partnerships, understanding funder interests and priorities. Analyzing requests for proposals, writing needs statements, methods, budgets, peer review.",
            "id": "CSCS 510",
            "parent": "CSCS",
            "title": "DESIGN & WRITE GRANT PROPOSALS"
        }
    },
    {
        "data": {
            "description": "Consistent with the values of civil society, emphasizes engagement, debate, collegiality, personal discernment, and expression. Reflect on how developing academics and practitioners can use frameworks and practices of civil society to further professional goals and civic contributions.",
            "id": "CSCS 775",
            "parent": "CSCS",
            "title": "BUILDING CIVIL SOCIETY"
        }
    },
    {
        "data": {
            "description": "Newswriting of interest to individuals, families, and communities.",
            "id": "CSCS 130",
            "parent": "CSCS",
            "title": "COMMUNITY NEWSWRITING"
        }
    },
    {
        "data": {
            "source": "CSCS 300",
            "target": "CSCS 560"
        }
    },
    {
        "data": {
            "description": "Provides detailed examination of careers in Human Ecology and the fields of community and nonprofit leadership. High-level leaders from leading community organizations, nonprofits, community health institutions, family support agencies, NGO's, and public-sector entities will present as guest speakers and panel members.",
            "id": "CSCS 254",
            "parent": "CSCS",
            "title": "COMMUNITY & NONPROFIT LEADERSHIP SYMPOSIUM"
        }
    },
    {
        "data": {
            "id": "CSCS",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Theory and principles of teaching and learning in family and consumer education.",
            "id": "CSCS/CURRIC 427",
            "title": "METHODS OF TEACHING FAMILY AND CONSUMER EDUCATION"
        }
    },
    {
        "data": {
            "description": "Enables students with supervised internships to earn academic credit while engaged in a professional experience in community and nonprofit leadership related fields. Course is intended for juniors and seniors in Community and Nonprofit Leadership.",
            "id": "CSCS 301",
            "parent": "CSCS",
            "title": "COORDINATIVE INTERNSHIP/COOPERATIVE EDUCATION"
        }
    },
    {
        "data": {
            "description": "Explores philanthropy and civic engagement through giving time, money and effort to a public purpose. Learn the philanthropic process including creating a giving plan, as well as exploring strategic and creative ways to give that promote civil society and engagement. Develop plans for assessment and evaluation of philanthropic giving.",
            "id": "CSCS 400",
            "parent": "CSCS",
            "title": "PHILANTHROPY AND CIVIC ENGAGEMENT"
        }
    },
    {
        "data": {
            "source": "CSCS 300",
            "target": "CSCS 570"
        }
    },
    {
        "data": {
            "description": "Directed study projects as arranged with a faculty member.",
            "id": "CSCS 699",
            "parent": "CSCS",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Theoretical, critical, and analytical understanding and application of the conscious and systematic use of data, inquiry and analysis for community, organization and program diagnosis, intervention and evaluation in various community-based and nonprofit organizations.",
            "id": "CSCS 570",
            "parent": "CSCS",
            "title": "COMMUNITY BASED RESEARCH AND EVALUATION"
        }
    },
    {
        "data": {
            "source": "CSCS 742",
            "target": "CSCS 743"
        }
    },
    {
        "data": {
            "source": "CSCS 300",
            "target": "CSCS 345"
        }
    },
    {
        "data": {
            "description": "Learn about contemporary Native communities, both domestically and globally, through a carefully curated selection of readings, podcasts, and videos from Indigenous scholars, community members, knowledge holders, and activists. Offers a broad historical overview of Native American communities in the United States that illustrates the historical trajectory from early colonization and dispossession through self-determination and the recognition of tribal sovereignty in action by local, state, and federal governments.",
            "id": "AMERIND/CSCS 330",
            "title": "AMERICAN INDIAN COMMUNITIES: SOVEREIGNTY, STRUGGLES, AND SUCCESSES"
        }
    },
    {
        "data": {
            "source": "CSCS 811",
            "target": "CSCS 812"
        }
    },
    {
        "data": {
            "description": "Theory and processes of program planning for formal and informal educational settings; relation of vocational education to secondary, adult, and continuing education programs.",
            "id": "CSCS/CURRIC 428",
            "title": "PROGRAM PLANNING IN FAMILY AND CONSUMER EDUCATION"
        }
    },
    {
        "data": {
            "description": "Specialized subject matter of current interest.",
            "id": "CSCS 501",
            "parent": "CSCS",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "Develop, conduct, and lead a participatory program evaluation using a transformative lens. Emphasizes collaborative strategies that build evaluation capacity and improve the use of evaluation findings. Build knowledge and skills in evaluation and apply them through projects with institutions (e.g. community organizations, voluntary associations or foundations) involved in creating a civil and just society. Topics include but are not limited to professional standards and ethical practice, understanding context and engaging stakeholders, the role of power in evaluation, evaluation theory, mixed methods designs, developmental and collective approaches to evaluation, and systems thinking.",
            "id": "CSCS 813",
            "parent": "CSCS",
            "title": "TRANSFORMATIVE EVALUATION IN PRACTICE"
        }
    },
    {
        "data": {
            "description": "An interdisciplinary approach to understand human trafficking as a complex social phenomenon. The topic of human trafficking is analyzed through readings and a robust set of case studies, as part of a spectrum of interrelated violence, exploitation and systemic inequities influenced by various social determinants rooted in gender, power, class, sex, race, opportunity, education, culture, politics, access, and sexual orientation among other factors. Advocacy training will focus on commercial sexual exploitation and human trafficking with attention to supply and demand issues, vulnerability factors, immigration and law enforcement policies, and the overall impact on survivors' rights, health, and their status in society.",
            "id": "CSCS 410",
            "parent": "CSCS",
            "title": "HUMAN TRAFFICKING:  GLOBAL AND LOCAL PERSPECTIVES"
        }
    },
    {
        "data": {
            "description": "Specialized subject matter of current interest to graduate students. Requisite varies by topic",
            "id": "CSCS 675",
            "parent": "CSCS",
            "title": "GENERAL TOPICS"
        }
    },
    {
        "data": {
            "description": "Focus on ways in which people develop identities and commitments as members of cultural and community groups and how they exercise rights and assume responsibilities in those contexts. An ecological approach to civic development - considering characteristics of persons (age, race, ethnicity, gender, sexual orientation, culture) and the opportunities, structural impediments, and challenges of social and institutional contexts for different groups. Major themes are people's collective agency in working for social change and how engaging in civic work promotes well-being. Designed to encourage a collaborative approach to learning, to articulate scholarship based on your passions for social justice, and to make your work accessible to different scholarly and public audiences.",
            "id": "CSCS 785",
            "parent": "CSCS",
            "title": "CIVIC DEVELOPMENT ACROSS THE LIFESPAN"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "An applied introduction to planning and evaluation for nonprofit and community-based organizations. Develop skills that can be utilized in both existing and prospective organization-level strategic planning, individual program-level planning, as well as multi-organization planning contexts. Learn how to think of evaluation as a practice, a way of thinking, and as a process integral to and interdependent with strategic and program planning.",
            "id": "CSCS 345",
            "parent": "CSCS",
            "title": "EVALUATION AND PLANNING FOR COMMUNITY AND NONPROFIT ORGANIZATIONS"
        }
    },
    {
        "data": {
            "description": "Explores entrepreneurialism in nonprofits, business, government, and arts and humanities contexts.  With a broad approach of ideas, readings, and lectures, students will understand the ever-changing role that entrepreneurs play and contribute to society.",
            "id": "CSCS 455",
            "parent": "CSCS",
            "title": "ENTREPRENEURIALISM AND SOCIETY"
        }
    },
    {
        "data": {
            "description": "Part two of a two part course sequence. Continued development of a commitment to community and civic engagement through volunteer leadership of nonprofit organizations in Madison/Dane County.  Continued service on the boards of nonprofits (in a non-voting capacity) and completion of an independent governance project.",
            "id": "CSCS 743",
            "parent": "CSCS",
            "title": "NONPROFIT BOARD LEADERSHIP DEVELOPMENT II"
        }
    },
    {
        "data": {
            "description": "Enhance your collective ability to identify, describe, and analyze power and empowerment within communities and social, economic, and political systems. Enables us to more effectively and intentionally situate our praxis with regard to power and collective action. Centers on inquiries into the roles that power plays in collective action for community change and improvement, as well as the roles that it often plays in hindering such efforts and maintaining the status quo or defending elite interests.",
            "id": "CSCS 795",
            "parent": "CSCS",
            "title": "COMMUNITY POWER AND COLLECTIVE ACTION"
        }
    },
    {
        "data": {
            "description": "Social media is a strategic tool to help organizations, advocacy groups, and individuals advance social justice initiatives to create a more equitable future. Analyze historical campaigns to evaluate social media presence, audience focus, communication goals, content resonance, storytelling techniques, and audience engagement. Explore ethical topics tied to social media as a communications and organizing medium including: first amendment rights and the emerging regulation of social media platforms; source authenticity and the weaponization of misinformation in an era of rapidly evolving technology; privacy in an increasingly connected world; biases built into our technology; and equity of technology access.",
            "id": "CSCS 155",
            "parent": "CSCS",
            "title": "SOCIAL MEDIA FOR SOCIAL JUSTICE"
        }
    },
    {
        "data": {
            "description": "Part one of a two part course sequence. Develop a commitment to community and civic engagement through volunteer leadership of nonprofit organizations in Madison/Dane County.  Serve on the boards of nonprofits (in a non-voting capacity) and complete an independent governance project.",
            "id": "CSCS 742",
            "parent": "CSCS",
            "title": "NONPROFIT BOARD LEADERSHIP DEVELOPMENT I"
        }
    },
    {
        "data": {
            "description": "Explores community building and community action strategies for renewing fragmented connections in today's localities. Builds knowledge and skills for participation and leadership at team and multi-stakeholder community levels in the context of nonprofit organization work.  Requires 5 hours of service learning.",
            "id": "CSCS 560",
            "parent": "CSCS",
            "title": "COMMUNITY LEADERSHIP"
        }
    },
    {
        "data": {
            "description": "Independent research and writing under the supervision of a faculty member.",
            "id": "CSCS 990",
            "parent": "CSCS",
            "title": "RESEARCH AND THESIS"
        }
    },
    {
        "data": {
            "description": "Purpose-driven organizations including community and grassroots efforts, nonprofits, nongovernmental organizations, social enterprises, cooperatives, and land trusts. Examines roles, critiques, characteristics, and infrastructural components. Includes analysis of historical, current, and trending approaches to purpose-driven work through textual, community-engaged, or case study learning.",
            "id": "CSCS 530",
            "parent": "CSCS",
            "title": "PURPOSE-DRIVEN ORGANIZATIONS"
        }
    },
    {
        "data": {
            "description": "Explores global health and well-being from a community perspective and through the holistic lens of human ecology. Respectful community-engagement, evidence-based practice, and making the local to global connection are key themes. Almost everything we do has an impact on our own health and that of our communities and the world. Prepares students for community-oriented global health engagement. Consider the nature of community and different types of communities, both locally and globally. Reflect on experiences in communities where you have lived or called home. Review the concept of health and well-being, and evidence-based practice. Learn basic principles of asset-based participatory community research and study, compare and contrast case examples from around the world.",
            "id": "CSCS 500",
            "parent": "CSCS",
            "title": "GLOBAL HEALTH AND COMMUNITIES: FROM RESEARCH TO PRAXIS"
        }
    },
    {
        "data": {
            "description": "Directed study projects as arranged with a faculty member.",
            "id": "CSCS 299",
            "parent": "CSCS",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "An interdisciplinary, introduction to community-based research. Designed to be a co-exploration of different community-based, community-engaged, and action-oriented research approaches and methods as utilized in a variety of disciplines. An opportunity to apply skills gained through participation in community-based research (CBR) projects developed collaboratively with a local community partner.",
            "id": "CSCS 811",
            "parent": "CSCS",
            "title": "COMMUNITY-BASED RESEARCH: THEORY AND PRACTICE"
        }
    },
    {
        "data": {
            "description": "Designed to demonstrate accumulated training and experience in community and nonprofit leadership. Explores how to better conceptualize, engage with, and reflect on social justice and community issues from a human ecology perspective, while also learning from prior practice and experience working with nonprofit, community- and mission-based organizations.",
            "id": "CSCS 600",
            "parent": "CSCS",
            "title": "COMMUNITY LEADERSHIP PORTFOLIO CAPSTONE"
        }
    },
    {
        "data": {
            "description": "Human rights precepts, policies and frameworks for change in governments and civil society. Convention of the Rights of the Child (CRC), the principal human rights convention related to children, and other human rights policies related to children and young people. Critically analyze the CRC and access information from the Reports of the Committee on the Rights of the Child. Legal and policy frameworks which address the needs of children in adversity Internationally. Review and develop case studies from around the world and from the United States on child rights topics, including a statement of intention and profiles of relevant research, advocacy, or service organizations.",
            "id": "CSCS 470",
            "parent": "CSCS",
            "title": "THE HUMAN RIGHTS OF CHILDREN AND YOUTH: GLOBAL AND LOCAL PERSPECTIVES"
        }
    }
]