[
    {
        "data": {
            "description": "Addresses aspects of forms, features and functions of the English language, including an understanding of multiple varieties and registers of English, and how language use functions in and out of schools. Attention to the emergent bilingual students' use of dual/multiple languages, varieties, registers, and discourses, relationships between first and additional languages, and ways to support students as they develop linguistic repertoires  that include particular varieties of language that can help facilitate school success.",
            "id": "CURRIC 338",
            "parent": "CURRIC",
            "title": "LINGUISTICS FOR TEACHERS"
        }
    },
    {
        "data": {
            "description": "An introduction to language, literacy and linguistic diversity for teachers. Provides an overview of the components of language, the structure of the English language and how language functions, with special emphasis on how language is used in schools, with the goal of supporting teachers' work with multilingual learners. Through exploration of language(s) and a critical reflection of personal experiences as language users, language learners, language analysts and language advocates, enhance understanding of communicative repertoires as dynamic, fluid, and complex.",
            "id": "CURRIC 737",
            "parent": "CURRIC",
            "title": "LINGUISTICS FOR EDUCATORS"
        }
    },
    {
        "data": {
            "description": "An opportunity to learn from professional teaching artists, continue to develop practical skills of teaching, and reflect on one's teaching artist practice. Participate in two different teaching artist residencies in order to learn a variety of disciplinary practices. Observe and assist the teaching artists and lead a portion of one class. Engage in collective reflection of residencies and explore relationship to theory. Address classroom challenges and establish the habits of ongoing reflection and effective pedagogical critique. Articulate a personal teaching artist statement, reflect on teaching experiences, and identify ways to make the arts accessible to diverse groups of learners.",
            "id": "CURRIC 329",
            "parent": "CURRIC",
            "title": "TEACHING ARTIST PRACTICUM"
        }
    },
    {
        "data": {
            "description": "Critically examines different lines of research in controversial issues instruction such as the contextual factors affecting the teaching of controversial topics, and the instructional practices involved in teaching controversial issues. Contextual factors affecting teachers' decisions to teach controversial issues or topics include official curricular policies, community beliefs, emotional histories, and teachers' differing beliefs and sense of purpose. Examines the affordances and constraints of different pedagogical approaches to teaching controversial issues such as the use of discussion and deliberation, as well as pedagogies that recognize the importance of trust, power, emotion, and personal connections.",
            "id": "CURRIC 818",
            "parent": "CURRIC",
            "title": "TEACHING CONTROVERSIAL ISSUES"
        }
    },
    {
        "data": {
            "description": "Developing strategies for teaching young children. Relationships between development and culture, play, the variety of teachers' roles in learning, the functions of observation and assessment, developmentally appropriate practices, engaging children in their own learning, and constructing a curriculum unit.",
            "id": "CURRIC 550",
            "parent": "CURRIC",
            "title": "METHODS, MATERIALS AND ACTIVITIES IN EARLY CHILDHOOD EDUCATION"
        }
    },
    {
        "data": {
            "description": "Develops preservice teachers' mathematical knowledge for teaching i.e., Pedagogical Content Knowledge - the kind of knowledge that blends mathematical and pedagogical understandings. Explores topics defined by the Common Core State Standards for Mathematics such as foundations of arithmetic, addition, subtraction, multiplication and division of whole numbers and integers, the base-ten system, number theory, foundations of fraction operations and geometry.",
            "id": "CURRIC 319",
            "parent": "CURRIC",
            "title": "PEDAGOGICAL CONTENT KNOWLEDGE FOR TEACHING ELEMENTARY MATHEMATICS 1"
        }
    },
    {
        "data": {
            "description": "Explore how children learn science, how to create classrooms where children learn to inquire, and  how to assess children's learning. Conduct inquiries as the basis for considering these issues.",
            "id": "CURRIC 372",
            "parent": "CURRIC",
            "title": "TEACHING SCIENCE"
        }
    },
    {
        "data": {
            "description": "Focuses on framing, generating, collecting, and analyzing data gathered from interviews and documents related to people's lives.",
            "id": "CURRIC 723",
            "parent": "CURRIC",
            "title": "LIFE HISTORY: THEORIES & METHODS"
        }
    },
    {
        "data": {
            "description": "Further develop the pedagogical knowledge that elementary and middle school teachers need to appropriately understand and extend students' mathematical ways of knowing as defined by the Common Core State Standards. Critically reflect on personal assumptions about mathematics and think beyond standardized mathematical practices.",
            "id": "CURRIC 320",
            "parent": "CURRIC",
            "title": "PEDAGOGICAL CONTENT KNOWLEDGE FOR TEACHING ELEMENTARY MATHEMATICS 2"
        }
    },
    {
        "data": {
            "description": "Internationalizing education means both internationalizing our thinking and the ways we perceive the world, and internationalizing the field of curriculum and instruction. An introduction to various educational systems around the world, focusing on similarities and dissimilarities in what is taught. Discussions center on curriculum across cultures, and its relation to political systems and religions to build an understanding of diversity in societies and schools. Explores local and indigenous knowledge; the role of international agencies in comparing nation's school systems; the rise of private schools and universities; immigration and the changing borders of society and cultures in the curriculum; questions of sexuality and gender diversity; diversity of families and social exclusions and inequalities in elementary and secondary schools; as well as international opportunities for study with international and local speakers from multiple perspectives.",
            "id": "CURRIC 366",
            "parent": "CURRIC",
            "title": "INTERNATIONALIZING EDUCATIONAL KNOWLEDGE"
        }
    },
    {
        "data": {
            "description": "Investigates how the systems of incarceration and education operate alongside, within, around and through one another. Provides a historical examination of how education and incarceration have interacted. Examines how prisons operate as 'teaching institutions,' what it teaches all of us impacted by it, and what interventions have been designed to facilitate particular kinds of learning. Presents firsthand accounts of those who work and live in the carceral system currently.",
            "id": "CURRIC/EDPOL/LEGALST 250",
            "title": "INCARCERATION AND EDUCATION"
        }
    },
    {
        "data": {
            "description": "Planning and completing a master's project or thesis.",
            "id": "CURRIC 790",
            "parent": "CURRIC",
            "title": "MASTER'S PROJECT OR THESIS"
        }
    },
    {
        "data": {
            "description": "",
            "id": "CURRIC 399",
            "parent": "CURRIC",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "",
            "id": "CURRIC 490",
            "parent": "CURRIC",
            "title": "STUDENT TEACHING IN SCIENCE IN THE HIGH SCHOOL"
        }
    },
    {
        "data": {
            "description": "",
            "id": "CURRIC 494",
            "parent": "CURRIC",
            "title": "STUDENT TEACHING IN HIGH SCHOOL MATHEMATICS"
        }
    },
    {
        "data": {
            "description": "",
            "id": "CURRIC 496",
            "parent": "CURRIC",
            "title": "STUDENT TEACHING OF ENGLISH IN THE HIGH SCHOOL"
        }
    },
    {
        "data": {
            "description": "",
            "id": "CURRIC 690",
            "parent": "CURRIC",
            "title": "INDEPENDENT FIELD WORK"
        }
    },
    {
        "data": {
            "description": "",
            "id": "CURRIC 699",
            "parent": "CURRIC",
            "title": "INDEPENDENT READING"
        }
    },
    {
        "data": {
            "description": "A broad introduction to the field of Educational Communications and Technology (ECT) and attempts to balance theoretical inquiry with \"hands on\" design work. Cover the theoretical foundations of ECT and explore new developments in technology, theory and practice. Identifies new horizons for practicing and pre-service teachers to leverage technology for their own professional and personal empowerment through thinking systematically about technology and the classroom.",
            "id": "CURRIC 713",
            "parent": "CURRIC",
            "title": "TECHNOLOGY INTEGRATION FOR TEACHING AND LEARNING"
        }
    },
    {
        "data": {
            "description": "A critical examination of the conceptual and theoretical traditions that contribute to the educational reform and ideology known as multicultural education. Includes readings from ethnic studies, black studies, feminist theory, antiracist pedagogy, bilingual education, and critical race theory.",
            "id": "CURRIC 744",
            "parent": "CURRIC",
            "title": "PERSPECTIVES IN MULTICULTURAL EDUCATION"
        }
    },
    {
        "data": {
            "description": "A poststructural feminist analysis of educational discourse and practice; examines selected sex/gender issues in curriculum and instruction; explores some implications for classroom teaching of the complex interrelationships between sex/gender, race, social class, sexuality, and ability/disability.",
            "id": "CURRIC/GEN&WS 760",
            "title": "SEX/GENDER-RELATED ISSUES IN CURRICULUM AND INSTRUCTION"
        }
    },
    {
        "data": {
            "description": "A practical class: preparation and performance of a production for young audiences, with development and implementation of accompanying educational material.",
            "id": "CURRIC/THEATRE 462",
            "title": "THEATRE FOR YOUNG AUDIENCES: PRODUCTION"
        }
    },
    {
        "data": {
            "description": "Addresses a range of issues to help teachers more thoughtfully and equitably serve their students of color and develop a critical and historical understanding of the racism, marginalization, and exclusion that is endemic to the U.S. public school system. Provides an overview of foundational constructs that  are essential for pre-service teachers preparing to teach and serve diverse students and families. Explore how race, racism, and racialization in education intersect with class, gender, dis/ability, religion, sexuality, etc. to shape inequitable schooling conditions and experiences for students of color. Analyze the effects at the individual, interactional, institutional, and societal levels Consider how power always-already enables particular policies and practices that reproduce educational inequities and hence sustain white privilege and dominance.",
            "id": "CURRIC/RP&SE 406",
            "title": "RACE, INTERSECTIONALITY, AND EQUITY IN EDUCATION"
        }
    },
    {
        "data": {
            "description": "Addresses core ideas of learning theory and human development focusing on the middle childhood population. Explores how learning and development are necessarily situated in local and global contexts, offering a cultural frame for understanding the work of teachers. Explores the cultural nature of learning and development and how these understandings can be applied to classroom practice.",
            "id": "CURRIC 339",
            "parent": "CURRIC",
            "title": "CULTURAL FOUNDATIONS OF LEARNING AND DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Addresses how members of Latinx communities have used writing for both personal and social change.  Develop a deeper understanding of the political, family, and school contexts in which Latinx peoples in the United States write and read.",
            "id": "CHICLA/CURRIC 306",
            "title": "LATINX LITERACIES"
        }
    },
    {
        "data": {
            "description": "Addresses social, cultural, and educational issues related to schooling for young English learners. Provides an overview of multiple factors that impact teaching and learning for these students.",
            "id": "CURRIC 325",
            "parent": "CURRIC",
            "title": "EDUCATING YOUNG ENGLISH LEARNERS"
        }
    },
    {
        "data": {
            "description": "Addresses social, cultural, and educational issues related to schooling for young English learners. Provides an overview of multiple factors that impact teaching and learning. Issues include but are not limited to: theories relating to language use and learning; registers and varieties of English; program structures and designs; school and classroom environments, and connections between families and schools.",
            "id": "CURRIC 312",
            "parent": "CURRIC",
            "title": "FOUNDATIONS OF ESL EDUCATION"
        }
    },
    {
        "data": {
            "description": "Addresses the mathematical concepts necessary for the effective instruction of number and generalization at the middle school level.",
            "id": "CURRIC 636",
            "parent": "CURRIC",
            "title": "MATHEMATICAL KNOWLEDGETEACHING"
        }
    },
    {
        "data": {
            "description": "Addresses the ways Chican@s/Latin@s in contemporary U.S. society have engaged in social, cultural, political, and ideological struggles for educational justice. Begins with a broad overview of educational issues and examines major social movements, legal cases, and local and national efforts that have established important precedents. Focus on different enactments of resistance, struggle, resilience, self-determination, and educational justice and focus on how these precedents and enactments pertain to teaching, learning, and curriculum practices that reflect key tenets of educational justice for Chican@/Latin@ students.",
            "id": "CHICLA/CURRIC 321",
            "title": "CHICANO/LATINO EDUCATIONAL JUSTICE"
        }
    },
    {
        "data": {
            "description": "Advanced studies in theories and practices of drama in education.",
            "id": "CURRIC/THEATRE 562",
            "title": "DRAMA IN EDUCATION: ADVANCED STUDIES"
        }
    },
    {
        "data": {
            "description": "An analysis of differing orientations to evaluation and research. Emphasis on assumptions, attitudes, and expectations of what constitutes scientific knowledge and explanation; relationship of research orientation, methods of inquiry, theory, and practice.",
            "id": "CURRIC 714",
            "parent": "CURRIC",
            "title": "RESEARCH AND EVALUATION PARADIGMS IN CURRICULUM AND INSTRUCTION"
        }
    },
    {
        "data": {
            "description": "An exploration of current issues facing music education and an examination of future directions for the field. Identify and investigate individual topics.",
            "id": "CURRIC 947",
            "parent": "CURRIC",
            "title": "CURRENT ISSUES IN MUSIC EDUCATION"
        }
    },
    {
        "data": {
            "description": "An exploration of theories, issues, and histories within a specialized area of game design such as developing games for a particular genre, for social impact, or using novel technologies.",
            "id": "CURRIC 576",
            "parent": "CURRIC",
            "title": "TOPICS IN GAME DESIGN"
        }
    },
    {
        "data": {
            "description": "An extended and in-depth analysis of the key themes in science education introduced in the introductory methods course as well as an exploration of additional topics important to beginning science educators.",
            "id": "CURRIC 590",
            "parent": "CURRIC",
            "title": "ADVANCED PRACTICES IN THE TEACHING OF SCIENCE"
        }
    },
    {
        "data": {
            "description": "An introduction to Euclidean or non-Euclidean geometry.",
            "id": "MATH 461",
            "parent": "MATH",
            "title": "COLLEGE GEOMETRY I"
        }
    },
    {
        "data": {
            "description": "An introduction to language instruction policies and linguistic human rights. Examines teaching and learning in a multilingual society. Explores the various dimensions of the language used in the schools for instruction in different countries during the globalization process.",
            "id": "CURRIC 764",
            "parent": "CURRIC",
            "title": "GLOBALIZATION AND LINGUISTIC HUMAN RIGHTS IN EDUCATION"
        }
    },
    {
        "data": {
            "description": "An introduction to tools used to design and develop video games.",
            "id": "CURRIC 534",
            "parent": "CURRIC",
            "title": "TOOLS FOR GAME DESIGN"
        }
    },
    {
        "data": {
            "description": "Analysis of current programs and the identification of the mathematical content of K-12 education.",
            "id": "CURRIC 810",
            "parent": "CURRIC",
            "title": "GOALS, CONTENT AND PROGRAMS IN MATHEMATICS EDUCATION"
        }
    },
    {
        "data": {
            "description": "Analysis of current research and examination of current programs to identify how they reflect different theories of learning and instruction.",
            "id": "CURRIC 811",
            "parent": "CURRIC",
            "title": "THE INSTRUCTION OF MATHEMATICS"
        }
    },
    {
        "data": {
            "description": "Analysis of field experience through seminars, individual conferences, required reading and consultations with cooperating librarians and information specialists. Enrollment limited.",
            "id": "CURRIC/LIS 620",
            "title": "FIELD PROJECT IN LIBRARY AND INFORMATION AGENCIES"
        }
    },
    {
        "data": {
            "description": "Analysis of research and evaluation of programs as they operate within the school environment.",
            "id": "CURRIC 812",
            "parent": "CURRIC",
            "title": "CURRICULAR ISSUES IN MATHEMATICS EDUCATION"
        }
    },
    {
        "data": {
            "description": "Become familiar with aspects of forms and features of the English language and language use in and out of schools. Analysis of language learning and use across settings provides tools to enhance practice.",
            "id": "CURRIC 326",
            "parent": "CURRIC",
            "title": "LANGUAGE USE AND ACQUISITION IN EARLY CHILDHOOD"
        }
    },
    {
        "data": {
            "description": "Become familiar with faculty, procedures, policy, and the wide range of research in curriculum and instruction.",
            "id": "CURRIC 712",
            "parent": "CURRIC",
            "title": "INTRODUCTION TO CURRICULUM AND INSTRUCTION: RESEARCH AND RESOURCES"
        }
    },
    {
        "data": {
            "description": "Capstone for future middle and high school teachers, drawing connections between higher mathematics and school mathematics.",
            "id": "CURRIC/MATH 471",
            "title": "MATHEMATICS FOR SECONDARY SCHOOL TEACHERS"
        }
    },
    {
        "data": {
            "description": "Comparison of historical and current practices in special education; legal, philosophical, and programmatic changes leading to inclusive models of education; emphasis on concepts of collaboration, cooperative learning structures, and curricular and instructional adaptations to accommodate learners with disabilities in general education classrooms.",
            "id": "CURRIC/RP&SE 506",
            "title": "STRATEGIES FOR INCLUSIVE SCHOOLING"
        }
    },
    {
        "data": {
            "description": "Comparison of historical and current practices in special education; legal, philosophical, and programmatic changes leading to inclusive models of education; emphasis on concepts of universal design for learning, methods of differentiation, collaboration among educators, and responsive instructional strategies for learners with disabilities in general education classrooms.",
            "id": "CURRIC 507",
            "parent": "CURRIC",
            "title": "INCLUSIVE EDUCATION IN SECONDARY SCHOOLS"
        }
    },
    {
        "data": {
            "description": "Computer science educational pedagogy and general teaching practices. Practical experience gained through tutoring students. Knowledge of object-oriented programming required.",
            "id": "COMPSCI/CURRIC 502",
            "title": "THEORY AND PRACTICE IN COMPUTER SCIENCE EDUCATION"
        }
    },
    {
        "data": {
            "description": "Continuation of group instruction in beginning piano.",
            "id": "MUSPERF 102",
            "parent": "MUSPERF",
            "title": "BEGINNING CLASS PIANO"
        }
    },
    {
        "data": {
            "description": "Critical review of literature on digital media and learning; utilization of digital media inside and outside classrooms.",
            "id": "CURRIC 606",
            "parent": "CURRIC",
            "title": "CRITICAL PERSPECTIVES ON DIGITAL MEDIA IN EDUCATION"
        }
    },
    {
        "data": {
            "description": "Critical survey of issues and trends; their social, educational basis; implications for elementary schools; examination and analysis of major problems.",
            "id": "CURRIC/EDPOL 855",
            "title": "ISSUES IN ELEMENTARY EDUCATION"
        }
    },
    {
        "data": {
            "description": "Critically approaches a range of complexities entailed in teaching abroad. Power-knowledge relations in pedagogical acts of planning, implementation and reflection will be identified and analyzed. Several basic formats for lesson preparation will be introduced. A variety of teaching techniques for implementing lesson plans will be practiced with peers. Approaches for critically reflecting in verbal and written ways upon teaching/learning and power-knowledge relations integral to curriculum and instruction, student inclusion/exclusion, and cultural responsiveness will be surveyed.",
            "id": "CURRIC 418",
            "parent": "CURRIC",
            "title": "PREPARING TO TEACH ABROAD"
        }
    },
    {
        "data": {
            "description": "Critically examine the process of collaboration and its multiple forms among professionals in the creation of inclusive school communities. Explore various methods and tools for collaboration that promote effective team relationships, problem solving, and co-planning of differentiated curriculum and instruction. Activities and projects are problem-based and focus on generating solutions to programmatic, student-specific, or school-wide issues related to inclusive education. Acquire skills to engage in collaborative teamwork and act as change facilitators within a school system.",
            "id": "CURRIC 731",
            "parent": "CURRIC",
            "title": "COLLABORATIVE TEAMWORK FOR INCLUSIVE SCHOOL REFORM"
        }
    },
    {
        "data": {
            "description": "Critically examines efforts to introduce teaching and curriculum on globalization in elementary and secondary schooling, as well as in teacher education.",
            "id": "CURRIC 765",
            "parent": "CURRIC",
            "title": "GLOBALIZATION AND TEACHING: DIMENSIONS FOR CURRICULUM PLANNING"
        }
    },
    {
        "data": {
            "description": "Dedicated to Semiotics or the study sign action for Education purpose, described as any activity or process including the production of meaning and apprenticeship.",
            "id": "CURRIC 864",
            "parent": "CURRIC",
            "title": "SEMIOTICS FOR EDUCATION"
        }
    },
    {
        "data": {
            "description": "Designed for future teachers of world languages to build their philosophy of education and philosophy of teaching in conjunction with building practical knowledge about teaching and learning, professional standards, and issues facing schools. Provides opportunities to apply theories and standards through the practice of planning for language and child development through the creation of lesson plans, unit plans, and assessment creation. Pass oral proficiency exam, concurrent enrollment inCURRIC 243, and declared in French, German, or Spanish BSE",
            "id": "CURRIC 342",
            "parent": "CURRIC",
            "title": "TEACHING WORLD LANGUAGES (K-8)"
        }
    },
    {
        "data": {
            "description": "Designed to explore the regionally, societally and culturally embedded nature of schooling, impacts of globalization on schooling, the relationship of schooling to increasingly global societies, and how policy, curriculum  instruction, both domestically and internationally, are both shaped by and sometimes responsive to globalization.",
            "id": "CURRIC 292",
            "parent": "CURRIC",
            "title": "GLOBALIZING EDUCATION"
        }
    },
    {
        "data": {
            "description": "Designed to foster cultural awareness at the individual and institutional levels, and to promote equitable and anti-racist behaviors as well as social justice in educational practices.",
            "id": "CURRIC 537",
            "parent": "CURRIC",
            "title": "TEACHING DIVERSE LEARNERS"
        }
    },
    {
        "data": {
            "description": "Designed to help identify/develop and implement methodological appraoches and techniques for uspporting the language and literacy development of English learners that coordinate with current theories on language and learning.",
            "id": "CURRIC 674",
            "parent": "CURRIC",
            "title": "ADVANCED METHODS IN TEACHING ENGLISH AS A SECOND LANGUAGE"
        }
    },
    {
        "data": {
            "description": "Designed to inform students of basic principles of good classroom management within a social justice framework. Learn about motivating student learning through clear classroom management strategies, communicating with parents and families regarding student behavior, establishing positive teacher-student relationships, responding to challenging student behaviors, and responding to bullying.",
            "id": "CURRIC 729",
            "parent": "CURRIC",
            "title": "CLASSROOM MANAGEMENT FOR SECONDARY EDUCATORS"
        }
    },
    {
        "data": {
            "description": "Develop a review of literature and a research project related to Second Language acquisition.",
            "id": "CURRIC 964",
            "parent": "CURRIC",
            "title": "SEMINAR IN WORLD LANGUAGE EDUCATION"
        }
    },
    {
        "data": {
            "description": "Develop and complete a synthetic, research-based project. Projects are individualized to professional interests and draw from the knowledge gained from previous coursework and the experiences in practicum and student-teaching placements in area schools.",
            "id": "CURRIC 747",
            "parent": "CURRIC",
            "title": "MASTERS CAPSTONE IN TEACHER EDUCATION"
        }
    },
    {
        "data": {
            "description": "Develop lesson and unit plans, appropriate assessments, and understand what it means to teach social studies for democratic citizenship. Make connections between educational theory and the use of different pedagogical strategies, and be able to critically evaluate and discuss the assigned journal articles and book chapters.",
            "id": "CURRIC 359",
            "parent": "CURRIC",
            "title": "TEACHING OF HISTORY AND THE OTHER SOCIAL STUDIES"
        }
    },
    {
        "data": {
            "description": "Develop lesson plans, design an integrated curriculum unit, and employ active and collaborative learning strategies in general education classrooms.",
            "id": "CURRIC 374",
            "parent": "CURRIC",
            "title": "GENERAL EDUC PRACTICUM & INSTRUCTIONAL PLANNING FOR DIVERSE LEARNERS"
        }
    },
    {
        "data": {
            "description": "Development of critical perspectives, musical knowledge, and pedagogical skills needed to teach instrumental popular music. Focus on popular percussion instruments, their electronic counterparts, and emerging technologies for the performance and production of popular music.",
            "id": "CURRIC/MUSIC 421",
            "title": "TEACHING POPULAR INSTRUMENTAL MUSIC 2"
        }
    },
    {
        "data": {
            "description": "Development of critical perspectives, musical knowledge, and pedagogical skills needed to teach instrumental popular music. Focus on popular string instruments, their electronic counterparts, and emerging technologies for the performance and production of popular music.",
            "id": "CURRIC/MUSIC 420",
            "title": "TEACHING POPULAR INSTRUMENTAL MUSIC 1"
        }
    },
    {
        "data": {
            "description": "Dimensions of theory and their interrelationships with reference to the curriculum field.",
            "id": "CURRIC 830",
            "parent": "CURRIC",
            "title": "THEORY AND DESIGN OF THE CURRICULUM"
        }
    },
    {
        "data": {
            "description": "Education is often considered only to take place in formal schooling environments with professionally-trained teachers and students sitting in classrooms. However, research shows - and our intuitions suggest - that education occurs every day in a variety of ways, with a variety of people, and in a variety of spaces. For example, education - or more specifically, teaching and learning - happens in spaces such as museums and libraries but also, perhaps, at sports practice and around the family dinner table. Truly understanding what it means to teach and learn involves delving into and unpacking this variety. Further, if creating change in whether and how different people have opportunities to teach and learn in our society requires exposing and exploiting this variety.",
            "id": "CURRIC 331",
            "parent": "CURRIC",
            "title": "TAKING EDUCATION OUTSIDE OF SCHOOL"
        }
    },
    {
        "data": {
            "description": "Education is often portrayed as a critical part of the solution to the intertwined problems of environment and society. Examines environmental education and related traditions such as nature study, conservation education, and outdoor education, as well as more recent movements such as place-based education and education for sustainability. Grounds discussions in concrete examples of educational practice, considers historical and contemporary critiques of environmental education.",
            "id": "CURRIC/ENVIRST 932",
            "title": "FOUNDATIONS OF ENVIRONMENTAL AND SUSTAINABILITY EDUCATION"
        }
    },
    {
        "data": {
            "description": "Engages in consideration of and deep dialog around cutting-edge theoretical approaches and framings to languages, literacies, mobility, communication, learning and teaching globally, and to show what different perspectives may offer to understandings of language-in-use across varied global educational and life contexts.",
            "id": "CURRIC 943",
            "parent": "CURRIC",
            "title": "MOBILITY, LANGUAGE & EDUCATION"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "Examination of issues related to preservice teacher education and teacher education reform.",
            "id": "CURRIC 950",
            "parent": "CURRIC",
            "title": "SEMINAR IN THE STUDY OF TEACHER EDUCATION"
        }
    },
    {
        "data": {
            "description": "Examination of substantive and stylistic elements of writing in the field of education research. Development of individual skills within and mastery through analysis, practice, and peer editing.",
            "id": "CURRIC 912",
            "parent": "CURRIC",
            "title": "WRITING IN EDUCATIONAL RESEARCH"
        }
    },
    {
        "data": {
            "description": "Examination of the key ideas from the field of science and technology studies (history, philosophy, sociology of science, etc.) and how they have been taken up in both the school science curriculum as well as the science education research community.",
            "id": "CURRIC/STS 734",
            "title": "SCIENCE STUDIES AND SCIENCE EDUCATION"
        }
    },
    {
        "data": {
            "description": "Examine pedagogical and curricular issues related to the teaching of English Language Arts in secondary grades. Analyze and construct texts that address multiple aspects related to the teaching of English as reading the word and the world, while attending to notions of equity, cultural funds of knowledge, and strengths-based pedagogies. Use theory and practice to explore effective pedagogical strategies in the teaching of reading, writing, speaking, listening, and thinking using critical lenses",
            "id": "CURRIC 396",
            "parent": "CURRIC",
            "title": "TEACHING OF ENGLISH"
        }
    },
    {
        "data": {
            "description": "Examines current research on reading, writing and varieties of oral language from perspective of sociocognitive and sociocultural literacy studies. Explore various theories of school, community, and workplace literacy, different approaches to literacy pedagogy and curricula, assessment practices, and interventions for learners with various needs.",
            "id": "CURRIC 604",
            "parent": "CURRIC",
            "title": "SEMINAR ON LITERACY"
        }
    },
    {
        "data": {
            "description": "Examines issues related to identity through three interrelated concepts--teaching, literacies, and diversity--from a variety of perspectives, including psychology, sociology, narrative studies, and sociocultural perspectives. Explore what \"identity\" means and how each conceptualization is related to teaching and learning, especially for children from diverse communities and backgrounds.",
            "id": "CURRIC 778",
            "parent": "CURRIC",
            "title": "TEACHING, LITERACIES, AND IDENTITIES"
        }
    },
    {
        "data": {
            "description": "Examines key arguments in literacy studies to help future teachers make intentional and informed decisions about teaching literacy.",
            "id": "CURRIC 535",
            "parent": "CURRIC",
            "title": "FOUNDATIONS OF LITERACY"
        }
    },
    {
        "data": {
            "description": "Examines recent trends in the field of social studies. Develop social studies curricula and instructional strategies that help prepare children for active citizenship in a democratic, multicultural, technological society.",
            "id": "CURRIC 371",
            "parent": "CURRIC",
            "title": "TEACHING SOCIAL STUDIES"
        }
    },
    {
        "data": {
            "description": "Examines the influence of science in everyday life. Provides both academic context (research and theory) and a firsthand look at how science matters to people who are not themselves scientists.",
            "id": "CURRIC/STS 733",
            "title": "PUBLIC ENGAGEMENT WITH SCIENCE"
        }
    },
    {
        "data": {
            "description": "Examines the literature and debates that have arisen in the past three decades on what has come to be called the sociology of school knowledge and related areas. Devoted entirely to the topic of the relationship among policies, curriculum, teaching, and social relations of schools and differential power.",
            "id": "CURRIC 910",
            "parent": "CURRIC",
            "title": "SEMINAR-CURRICULUM DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Examines the psycholinguistics of reading; reading in social and cultural contexts in schools, families, communities, and workplaces; and the politics of reading. Provides strategies for teaching all children to read.",
            "id": "CURRIC 368",
            "parent": "CURRIC",
            "title": "THE TEACHING OF READING"
        }
    },
    {
        "data": {
            "description": "Examines the theoretical, methodological, and ethical issues in studying children from interpretive perspectives. A small group research project, focused on examination of an individual child and context, provides an introduction to qualitative methods within fieldwork.",
            "id": "CURRIC 726",
            "parent": "CURRIC",
            "title": "QUALITATIVE METHODS OF STUDYING CHILDREN AND CONTEXTS"
        }
    },
    {
        "data": {
            "description": "Examines theoretical, pedagogical, and sociopolitical foundations for the teaching and learning of languages in U.S. schools.",
            "id": "CURRIC 435",
            "parent": "CURRIC",
            "title": "FOUNDATIONS OF WORLD LANGUAGE EDUCATION"
        }
    },
    {
        "data": {
            "description": "Examines theories and practices related to the role of religion in public schooling and its accompanying tensions: political and philosophical, practical and personal.",
            "id": "CURRIC/EDPOL/RELIGST 516",
            "title": "RELIGION AND PUBLIC EDUCATION"
        }
    },
    {
        "data": {
            "description": "Exploration of literature and recent debates related to cultural and linguistic diversity, learning, and instruction. Focuses on education within and across home, community, and school contexts, including a focus on home-school-community relationships.",
            "id": "CURRIC 711",
            "parent": "CURRIC",
            "title": "CULTURE, CURRICULUM, AND LEARNING"
        }
    },
    {
        "data": {
            "description": "Explore new frontiers in curriculum and instruction.",
            "id": "CURRIC 375",
            "parent": "CURRIC",
            "title": "PROSEMINAR"
        }
    },
    {
        "data": {
            "description": "Explore research and practice on topics such as social studies instruction for diverse pupils, critical thinking, and authentic assessment.",
            "id": "CURRIC 559",
            "parent": "CURRIC",
            "title": "ADVANCED PRACTICES IN THE TEACHING OF SOCIAL STUDIES"
        }
    },
    {
        "data": {
            "description": "Explore teaching methods for secondary science education based on extensive research.",
            "id": "CURRIC 390",
            "parent": "CURRIC",
            "title": "TEACHING OF SCIENCE IN SECONDARY SCHOOLS"
        }
    },
    {
        "data": {
            "description": "Explore the expressive, social, and cultural impact of games as a medium through focused creation of a single capstone project. Develop an analog or digital game depending on  interest and skill set. Designed to build skills in designing interactive games using an iterative approach that incorporates user testing and feedback. Focuses on design practices common to all games which can be applied by a game designer working in any medium, including sports, board games, computer games, and videogames. Opportunities to explore a wide variety of independent games as well as the platforms used to create them.",
            "id": "CURRIC 432",
            "parent": "CURRIC",
            "title": "GAME DESIGN II"
        }
    },
    {
        "data": {
            "description": "Explore theories of first and second language acquisition (SLA) and factors that impact language, literacy, and academic learning and development for emergent bilinguals (or English Learners). Develop an understanding of theories of language learning and development to build a theoretical foundation that will provide the basis for work with bi/multilingual learners. Analyze the language learning and language use of an emergent bilingual across multiple contexts at a practicum site. Consider the implications of theories for language learning and development for instructional design while learning research tools to enhance teaching practice.",
            "id": "CURRIC 311",
            "parent": "CURRIC",
            "title": "LANGUAGE ACQUISITION FOR MULTILINGUAL LEARNERS"
        }
    },
    {
        "data": {
            "description": "Explores central issues of theory and practice in the teaching of English in middle and secondary skills using an inquiry framework in which beginning and experienced teachers act as researchers.",
            "id": "CURRIC 596",
            "parent": "CURRIC",
            "title": "ADVANCED PRACTICES IN TEACHING ENGLISH IN SECONDARY SCHOOLS"
        }
    },
    {
        "data": {
            "description": "Explores current research on videogames and learning.  Critically reflect on the intellectual and educational merits and drawbacks of videogames and how videogame culture shapes how individuals think and learn.",
            "id": "CURRIC 277",
            "parent": "CURRIC",
            "title": "VIDEOGAMES & LEARNING"
        }
    },
    {
        "data": {
            "description": "Explores interdisciplinary theories on coloniality used in education research, with a focus on historicizing and interrogating hierarchies of language, race, and scientific reason. Examines distinct analytics of power offered by raciolinguistic perspectives, postcolonial science studies, and postfoundational curriculum studies.",
            "id": "CURRIC 823",
            "parent": "CURRIC",
            "title": "COLONIALITY OF LANGUAGE AND SCIENCE IN EDUCATION"
        }
    },
    {
        "data": {
            "description": "Explores the contestation of ongoing histories of injustice, exclusion, and raciolinguistic hierarchies across science, mathematics, and environmental education. Scholarship from Chicane/Latine Studies, raciolinguistic perspectives, and post/de/anticolonial studies will be examined to critically analyze these school subjects and related hierarchies of knowing, languaging, and being. Applies transdisciplinary perspectives to consider how students, educators, and community activists have challenged those hierarchies and worked to repurpose science, mathematics, and environmental pedagogies toward aims of linguistic, racial, educational, and environmental justice.",
            "id": "CHICLA/CURRIC 354",
            "title": "RACE AND LANGUAGE IN STEM AND ENVIRONMENTAL EDUCATION"
        }
    },
    {
        "data": {
            "description": "Explores the fundamentals of game design. Develop fundamental skills in designing interactive systems (much as art students develop fundamental skills through courses in figure drawing or color theory). Applicable to careers in educational game design or in design fields in related settings, such as museums, theme parks, and technology-mediated classrooms.",
            "id": "CURRIC 357",
            "parent": "CURRIC",
            "title": "GAME DESIGN I"
        }
    },
    {
        "data": {
            "description": "Explores the ways in which Holocaust history, memory and education are mutually entangled, politically charged and morally complex. Using primarily American sites of memory, critically analyze a variety of representations of the Shoah--in literature, films, memoirs, monuments, museums and classrooms.",
            "id": "CURRIC/EDPOL/HISTORY/JEWISH 515",
            "title": "HOLOCAUST: HISTORY, MEMORY AND EDUCATION"
        }
    },
    {
        "data": {
            "description": "Explores theoretical and practical aspects of second language and literacy development in schooling for English learners.  Includes a fieldwork component.  Informed by theories, students conduct and analyze data from classroom-based research, investigating implications for learning and teaching.",
            "id": "CURRIC 673",
            "parent": "CURRIC",
            "title": "LEARNING SECOND LANGUAGE AND LITERACIES"
        }
    },
    {
        "data": {
            "description": "Explores theoretical, empirical and methodological perspectives that inform early childhood policy and practice in the U.S. Examine the programs, policies, persons, institutions, and practices serving chidren ages birth to age eight, with particular attendion on the period of age 3-6.",
            "id": "CURRIC 665",
            "parent": "CURRIC",
            "title": "EARLY CHILDHOOD EDUCATION POLICY & PRACTICE"
        }
    },
    {
        "data": {
            "description": "Explores theories of knowing and learning as they relate to digital media. Focused on digital media in all of its forms - from Wikipedia to YouTube mashups to mobile apps - and how these new ways of doing and making are related to learning.",
            "id": "CURRIC 209",
            "parent": "CURRIC",
            "title": "DIGITAL MEDIA AND LITERACY"
        }
    },
    {
        "data": {
            "description": "Field experiences that promote bilingualism-biculturalism and content area learning in K-12 schools; review of pedagogies and methodologies that support bi/multilingual pupils; application of effective pedagogies, methodologies, and instructional practices; taught in Spanish.",
            "id": "CURRIC 625",
            "parent": "CURRIC",
            "title": "BILINGUAL-BICULTURAL EDUCATION PRACTICUM"
        }
    },
    {
        "data": {
            "description": "First order differential equations, introduction to multivariable calculus and constrained optimization, infinite sequences and series, methods of approximation, and a brief introduction to probability. Models and applications from business and the social sciences.",
            "id": "MATH 213",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 2"
        }
    },
    {
        "data": {
            "description": "Focus on analysis of music education in primary and secondary schools via examination of historical, philosophical, and psychological sources. Explore ideas that have shaped the field in the past and investigate the influence of these ideas on current thinking and practice.",
            "id": "CURRIC/MUSIC 946",
            "title": "PAST PERSPECTIVES ON MUSIC EDUCATION"
        }
    },
    {
        "data": {
            "description": "Focus on data analysis and translation of finds and implications. Gain theoretical and practical knowledge and skills regarding coding and analysis techniques, use of qualitative analytic tools, strategies for sharing findings with audiences beyond research team.",
            "id": "COUNPSY/CURRIC/EDPOL/EDPSYCH/ELPA/RP&SE 789",
            "title": "QUALITATIVE RESEARCH METHODS IN EDUCATION: FIELD METHODS II"
        }
    },
    {
        "data": {
            "description": "Focuses on helping pre-service teachers understand what it means to teach social studies for democratic citizenship. Focuses on central debates within social studies education and considers how different national, historical, economic, and political contexts have shaped social studies curricula. Offers an opportunity to compare and contrast social studies education curricula and approaches in diverse national contexts.",
            "id": "CURRIC 835",
            "parent": "CURRIC",
            "title": "FOUNDATIONS OF SOCIAL STUDIES EDUCATION"
        }
    },
    {
        "data": {
            "description": "Focuses on the nature of knowing mathematics.",
            "id": "CURRIC 635",
            "parent": "CURRIC",
            "title": "EPISTEMOLOGY OF MATHEMATICS FOR TEACHERS"
        }
    },
    {
        "data": {
            "description": "Focuses on written and oral language development of children from infancy through early adolescence. Explores the cognitive, social, cultural, and political implications of literacy education.",
            "id": "CURRIC 369",
            "parent": "CURRIC",
            "title": "THE TEACHING OF LANGUAGE ARTS"
        }
    },
    {
        "data": {
            "description": "For the exploration of new frontiers.",
            "id": "CURRIC 975",
            "parent": "CURRIC",
            "title": "GENERAL SEMINAR"
        }
    },
    {
        "data": {
            "description": "For those who are or wish to be university supervisors or cooperating teachers in practicum or student teaching programs. Study and discussion of factors which enter into the supervision of prospective teachers.",
            "id": "CURRIC 860",
            "parent": "CURRIC",
            "title": "SUPERVISION IN TEACHER EDUCATION"
        }
    },
    {
        "data": {
            "description": "Formulate and reflect on the obligations and responsibilities of teaching in contexts different from the US. Capstone provides field experiences with virtual, community, and campus organizations relevant to planning curriculum, teaching, and cross-cultural comparison of educational contexts. Addresses colonization and power, assumptions of difference, and cross-cultural awareness in teaching and learning.",
            "id": "CURRIC 419",
            "parent": "CURRIC",
            "title": "PREPARING TO TEACH ABROAD CAPSTONE"
        }
    },
    {
        "data": {
            "description": "Fundamental elements of curriculum development, instruction, and assessment for teaching world languages in PK-12 contexts.",
            "id": "CURRIC 545",
            "parent": "CURRIC",
            "title": "TEACHING WORLD LANGUAGES I"
        }
    },
    {
        "data": {
            "description": "Gain the ability to think critically and creatively about the role of assessment in our education system, aiming to pave a pathway toward better assessments. Seeks to challenge standard methods in assessment design and development, as well as psychometric notions of what constitutes good assessment. Through the application of critical pedagogies and theories, create assessments that align with the modern understanding of how people learn, placing justice at the core of the commitment and design principles.",
            "id": "CURRIC 645",
            "parent": "CURRIC",
            "title": "FOUNDATIONS OF EDUCATIONAL ASSESSMENT"
        }
    },
    {
        "data": {
            "description": "Gives students an introduction to computer and analytical skills to use in their subsequent course work and professional development. Discusses several methods of using computers to solve problems, including elementary programming techniques, symbolic manipulation languages, and software packages. Techniques will be illustrated using sample problems drawn from elementary engineering. Emphasis is on introduction of algorithms with the use of specific tools to illustrate the methods.",
            "id": "COMPSCI 310",
            "parent": "COMPSCI",
            "title": "PROBLEM SOLVING USING COMPUTERS"
        }
    },
    {
        "data": {
            "description": "Group instruction in beginning piano.",
            "id": "MUSPERF 101",
            "parent": "MUSPERF",
            "title": "BEGINNING CLASS PIANO"
        }
    },
    {
        "data": {
            "description": "Group instruction in elementary piano.",
            "id": "MUSPERF 103",
            "parent": "MUSPERF",
            "title": "ELEMENTARY CLASS PIANO"
        }
    },
    {
        "data": {
            "description": "Group instruction in intermediate piano.",
            "id": "MUSPERF 104",
            "parent": "MUSPERF",
            "title": "INTERMEDIATE CLASS PIANO"
        }
    },
    {
        "data": {
            "description": "Historical foundations, basic theories, and contemporary patterns of instruction underlying educational programs for young children (3-9). Integrating and contrasting features of comprehensive curricula for the very young: play, communication, self concepts, health, arts, motor, literacy numeracy, science, and other areas of educational concern.",
            "id": "CURRIC 663",
            "parent": "CURRIC",
            "title": "LEARNING ENVIRONMENTS FOR INITIAL EDUCATION PROGRAMS"
        }
    },
    {
        "data": {
            "description": "Historiographical perspectives in theatre for young audiences; analysis of plays for young people, theoretical implications, assumptions, current developments.",
            "id": "CURRIC/THEATRE 426",
            "title": "HISTORY, THEORY, AND DRAMATIC CRITICISM IN THEATRE FOR YOUNG AUDIENCES"
        }
    },
    {
        "data": {
            "description": "How can education - for children and adults, in school and out - help to address crucial environmental and social sustainability challenges? What ideas and strategies have guided environmental and sustainability education over the years? What can individual people do to address environmental challenges, and what can only be accomplished by people working together? What does sustainability have to do with justice - and vice versa? Examine the principles behind behavior change and empowerment, community action and whole-scale social reform. Drawing on research and theory from across the social sciences, we will explore the uncertain relationship between education and advocacy, seeking the means by which education can have the greatest impact without compromising the core ideals of a democratic society.",
            "id": "C&ESOC/CURRIC/ENVIRST 405",
            "title": "EDUCATION FOR SUSTAINABLE COMMUNITIES"
        }
    },
    {
        "data": {
            "description": "Identify and develop methodological approaches and techniques that coordinate instructional practice with current theories on language and learning. Develop criteria for designing, implementing, and evaluating appropriate lessons and materials that integrate with classroom curricula and goals.",
            "id": "CURRIC 316",
            "parent": "CURRIC",
            "title": "ESL/BILINGUAL METHODS"
        }
    },
    {
        "data": {
            "description": "Identify, develop and implement methodological approaches and techniques for teaching English learners that coordinate instructional practice with current theories on language and learning.",
            "id": "CURRIC 327",
            "parent": "CURRIC",
            "title": "METHODS OF TEACHING YOUNG ENGLISH LEARNERS"
        }
    },
    {
        "data": {
            "description": "In recent years, there has been an increase in attention to what has come to be known as STEM education in education circles and in the public sphere. Although this focus on STEM may seem recent, it is part of a long history of interest in the STEM disciplines. Consider STEM education from a political perspective by examining its histories, philosophies, policies, and effects.",
            "id": "CURRIC 809",
            "parent": "CURRIC",
            "title": "POLITICS OF STEM EDUCATION"
        }
    },
    {
        "data": {
            "description": "In the past few decades, social thought and philosophy have provided alternative arguments and styles of reasoning in thinking about the history and sciences of  education.  Explores readings and the importance of this literature to education is in multiple layers; provides ways of thinking about difference outside of  theories of representation and identity; embodies ways of engaging the knowledge of  science and the political in schooling; provides alternative strategies for discourse analyses; problematizes the givenness of the subject of schooling as the object of  change; (re)vises notions of materialism and power in understanding the effects of  schooling; provides ways of thinking about knowledge and language as not merely an epiphenomena to structures; and historically explores the limits of theories of practice that are given as what is real and useful.",
            "id": "CURRIC 916",
            "parent": "CURRIC",
            "title": "SMR: SPECIAL TOPICS IN RESEARCH & EVALUATION IN CURRICULUM & INSTRUCTION"
        }
    },
    {
        "data": {
            "description": "Introduces basic concepts and principles of information organization and online searching. Gain knowledge of information organization and retrieval theories and methods and knowledge of large database structures and database searching techniques. Critically examine the impact of information organization practices on organizations and culture. Learn how to develop information organizing systems and to evaluate and improve search systems.",
            "id": "LIS 602",
            "parent": "LIS",
            "title": "INFORMATION: ORGANIZATION AND SEARCH"
        }
    },
    {
        "data": {
            "description": "Introduction for secondary educators to the role of digital media technologies in their classrooms. Covers major topics in digital media in teaching and design several instructional units that incorporate technology meaningfully into the classroom.",
            "id": "CURRIC 709",
            "parent": "CURRIC",
            "title": "DIGITAL MEDIA & TECHNOLOGY IN SCHOOLS"
        }
    },
    {
        "data": {
            "description": "Introduction to Data Science programming using Python.  No previous programming experience required.  Emphasis on analyzing real datasets in a variety of forms and visual communication.",
            "id": "COMPSCI 220",
            "parent": "COMPSCI",
            "title": "DATA SCIENCE PROGRAMMING I"
        }
    },
    {
        "data": {
            "description": "Introduction to Object-Oriented Programming using classes and objects to solve more complex problems. Introduces array-based and linked data structures: including lists, stacks, and queues. Programming assignments require writing and developing multi-class (file) programs using interfaces, generics, and exception handling to solve challenging real world problems. Topics reviewed include reading/writing data and objects from/to files and exception handling, and command line arguments. Topics introduced: object-oriented design; class vs. object; create and define interfaces and iterators; searching and sorting; abstract data types (List,Stack,Queue,PriorityQueue(Heap),Binary Search Tree); generic interfaces (parametric polymorphism); how to design and write test methods and classes; array based vs. linked node implementations; introduction to complexity analysis; recursion.",
            "id": "COMPSCI 300",
            "parent": "COMPSCI",
            "title": "PROGRAMMING II"
        }
    },
    {
        "data": {
            "description": "Introduction to a range of qualitative inquiry texts that examine the intersections of language, literacy, and culture. Examine ethnographies and case studies that ask questions about the literacy practices of children, youth, and adults in both schools and out-of-school contexts using critically conscious and humanizing research methodologies. Become knowledgeable about pivotal qualitative studies in language, literacy, and culture while developing a personal identity as a methodologist.",
            "id": "CURRIC 774",
            "parent": "CURRIC",
            "title": "LITERACY RESEARCH METHODS"
        }
    },
    {
        "data": {
            "description": "Introduction to a variety of approaches for teaching mathematics to students in inclusive schools",
            "id": "CURRIC/RP&SE 365",
            "title": "TEACHING MATHEMATICS IN INCLUSIVE SETTINGS"
        }
    },
    {
        "data": {
            "description": "Introduction to calculus of functions of several variables; calculus on parameterized curves, derivatives of functions of several variables, multiple integrals, vector calculus.",
            "id": "MATH 234",
            "parent": "MATH",
            "title": "CALCULUS--FUNCTIONS OF SEVERAL VARIABLES"
        }
    },
    {
        "data": {
            "description": "Introduction to current practices and issues in K-12 school systems as they relate specifically to educational inequality, the concept of \"educational debt,\" and the role of teachers and administrators in system change. Encourages future educators to think critically about these issues while preparing them to serve in culturally and socio-economically diverse schools.",
            "id": "CURRIC 276",
            "parent": "CURRIC",
            "title": "CONTEMPORARY ISSUES IN K-12 SCHOOLS"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Introduction to material on framing, generating, gathering, and analyzing stories that people tell.",
            "id": "CURRIC 718",
            "parent": "CURRIC",
            "title": "INTRODUCTION TO NARRATIVE INQUIRY"
        }
    },
    {
        "data": {
            "description": "Introduction to the teaching and learning of diverse vocal styles. Special emphasis on what makes each style distinct, as well as the acquisition practices associated with each style.",
            "id": "CURRIC/MUSIC 344",
            "title": "TEACHING VOCAL STYLES IN THE MUSIC CLASSROOM"
        }
    },
    {
        "data": {
            "description": "Introduction to the teaching of musical composition, arrangement, and orchestration. Special emphasis on how music technologies interact with conceptions of composition, arrangement, and orchestration; implications for music learning and teaching.",
            "id": "CURRIC/MUSIC 304",
            "title": "COMPOSITION, ARRANGEMENT, AND ORCHESTRATION FOR THE MUSIC TEACHER"
        }
    },
    {
        "data": {
            "description": "Introductory field methods experience in qualitative research. Learn to define good research questions, determine which methods of data collection and analysis are useful for addressing those questions, engage in these methods, reflect on their utility in education research.",
            "id": "COUNPSY/CURRIC/EDPOL/EDPSYCH/ELPA/RP&SE 788",
            "title": "QUALITATIVE RESEARCH METHODS IN EDUCATION: FIELD METHODS I"
        }
    },
    {
        "data": {
            "description": "Introductory survey of empirical foundations of research. Development of methods and tools of research.",
            "id": "CURRIC 715",
            "parent": "CURRIC",
            "title": "DESIGN OF RESEARCH IN CURRICULUM AND INSTRUCTION"
        }
    },
    {
        "data": {
            "description": "Investigate the mathematics in the elementary school curriculum, how critical mathematics concepts and skills are learned, and how those concepts can be taught.",
            "id": "CURRIC 370",
            "parent": "CURRIC",
            "title": "TEACHING MATHEMATICS"
        }
    },
    {
        "data": {
            "description": "Investigates aspects of social justice and equity as they relate to teaching, schooling, and education.",
            "id": "CURRIC 240",
            "parent": "CURRIC",
            "title": "CRITICAL ASPECTS OF TEACHING, SCHOOLING, AND EDUCATION"
        }
    },
    {
        "data": {
            "description": "Issues and practices in reading program development from first through twelfth grade. Emphasis on the various roles and responsibilities of instructional leaders in reading program development.",
            "id": "CURRIC 805",
            "parent": "CURRIC",
            "title": "GUIDING AND DIRECTING THE SCHOOL READING PROGRAM"
        }
    },
    {
        "data": {
            "description": "Learn how to mount a theatrical production. Through scenery, costumes, lighting, sound, and stage management explore the relationship between the technical components of the production process. Includes lectures as well as practical experience in University Theatre productions.",
            "id": "THEATRE 160",
            "parent": "THEATRE",
            "title": "TECHNICAL THEATRE FUNDAMENTALS"
        }
    },
    {
        "data": {
            "description": "Learn the process of incrementally developing small (200-500 lines) programs along with the fundamental Computer Science topics. These topics include: problem abstraction and decomposition, the edit-compile-run cycle, using variables of primitive and more complex data types, conditional and loop-based flow control, basic testing and debugging techniques, how to define and call functions (methods), and IO processing techniques. Also teaches and reinforces good programming practices including the use of a consistent style, and meaningful documentation. Intended for students who have no prior programming experience.",
            "id": "COMPSCI 200",
            "parent": "COMPSCI",
            "title": "PROGRAMMING I"
        }
    },
    {
        "data": {
            "description": "Logic components built with transistors, rudimentary Boolean algebra, basic combinational logic design, basic synchronous sequential logic design, basic computer organization and design, introductory machine- and assembly-language programming.",
            "id": "COMPSCI/ECE 252",
            "title": "INTRODUCTION TO COMPUTER ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Major movements in the field such as Herbartianism, scientific curriculum planning, rational decision making, group process, and structure of the disciplines. Analysis of major documents and leading figures.",
            "id": "CURRIC 829",
            "parent": "CURRIC",
            "title": "PROSEMINAR IN AMERICAN CURRICULUM THEORY: 1890-PRESENT"
        }
    },
    {
        "data": {
            "description": "Methods for all involved in teaching and learning, including foreign languages. Introduction to philosophy, methodology, and practice of the use of drama and performance techniques in any educational or recreational settings. Focus on creativity and embodied and contextual learning, based on current neurological, psychological, and sociological research. A practical class which includes demonstration and practice with children.",
            "id": "CURRIC/SLAVIC/THEATRE 362",
            "title": "DRAMA FOR TEACHING AND LEARNING"
        }
    },
    {
        "data": {
            "description": "Nature of teaching; fundamental issues which confront the teacher and bases for making decisions; overview of the program, field trips to educational sites.",
            "id": "CURRIC 364",
            "parent": "CURRIC",
            "title": "INTRODUCTION TO EDUCATION"
        }
    },
    {
        "data": {
            "description": "Observation and instruction of elementary and secondary pupils in a laboratory setting. Lecture and discussion of topics related to art instruction.",
            "id": "ARTED/CURRIC 493",
            "title": "PRACTICUM IN SECONDARY SCHOOL ART"
        }
    },
    {
        "data": {
            "description": "Observation and participation in K-12 music education settings.",
            "id": "CURRIC/MUSIC 337",
            "title": "PRACTICUM IN TEACHING MUSIC"
        }
    },
    {
        "data": {
            "description": "Observation and participation in a classroom setting. Reserve two mornings, two afternoons, or one full day.",
            "id": "CURRIC 363",
            "parent": "CURRIC",
            "title": "PRACTICUM IN EARLY CHILDHOOD EDUCATION IN KINDERGARTEN"
        }
    },
    {
        "data": {
            "description": "Observe, supervise small groups, develop lesson plans for instruction, and teach a series of lessons in the related subject matter of math, literacy, language acquisition and inclusive schooling.",
            "id": "CURRIC 367",
            "parent": "CURRIC",
            "title": "ELEMENTARY EDUCATION PRACTICUM II"
        }
    },
    {
        "data": {
            "description": "Observe, supervise small groups, develop lesson plans for instruction, and teach a series of lessons relating theories of learning with the subject matter of mathematics and art.",
            "id": "CURRIC 373",
            "parent": "CURRIC",
            "title": "ELEMENTARY TEACHING PRACTICUM III"
        }
    },
    {
        "data": {
            "description": "Observe, supervise small groups, develop lesson plans for instruction, teach and assess a series of lessons in the related subject matter of science, social studies, literacy, and language acquisition.",
            "id": "CURRIC 340",
            "parent": "CURRIC",
            "title": "ELEMENTARY EDUCATION PRACTICUM I"
        }
    },
    {
        "data": {
            "description": "Opportunity to gain an understanding about the design and instruction of teacher education courses.",
            "id": "CURRIC 991",
            "parent": "CURRIC",
            "title": "POST-SECONDARY TEACHING PRACTICUM"
        }
    },
    {
        "data": {
            "description": "Overview of issues that influence and determine the language and academic developmet of English language learners. Explore social, cultural and educational contexts and practices as they relate to the education of this population.",
            "id": "CURRIC 736",
            "parent": "CURRIC",
            "title": "EDUCATING LINGUISTICALLY AND CULTURALLY DIVERSE LEARNERS"
        }
    },
    {
        "data": {
            "description": "Pedagogy that explores the relationships between culture and learning as well as teacher ideology and beliefs systems. Examines critical pedagogy and pedagogies of resistance.",
            "id": "CURRIC 844",
            "parent": "CURRIC",
            "title": "CULTURALLY RELEVANT PEDAGOGY"
        }
    },
    {
        "data": {
            "description": "Planning and completing a doctoral dissertation.",
            "id": "CURRIC 990",
            "parent": "CURRIC",
            "title": "DISSERTATION RESEARCH"
        }
    },
    {
        "data": {
            "description": "Practice teaching in world languages education classes at the 6-12 school level in middle and high schools.",
            "id": "CURRIC 443",
            "parent": "CURRIC",
            "title": "STUDENT TEACHING IN WORLD LANGUAGES (6-12)"
        }
    },
    {
        "data": {
            "description": "Practice teaching in world languages education classes at the PK-8 school level in elementary and middle schools.",
            "id": "CURRIC 442",
            "parent": "CURRIC",
            "title": "STUDENT TEACHING IN WORLD LANGUAGES (PK-8)"
        }
    },
    {
        "data": {
            "description": "Prepares prospective educators to integrate the arts into their teaching practices.",
            "id": "CURRIC 328",
            "parent": "CURRIC",
            "title": "ARTS INTEGRATION FOR TEACHING AND LEARNING"
        }
    },
    {
        "data": {
            "description": "Prepares prospective teachers of children 8/9 to 12/13 to teach reading and writing across all content areas.",
            "id": "CURRIC 309",
            "parent": "CURRIC",
            "title": "READING AND WRITING ACROSS THE CONTENT AREAS"
        }
    },
    {
        "data": {
            "description": "Principles of music education, including philosophy, history, and current practices and curricular trends. Survey of music education in and out of schools as situated within diverse, pluralistic communities.",
            "id": "CURRIC/MUSIC 300",
            "title": "PRINCIPLES OF MUSIC EDUCATION"
        }
    },
    {
        "data": {
            "description": "Provides a broad overview of ways of formulating and investigating novel questions with tools from educational data mining and learning analytics including social network analysis, natural language processing, Markov modeling, Bayesian inference, and agent-based modeling.",
            "id": "CURRIC/EDPSYCH/LIS 803",
            "title": "COMPUTATIONAL RESEARCH METHODS"
        }
    },
    {
        "data": {
            "description": "Provides a more in-depth examination of the issues associated with mathematics curriculum and instruction in secondary schools. A special emphasis is on curriculum choices and assessment practices.",
            "id": "CURRIC 394",
            "parent": "CURRIC",
            "title": "THE TEACHING OF SECONDARY SCHOOL MATHEMATICS II"
        }
    },
    {
        "data": {
            "description": "Provides an introduction to issues associated with mathematics curriculum and instruction in secondary schools. Instructional strategies, classroom management, and assessment of learning are examined in the context of current and reformed curricula.",
            "id": "CURRIC 393",
            "parent": "CURRIC",
            "title": "THE TEACHING OF SECONDARY SCHOOL MATHEMATICS I"
        }
    },
    {
        "data": {
            "description": "Provides an introduction to major themes and topics in information studies as well as the language and literature of the field and related disciplines. This course is about information, information agencies, and being an information professional. We look at social, historical, ethical, legal and political issues surrounding information dissemination, use, control, and management.",
            "id": "LIS 601",
            "parent": "LIS",
            "title": "INFORMATION: PERSPECTIVES AND CONTEXTS"
        }
    },
    {
        "data": {
            "description": "Provides an opportunity to connect teaching and learning theory and research knowledge to community based settings. Explore how community education is organized and educational services are delivered. Interact with children and develop an identity as an educator. Develop the necessary knowledge and skills required to work with students and educational professionals in a supervised community-based educational setting.",
            "id": "CURRIC 510",
            "parent": "CURRIC",
            "title": "COMMUNITY-BASED PRACTICUM"
        }
    },
    {
        "data": {
            "description": "Provides an opportunity to connect teaching and learning theory and research knowledge to the practical setting of schools. Explore how schools are organized and educational services are delivered. Interact with students and develop an identity as an educator. Develop the necessary knowledge and skills required to work with students and educational professionals in a supervised school-based setting.",
            "id": "CURRIC 511",
            "parent": "CURRIC",
            "title": "SCHOOL-BASED PRACTICUM"
        }
    },
    {
        "data": {
            "description": "Provides an overview of qualitative inquiry, examining assumptions, standards, and methods for generating and communicating interpretations. Methodological and theoretical works illustrate case study, ethnography, narrative, and action research. Does not include a field method component.",
            "id": "COUNPSY/CURRIC/EDPOL/EDPSYCH/ELPA/RP&SE 719",
            "title": "INTRODUCTION TO QUALITATIVE RESEARCH"
        }
    },
    {
        "data": {
            "description": "Provides early childhood educators with information, strategies, and activities for instructing young children with literacy. Teachers explore the multiple sources of information that young readers must orchestrate as they learn to read.",
            "id": "CURRIC 315",
            "parent": "CURRIC",
            "title": "READING AND WRITING ACROSS THE CURRICULUM IN EARLY CHILDHOOD"
        }
    },
    {
        "data": {
            "description": "Provides in-depth examination of the issues associated with elements of teaching world languages in PK-12 contexts. Focuses on classroom community and procedures as well as advanced elements of instructional design and assessment.",
            "id": "CURRIC 546",
            "parent": "CURRIC",
            "title": "TEACHING WORLD LANGUAGES II"
        }
    },
    {
        "data": {
            "description": "Provides information and instructional strategies to support literacy learning. Addresses a wide range of literacy abilities including reading, writing, comprehending, and decoding. Focuses on the continuing developmental processes associated with becoming competent readers and writers.",
            "id": "CURRIC 318",
            "parent": "CURRIC",
            "title": "TEACHING READING AND WRITING"
        }
    },
    {
        "data": {
            "description": "Provides information and instructional strategies to support literacy learning. Addresses a wide range of literacy abilities including reading, writing, comprehending, and decoding. Focuses on the continuing developmental processes associated with becoming competent readers and writers.",
            "id": "CURRIC 346",
            "parent": "CURRIC",
            "title": "FOUNDATIONS OF LANGUAGE AND READING INSTRUCTION IN ELEMENTARY EDUCATION"
        }
    },
    {
        "data": {
            "description": "Provides instruction and support for individual research on personal practices in schools.",
            "id": "CURRIC 626",
            "parent": "CURRIC",
            "title": "ACTION RESEARCH IN SCHOOLS"
        }
    },
    {
        "data": {
            "description": "Pursues the following questions: Where does our scientific knowledge come from and how does science work to generate that knowledge? In what ways might science education meaningfully engage learners in science?",
            "id": "CURRIC 735",
            "parent": "CURRIC",
            "title": "EPISTEMIC PRACTICE AND SCIENCE TEACHING"
        }
    },
    {
        "data": {
            "description": "Recent developments in technologies and methods of teaching world languages; exploration and analysis of teaching practices; critical review of relevant literature and adaptation of materials; recent innovations in elementary and secondary world language teaching.",
            "id": "CURRIC 564",
            "parent": "CURRIC",
            "title": "ADVANCED PROBLEMS ON THE TEACHING OF WORLD LANGUAGES"
        }
    },
    {
        "data": {
            "description": "Role of literature in literacy development from pre-school to high school. Theories and practices in regard to interpretation, reader response, criticism, genres, multiculturalism, and literature for early literacy and in content learning.",
            "id": "CURRIC 632",
            "parent": "CURRIC",
            "title": "LITERATURE AND LITERACY"
        }
    },
    {
        "data": {
            "description": "Selected investigations; design of individual research activities.",
            "id": "CURRIC 942",
            "parent": "CURRIC",
            "title": "SEMINAR IN RESEARCH ON MATHEMATICS EDUCATION"
        }
    },
    {
        "data": {
            "description": "Series of advanced seminars on such topics as: diagnostic and remedial teaching; sociology of reading; developmental reading; linguistics in the teaching of reading; or others as designated.",
            "id": "CURRIC 976",
            "parent": "CURRIC",
            "title": "SEMINAR IN READING"
        }
    },
    {
        "data": {
            "description": "Social, political and epistemological assumptions underlying current efforts towards curriculum and instructional reform in elementary and secondary schools.",
            "id": "CURRIC 716",
            "parent": "CURRIC",
            "title": "REFORM AND CHANGE IN CURRICULUM AND INSTRUCTION"
        }
    },
    {
        "data": {
            "description": "Sociocultural theories posit that the fundamental mechanism for teaching and learning is social interaction. Examine the varying positions within this genraly body of theoretical liturature, compare and contrast how each position construes the fundamentally social nature of thinking and learning, and consider the methods entailed by each given theory.",
            "id": "CURRIC 702",
            "parent": "CURRIC",
            "title": "SOCIOCULTURAL THEORY"
        }
    },
    {
        "data": {
            "description": "Specific construction and theoretical implications for professional in-service and field student teaching assignments. Learning materials and school systems program needs for children.",
            "id": "CURRIC 630",
            "parent": "CURRIC",
            "title": "PROFESSIONAL DEVELOPMENT FOR SCHOOLS AND COMMUNITY EDUCATORS"
        }
    },
    {
        "data": {
            "description": "Starts with a simple proposition that 19th century modern school curriculum is concerned with making kinds of people: \"the citizen\", \"a worker\", \"civic minded\", \"life-long learner\", \"motivated\", \"with grit\", etc. Discussions explore \"the building (and disseminating) of knowledge\" in schools (curriculum) across nations, cultures, and within political and religious modes of thought, to understand how differences in the self and others are produced through schooling. Internationalizing education means understanding how curriculum, pedagogy, theories of learning, and notions of childhood from schooling generate \"ways of thinking\" about \"kinds of people\". Internationalizing the field of curriculum and instruction shows how difference is produced and categorized. Facilitates thinking about how regional and national representations of people go unexamined in school curriculums when studying \"others\".",
            "id": "CURRIC 727",
            "parent": "CURRIC",
            "title": "INTERNATIONALIZING EDUCATIONAL KNOWLEDGE"
        }
    },
    {
        "data": {
            "description": "Student teaching placement in elementary school setting.",
            "id": "CURRIC/KINES 478",
            "title": "ELEMENTARY SCHOOL PHYSICAL EDUCATION STUDENT TEACHING"
        }
    },
    {
        "data": {
            "description": "Student teaching placement in secondary school setting.",
            "id": "CURRIC/KINES 479",
            "title": "MIDDLE SCHOOL OR HIGH SCHOOL PHYSICAL EDUCATION STUDENT TEACHING"
        }
    },
    {
        "data": {
            "description": "Student teaching specific to Early childhood/English as a Second Language certification",
            "id": "CURRIC 468",
            "parent": "CURRIC",
            "title": "EARLY CHILDHOOD/ENGLISH AS A SECOND LANGUAGE STUDENT TEACHING"
        }
    },
    {
        "data": {
            "description": "Student-designed opportunity to explore a subject in depth.",
            "id": "CURRIC 799",
            "parent": "CURRIC",
            "title": "MASTER'S INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Student-designed opportunity to explore a subject in depth.",
            "id": "CURRIC 999",
            "parent": "CURRIC",
            "title": "DOCTORAL INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Studies of race-related issues in education often borrow from a narrow conceptual field that can limit how the researcher forms and investigates questions. It is important for education researchers to develop a solid conceptual understanding of race, racism, and racialization, and the analytical concepts that relate to these ideas determine appropriate questions and theories to apply to the analysis of educational phenomena. Bringing together concepts related to race, racism, and racialization via core conceptual literature from philosophy, sociology, and cultural studies supports the design of education research that attends to these issues.",
            "id": "CURRIC 775",
            "parent": "CURRIC",
            "title": "THEORIES OF RACE, RACISM, AND RACIALIZATION IN EDUCATION RESEARCH"
        }
    },
    {
        "data": {
            "description": "Study of applied linguistics in in relation to Spanish, English, and bilingualism; introduction to the basic structures of language (i.e., phonetics and phonology, morphology and semantics, syntax, pragmatics); application of educational linguistics to curriculum and instructional decision-making for K-12 bilingual learners; taught in Spanish. Demonstrate advanced-low Spanish language proficiency",
            "id": "CURRIC 671",
            "parent": "CURRIC",
            "title": "EDUCATIONAL LINGUISTICS FOR BILINGUAL TEACHERS"
        }
    },
    {
        "data": {
            "description": "Study of contemporary theoretical perspectives, constructs, models, and frameworks related to bilingualism and biliteracy development and relationship between home/first languages (i.e., Spanish) and second/additional languages (i.e., English); review of cultural backgrounds and experiences, transnational experiences and mobility, and social and linguistic identities; application of theory to curriculum and instructional decision-making for K-12 bilingual learners; taught in Spanish. Demonstrate advanced-low Spanish language proficiency",
            "id": "CURRIC 670",
            "parent": "CURRIC",
            "title": "THEORIES OF BILINGUALISM AND BILITERACY"
        }
    },
    {
        "data": {
            "description": "Study of pedagogies, frameworks, and methodologies appropriate for bilingual-bicultural education; review of contemporary scholarship about rigorous, responsive, and effective practices with K-12 bilingual learners; review of Spanish and English language standards and bilingual standards-based teaching and learning; taught in Spanish.",
            "id": "CURRIC 676",
            "parent": "CURRIC",
            "title": "BILINGUALISM AND BILITERACY IN SCHOOLS"
        }
    },
    {
        "data": {
            "description": "Subjects of current interest. Recent topics have included educational linguistics, language awareness, understanding language, foundations in teaching English or social studies.",
            "id": "CURRIC 675",
            "parent": "CURRIC",
            "title": "GENERAL SEMINAR"
        }
    },
    {
        "data": {
            "description": "Supervised field experience in working with school-wide reading programs.",
            "id": "CURRIC 840",
            "parent": "CURRIC",
            "title": "FIELD WORK IN SCHOOL READING PROGRAMS"
        }
    },
    {
        "data": {
            "description": "Supervised student teaching at the middle school. Employ and evaluate a variety of approaches to mathematics curriculum and instruction.",
            "id": "CURRIC 497",
            "parent": "CURRIC",
            "title": "STUDENT TEACHING IN MIDDLE SCHOOL MATHEMATICS"
        }
    },
    {
        "data": {
            "description": "Supervised student teaching at the middle school. Employ and evaluate a variety of approaches to science curriculum and instruction.",
            "id": "CURRIC 495",
            "parent": "CURRIC",
            "title": "STUDENT TEACHING IN SCIENCE IN THE MIDDLE SCHOOL"
        }
    },
    {
        "data": {
            "description": "Supervised student teaching experience in elementary education located in a 5th-9th grade classroom.",
            "id": "CURRIC 454",
            "parent": "CURRIC",
            "title": "STUDENT TEACHING IN THE MIDDLE SCHOOL"
        }
    },
    {
        "data": {
            "description": "Supervised student teaching in general and instrumental K-12 settings.",
            "id": "CURRIC/MUSIC 410",
            "title": "STUDENT TEACHING IN GENERAL AND INSTRUMENTAL MUSIC"
        }
    },
    {
        "data": {
            "description": "Supervised student teaching in general and vocal K-12 settings.",
            "id": "CURRIC/MUSIC 409",
            "title": "STUDENT TEACHING IN GENERAL AND VOCAL MUSIC"
        }
    },
    {
        "data": {
            "description": "Supervised student teaching in the high school. Employ and evaluate a variety of approaches to social studies curriculum and instruction.",
            "id": "CURRIC 459",
            "parent": "CURRIC",
            "title": "STUDENT TEACHING IN HISTORY AND SOCIAL STUDIES IN THE HIGH SCHOOL"
        }
    },
    {
        "data": {
            "description": "Supervised student teaching in the middle school. Employ and evaluate a variety of approaches to social studies curriculum and instruction.",
            "id": "CURRIC 458",
            "parent": "CURRIC",
            "title": "STUDENT TEACHING IN HISTORY AND SOCIAL STUDIES IN THE MIDDLE SCHOOL"
        }
    },
    {
        "data": {
            "description": "Supervised student teaching in the middle school. Employ and evaluate a variety of approches to English curriculum and instruction.",
            "id": "CURRIC 472",
            "parent": "CURRIC",
            "title": "STUDENT TEACHING OF ENGLISH IN THE MIDDLE SCHOOL"
        }
    },
    {
        "data": {
            "description": "Supervised student teaching semester of the elementary education program in a 4K-6th grade classroom.",
            "id": "CURRIC 464",
            "parent": "CURRIC",
            "title": "STUDENT TEACHING IN THE ELEMENTARY SCHOOL"
        }
    },
    {
        "data": {
            "description": "Survey and critical analysis of language and literacy development in and out of school, with a focus on the elementary school years.",
            "id": "CURRIC 500",
            "parent": "CURRIC",
            "title": "LITERACY AND LANGUAGE DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Survey and critical analysis of selected research and other literature in the major divisions of the field, with emphasis according to individual interest.",
            "id": "CURRIC 900",
            "parent": "CURRIC",
            "title": "ADVANCED SEMINAR IN DIGITAL MEDIA"
        }
    },
    {
        "data": {
            "description": "Survey and critical analysis of theories and practices for literacy development across the curriculum. Reading, writing, oral language, and technology as situated in the content areas. Focus on middle and high schools.",
            "id": "CURRIC 503",
            "parent": "CURRIC",
            "title": "LITERACY ACROSS THE CURRICULUM"
        }
    },
    {
        "data": {
            "description": "Survey of constructionist theory, research, and tools. Develop a deeper understanding of the history, theories, philosophies, tools, research, and technologies of constructionism and its children.",
            "id": "CURRIC/EDPSYCH 821",
            "title": "CONSTRUCTIONISM"
        }
    },
    {
        "data": {
            "description": "Surveys critical issues related to literacy for early childhood teachers including early literacy and language learning, insights into cultural differences related to literacy and language, and knowledge of the social dimensions of literacy.",
            "id": "CURRIC 314",
            "parent": "CURRIC",
            "title": "BECOMING LITERATE IN AND OUT OF SCHOOLS"
        }
    },
    {
        "data": {
            "description": "Surveys critical literacy issues for elementary teachers. Provides understandings related to literacy and language learning, insights into cultural differences related to literacy and language, and knowledge of the social dimensions of literacy. Addresses various theories that inform literacy teaching including deficit versus strength models of literacy learning, meaning-based models, systematic instruction, and sociocultural approaches.",
            "id": "CURRIC 317",
            "parent": "CURRIC",
            "title": "DIMENSIONS OF LITERACY"
        }
    },
    {
        "data": {
            "description": "Systematic observation and participation in world language classes (French, German, or Spanish) in the public school.",
            "id": "CURRIC 243",
            "parent": "CURRIC",
            "title": "PRACTICUM IN WORLD LANGUAGES (K-12)"
        }
    },
    {
        "data": {
            "description": "Techniques of integration, improper integrals, first order ordinary differential equations, sequences and series, Taylor series, vector geometry in two and three dimensions.",
            "id": "MATH 222",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 2"
        }
    },
    {
        "data": {
            "description": "The concept of curriculum in modern American education.",
            "id": "CURRIC 704",
            "parent": "CURRIC",
            "title": "CURRICULUM PLANNING"
        }
    },
    {
        "data": {
            "description": "The history, theories, philosophies, tools, research, and technologies of Computing Education, with a focus on K-12 Computer Science Education.",
            "id": "CURRIC 721",
            "parent": "CURRIC",
            "title": "RESEARCH IN COMPUTING EDUCATION"
        }
    },
    {
        "data": {
            "description": "The learning and teaching of music at the elementary and middle school levels.",
            "id": "CURRIC/MUSIC 301",
            "title": "MUSIC LEARNING AND TEACHING 1"
        }
    },
    {
        "data": {
            "description": "The learning and teaching of music at the high school level.",
            "id": "CURRIC/MUSIC 302",
            "title": "MUSIC LEARNING AND TEACHING 2"
        }
    },
    {
        "data": {
            "description": "Theories and methods for analyzing \"discourse\" or language in use. Covers formal and informal written text, formal and informal oral speech, and face-to-face and online social interaction, with particular focus on cultural and social institutions and norms (such as school) and learning through social interaction.",
            "id": "CURRIC 802",
            "parent": "CURRIC",
            "title": "DISCOURSE ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Theories and practices in regard to assessing and intervening in literacy development for a variety of different sorts of learners, including those facing various reading or writing difficulties.",
            "id": "CURRIC 504",
            "parent": "CURRIC",
            "title": "LITERACY ASSESSMENT AND INTERVENTION"
        }
    },
    {
        "data": {
            "description": "Theories, principles, and practical applications of instructional strategies and curriculum development for teaching a world language (Spanish, German, French, etc.) in secondary schools. Pass oral proficiency exam, concurrent enrollment inCURRIC 243, and declared in French, German, or Spanish BSE",
            "id": "CURRIC 343",
            "parent": "CURRIC",
            "title": "TEACHING WORLD LANGUAGES (6-12)"
        }
    },
    {
        "data": {
            "description": "Theory and practice of theatre in elementary and secondary educational settings. Devise, script, and present programs as actor-teachers and interact with audiences.",
            "id": "CURRIC/THEATRE 525",
            "title": "THEATRE IN EDUCATION"
        }
    },
    {
        "data": {
            "description": "Theory and principles of teaching and learning in family and consumer education.",
            "id": "CSCS/CURRIC 427",
            "title": "METHODS OF TEACHING FAMILY AND CONSUMER EDUCATION"
        }
    },
    {
        "data": {
            "description": "Theory and processes of program planning for formal and informal educational settings; relation of vocational education to secondary, adult, and continuing education programs.",
            "id": "CSCS/CURRIC 428",
            "title": "PROGRAM PLANNING IN FAMILY AND CONSUMER EDUCATION"
        }
    },
    {
        "data": {
            "description": "Theory, research and instructional practices supporting the teaching of reading, writing, speaking and listening skills in an integrated curriculum from kindergarten through grade twelve.",
            "id": "CURRIC 305",
            "parent": "CURRIC",
            "title": "INTEGRATING THE TEACHING OF READING WITH OTHER LANGUAGE ARTS"
        }
    },
    {
        "data": {
            "description": "Trends, basic principles, issues, evaluation, and curriculum planning for the group education of preschool children.",
            "id": "CURRIC 660",
            "parent": "CURRIC",
            "title": "FOUNDATIONS OF EARLY CHILDHOOD EDUCATION"
        }
    },
    {
        "data": {
            "description": "Vector spaces and linear transformations, differential calculus of scalar and vector fields, determinants, eigenvalues and eigenvectors, multiple integrals, line integrals, and surface integrals. Freshmen students are invited to enroll by the Department of Mathematics.",
            "id": "MATH 375",
            "parent": "MATH",
            "title": "TOPICS IN MULTI-VARIABLE CALCULUS AND LINEAR ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Video games can be powerful experiences that take us to new worlds, teach us about complex systems, and provoke a range of emotions. Games transform us while we play, and some of these changes can be hard to predict and understand. Games can disrupt our sense of self, reshape our pleasures and feelings, lead us to question deeply held values, and allow us to experience new forms of embodiment through an avatar. A growing body of research in game studies engages with this potential for expansive change by focusing on player experience from a variety of methodological perspectives, including phenomenological, feminist and queer theory, critical disability studies, learning sciences, ecocriticism, and media archeology.",
            "id": "COMARTS/CURRIC 914",
            "title": "HOW GAMES CHANGE US"
        }
    },
    {
        "data": {
            "description": "Weekly workshop to provide an opportunity to develop skills as critically reflective practitioners and make specific plans for the full-time teaching experience.",
            "id": "CURRIC 463",
            "parent": "CURRIC",
            "title": "SEMINAR IN ELEMENTARY EDUCATION"
        }
    },
    {
        "data": {
            "id": "COMPSCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CURRIC",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "LIS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MUSPERF",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "THEATRE",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "COMPSCI 200",
            "target": "COMPSCI 300"
        }
    },
    {
        "data": {
            "source": "COMPSCI 220",
            "target": "COMPSCI 300"
        }
    },
    {
        "data": {
            "source": "COMPSCI 300",
            "target": "COMPSCI/CURRIC 502"
        }
    },
    {
        "data": {
            "source": "COMPSCI 310",
            "target": "COMPSCI 300"
        }
    },
    {
        "data": {
            "source": "COMPSCI/ECE 252",
            "target": "COMPSCI 300"
        }
    },
    {
        "data": {
            "source": "COUNPSY/CURRIC/EDPOL/EDPSYCH/ELPA/RP&SE 719",
            "target": "COUNPSY/CURRIC/EDPOL/EDPSYCH/ELPA/RP&SE 788"
        }
    },
    {
        "data": {
            "source": "COUNPSY/CURRIC/EDPOL/EDPSYCH/ELPA/RP&SE 788",
            "target": "COUNPSY/CURRIC/EDPOL/EDPSYCH/ELPA/RP&SE 789"
        }
    },
    {
        "data": {
            "source": "CURRIC 314",
            "target": "CURRIC 315"
        }
    },
    {
        "data": {
            "source": "CURRIC 318",
            "target": "CURRIC 504"
        }
    },
    {
        "data": {
            "source": "CURRIC 318",
            "target": "CURRIC 604"
        }
    },
    {
        "data": {
            "source": "CURRIC 319",
            "target": "CURRIC 320"
        }
    },
    {
        "data": {
            "source": "CURRIC 320",
            "target": "CURRIC 370"
        }
    },
    {
        "data": {
            "source": "CURRIC 328",
            "target": "CURRIC 329"
        }
    },
    {
        "data": {
            "source": "CURRIC 340",
            "target": "CURRIC 367"
        }
    },
    {
        "data": {
            "source": "CURRIC 357",
            "target": "CURRIC 432"
        }
    },
    {
        "data": {
            "source": "CURRIC 359",
            "target": "CURRIC 559"
        }
    },
    {
        "data": {
            "source": "CURRIC 366",
            "target": "CURRIC 419"
        }
    },
    {
        "data": {
            "source": "CURRIC 367",
            "target": "CURRIC 454"
        }
    },
    {
        "data": {
            "source": "CURRIC 367",
            "target": "CURRIC 463"
        }
    },
    {
        "data": {
            "source": "CURRIC 367",
            "target": "CURRIC 464"
        }
    },
    {
        "data": {
            "source": "CURRIC 367",
            "target": "CURRIC 468"
        }
    },
    {
        "data": {
            "source": "CURRIC 390",
            "target": "CURRIC 495"
        }
    },
    {
        "data": {
            "source": "CURRIC 390",
            "target": "CURRIC 590"
        }
    },
    {
        "data": {
            "source": "CURRIC 393",
            "target": "CURRIC 394"
        }
    },
    {
        "data": {
            "source": "CURRIC 396",
            "target": "CURRIC 596"
        }
    },
    {
        "data": {
            "source": "CURRIC 418",
            "target": "CURRIC 419"
        }
    },
    {
        "data": {
            "source": "CURRIC 463",
            "target": "CURRIC 454"
        }
    },
    {
        "data": {
            "source": "CURRIC 463",
            "target": "CURRIC 464"
        }
    },
    {
        "data": {
            "source": "CURRIC 463",
            "target": "CURRIC 468"
        }
    },
    {
        "data": {
            "source": "CURRIC 464",
            "target": "CURRIC 463"
        }
    },
    {
        "data": {
            "source": "CURRIC 503",
            "target": "CURRIC 976"
        }
    },
    {
        "data": {
            "source": "CURRIC 545",
            "target": "CURRIC 546"
        }
    },
    {
        "data": {
            "source": "CURRIC 550",
            "target": "CURRIC 363"
        }
    },
    {
        "data": {
            "source": "CURRIC 676",
            "target": "CURRIC 625"
        }
    },
    {
        "data": {
            "source": "CURRIC 704",
            "target": "CURRIC 829"
        }
    },
    {
        "data": {
            "source": "CURRIC 810",
            "target": "CURRIC 811"
        }
    },
    {
        "data": {
            "source": "CURRIC 811",
            "target": "CURRIC 812"
        }
    },
    {
        "data": {
            "source": "CURRIC/MUSIC 300",
            "target": "CURRIC/MUSIC 301"
        }
    },
    {
        "data": {
            "source": "CURRIC/MUSIC 301",
            "target": "CURRIC/MUSIC 302"
        }
    },
    {
        "data": {
            "source": "CURRIC/MUSIC 301",
            "target": "CURRIC/MUSIC 337"
        }
    },
    {
        "data": {
            "source": "CURRIC/MUSIC 302",
            "target": "CURRIC/MUSIC 337"
        }
    },
    {
        "data": {
            "source": "CURRIC/MUSIC 337",
            "target": "CURRIC/MUSIC 301"
        }
    },
    {
        "data": {
            "source": "CURRIC/MUSIC 337",
            "target": "CURRIC/MUSIC 302"
        }
    },
    {
        "data": {
            "source": "CURRIC/SLAVIC/THEATRE 362",
            "target": "CURRIC/THEATRE 426"
        }
    },
    {
        "data": {
            "source": "CURRIC/SLAVIC/THEATRE 362",
            "target": "CURRIC/THEATRE 562"
        }
    },
    {
        "data": {
            "source": "LIS 601",
            "target": "CURRIC/LIS 620"
        }
    },
    {
        "data": {
            "source": "LIS 602",
            "target": "CURRIC/LIS 620"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 213"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 213",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 222"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "COMPSCI 310"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 234"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 461"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "MATH 461"
        }
    },
    {
        "data": {
            "source": "MATH 375",
            "target": "CURRIC/MATH 471"
        }
    },
    {
        "data": {
            "source": "MATH 375",
            "target": "MATH 461"
        }
    },
    {
        "data": {
            "source": "MATH 461",
            "target": "CURRIC/MATH 471"
        }
    },
    {
        "data": {
            "source": "MUSPERF 101",
            "target": "MUSPERF 102"
        }
    },
    {
        "data": {
            "source": "MUSPERF 102",
            "target": "MUSPERF 103"
        }
    },
    {
        "data": {
            "source": "MUSPERF 103",
            "target": "MUSPERF 104"
        }
    },
    {
        "data": {
            "source": "MUSPERF 104",
            "target": "CURRIC/MUSIC 304"
        }
    },
    {
        "data": {
            "source": "THEATRE 160",
            "target": "CURRIC/THEATRE 426"
        }
    }
]