[
    {
        "data": {
            "description": "Introduction to Javanese theatre performance in a Javanese epic tradition. Includes use of Javanese gamelan music as accompaniment for dance drama.",
            "id": "DANCE/FOLKLORE/THEATRE 421",
            "title": "JAVANESE PERFORMANCE REPERTORY"
        }
    },
    {
        "data": {
            "description": "The influence of traditional West African dance/music heritage in historical, artistic, social contexts in the development of new hybrid forms of music/dance created by cross-pollination of cultures of Africans, Europeans and indigenous peoples in the New World.",
            "id": "AFROAMER/DANCE/MUSIC 318",
            "title": "CULTURAL CROSS CURRENTS: WEST AFRICAN DANCE/MUSIC IN THE AMERICAS"
        }
    },
    {
        "data": {
            "description": "Examines dance historical work in the changing field of Dance Studies since the mid-1980s. Introduces significant perspectives on dance history and dance theory, and considers how these impact and relate to dance creation and pedagogy. Engage with new research in dance history, practice archival research methods, and form a teaching approach to dance history that is responsive to the current direction and needs of the field.",
            "id": "DANCE 665",
            "parent": "DANCE",
            "title": "DANCE HISTORY AND THEORY"
        }
    },
    {
        "data": {
            "description": "A laboratory in mind-body practice. Topics titles reflect the type of body practices or modalities covered. Each specific practice focuses on increased bodily awareness and function for the performing artist. Includes movement practices, readings, discussion, writing assignments, videos and performances/lectures.",
            "id": "DANCE 132",
            "parent": "DANCE",
            "title": "WORKSHOP IN BODY STUDIES AND PRACTICES"
        }
    },
    {
        "data": {
            "source": "DANCE 118",
            "target": "DANCE/THEATRE 218"
        }
    },
    {
        "data": {
            "id": "DANCE",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Study of choreography created by member of the faculty and guest artists, leading to public performance. Must be cast in the Faculty Concert or Guest Artist work, and concurrently enrolled in one of the following: DANCE  111, 112, 115, 118, 125, 126, 211, 212, 213, 218 225, 226, 231, 311, 312, 325, or 326. Open to first-year students.",
            "id": "DANCE 453",
            "parent": "DANCE",
            "title": "DANCE REPERTORY THEATRE"
        }
    },
    {
        "data": {
            "description": "Emphasizes the study and practice of the fundamental principles of Ballet technique and exploration of the body as a creative and expressive instrument. Movement based experiential learning.",
            "id": "DANCE 105",
            "parent": "DANCE",
            "title": "BALLET I"
        }
    },
    {
        "data": {
            "description": "Complete a minimum of 3 hours of teaching per week (or equivalent) working with individuals one on one or with group classes. Teach Pilates coursework Level I-V. Attend weekly seminars and mentor meetings.",
            "id": "DANCE 476",
            "parent": "DANCE",
            "title": "PILATES TEACHING II"
        }
    },
    {
        "data": {
            "description": "Focuses on the creation and performance of dance repertory, whether through the development of new choreographic works or the re-staging of existing pieces. Emphasizes live performance as a process to contribute to both the creative and performance aspects of the work. Collaboratively engage in critical discussions and provide expert feedback, reinforcing arguments around artistry, excellence, and the role of live performance in contemporary dance. Hands-on experience in contemporary performance skills and techniques related to dance repertory, emphasizing collaboration in the creation and practice of live dance. Requires concurrent enrollment inDANCE 311,312,325, or326and audition at first class meeting.",
            "id": "DANCE 552",
            "parent": "DANCE",
            "title": "ADVANCED DANCE REPERTORY AND PERFORMANCE II"
        }
    },
    {
        "data": {
            "description": "One semester supervised experience in psychiatric setting, i.e., special school, hospital, or community mental health center, and one semester of independent study.",
            "id": "DANCE 431",
            "parent": "DANCE",
            "title": "DANCE THERAPY PRACTICUM"
        }
    },
    {
        "data": {
            "description": "Reflect on the entirety of dance coursework, develop current work in performance and dance scholarship, and prepare for future engagement with the discipline outside the university.",
            "id": "DANCE 462",
            "parent": "DANCE",
            "title": "SENIOR SEMINAR"
        }
    },
    {
        "data": {
            "description": "Integration of body and mind is explored through various somatic practices.",
            "id": "DANCE 131",
            "parent": "DANCE",
            "title": "SOMATIC THEORY AND PRACTICES"
        }
    },
    {
        "data": {
            "source": "DANCE 235",
            "target": "DANCE 337"
        }
    },
    {
        "data": {
            "source": "DANCE 376",
            "target": "DANCE 476"
        }
    },
    {
        "data": {
            "description": "Level II Core continued expanding terminology, further developing barre work, center work, petit allegro, grand allegro; focus on form, kinesthetic principles and aesthetic values.",
            "id": "DANCE 226",
            "parent": "DANCE",
            "title": "BALLET TECHNIQUE II-B"
        }
    },
    {
        "data": {
            "source": "DANCE 274",
            "target": "DANCE 379"
        }
    },
    {
        "data": {
            "source": "DANCE 156",
            "target": "DANCE 374"
        }
    },
    {
        "data": {
            "description": "Focuses on artistic and scholarly senior dance projects such as choreography, performance, pedagogy, research studies, papers, and articles.",
            "id": "DANCE 463",
            "parent": "DANCE",
            "title": "SENIOR PROJECT"
        }
    },
    {
        "data": {
            "description": "Study of choreography created by member of the faculty and guest artists, leading to public performance. Must take a 100 level or higher dance technique or theory course concurrently. Must be cast in the Faculty Concert or Guest Artist work. Audition at first class meeting.",
            "id": "DANCE 451",
            "parent": "DANCE",
            "title": "DANCE REPERTORY THEATER"
        }
    },
    {
        "data": {
            "description": "Introduction to Modern Jazz Dance with emphasis on practical application, including center work, traveling, and memorized movement sequences.",
            "id": "DANCE 103",
            "parent": "DANCE",
            "title": "MODERN JAZZ DANCE"
        }
    },
    {
        "data": {
            "description": "Supervised practicums; teaching dance or movement integrated strategies from a trauma-informed, culturally responsive-sustaining lens. Practicums take place in public schools, private studios, community centers, or Lathrop Hall depending on interests and experiences.",
            "id": "DANCE 379",
            "parent": "DANCE",
            "title": "DANCE TEACHING PRACTICUM"
        }
    },
    {
        "data": {
            "description": "Introduction to community engagement through dance and movement. Focus on skills to work within service-oriented programs that engage communities in transformative, decolonizing, and humanizing dance practices. Investigate theory, practice, and empirical research to support ethnographic approaches with feminist and critical perspectives when working with dance in communities.",
            "id": "DANCE 373",
            "parent": "DANCE",
            "title": "INTRODUCTION TO DANCE AND COMMUNITY"
        }
    },
    {
        "data": {
            "description": "Continuation ofDANCE 135. Learn the intermediate to advanced level mat exercises, which continue to focus on core strength, breath and spinal flexibility while challenging upper body strength, range of motion in the hips and spine, spinal extension and inverted balance.",
            "id": "DANCE 235",
            "parent": "DANCE",
            "title": "PILATES MAT II"
        }
    },
    {
        "data": {
            "source": "DANCE 156",
            "target": "DANCE 255"
        }
    },
    {
        "data": {
            "description": "Movement lab integrating theory and techniques of dance therapy. Field work in community service projects.",
            "id": "DANCE 331",
            "parent": "DANCE",
            "title": "DYNAMICS OF DANCE THERAPY"
        }
    },
    {
        "data": {
            "description": "Use of improvisation to develop a personal movement vocabulary and explore compositional form.",
            "id": "DANCE 156",
            "parent": "DANCE",
            "title": "MOVEMENT AS MATERIAL THROUGH IMPROVISATION"
        }
    },
    {
        "data": {
            "description": "Explores the evolving practice of performance curation in the 21st century, emphasizing the  role of curators and artists in shaping contemporary performance art. Critical engagement with diverse curatorial  practices, considering both historical and emerging models influenced by the 2020 global lockdown, digital  platforms, and virtual spaces. Exploration of how performance reception, access, and curation have been reshaped since 2020, and investigation of new paradigms such as digital and technologically mediated sites for  performance through interdisciplinary discussions, presentations, and guest speakers.",
            "id": "DANCE 466",
            "parent": "DANCE",
            "title": "CURATING THE PRACTICE"
        }
    },
    {
        "data": {
            "source": "DANCE 274",
            "target": "DANCE 374"
        }
    },
    {
        "data": {
            "description": "Introduction to the world of contemporary dance, and covers topics in contemporary dance performance and professionalism.",
            "id": "DANCE 162",
            "parent": "DANCE",
            "title": "FIRST YEAR WORKSHOP"
        }
    },
    {
        "data": {
            "source": "DANCE 131",
            "target": "DANCE 330"
        }
    },
    {
        "data": {
            "description": "Level I Core continued expanding terminology, further developing barre work, center work, petit allegro, grand allegro; focus on form, kinesthetic principles and aesthetic values.",
            "id": "DANCE 126",
            "parent": "DANCE",
            "title": "BALLET TECHNIQUE I-B"
        }
    },
    {
        "data": {
            "description": "Examines performance texts from the 20th century to the present, and applies them through written analyses.",
            "id": "DANCE 200",
            "parent": "DANCE",
            "title": "WRITING THE MOVING BODY"
        }
    },
    {
        "data": {
            "description": "Explores the creative and expressive aspects of dance movement. Develops technical skills and creative ability through whole body work on flexibility, strength, alignment, endurance, movement and improvisation. Develops appreciation of dance as an art form.",
            "id": "DANCE 110",
            "parent": "DANCE",
            "title": "WORKSHOP IN DANCE ACTIVITY"
        }
    },
    {
        "data": {
            "description": "Guest artists present topics appropriate to their specializations.",
            "id": "DANCE 469",
            "parent": "DANCE",
            "title": "INTERDISCIPLINARY STUDIES IN THE ARTS"
        }
    },
    {
        "data": {
            "description": "Continuation ofDANCE 211. Further development of skills. Development of dance phrases and movement vocabulary for invention.",
            "id": "DANCE 212",
            "parent": "DANCE",
            "title": "CONTEMPORARY DANCE TECHNIQUE AND THEORY IV"
        }
    },
    {
        "data": {
            "description": "Provides methods and materials for appropriate dance instruction in the public and private sectors for an array of ages. Advocates for Dance Education in both public and private settings and emphasizes the value of Dance in enhancing the quality of life for all people.",
            "id": "DANCE 374",
            "parent": "DANCE",
            "title": "TEACHING DANCE"
        }
    },
    {
        "data": {
            "description": "Focuses on learning Level I  II (Lab I) exercises on the Pilates equipment, which includes the Reformer, Cadillac, Low Chair, and High Barrel.",
            "id": "DANCE 136",
            "parent": "DANCE",
            "title": "PILATES EQUIPMENT I"
        }
    },
    {
        "data": {
            "description": "Orientation to the scope of dance therapy as a profession. Historical framework, theoretical rationale, and present application of dance/movement therapy.",
            "id": "DANCE 231",
            "parent": "DANCE",
            "title": "INTRODUCTION TO DANCE/MOVEMENT THERAPY"
        }
    },
    {
        "data": {
            "description": "Technique, practice and performance of complex African and African-based dances in relation to polyrhythmic musical and percussive accompaniment. Study of historical and cultural contexts of these forms. Development of improvisational skills in dialogue with musicians.",
            "id": "DANCE/THEATRE 218",
            "title": "AFRICAN DANCE PERFORMANCE"
        }
    },
    {
        "data": {
            "description": "Cover the Pilates Level IV-V (Intermediate-Advanced) material on the equipment and continues work fromDANCE 237.",
            "id": "DANCE 337",
            "parent": "DANCE",
            "title": "PILATES STUDIO II"
        }
    },
    {
        "data": {
            "description": "",
            "id": "DANCE 399",
            "parent": "DANCE",
            "title": "INDEPENDENT PROJECT"
        }
    },
    {
        "data": {
            "source": "DANCE 136",
            "target": "DANCE 236"
        }
    },
    {
        "data": {
            "description": "Technique and practice of several basic African dance forms with study of their musical, historical and cultural contexts.",
            "id": "DANCE 118",
            "parent": "DANCE",
            "title": "AFRICAN DANCE"
        }
    },
    {
        "data": {
            "source": "DANCE 255",
            "target": "DANCE 455"
        }
    },
    {
        "data": {
            "source": "DANCE 101",
            "target": "DANCE 102"
        }
    },
    {
        "data": {
            "description": "Study of principles in dance curriculum planning, instruction, assessment, classroom management, and learner diversity through a trauma-informed and culturally responsive-sustaining lens.",
            "id": "DANCE 274",
            "parent": "DANCE",
            "title": "METHODS IN DANCE EDUCATION"
        }
    },
    {
        "data": {
            "description": "Introduction to design and production for the performing arts with emphasis on dance. Covers the use of lighting, sound and other scenographic elements in theory and with practical experience.",
            "id": "DANCE 140",
            "parent": "DANCE",
            "title": "DANCE PRODUCTION"
        }
    },
    {
        "data": {
            "source": "DANCE 237",
            "target": "DANCE 337"
        }
    },
    {
        "data": {
            "description": "Foundational structure engaging in various dance teaching experiences. Cultivate self-reflective, student-centered teaching skills through discussions, integrating an awareness of current issues and developments impacting the field with personal artistry. Investigage the expansion and evolution of dance pedagogy to explore and address the evolution of the field at local, regional, national, and global levels.",
            "id": "DANCE 776",
            "parent": "DANCE",
            "title": "DANCE CURRICULUM AND TEACHING PRACTICES"
        }
    },
    {
        "data": {
            "description": "Introduction to basic elements of modern, jazz and ballet dance forms; emphasis on dance in the physical education curriculum.",
            "id": "DANCE 205",
            "parent": "DANCE",
            "title": "DANCE"
        }
    },
    {
        "data": {
            "description": "Emphasizes private session teaching, applied anatomy and imagery, and overall Pilates pedagogy.",
            "id": "DANCE 376",
            "parent": "DANCE",
            "title": "PILATES TEACHING I"
        }
    },
    {
        "data": {
            "description": "Focuses on sharing ideas by creating dance and theatre through a collaborative process. Exposes a range of artistic disciplines with the focus of collaboratively developing a concert program projected through the lens of hip hop theatre. Engage in various art disciplines to develop interdisciplinary tools through a collaborative process that will strengthen and teach creative problem solving skills. By audition",
            "id": "DANCE 159",
            "parent": "DANCE",
            "title": "COLLABORATIVE ARTS WORKSHOP"
        }
    },
    {
        "data": {
            "description": "Technique and practice of classical Javanese dance in its musical, historical and cultural contexts.",
            "id": "DANCE/FOLKLORE/THEATRE 321",
            "title": "JAVANESE PERFORMANCE"
        }
    },
    {
        "data": {
            "description": "Emphasizes the study and practice of the Contemporary dance technique and exploration of the body as a creative and expressive instrument capable of gaining new understanding through the art of dance.",
            "id": "DANCE 107",
            "parent": "DANCE",
            "title": "CONTEMPORARY DANCE I"
        }
    },
    {
        "data": {
            "description": "Pilates is a physical conditioning program that creates balance, improves posture, decompresses joints and creates elongated, toned muscles. The exercises focus on core strength, breath, and a flexible spine. Incorporates Level I-III Mat exercises. Explore functional anatomy and imagery-based alignment.",
            "id": "DANCE 135",
            "parent": "DANCE",
            "title": "PILATES MAT I"
        }
    },
    {
        "data": {
            "description": "Exploration in different traditional or folk dance forms from around the world.",
            "id": "DANCE 116",
            "parent": "DANCE",
            "title": "WORKSHOP IN WORLD DANCE"
        }
    },
    {
        "data": {
            "source": "DANCE 140",
            "target": "DANCE 240"
        }
    },
    {
        "data": {
            "source": "DANCE 355",
            "target": "DANCE 455"
        }
    },
    {
        "data": {
            "source": "DANCE 231",
            "target": "DANCE 331"
        }
    },
    {
        "data": {
            "description": "Study of the elements of music and their relationship to movement, a history of contemporary music and modern dance and an introduction to digital audio applications for choreography.",
            "id": "DANCE 241",
            "parent": "DANCE",
            "title": "MUSIC FUNDAMENTALS FOR DANCERS"
        }
    },
    {
        "data": {
            "description": "Builds understanding and appreciation for the field of Dance. Delves into dance and its' many facets, integrating, theoretical, historical, and embodied learning through viewing, reading, reflecting, discussing and finally, creating. Develops students into an informed audience and encourages relevance to other disciplines.",
            "id": "DANCE 100",
            "parent": "DANCE",
            "title": "UNDERSTANDING DANCE"
        }
    },
    {
        "data": {
            "description": "Improves and expands social dance skills. Covers the fundamental skills in leaning and following, rhythm, and style of the Fox Trot, Jitterbug/Swing, Waltz, Cha-Cha, Tango, Rumba, Merengue, and Polka. Other social dances may be explored.",
            "id": "DANCE 102",
            "parent": "DANCE",
            "title": "SOCIAL DANCE II"
        }
    },
    {
        "data": {
            "description": "Provides technical and aesthetic knowledge of the use of video camera and editing techniques, the introduction to digital video, and the relationship of video to the performing and visual arts.",
            "id": "DANCE 345",
            "parent": "DANCE",
            "title": "SCREENDANCE PRODUCTION"
        }
    },
    {
        "data": {
            "description": "Level I Core course in technique. Study and practice of the fundamental principles of contemporary dance technique and theory. Exploration of the body as a creative and expressive instrument. Audition at first class meeting determines course eligibility and placement.",
            "id": "DANCE 112",
            "parent": "DANCE",
            "title": "CONTEMPORARY DANCE TECHNIQUE AND THEORY II"
        }
    },
    {
        "data": {
            "description": "Provides an understanding of functional anatomy in kinetic terms, exploring efficient musculoskeletal function as it relates to pedestrian movement and vigorous movement. Learn how to see and feel the difference between healthy movement and movement pathology.",
            "id": "DANCE 330",
            "parent": "DANCE",
            "title": "FUNCTIONAL ANATOMY FOR MOVEMENT PRACTICES"
        }
    },
    {
        "data": {
            "description": "Work together to create a repertory company which produces performances of short hip hop theater and other collaborative performance art works for public viewing. Experimental works are researched and developed. Involves the development of collaborative and small group pieces as well as artistic training with a focus on individual and multi-voice work, theater improvisation, dance/movement.",
            "id": "DANCE/THEATRE 259",
            "title": "COLLABORATIVE ARTS PERFORMANCE LAB: DEVISING COLLABORATIVE PERFORMANCE THROUGH HIP HOP ARTS"
        }
    },
    {
        "data": {
            "description": "Study of choreography created by member of the faculty and guest artists, leading to public performance. Must take a 100 level or higher dance technique or theory course concurrently. Must be cast in the Faculty Concert or Guest Artist work. Audition at first class meeting.",
            "id": "DANCE 452",
            "parent": "DANCE",
            "title": "DANCE REPERTORY THEATER"
        }
    },
    {
        "data": {
            "description": "Designed to provide an understanding of the practice of teaching and learning Pilates. Develops understanding of body mechanics as well as an appreciation of the variety of movement possibilities and compensatory patterns present in individual bodies. Consists of lecture, discussion, practice teaching and mentorship as students begin the process of teaching Pilates.",
            "id": "DANCE 375",
            "parent": "DANCE",
            "title": "PILATES TEACHING METHODS"
        }
    },
    {
        "data": {
            "source": "DANCE 374",
            "target": "DANCE 379"
        }
    },
    {
        "data": {
            "description": "Composition and performance of dances based on pre-classic and modern dance forms to include practical application of theater production, costuming, and stage design.",
            "id": "DANCE 355",
            "parent": "DANCE",
            "title": "DANCE COMPOSITION II"
        }
    },
    {
        "data": {
            "description": "Off-campus, in-the-field experience pursuing an intensive, self-directed study or project under faculty guidance and mentorship. Research directly leads to the development of a creative performance project. May be conducted in a local, national, or international community or professional settings as related to student's practice-as-research work. One-on-one high-value creative research activity, individual-level feedback, and model the behavior and norms of academia and professional life. Devise a research project while guided through the research and creative process.",
            "id": "DANCE 679",
            "parent": "DANCE",
            "title": "DANCE FIELD WORK"
        }
    },
    {
        "data": {
            "source": "DANCE 156",
            "target": "DANCE 274"
        }
    },
    {
        "data": {
            "description": "Surveys dance history from about 1500 through the 1900s. Through research, discussion, and viewing images and video, students will analyze and understand dance in relation to the fundamental changes to human experiences that arose in the modern era.",
            "id": "DANCE 265",
            "parent": "DANCE",
            "title": "DANCE HISTORY I: DANCE IN THE MODERN ERA"
        }
    },
    {
        "data": {
            "source": "DANCE 236",
            "target": "DANCE 237"
        }
    },
    {
        "data": {
            "description": "Emphasizes the study and practice of the fundamental principles of Ballet technique and exploration of the body as a creative and expressive instrument.",
            "id": "DANCE 106",
            "parent": "DANCE",
            "title": "BALLET II"
        }
    },
    {
        "data": {
            "description": "Provides hands-on experience working with the technical aspects of dance program performances.",
            "id": "DANCE 440",
            "parent": "DANCE",
            "title": "ADVANCED PRODUCTION LABORATORY"
        }
    },
    {
        "data": {
            "description": "Examines different research methodologies and approaches to researching dance. Topics range  from studio-based research to theoretical research and include: Practice as Research, Embodied Approaches to Research, Ethnographic Methodologies, Dramaturgy, Critical Theory, and Issues in Dance Studies.",
            "id": "DANCE 762",
            "parent": "DANCE",
            "title": "RESEARCH METHODS"
        }
    },
    {
        "data": {
            "description": "Provides hands-on experience working with the technical aspects of dance program performances.",
            "id": "DANCE 240",
            "parent": "DANCE",
            "title": "DANCE PRODUCTION LABORATORY"
        }
    },
    {
        "data": {
            "description": "Intermediate level continued: barrework, center work, petit and grand allegro, adagio, demi-pointe, and more complex combinations and skills. Focus on form, kinesthetic principles, and aesthetic values.",
            "id": "DANCE 326",
            "parent": "DANCE",
            "title": "BALLET TECHNIQUE III-B"
        }
    },
    {
        "data": {
            "description": "Continuation ofDANCE 111andDANCE 112. Exploration of dance dynamics and quality through improvisation and the practice of set dance sequences.",
            "id": "DANCE 211",
            "parent": "DANCE",
            "title": "CONTEMPORARY DANCE TECHNIQUE AND THEORY III"
        }
    },
    {
        "data": {
            "description": "Continuation ofDANCE 311.",
            "id": "DANCE 312",
            "parent": "DANCE",
            "title": "CONTEMPORARY DANCE TECHNIQUE AND THEORY VI"
        }
    },
    {
        "data": {
            "description": "Experience in teaching Pilates, which includes private, semi-private, and small group sessions.Gives student-teachers class structure formats, including an understanding of the instructor to student relationship, pacing of class sessions, and the physical detail with which Pilates is taught.",
            "id": "DANCE 237",
            "parent": "DANCE",
            "title": "PILATES STUDIO I"
        }
    },
    {
        "data": {
            "source": "DANCE 135",
            "target": "DANCE 375"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Intermediate: barrework, center work, petit and grand allegro, adagio, demi-pointe, and more complex combinations and skills. Focus on form, kinesthetic principles, and aesthetic values.",
            "id": "DANCE 325",
            "parent": "DANCE",
            "title": "BALLET TECHNIQUE III"
        }
    },
    {
        "data": {
            "description": "Surveys dance history from the 1960's to the present. Through research, video viewing, and discussions, grasp aesthetic ideas of modern dance; contextualize the major components of contemporary dance; and characterize trends and styles relative to underlying philosophies.",
            "id": "DANCE 365",
            "parent": "DANCE",
            "title": "DANCE HISTORY II: DIRECTIONS AND ISSUES OF CONTEMPORARY DANCE"
        }
    },
    {
        "data": {
            "description": "Level I Core course in technique. Study and practice of the fundamental principles of contemporary dance technique and theory. Exploration of the body as a creative and expressive instrument. Audition at first class meeting determines course eligibility and placement.",
            "id": "DANCE 111",
            "parent": "DANCE",
            "title": "CONTEMPORARY DANCE TECHNIQUE AND THEORY I"
        }
    },
    {
        "data": {
            "description": "Production of audio soundtracks to complement the work of artists. The relationship of sound and music to dance, video, film, computer art, and other interdisciplinary forms.",
            "id": "ART/DANCE 341",
            "title": "SOUND DESIGN FOR THE PERFORMING AND VISUAL ARTS"
        }
    },
    {
        "data": {
            "description": "Examine the construction of Greek national identity and cultural heritage through dance, embodied practices, and art creation practices by utilizing dance studies frameworks and ethnographic research tools. Experiential multi-sited research to be completed in Greece, conducted through dance workshops, performances, museum visits, attendance to regional dance festivals, and in conversation with local experts featured as guest lecturers, such as dance historians, folklorists, choreographers, teachers, and performers. Genres covered include folk dance, social dance, concert dance, and other somatic practices that foster a sense of belonging, community, and unity amongst practitioners. Must have sophomore standing and a valid passport that does not expire 6 months past the Greece travel dates.",
            "id": "DANCE 368",
            "parent": "DANCE",
            "title": "DANCING CULTURES IN GREECE"
        }
    },
    {
        "data": {
            "description": "Emphasizes the study and practice of the Contemporary dance technique and exploration of the body as a creative and expressive instrument capable of gaining new understanding through the art of dance.",
            "id": "DANCE 108",
            "parent": "DANCE",
            "title": "CONTEMPORARY DANCE II"
        }
    },
    {
        "data": {
            "description": "Provides an introduction to foundational movement technical knowledge necessary to perform Hip-Hop dance safely with form and skill. Introduces the theory, practice, aesthetics, and historical foundations of hip-hop dance. Hip-Hop dance is an artistic manifestation of Hip-Hop culture with dances and movement activities related to histories and philosophies as well as improvisatory states of expression. Engage with the history, theory and philosophy surrounding the dance vocabulary, which directly impacts the physical intelligence of the dancer. Explore the roots of funk and Hip-Hop dance in the social fabric of African, Caribbean, and Afro-Latin cultures while examining reinventions of ragtime, swing, and rock n' roll throughout the 20th and 21st centuries in America.",
            "id": "DANCE 115",
            "parent": "DANCE",
            "title": "HIP-HOP DANCE TECHNIQUE AND THEORY 1"
        }
    },
    {
        "data": {
            "source": "ART/DANCE 341",
            "target": "ART/DANCE 441"
        }
    },
    {
        "data": {
            "description": "",
            "id": "DANCE 699",
            "parent": "DANCE",
            "title": "INDEPENDENT PROJECT"
        }
    },
    {
        "data": {
            "description": "Techniques of exercises and movement forms derived from several Asian cultures as taught in the United States. Studied in the context of the construction and expression of ethnic and cultural identity.",
            "id": "ASIANAM/DANCE 121",
            "title": "ASIAN AMERICAN MOVEMENT"
        }
    },
    {
        "data": {
            "source": "DANCE 231",
            "target": "DANCE 232"
        }
    },
    {
        "data": {
            "description": "Introduction to basic movement concepts and skills involved in social dancing. Covers the fundamental skills in leading and following, rhythm, and style of the Waltz, Fox Trot, Jitterbug/Swing, Tango, and Cha-Cha. Many social dance forms require that participants work in pairs, which will switch throughout the semester. Other dances may be explored.",
            "id": "DANCE 101",
            "parent": "DANCE",
            "title": "SOCIAL DANCE I"
        }
    },
    {
        "data": {
            "description": "Level III. Contemporary dance technique and theory on the intermediate level. Emphasis on movement skills employing proper body alignment.",
            "id": "DANCE 311",
            "parent": "DANCE",
            "title": "CONTEMPORARY DANCE TECHNIQUE AND THEORY V"
        }
    },
    {
        "data": {
            "source": "DANCE 331",
            "target": "DANCE 431"
        }
    },
    {
        "data": {
            "description": "Gender theories and feminist theories focus on the body as the main site where gender distinctions are understood. As the body holds a central position in the art of dance and the academic discipline of dance studies, explores gender and feminist theories through the lens of dance. Drawing on a wide array of examples and dance genres ranging from across the globe (such as Ballroom, Bollywood, Folk Dance, Ballet and more) introduces the cultural specificity of gender norms and the ways that dance has the potential to challenge heteronormativity through performance.",
            "id": "DANCE 168",
            "parent": "DANCE",
            "title": "DANCING GENDER: EMBODIMENT, POLITICS AND FEMINIST THEORY"
        }
    },
    {
        "data": {
            "description": "Overview of the history and practice of interdisciplinary work by artists working alone or in collaboration with others. Explores work that relies on or has a contingent relationship to the technology of the era in which it was created. Covers the history of lnterarts and Technology from the early 1900's to the present with additional lectures focusing on relevant topics from earlier periods of history, e.g. Guttenburg's printing press, Da Vinci's flying machines, etc. Individual artists and movements will be profiled with a focus on the Futurists, Dada, and Surrealists in the early half of the century, dance and technology in general and the crossover of contemporary avant garde theater and performing artists such as Laurie Anderson and others whose work is dependent on high tech electronics.",
            "id": "DANCE 449",
            "parent": "DANCE",
            "title": "SURVEY OF INTERARTS AND TECHNOLOGY"
        }
    },
    {
        "data": {
            "description": "Advanced instruction in the production of sound tracks to complement the work of artists in dance, video, film, computer art and other interdisciplinary forms.",
            "id": "ART/DANCE 441",
            "title": "ADVANCED SOUND DESIGN"
        }
    },
    {
        "data": {
            "source": "DANCE 337",
            "target": "DANCE 476"
        }
    },
    {
        "data": {
            "description": "Principles of organization in group composition. Planning, composing and presenting of group dances.",
            "id": "DANCE 455",
            "parent": "DANCE",
            "title": "DANCE COMPOSITION III"
        }
    },
    {
        "data": {
            "description": "Study and practice of neuro-muscular relaxation, self-regulation, focus/concentration, stress/anxiety management, and body awareness. Exploration of the body as a creative tool to facilitate ease of movement and flexible approaches to stressors.",
            "id": "DANCE 133",
            "parent": "DANCE",
            "title": "RELAXATION TECHNIQUES FOR EMBODIMENT AND STRESS MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Examines the role of dance as a cultural form of expression within the political sphere. Draws on a variety of case studies ranging from popular dance TV shows, to European modern dance and from hip-hop to dancing at public protests and asks the question of what constitutes dance and what is its social and political function.",
            "id": "DANCE 268",
            "parent": "DANCE",
            "title": "POLITICAL AND CULTURAL PERSPECTIVES IN DANCE STUDIES"
        }
    },
    {
        "data": {
            "source": "DANCE 762",
            "target": "DANCE 990"
        }
    },
    {
        "data": {
            "description": "An examination of the qualitative variations in movement processes as they relate to human function and expression.",
            "id": "DANCE 157",
            "parent": "DANCE",
            "title": "INTRODUCTION TO MOVEMENT ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Introduction to basic skills and terminology; includes barrework, center work, petit allegro, grand allegro; focus on form, kinesthetic principles and aesthetic values.",
            "id": "DANCE 125",
            "parent": "DANCE",
            "title": "BALLET TECHNIQUE I"
        }
    },
    {
        "data": {
            "description": "",
            "id": "DANCE 560",
            "parent": "DANCE",
            "title": "CURRENT TOPICS IN DANCE: WORKSHOP"
        }
    },
    {
        "data": {
            "description": "Covers the Intermediate to Advanced exercises (Level IV and V) on all equipment. The V exercises challenge a body's uniform development, range of motion in all actions of the spine, hips and shoulders, and require significant control and balance. These exercises are great cross-training for athletes, dancers or Pilates enthusiasts who wish to feel the advanced movement potential of their own bodies. Achieving mastery over these exercises requires more practice and commitment than the Beginner-Intermediate exercises as the body is expected to move beyond its average range of strength and flexibility.",
            "id": "DANCE 236",
            "parent": "DANCE",
            "title": "PILATES EQUIPMENT II"
        }
    },
    {
        "data": {
            "description": "Focus on the history and practice of screendance in its myriad forms including, but not limited to, performance made for the camera, first person narrative, spoken word, fictional cinema, experimental documentary and other forms of mediated performance practice within the broadly defined context of dance. Interdisciplinary approach to making performative work for the screen.",
            "id": "DANCE 567",
            "parent": "DANCE",
            "title": "HISTORY OF SCREENDANCE"
        }
    },
    {
        "data": {
            "description": "Engages with dance arts for and in communities. Working in relation to core ideas about the value of dance/movement in community, covers interdisciplinary research, scholarship, and praxis within this diverse area of work. Investigates how dance and interrelated arts serve as vehicles for social and environmental change in diverse communities. Specific themes might include racial justice, environmental justice, indigenous survival struggles, and how these themes impact or galvanize communities. Theory and practice reaches beyond campus and connects to the H'Doubler legacy as well as the Wisconsin idea.",
            "id": "DANCE 675",
            "parent": "DANCE",
            "title": "DANCE AND COMMUNITY"
        }
    },
    {
        "data": {
            "description": "",
            "id": "DANCE 999",
            "parent": "DANCE",
            "title": "INDEPENDENT PROJECT"
        }
    },
    {
        "data": {
            "description": "Study and Practice of using movement, body awareness, creativity and discussion to experience and develop skills to teach others embodied practices for handling stress, anxiety, conflicts, etc. in a peaceful, healthy way. Learn how to use tools to set healthy boundaries and deal with conflicts in the classroom or your life. Receive a thorough introduction to the Disarming the Playground Curriculum, a school violence prevention program rooted in the principles of dance/movement therapy. Learn to adjust activities and experiences for different age groups and different populations.",
            "id": "DANCE 233",
            "parent": "DANCE",
            "title": "DISARMING THE PLAYGROUND: VIOLENCE PREVENTION THROUGH MOVEMENT"
        }
    },
    {
        "data": {
            "description": "Emphasis on basic skills; barrework, center work, petit and grand allegro, adagio, and increased use of demi-pointe. Focus on form, kinesthetic principles and aesthetic values.",
            "id": "DANCE 225",
            "parent": "DANCE",
            "title": "BALLET TECHNIQUE II"
        }
    },
    {
        "data": {
            "description": "Individual research projects following the approval stage of thesis proposal. Create research plans and schedules determined by the particulars of creative research, whether methodologies and approaches are studio-based or theory-based. Early through final stages of thesis projects are guided with faculty mentorship.",
            "id": "DANCE 990",
            "parent": "DANCE",
            "title": "CREATIVE PROJECT FOR RESEARCH"
        }
    },
    {
        "data": {
            "description": "Exploration of new movement techniques in dance outside of traditional forms and methods.",
            "id": "DANCE 213",
            "parent": "DANCE",
            "title": "NEW MOVEMENT TECHNIQUES"
        }
    },
    {
        "data": {
            "description": "An Afro Asian perspective provides a lens through which intersections between Asian American and African American dance and martial arts are studied and practiced. Asian American and African American movement genres provide tools to explore dance fusion, choreography, and improvisation, to create dances informed by African American and Asian American legacies of struggle, innovation and transformation, while cognizant of historical forces of oppression and racism. Building connections through respectful communication with others are learned through dance practice, discussion and writing about concepts learned through readings, videos, and guest artist visits. Engagement with dance as a cultural vehicle for creative problem-solving and risk-taking occurs through guided class or smaller group activities.",
            "id": "AFROAMER/ASIANAM/DANCE/FOLKLORE 319",
            "title": "AFRO ASIAN IMPROV: FROM HIP HOP TO MARTIAL ARTS FUSION"
        }
    },
    {
        "data": {
            "description": "A survey providing a framework for understanding and appreciating the significance of dance in and as human culture.",
            "id": "DANCE 165",
            "parent": "DANCE",
            "title": "INTRODUCTION TO THE HISTORIES OF DANCE"
        }
    },
    {
        "data": {
            "description": "Continued development of the field of dance/movement therapy with specific emphasis on DMT with specific populations and research in the field.  Fieldwork in community programs is required.",
            "id": "DANCE 232",
            "parent": "DANCE",
            "title": "INTRODUCTION TO DYNAMICS OF DANCE THERAPY"
        }
    },
    {
        "data": {
            "description": "Basic principles of solo composition explored and applied to movement in visual and performing arts.",
            "id": "DANCE 255",
            "parent": "DANCE",
            "title": "MOVEMENT COMPOSITION FOR THE PERFORMING AND VISUAL ARTS"
        }
    },
    {
        "data": {
            "source": "DANCE 135",
            "target": "DANCE 235"
        }
    },
    {
        "data": {
            "source": "DANCE 156",
            "target": "DANCE 355"
        }
    }
]