[
    {
        "data": {
            "description": "Develop clinical knowledge and skills necessary to care for patients in Pediatrics and Obstetrics and Gynecology, with emphasis on unique skills such as taking care of vulnerable populations as identified in women's and child health and working with caregivers in addition to the patient themselves. Increase knowledge of fundamental science concepts introduced in Human Family Tree during Phase 1 of the curriculum, such as embryology and teratology, genetic testing, and neurodevelopment. Clinical experiences will occur in a range of representative inpatient, outpatient and surgical settings. In structured educational sessions, compare and contrast selected topics in pediatric, obstetric, and gynecologic patient populations, highlighting the relevant physiology, pathophysiology, basic science, and public health topics.",
            "id": "MEDSC-M 810",
            "parent": "MEDSC-M",
            "title": "SPECIALIZED CARE OF OBSTETRIC, GYNECOLOGIC, AND PEDIATRIC PATIENTS (SCOPE)"
        }
    },
    {
        "data": {
            "description": "Independent research under the direct supervision of Dermatology faculty.  Each student's research project is individualized to meet student research goals within the context of faculty research needs.",
            "id": "DERM 910",
            "parent": "DERM",
            "title": "INDEPENDENT READING AND RESEARCH IN DERMATOLOGY"
        }
    },
    {
        "data": {
            "description": "Accelerated coverage of topics in general chemistry, including introduction to laboratory techniques. Topics include atomic and molecular structure, chemical equilibrium, acid-base chemistry, thermodynamics, kinetics, and electrochemistry.",
            "id": "CHEM 109",
            "parent": "CHEM",
            "title": "ADVANCED GENERAL CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Chemistry, nutrition, and metabolism of biological systems.",
            "id": "BIOCHEM 501",
            "parent": "BIOCHEM",
            "title": "INTRODUCTION TO BIOCHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Core organic chemistry concepts of structure, reactivity, and synthesis with regards to the functional groups commonly found in commercial and biological substances. Covers a selection of topics fromCHEM 343and345.",
            "id": "CHEM 341",
            "parent": "CHEM",
            "title": "ELEMENTARY ORGANIC CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Experience blends medical and procedural dermatology, dermatopathology and basic science topics. Advance patient care skills through exposure to a broad array of common and complex cutaneous diseases, formulation of basic differential diagnoses and treatment plans, and performance of common diagnostic procedures. Experience via rotations through general adult and pediatric dermatology clinics, as well as specialty clinics. Opportunities may arise for participation in inpatient dermatology consults. All clinical activities will be completed under the direct supervision of attending physicians and residents. Participate in additional educational activities, including faculty lectures, Grand Rounds conference, and reading or on-line assignments. Additional patient care related learning activities may be assigned by instructors (e.g., literature reviews, presentations on specific topics); these are dependent on the individual student, attending physician, and clinical site.",
            "id": "DERM 919",
            "parent": "DERM",
            "title": "INDIVIDUALIZED CLINICAL ELECTIVE IN DERMATOLOGY"
        }
    },
    {
        "data": {
            "description": "Experience blends medical and procedural dermatology, dermatopathology and basic science topics. Advance patient care skills through exposure to a broad array of common and complex cutaneous diseases, formulation of basic differential diagnoses and treatment plans, and performance of common diagnostic procedures. Experience via rotations through general adult and pediatric dermatology clinics, as well as specialty clinics. Opportunities may arise for participation in inpatient dermatology consults. All clinical activities will be completed under the direct supervision of attending physicians and residents. Participate in additional educational activities, including faculty lectures, Grand Rounds conference, and reading or on-line assignments. Additional patient care related learning activities may be assigned by instructors (e.g., literature reviews, presentations on specific topics); these are dependent on the individual student, attending physician, and clinical site.",
            "id": "DERM 953",
            "parent": "DERM",
            "title": "DERMATOLOGY ELECTIVE"
        }
    },
    {
        "data": {
            "description": "Explore the difficulties and opportunities available in improving public health in the specialized field of dermatology. Topics and readings have been developed with public health experts from around the country, and include discussions surrounding skin cancer screening and overdiagnosis, as well as dermatologic challenges in LGBTQ+, skin of color, rural, and inmate communities.",
            "id": "DERM 955",
            "parent": "DERM",
            "title": "PUBLIC HEALTH IN DERMATOLOGY SELECTIVE"
        }
    },
    {
        "data": {
            "description": "Focuses on molecular, genetic, embryologic, hormonal, anatomical and physiological factors that govern fertility, cell growth, fetal development, and pregnancy as well as the congenital anomalies that can occur when those processes are aberrant. Encompasses the full life-cycle spectrum including childhood growth and development, young adulthood/puberty, issues affecting adolescents and young adults, genetic basis of human disease, reproductive health, menopause, aging, unregulated cell growth (cancer) and end of life issues. Significant content from other competency domains, or \"longitudinal threads\", such as public health, advocacy, ethics, patient care/communication and clinical skills.",
            "id": "MEDSC-M 773",
            "parent": "MEDSC-M",
            "title": "HUMAN FAMILY TREE"
        }
    },
    {
        "data": {
            "description": "General biological principles. Topics include: evolution, ecology, animal behavior, cell structure and function, genetics and molecular genetics and the physiology of a variety of organ systems emphasizing function in humans.",
            "id": "BIOLOGY/ZOOLOGY 101",
            "title": "ANIMAL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Identify the roles of physicians, interdisciplinary providers, health care systems, and communities in screening, treating, and preventing common, chronic conditions. Activities are centered on health promotion, outpatient-based chronic disease management, and community health. Clinical experiences will occur in primary care, behavioral health, and other ambulatory and community-based settings that focus on chronic disease management.",
            "id": "MEDSC-M 811",
            "parent": "MEDSC-M",
            "title": "CHRONIC AND PREVENTIVE CARE"
        }
    },
    {
        "data": {
            "description": "Introduction to basic science principles of skin biology and skin diseases (biochemistry, molecular biology, genetics, etc.). Provides a strong base and training to future scientists, physicians, and industrial leaders in skin sciences and skin care, as well as drug and device development.",
            "id": "DERM 601",
            "parent": "DERM",
            "title": "SKIN BIOLOGY AND SKIN DISEASES"
        }
    },
    {
        "data": {
            "description": "Introduction to the basic principles and concepts of the biology of plants. an integrative approach stressing evolutionary sequences and the relationship between structure and function at succeeding levels of organization: molecule, cell, organism, population, community. Correlated lectures, laboratories, and discussions.",
            "id": "BIOLOGY/BOTANY 130",
            "title": "GENERAL BOTANY"
        }
    },
    {
        "data": {
            "description": "Offers an interactive platform to critically analyze classic and state-of-the-art research articles in skin biology and skin diseases, as well as the opportunity to present journal articles. Provides a strong base and training for future scientists, physicians, and industrial leaders in skin sciences, skincare, and drug development.",
            "id": "DERM 602",
            "parent": "DERM",
            "title": "ADVANCES IN SKIN BIOLOGY AND SKIN DISEASES"
        }
    },
    {
        "data": {
            "description": "Organized around physiological themes, the course includes material related to the cardiovascular system, hematology, nephrology, and pulmonology to present an integrated picture of how these systems function together to maintain homeostasis. In addition, there is significant content from other competency domains such as public health, ethics, evidence-based medicine, patient care/communication and clinical skills.",
            "id": "MEDSC-M 771",
            "parent": "MEDSC-M",
            "title": "BODY IN BALANCE"
        }
    },
    {
        "data": {
            "description": "Outpatient dermatology experience provides exposure to a typical private practice where patients present with a broad array of problems. Learn to diagnose, treat, and/or appropriately refer common dermatologic conditions and to be aware of cutaneous manifestations of serious and significant systemic disease.",
            "id": "DERM 954",
            "parent": "DERM",
            "title": "AMBULATORY DERMATOLOGY ELECTIVE"
        }
    },
    {
        "data": {
            "description": "Principles and application of chemical equilibrium, coordination chemistry, oxidation-reduction and electrochemistry, kinetics, nuclear chemistry, introduction to organic chemistry, and chemistry laboratory skills.",
            "id": "CHEM 104",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Principles of molecular structure and bonding applied to predict and explain the reactivity of alkanes, alkenes, alkynes, alkyl halides, alcohols, and thiols. Emphasis placed on rationalizing the stereochemical and regiochemical outcome of chemical processes.",
            "id": "CHEM 343",
            "parent": "CHEM",
            "title": "ORGANIC CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Principles of molecular structure and bonding applied to predict and explain the reactivity of aromatic systems, benzylic and allylic systems, aryl and vinyl halides, and carbonyl-containing compounds (e.g., ketones, carboxylic acids, esters, acid chlorides, amides). Emphasis placed on rationalizing the stereochemical and regiochemical outcome of chemical processes as well as arguing reaction outcomes from spectroscopic evidence.",
            "id": "CHEM 345",
            "parent": "CHEM",
            "title": "ORGANIC CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Stoichiometry and the mole concept, the behavior of gases, liquids and solids, thermochemistry, electronic structure of atoms and chemical bonding, descriptive chemistry of selected elements and compounds, intermolecular forces, and chemistry laboratory skills.",
            "id": "CHEM 103",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "The practice of Dermatology encompasses diseases of the skin, mucosal surfaces, hair and nails. The scientific specialty integrates cellular and molecular biology, immunology, microbiology, and physiology to support patient care decisions. Learn basic science principles of normal and abnormal cutaneous functioning, building on the principles introduced in theMED SC-M 774. These core concepts will be applied though interactions with patients in the clinical setting, building foundational basic science knowledge to diagnose and treat dermatologic diseases.",
            "id": "DERM 904",
            "parent": "DERM",
            "title": "SCIENCE OF CUTANEOUS DISEASE"
        }
    },
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics and selected topics in Animal Physiology.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "id": "BIOCHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "DERM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MEDSC-M",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 501",
            "target": "DERM 601"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "DERM 602"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 101"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "DERM 601"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "DERM 602"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 151"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 109"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 343"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 341",
            "target": "BIOCHEM 501"
        }
    },
    {
        "data": {
            "source": "CHEM 343",
            "target": "BIOCHEM 501"
        }
    },
    {
        "data": {
            "source": "CHEM 343",
            "target": "CHEM 345"
        }
    },
    {
        "data": {
            "source": "CHEM 345",
            "target": "CHEM 341"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 771",
            "target": "MEDSC-M 810"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 773",
            "target": "MEDSC-M 810"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 810",
            "target": "DERM 904"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 810",
            "target": "DERM 955"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 811",
            "target": "DERM 904"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 811",
            "target": "DERM 955"
        }
    }
]