[
    {
        "data": {
            "description": "Artists and designers' material choices influence the content, social meaning, and physical structure of their work, as well as leaving an environmental foot print and affecting social exchange. Consideration given to reuse and recycling, and critically engaging ideas of sustainability in art making and design practice with an emphasis on fiber related topics including textile and apparel design, soft sculpture, papermaking and book arts, as well as exhibition, installation, and/or the distribution of finished works.",
            "id": "DS 529",
            "parent": "DS",
            "title": "BUILDING A SUSTAINABLE CREATIVE PRACTICE"
        }
    },
    {
        "data": {
            "description": "Examines the arts and cultures of Europe and the Mediterranean basin before the Renaissance. Explores canonical works such as the pyramids at Giza, the Parthenon in Athens, the Venus di Milo, Hagia Sophia in Constantinople, the Book of Kells, the Great Mosque at Córdoba, Chartres cathedral, and Giotto's Arena Chapel. Define art broadly, to encompass the material culture of everyday life, including jewelry, ceramics, and textiles. Considers the social and historical contexts of art and artistic production - art and imperialism, ethnicity, technology, religious ritual and belief, and myth and storytelling, and its relationships to basic human concerns: death and the afterlife, desire and the body, self-definition and portraiture, power and propaganda, monstrosity and the supernatural, the divine and the sacred. Develops crucial skill sets: critical visual analysis, contextual interpretation, research methods and resources, historiography, and oral, written and digital communication.",
            "id": "ARTHIST 201",
            "parent": "ARTHIST",
            "title": "HISTORY OF WESTERN ART I: FROM PYRAMIDS TO CATHEDRALS"
        }
    },
    {
        "data": {
            "description": "Visual thinking's theoretical foundations are paired with visual thinking skills, tools, and applications. The format explores the way these can be combined while thinking critically and engaging with problem solving methodologies such as design thinking. Theoretical foundations include the elements and principles of design, the processes of visual narrative, and perceptual theories. Skills and applications include manual sketching, 3D visualization and modeling, data visualization, image manipulation, graphic design, video presentation, multimedia, design for 3D printing and fabrication, diagramming, digital rendering, and graphic design.",
            "id": "DS 620",
            "parent": "DS",
            "title": "VISUAL THINKING FOR PROBLEM SOLVING"
        }
    },
    {
        "data": {
            "description": "A forum to discuss issues in contemporary art and design.",
            "id": "DS 920",
            "parent": "DS",
            "title": "SEMINAR IN DESIGN STUDIES"
        }
    },
    {
        "data": {
            "description": "A supervised internship providing hands-on training in a professional experience in design studies related fields.",
            "id": "DS 601",
            "parent": "DS",
            "title": "INTERNSHIP"
        }
    },
    {
        "data": {
            "description": "Addresses the multi-disciplinary production of a student-centered, student-driven design and fashion event. Topics include, creative direction, strategic marketing, stage and performance, visual communication, event organization, audience engagement and event production. Gain knowledge, skills and hands-on experience implementing a large-scale art event. Emphasizes teamwork and fosters multi-disciplinary appreciation.",
            "id": "DS 270",
            "parent": "DS",
            "title": "DESIGN AND FASHION EVENT PRACTICUM"
        }
    },
    {
        "data": {
            "description": "Advanced topics focusing on the concepts, methods and materials used for communicating ideas during the design process. With an emphasis on creating visually driven experiences, integrates traditional manual approaches with up-to-the-minute digital approaches, all within the context of creative design thinking.",
            "id": "DS 242",
            "parent": "DS",
            "title": "VISUAL COMMUNICATION II"
        }
    },
    {
        "data": {
            "description": "An empathetic, human-centered perspective that uses Design Thinking and draws from historical precedence and current research from a variety of fields to help solve complex and persistent problems such as student mental health awareness and lack of clean drinking water. Utilizes advanced design thinking techniques to enhance creative analysis and problem solving to address real-word problems with real-world constraints and the limitations of technology. Projects range from ways to improve everyday situations to community issues.",
            "id": "DS 641",
            "parent": "DS",
            "title": "ADVANCED DESIGN THINKING FOR TRANSFORMATION"
        }
    },
    {
        "data": {
            "description": "Analysis of complex or compound hand weave techniques. Individual development of solutions to problems of structural textile design.",
            "id": "DS 429",
            "parent": "DS",
            "title": "TEXTILE DESIGN: WEAVING II"
        }
    },
    {
        "data": {
            "description": "Basic principles and elements of design as they apply to apparel. Emphasizing both process and product, students analyze fashion trends and practical problems while developing and executing original designs.",
            "id": "DS 225",
            "parent": "DS",
            "title": "APPAREL DESIGN I"
        }
    },
    {
        "data": {
            "description": "Building components, construction, interpretation of working drawing, and the process of project development.",
            "id": "DS 223",
            "parent": "DS",
            "title": "INTERIOR ARCHITECTURAL DESIGN"
        }
    },
    {
        "data": {
            "description": "Changing form and meaning of costume in the West from Renaissance to present. Dress considered in relation to social/cultural milieu and as an art form. Includes treatment of the body; ethnic/class variations; couture; \"antifashion\".",
            "id": "DS 355",
            "parent": "DS",
            "title": "HISTORY OF FASHION, 1400-PRESENT"
        }
    },
    {
        "data": {
            "description": "Chemistry and physics of fibers and polymers. Principles of chemical finishes and dyeing. Qualitative fiber analysis. Structure and properties of yarns and fabrics.",
            "id": "DS 251",
            "parent": "DS",
            "title": "TEXTILE SCIENCE"
        }
    },
    {
        "data": {
            "description": "Culminates design education through real-world challenges. Develops critical thinking, creativity, innovation for effective solutions. Emphasizes collaborative teamwork within multidisciplinary groups. Guides portfolio development, underscoring growth and versatility as a designer. Topics include defining problems through research, conceptualizing solutions, designing prototypes and interfaces, conducting user testing, and implementing designs.",
            "id": "DS 650",
            "parent": "DS",
            "title": "COLLABORATIVE DESIGN CAPSTONE"
        }
    },
    {
        "data": {
            "description": "Demonstrate accumulated learning through a semester long project in the development of a collection of marketable artisan works within your own media. Combines classroom-based learning explorations with real world technical and economic considerations to successfully navigate a balance between expansive thinking and application in real world situations.",
            "id": "DS 519",
            "parent": "DS",
            "title": "COLLECTION DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Design is a key component of our daily lives and can profoundly affect all people. But how? And to what end? What does design mean and what can it do for us? Interrogate those questions by looking broadly at the place of design in everyday life, and how design intersects with society, economics, politics, the environment, and culture. Study the form, function, and philosophy of design, from what we wear on our bodies to how we move through the world. Ground discussions in close observation and analysis of previous design solutions, leading to innovative approaches to the roles, and responsibilities, of design for the future.",
            "id": "DS 123",
            "parent": "DS",
            "title": "WHAT IS DESIGN?"
        }
    },
    {
        "data": {
            "description": "Design of commercial interiors with emphasis on acoustics, codes, costs, specifications, details, and visual presentation. Field trip required.",
            "id": "DS 623",
            "parent": "DS",
            "title": "INTERIOR DESIGN IV"
        }
    },
    {
        "data": {
            "description": "Design of commercial interiors with emphasis on design process, programming, space planning, selection of interior materials, furniture, and lighting. Field trip required.",
            "id": "DS 622",
            "parent": "DS",
            "title": "INTERIOR DESIGN III"
        }
    },
    {
        "data": {
            "description": "Design of residential interiors including space planning, lighting design, selections of materials and furniture, professional communication of design solutions. Emphasis on the aesthetic and functional needs of the family and residents with special needs.",
            "id": "DS 322",
            "parent": "DS",
            "title": "INTERIOR DESIGN II"
        }
    },
    {
        "data": {
            "description": "Design thinking is an iterative problem-solving process geared toward producing innovative solutions for complex and persistent problems in various fields and organizations. Its process, culture, and value system from both design and business point of views will be covered: Empathetic understanding of the end users, problem definition rooted in systems thinking, ideation with a strong emphasis on creativity, visualization and prototyping, testing rooted in a set of research methods, and finally, the importance of iteration in bringing about innovative solutions. The path from project to market will also be explored, with an understanding of how one might balance desirability, feasibility and viability.",
            "id": "DS/GENBUS 240",
            "title": "HUMAN-CENTERED DESIGN AND BUSINESS"
        }
    },
    {
        "data": {
            "description": "Designs and meanings and interrelationships of textiles in selected cultures and time periods.",
            "id": "DS 430",
            "parent": "DS",
            "title": "HISTORY OF TEXTILES"
        }
    },
    {
        "data": {
            "description": "Directed study projects as arranged with a faculty member.",
            "id": "DS 299",
            "parent": "DS",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Directed study projects as arranged with a faculty member.",
            "id": "DS 699",
            "parent": "DS",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Directed study projects as arranged with a faculty member.",
            "id": "DS 999",
            "parent": "DS",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Effects of building and outdoor spaces on people over the life course.",
            "id": "DS 221",
            "parent": "DS",
            "title": "PERSON AND ENVIRONMENT INTERACTIONS"
        }
    },
    {
        "data": {
            "description": "Elements and principles of design relevant to design of the visual environment.",
            "id": "DS 120",
            "parent": "DS",
            "title": "DESIGN: FUNDAMENTALS I"
        }
    },
    {
        "data": {
            "description": "Elements and principles of three-dimensional design relevant to design and analysis of the spatial environment.",
            "id": "DS 220",
            "parent": "DS",
            "title": "DESIGN: FUNDAMENTALS II"
        }
    },
    {
        "data": {
            "description": "Emphasizes specialty fabrics, finishes and complex construction such as matching plaids and working with pile fabrics. Introduces pattern manipulation through basic flat patternmaking principles. Design and fabricate an original collection of garments for a target customer and will develop and construct two of the garments.",
            "id": "DS 154",
            "parent": "DS",
            "title": "SEWN CONSTRUCTION II"
        }
    },
    {
        "data": {
            "description": "Examine the arts and culture of Europe and North America from the Renaissance through the present. Explore important fine art, architecture, decorative arts, and photographic masterpieces by artists like Leonardo da Vinci, Rembrandt van Rijn, Claude Monet, Paul Cézanne, Pablo Picasso, Frida Kahlo, and Frank Lloyd Wright. Learn how works of art were valued from the moment of their making, fought over by different nations, bought, sold, stolen, or ignored for centuries and revived only recently for study through the political, historical, social and cultural contexts of their making. Critically examine the concept of artistic genius; the influence of colonialism and imperialism on artistic production and consumption; the role of the patron and the art market in art's production and circulation; the relationship of fine art and popular culture; and the idea of globalization as it relates to \"western\" artistic traditions. Develop skills in visual analysis to understand artistic production.",
            "id": "ARTHIST 202",
            "parent": "ARTHIST",
            "title": "HISTORY OF WESTERN ART II: FROM RENAISSANCE TO CONTEMPORARY"
        }
    },
    {
        "data": {
            "description": "Experimental design and decorative principles; elements and techniques for the animation of textile surfaces.",
            "id": "DS 528",
            "parent": "DS",
            "title": "EXPERIMENTAL TEXTILE DESIGN"
        }
    },
    {
        "data": {
            "description": "Exploration of the idea of taste - both \"good\" and \"bad\", in \"popular\" and \"high\" culture. Cross-cultural readings from theoretical and historical perspectives, relating to architecture, landscape, public space, art, and clothing.",
            "id": "DS 642",
            "parent": "DS",
            "title": "TASTE"
        }
    },
    {
        "data": {
            "description": "Explore specific dye and manipulation techniques that directly relate to integrated textile and garment design. Working with color, composition and fabric movement discuss simple garment shapes and how they can be used in conjunction with expressive textiles.",
            "id": "DS 319",
            "parent": "DS",
            "title": "CLOTH TO CLOTHING"
        }
    },
    {
        "data": {
            "description": "Explores cultural values embedded in buildings through understanding physical configurations, social organizations, practiced/symbolic/representational aspects of buildings. Covers a wide range of cultures and the built environments they produce including examples from the Americas, the Middle East, as well as those of the many ethnic minorities in the U.S.",
            "id": "DS/LANDARC 639",
            "title": "CULTURE AND BUILT ENVIRONMENT"
        }
    },
    {
        "data": {
            "description": "Explores emerging built environments designed to support people undergoing crises such as disasters, conflicts, forced migration. Focuses on psycho-social components to employ human-centered design lens to environments of crisis. Examines theoretical frameworks on stress, trauma-informed practices, supportive environments, and restoration. Investigates physical spaces in crisis environments and their health and wellbeing impacts. Evaluates design, policy interventions from lenses of equity and justice, human rights, and dignity.",
            "id": "DS 521",
            "parent": "DS",
            "title": "ENVIRONMENTS OF CRISIS & DESIGN"
        }
    },
    {
        "data": {
            "description": "Explores visual media as a means of describing what exists, as a method for generating ideas for what could be, and for professionally communicating a design concept. Use hand drawing techniques and professional design software. Supports the proficiency of technical skills while teaching essential methods for creative practice. Learn to move fluidly across platforms to visually explore possibilities, refine ideas, and professionally communicate design plans.",
            "id": "DS 150",
            "parent": "DS",
            "title": "VISUAL THINKING - PIXELS AND PENCILS"
        }
    },
    {
        "data": {
            "description": "Focuses on silkscreen printing. Discharge, burnout, and chemical resist processes, specific to screen printing. Develop conceptual ideas and explore alternative ways of producing images.",
            "id": "DS 427",
            "parent": "DS",
            "title": "TEXTILE DESIGN: PRINTING AND DYEING II"
        }
    },
    {
        "data": {
            "description": "Focuses on the basic concepts, methods and materials used for communicating ideas during the design process. Emphasizes creating visually driven experiences, with the goal of providing the tools to integrate traditional manual approaches with up-to-the-minute digital approaches, all within the context of creative design thinking.",
            "id": "DS 241",
            "parent": "DS",
            "title": "VISUAL COMMUNICATION I"
        }
    },
    {
        "data": {
            "description": "Future designers need to have critical research knowledge and skillsets that include mastery of various research methods, related issues, and practical experiences in understanding and interpreting quantitative or qualitative research. Design research allows designers to be involved directly with objects, products, and environments they design through human-centered inquiry. The major concepts addressed include design research and its influence on the practice of design, generating research questions, critical literature review, research evaluation, data management and analysis, and various research strategies, all geared toward application to various design practices.",
            "id": "DS 679",
            "parent": "DS",
            "title": "RESEARCH METHODS IN DESIGN"
        }
    },
    {
        "data": {
            "description": "Gives students hands-on experience in building wearable computing platforms. Designed for students who have a background in textiles and apparel design, computer science, engineering or media arts. By the completion of the course students will have fundamental knowledge of electronic circuitry, programming, and \"maker skills\".",
            "id": "COMPSCI/DS/ISYE 518",
            "title": "WEARABLE TECHNOLOGY"
        }
    },
    {
        "data": {
            "description": "Historic and contemporary design techniques for embellishing textiles; including embroidery, beadwork and appliqué.",
            "id": "DS 228",
            "parent": "DS",
            "title": "TEXTILE EMBELLISHMENT I"
        }
    },
    {
        "data": {
            "description": "In the field of design, there has been an increased emphasis on ethical practices in production and consumption. Utilizing \"design thinking\", become exposed to important issues surrounding small-scale artisan production and develop valuable hands-on skills working with artisan partners through design, quality control, branding and story- telling. Topics may include: fair trade development, product design, cultural implications, as well as pricing, marketing, and sales.",
            "id": "DS 527",
            "parent": "DS",
            "title": "GLOBAL ARTISANS"
        }
    },
    {
        "data": {
            "description": "In-depth study of art/design concepts and/or practice in a specific culture while studying abroad. Looks at cultural issues through a particularized design-related lens.",
            "id": "DS 361",
            "parent": "DS",
            "title": "DESIGN-RELATED INTERNATIONAL EXPERIENCE"
        }
    },
    {
        "data": {
            "description": "Independent research and writing under the supervision of a faculty member.",
            "id": "DS 990",
            "parent": "DS",
            "title": "RESEARCH AND THESIS"
        }
    },
    {
        "data": {
            "description": "Individual study as arranged with a faculty member.",
            "id": "DS 690",
            "parent": "DS",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Individual study in honors as arranged with a faculty member.",
            "id": "DS 680",
            "parent": "DS",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Interdisciplinary study of the design, production, and consumption of household objects and their American domestic settings, 17th through the early 19th centuries.",
            "id": "ARTHIST/DS 363",
            "title": "AMERICAN DECORATIVE ARTS AND INTERIORS: 1620-1840"
        }
    },
    {
        "data": {
            "description": "Introduces students to the field of virtual reality and focuses on creating immersive, interactive virtual experiences. Survey topics include historical perspectives on virtual reality technology, computer graphics and 3D modeling, human perception and psychology, human computer interaction and user interface design. This course is designed for students with backgrounds in Computer Science, Engineering, Art, Architecture and Design. Students will work in interdisciplinary teams on projects, culminating in a final event that will be showcased to the public. While not an official uisite, the class will be technologically motivated; therefore students should be comfortable learning new software. The class will utilize publicly available game design software which provides tools and services for the creation of interactive content. While not necessary, students may find it helpful to have taken classes in programming and computer graphics (suchCOMP SCI 559: Computer Graphics) or in 3D modeling (such asART 429: 3D Digital Studio I orDS 242: Visual Communication II).",
            "id": "COMPSCI/DS 579",
            "title": "VIRTUAL REALITY"
        }
    },
    {
        "data": {
            "description": "Introduces the principles of sewn construction and addresses the physical and aesthetic properties of fiber and fabrics in the context of apparel design. The studios address skills necessary to plan and construct basic garments. Lectures, hands-on studios, and critiques explore the fundamentals of apparel structure and emphasize the interrelationship of fabric, design and apparel construction as well as the creative, expressive potential of materials and making.",
            "id": "DS 153",
            "parent": "DS",
            "title": "SEWN CONSTRUCTION I"
        }
    },
    {
        "data": {
            "description": "Introduction to interior architecture, as a discipline and as a profession. Examine the ways in which interior environments impact our lives, and the challenges and responsibilities faced by those who work in this field. Topics include: the history of interior design as a profession; the increased professionalization of interior design; the relation of interior design to other design disciplines (such as architecture and furniture design); the social, economic, and environmental issues that impact design; the role of emerging technologies (including digital media); design research and documentation; the elements and principles of design; the identification and observation of quality work in both commercial and residential settings; contemporary trends in taste and aesthetics; and the application of design research methods to a real-world project.",
            "id": "DS 130",
            "parent": "DS",
            "title": "INTRODUCTION TO INTERIOR ARCHITECTURE"
        }
    },
    {
        "data": {
            "description": "Introduction to visual communication of apparel design concepts using selected media. Focus is on drawing the fashion figure, using special techniques, with emphasis on the relationship of figure, garment, fabric, texture, and pattern.",
            "id": "DS 210",
            "parent": "DS",
            "title": "FASHION ILLUSTRATION"
        }
    },
    {
        "data": {
            "description": "Learn design thinking techniques to enhance creative analysis and problem solving. Directly apply those techniques to a variety of human centered design challenges. Innovate, prototype, and test designs that address real-word problems with real-world constraints and the limitations of technology. Projects range from ways to improve everyday situations to community issues.",
            "id": "DS 341",
            "parent": "DS",
            "title": "DESIGN THINKING FOR TRANSFORMATION"
        }
    },
    {
        "data": {
            "description": "Manual and digital techniques for idea exploration, concept development, and design presentation using a variety of media. Projects in hand drawing techniques and professional design software. Gain heightened attention to detail;  understand the relationship of two-dimensional drawings and three-dimensional objects; explore multiple design solutions visually; convey technical information, and professionally communicate design concepts. Introduce visual communication, visual thinking, visual inspiration and visual representation",
            "id": "DS 140",
            "parent": "DS",
            "title": "VISUAL THINKING - FORM AND SPACE"
        }
    },
    {
        "data": {
            "description": "Modern tools and techniques including professional design software and digital fabrication equipment are used in combination with traditional model making for tangible prototyping using a variety of media. Leverage digital design software, laser cutting, and 3D printing alongside traditional methods and manual tools to develop design concepts into physical forms.",
            "id": "DS 333",
            "parent": "DS",
            "title": "DIGITAL FABRICATION FOR DESIGNERS"
        }
    },
    {
        "data": {
            "description": "Opportunity to continue creative research introduced in Textile Embellishment I, with a special emphasis on student driven design. Advance skill and vision using traditional and experimental ways of altering and enriching the surface of pliable materials using techniques such as stitching, embroidery, beading, and fabric collage. Identify and pursue individual conceptual concerns. Readings, formal and informal presentations, group and individual critiques will support the work. Presentation of research will include formal power point talks and physical presentation of the completed textile works.",
            "id": "DS 428",
            "parent": "DS",
            "title": "TEXTILE EMBELLISHMENT II"
        }
    },
    {
        "data": {
            "description": "Pattern design for textiles, wallpaper and other applications  (motif, layout, repeats, colorways, coordinates), using various manual and digital creation methods. Development of imagery, design concepts, collaboration and presentation.",
            "id": "DS 327",
            "parent": "DS",
            "title": "TEXTILE DESIGN: MANUAL/COMPUTER GENERATED IMAGERY AND PATTERN"
        }
    },
    {
        "data": {
            "description": "Physical textile testings are studied. Emphasis is placed on the evaluation of textiles intended for use as apparel and for interiors. Writing specifications, and minimum performance standards are also discussed.",
            "id": "DS 561",
            "parent": "DS",
            "title": "TEXTILES: SPECIFICATIONS AND END USE ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Prepares Interior Architecture majors to launch their careers in design. Become cquainted  with aspects of the interior design profession: how an office works, the project delivery process in interior design practice, and post-graduation material preparation.",
            "id": "DS 624",
            "parent": "DS",
            "title": "INTERIOR ARCHITECTURE PROFESSIONAL PRACTICE"
        }
    },
    {
        "data": {
            "description": "Production of a student-driven, student-centered design and fashion event presents the framework for advanced experience and study. Provides the opportunity to study and to actively engage in high-level interdisciplinary exploration and collaboration. Transferring discipline-specific skills to a new context, learn methods for testing, review, and revision to develop problem-solving skills and communication. Encourages teamwork as well as crossdisciplinary understanding and appreciation.",
            "id": "DS 570",
            "parent": "DS",
            "title": "DESIGN AND FASHION EVENT MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Programming is the problem definition phase of design process. An architectural or design program is used to guide the design process and to evaluate design solutions. A variety of design programming approaches, tools, and techniques are presented. Opportunity to develop skills in preparing a design program document that includes multiple user-needs and principles of environment-behavior interaction.",
            "id": "DS 321",
            "parent": "DS",
            "title": "PROBLEM-DEFINITION: DESIGN PROGRAMMING"
        }
    },
    {
        "data": {
            "description": "Provides a practical introduction to basic concepts of research question formulation, research designs and alternative methods of inquiry, implications for internal validity of the research and generalizability of the findings, operational definitions and measurement validity, reliability, utility and precision.",
            "id": "DS/F&WECOL/URBRPL 955",
            "title": "PRACTICAL RESEARCH DESIGN AND METHODS OF EMPIRICAL INQUIRY"
        }
    },
    {
        "data": {
            "description": "Provides detailed examination of design careers in the fields of textiles, fashion, and apparel design as well as interior design, industrial design, and architecture. High level industry experts from leading companies in the design industry participate as guest speakers and panel members.",
            "id": "DS 252",
            "parent": "DS",
            "title": "DESIGN LEADERSHIP SYMPOSIUM"
        }
    },
    {
        "data": {
            "description": "Provides equivalency for accessory design courses completed at the Fashion Institute of Technology (FIT) by Textiles  Fashion Design majors as part of the FIT visiting student program. This is not a course that can be enrolled in at UW-Madison",
            "id": "DS 401",
            "parent": "DS",
            "title": "FIT ACCESSORIES DESIGN"
        }
    },
    {
        "data": {
            "description": "Provides equivalency for advertising and marketing communications courses completed at the Fashion Institute of Technology (FIT) by Textiles  Fashion Design majors as part of the FIT visiting student program. This is not a course that can be enrolled in at UW-Madison",
            "id": "DS 402",
            "parent": "DS",
            "title": "FIT ADVERTISING AND MARKETING COMMUNICATIONS"
        }
    },
    {
        "data": {
            "description": "Provides equivalency for communication design foundation courses completed at the Fashion Institute of Technology (FIT) by Textiles  Fashion Design majors as part of the FIT visiting student program. This is not a course that can be enrolled in at UW- Madison",
            "id": "DS 403",
            "parent": "DS",
            "title": "FIT COMMUNICATION DESIGN FOUNDATION"
        }
    },
    {
        "data": {
            "description": "Provides equivalency for fashion business management courses completed at the Fashion Institute of Technology (FIT) by Textiles  Fashion Design majors as part of the FIT visiting student program. This is not a course that can be enrolled in at UW-Madison",
            "id": "DS 404",
            "parent": "DS",
            "title": "FIT FASHION BUSINESS MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Provides equivalency for fashion design courses completed at the Fashion Institute of Technology (FIT) by Textiles  Fashion Design majors as part of the FIT visiting student program. This is not a course that can be enrolled in at UW-Madison",
            "id": "DS 405",
            "parent": "DS",
            "title": "FIT FASHION DESIGN"
        }
    },
    {
        "data": {
            "description": "Provides equivalency for related area courses completed at the Fashion Institute of Technology (FIT) by Textiles  Fashion Design majors as part of the FIT visiting student program. This is not a course that can be enrolled in at UW-Madison",
            "id": "DS 407",
            "parent": "DS",
            "title": "FIT RELATED AREA"
        }
    },
    {
        "data": {
            "description": "Provides equivalency for textile design and science courses completed at the Fashion Institute of Technology (FIT) by Textiles  Fashion Design majors as part of the FIT visiting student program. This is not a course that can be enrolled in at UW-Madison",
            "id": "DS 406",
            "parent": "DS",
            "title": "FIT TEXTILE DESIGN AND SCIENCE"
        }
    },
    {
        "data": {
            "description": "Provides the opportunity to explore and refine interior design skills while responding to current events and the ever changing world around us. Follow the design process from research, programming, conceptual and schematic design, full design development and presentation. All aspects of designing an interiors project in detail will be addressed, including space planning, interior architectural articulation, furniture selection, finish selection, detailing of custom elements, rendering, website development for client presentation, and more.",
            "id": "DS 626",
            "parent": "DS",
            "title": "INTERIOR DESIGN V"
        }
    },
    {
        "data": {
            "description": "Specialized topics of current interest.",
            "id": "DS 451",
            "parent": "DS",
            "title": "COLOR THEORY AND TECHNOLOGY"
        }
    },
    {
        "data": {
            "description": "Specialized topics of current interest.",
            "id": "DS 501",
            "parent": "DS",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "Studio design problems in two and three dimensional off-loom constructions; off-loom weaving, looping, and knotting; historical reference and contemporary application.",
            "id": "ART/DS 226",
            "title": "TEXTILE DESIGN: OFF-LOOM CONSTRUCTION"
        }
    },
    {
        "data": {
            "description": "Surface design developed in print and resist techniques using historic and contemporary methods.",
            "id": "DS 227",
            "parent": "DS",
            "title": "TEXTILE DESIGN: PRINTING AND DYEING I"
        }
    },
    {
        "data": {
            "description": "Surveys the history of architecture, interiors, furnishings and decorative arts from antiquity to the mid-19th century. Introduction to major design cultures and movements, emphasizing the role of social, economic, political, technological, and aesthetic factors in the shaping design.",
            "id": "DS 421",
            "parent": "DS",
            "title": "HISTORY OF ARCHITECTURE AND INTERIORS I: ANTIQUITY THROUGH 18TH CENTURY"
        }
    },
    {
        "data": {
            "description": "Surveys the history of architecture, interiors, furnishings and decorative arts from the mid-19th to the mid-20th century. Introduction to major design cultures and movements, emphasizing the role of social, economic, political, technological, and aesthetic factors in the shaping design.",
            "id": "DS 422",
            "parent": "DS",
            "title": "HISTORY OF ARCHITECTURE & INTERIORS II: 19TH AND 20TH CENTURIES"
        }
    },
    {
        "data": {
            "description": "The materials used in interior environments are immense, diverse and constantly changing. Focus on the composition of materials, their uses, and how they affect human health and well being.",
            "id": "DS 224",
            "parent": "DS",
            "title": "INTERIOR MATERIALS AND FINISHES"
        }
    },
    {
        "data": {
            "description": "The principles and theories of flat pattern, drafting and draping methods for 3D accessories are explored. The principles of patternmaking are applied to headwear, handbags and footwear. Complete projects that require designing, patterning and constructing hats, bags and footwear.",
            "id": "DS 215",
            "parent": "DS",
            "title": "PATTERNMAKING FOR ACCESSORIES"
        }
    },
    {
        "data": {
            "description": "The relationship of hand weaving to textural surfaces and sculptural forms are examined through the study of problems including structure, pattern, composition, and additional conceptual technical possibilities. Content is explored in the development of individual direction and in relationship to the discussion of historical and contemporary textiles and other works of art. Pursue an advanced investigation of concept and technique of hand-woven cloth.",
            "id": "ART/DS 229",
            "title": "TEXTILE DESIGN: WEAVING I"
        }
    },
    {
        "data": {
            "description": "The theory and principles of pattern making through flat pattern and draping techniques.",
            "id": "DS 253",
            "parent": "DS",
            "title": "PATTERNMAKING FOR APPAREL DESIGN"
        }
    },
    {
        "data": {
            "description": "The ways in which we design, construct, and operate has significant impacts on the building occupants and the environment. Architects, designers, and building engineers can work closely together to reduce depletion of critical resources, prevent environmental degradation, and create built environments that are livable, comfortable, safe, and productive. Offers the foundational knowledge on which such practice can be built on. Through a series of lectures, field measurements, and building simulations, understand how lighting, acoustics, and thermal properties behave in buildings and influence the building occupants. The proper application of building design as well as methods for designing and evaluating these features are discussed.",
            "id": "DS 549",
            "parent": "DS",
            "title": "ENVIRONMENTAL CONTROL SYSTEMS: LIGHTING, ACOUSTICS, AND THERMAL COMFORT IN BUILDINGS"
        }
    },
    {
        "data": {
            "description": "This course introduces students to the interdisciplinary field of material culture studies. It is intended for students interested in any professional endeavor related to material culture, including careers in museums, galleries, historical societies, historic preservation organizations, and academic institutions. During the semester, students have varied opportunities to engage with and contemplate the material world to which people give meaning and which, in turn, influences their lives. Sessions combine in some way the following: presentations from faculty members and professionals who lecture on a phase of material culture related to his/her own scholarship or other professional work; discussion of foundational readings in the field; visits to collections and sites on campus and around Madison; discussion of readings assigned by visiting presenters or the professors; and exams and short papers that engage material culture topics.",
            "id": "ANTHRO/ARTHIST/DS/HISTORY/LANDARC 264",
            "title": "DIMENSIONS OF MATERIAL CULTURE"
        }
    },
    {
        "data": {
            "description": "This course introduces students to the interdisciplinary field of material culture studies. It is intended for students interested in any professional endeavor related to material culture, including careers in museums, galleries, historical societies, historic preservation organizations, and academic institutions. During the semester, students have varied opportunities to engage with and contemplate the material world to which people give meaning and which, in turn, influences their lives. Sessions combine in some way the following: presentations from faculty members and professionals who lecture on a phase of material culture related to his/her own scholarship or other professional work; discussion of foundational readings in the field; visits to collections and sites on campus and around Madison; discussion of readings assigned by visiting presenters or the professors; and exams and short papers that engage material culture topics.",
            "id": "ANTHRO/ARTHIST/DS/HISTORY/LANDARC 764",
            "title": "DIMENSIONS OF MATERIAL CULTURE"
        }
    },
    {
        "data": {
            "description": "This survey class will be an introduction to the technical and conceptual ways of working in Textile Design. Students will participate in three five week modules: one module introducing print and dye concerns, one module introducing off-loom processes, and one module introducing structural enrichment techniques and concepts. Each module will include a series of introductory exercises leading to a final larger project. The work in each module will be supported by short readings and slide lectures highlighting historical and contemporary work. Course fee: yes.",
            "id": "DS 101",
            "parent": "DS",
            "title": "INTRODUCTION TO TEXTILE DESIGN"
        }
    },
    {
        "data": {
            "description": "Understanding and applying the process of solving design problems of interiors. Space planning; selection and use of furnishings and materials; preparation of presentations.",
            "id": "DS 222",
            "parent": "DS",
            "title": "INTERIOR DESIGN I"
        }
    },
    {
        "data": {
            "id": "ARTHIST",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "DS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ANTHRO/ARTHIST/DS/HISTORY/LANDARC 264",
            "target": "DS 650"
        }
    },
    {
        "data": {
            "source": "ART/DS 229",
            "target": "DS 429"
        }
    },
    {
        "data": {
            "source": "ARTHIST 201",
            "target": "DS 421"
        }
    },
    {
        "data": {
            "source": "ARTHIST 202",
            "target": "DS 421"
        }
    },
    {
        "data": {
            "source": "DS 101",
            "target": "DS 227"
        }
    },
    {
        "data": {
            "source": "DS 101",
            "target": "DS 319"
        }
    },
    {
        "data": {
            "source": "DS 120",
            "target": "ART/DS 226"
        }
    },
    {
        "data": {
            "source": "DS 120",
            "target": "DS 210"
        }
    },
    {
        "data": {
            "source": "DS 120",
            "target": "DS 220"
        }
    },
    {
        "data": {
            "source": "DS 120",
            "target": "DS 361"
        }
    },
    {
        "data": {
            "source": "DS 123",
            "target": "DS 650"
        }
    },
    {
        "data": {
            "source": "DS 140",
            "target": "DS 333"
        }
    },
    {
        "data": {
            "source": "DS 140",
            "target": "DS 650"
        }
    },
    {
        "data": {
            "source": "DS 153",
            "target": "ART/DS 226"
        }
    },
    {
        "data": {
            "source": "DS 153",
            "target": "DS 154"
        }
    },
    {
        "data": {
            "source": "DS 153",
            "target": "DS 215"
        }
    },
    {
        "data": {
            "source": "DS 154",
            "target": "DS 210"
        }
    },
    {
        "data": {
            "source": "DS 154",
            "target": "DS 253"
        }
    },
    {
        "data": {
            "source": "DS 154",
            "target": "DS 319"
        }
    },
    {
        "data": {
            "source": "DS 210",
            "target": "DS 225"
        }
    },
    {
        "data": {
            "source": "DS 220",
            "target": "DS 222"
        }
    },
    {
        "data": {
            "source": "DS 220",
            "target": "DS 650"
        }
    },
    {
        "data": {
            "source": "DS 221",
            "target": "DS 321"
        }
    },
    {
        "data": {
            "source": "DS 221",
            "target": "DS 650"
        }
    },
    {
        "data": {
            "source": "DS 222",
            "target": "DS 223"
        }
    },
    {
        "data": {
            "source": "DS 222",
            "target": "DS 322"
        }
    },
    {
        "data": {
            "source": "DS 227",
            "target": "DS 427"
        }
    },
    {
        "data": {
            "source": "DS 228",
            "target": "DS 428"
        }
    },
    {
        "data": {
            "source": "DS 241",
            "target": "DS 242"
        }
    },
    {
        "data": {
            "source": "DS 251",
            "target": "DS 561"
        }
    },
    {
        "data": {
            "source": "DS 253",
            "target": "DS 225"
        }
    },
    {
        "data": {
            "source": "DS 270",
            "target": "DS 570"
        }
    },
    {
        "data": {
            "source": "DS 322",
            "target": "DS 622"
        }
    },
    {
        "data": {
            "source": "DS 322",
            "target": "DS 624"
        }
    },
    {
        "data": {
            "source": "DS 327",
            "target": "DS 427"
        }
    },
    {
        "data": {
            "source": "DS 421",
            "target": "DS 422"
        }
    },
    {
        "data": {
            "source": "DS 622",
            "target": "DS 623"
        }
    },
    {
        "data": {
            "source": "DS 623",
            "target": "DS 626"
        }
    },
    {
        "data": {
            "source": "DS/GENBUS 240",
            "target": "DS 650"
        }
    }
]