[
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics and selected topics in Animal Physiology.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Principles of molecular structure and bonding applied to predict and explain the reactivity of alkanes, alkenes, alkynes, alkyl halides, alcohols, and thiols. Emphasis placed on rationalizing the stereochemical and regiochemical outcome of chemical processes.",
            "id": "CHEM 343",
            "parent": "CHEM",
            "title": "ORGANIC CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Delves into aspects of natural sciences (biology and agricultural sciences) and social sciences underpinning the assessment of food production systems as related to a variety of outcomes including but not restricted to human and environmental health, air and water quality, greenhouse gases emission, land use, economic opportunity, social justice, as well as mitigation and adaptation to climate change, locally, regionally, domestically, across continents, and globally.",
            "id": "AGRONOMY/DYSCI 471",
            "title": "FOOD PRODUCTION SYSTEMS AND SUSTAINABILITY"
        }
    },
    {
        "data": {
            "description": "General concepts of animal biology at an introductory level emphasizing the evolutionary relationships between animals. Learn about general body plans and strategies used to accomplish the basic tasks of staying alive in major animal groups using preserved and live animals. Study the diversity within each group of animals by integrating the body plans with the lifestyle and ecology of animals. Dissections of earthworm, freshwater mussel, squid, sea star, and rat aid the study of these general principles.",
            "id": "BIOLOGY/ZOOLOGY 102",
            "title": "ANIMAL BIOLOGY LABORATORY"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 102"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "ANSCI/DYSCI 320"
        }
    },
    {
        "data": {
            "description": "Principles and application of chemical equilibrium, coordination chemistry, oxidation-reduction and electrochemistry, kinetics, nuclear chemistry, introduction to organic chemistry, and chemistry laboratory skills.",
            "id": "CHEM 104",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "An overview of animal sciences covering anatomy, physiology, nutrition, reproduction, genetics, management, animal welfare, and behavior of domesticated animals. Food animals are emphasized to discuss their contributions to humans.",
            "id": "ANSCI/DYSCI 101",
            "title": "INTRODUCTION TO ANIMAL SCIENCES"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "target": "ANSCI/DYSCI 434"
        }
    },
    {
        "data": {
            "description": "Application of the principles of quantitative genetics to the improvement of livestock and poultry; breeding value estimation and selection techniques; effects of inbreeding and hybrid vigor; crossbreeding systems.",
            "id": "ANSCI/DYSCI 363",
            "title": "PRINCIPLES OF ANIMAL BREEDING"
        }
    },
    {
        "data": {
            "description": "Full-time off-campus work experience which combines classroom theory with practical knowledge of operations to provide a background upon which to base a professional career. Students receive credit only for the term in which they are actively enrolled and working. The same work experience may not count toward credit in another course.",
            "id": "DYSCI 1",
            "parent": "DYSCI",
            "title": "COOPERATIVE EDUCATION/CO-OP IN DIARY SCIENCE"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "BIOCORE 382",
            "target": "ANSCI/DYSCI 434"
        }
    },
    {
        "data": {
            "description": "Accelerated coverage of topics in general chemistry, including introduction to laboratory techniques. Topics include atomic and molecular structure, chemical equilibrium, acid-base chemistry, thermodynamics, kinetics, and electrochemistry.",
            "id": "CHEM 109",
            "parent": "CHEM",
            "title": "ADVANCED GENERAL CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Core organic chemistry concepts of structure, reactivity, and synthesis with regards to the functional groups commonly found in commercial and biological substances. Covers a selection of topics fromCHEM 343and345.",
            "id": "CHEM 341",
            "parent": "CHEM",
            "title": "ELEMENTARY ORGANIC CHEMISTRY"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 501",
            "target": "ANSCI/DYSCI/NUTRSCI 311"
        }
    },
    {
        "data": {
            "description": "Instructional orientation to teaching at the higher eductation level in the agricultural and life sciences, direct teaching experience under faculty supervision, experience in testing and evaluation of students, and the analysis of teaching performance.",
            "id": "DYSCI 799",
            "parent": "DYSCI",
            "title": "PRACTICUM IN DAIRY SCIENCE TEACHING"
        }
    },
    {
        "data": {
            "description": "Comprehensive reviews of research aimed at broadening understanding of dairy science.",
            "id": "DYSCI 900",
            "parent": "DYSCI",
            "title": "SEMINAR"
        }
    },
    {
        "data": {
            "description": "Nutrients and their assimilation, function, and interactions that affect metabolism in mammals.  Differences among species will be used to emphasize unique digestive and physiological functions and how these differences affect metabolism of nutrients. Humans will be used in some comparisons. Follows physiological progression of nutrients, starting with an overview of the digestive tract followed by water and builds on specific roles of nutrients and substrates needed to provide basic processes required for maintenance, tissue accretion, and homeostatic regulation of nutrients.",
            "id": "ANSCI/DYSCI/NUTRSCI 311",
            "title": "COMPARATIVE ANIMAL NUTRITION"
        }
    },
    {
        "data": {
            "description": "Discussion of literature that has a bearing on animal nutrition. Students are to survey the literature and present a seminar.",
            "id": "ANSCI/DYSCI 931",
            "title": "SEMINAR IN ANIMAL NUTRITION"
        }
    },
    {
        "data": {
            "source": "ANSCI/DYSCI 101",
            "target": "ANSCI/DYSCI 370"
        }
    },
    {
        "data": {
            "description": "",
            "id": "ANSCI/DYSCI/GENETICS 951",
            "title": "SEMINAR IN ANIMAL BREEDING"
        }
    },
    {
        "data": {
            "description": "Independent research in preparation of a graduate thesis under supervision of a faculty member.",
            "id": "DYSCI 990",
            "parent": "DYSCI",
            "title": "RESEARCH"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 102",
            "target": "DYSCI 378"
        }
    },
    {
        "data": {
            "source": "BIOCORE 382",
            "target": "DYSCI 378"
        }
    },
    {
        "data": {
            "id": "BIOCHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "ANSCI/DYSCI 361"
        }
    },
    {
        "data": {
            "description": "Principles of reproductive physiology, improvement of fertility, and artificial insemination.",
            "id": "ANSCI/DYSCI 434",
            "title": "REPRODUCTIVE PHYSIOLOGY"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ANSCI/DYSCI 370"
        }
    },
    {
        "data": {
            "source": "CHEM 343",
            "target": "CHEM 341"
        }
    },
    {
        "data": {
            "source": "CHEM 115",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "description": "Explores a detailed atomic and molecular view of matter and its interactions, with a specific focus on quantum theory, molecular structure, and chemical bonding. Application required for enrollment.",
            "id": "CHEM 115",
            "parent": "CHEM",
            "title": "CHEMICAL PRINCIPLES I"
        }
    },
    {
        "data": {
            "description": "Second semester of individual study for majors completing theses for Honors degrees as arranged with a faculty member.",
            "id": "DYSCI 682",
            "parent": "DYSCI",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "BIOCORE 382"
        }
    },
    {
        "data": {
            "description": "Topics include: selected topics in plant physiology, a survey of the five major kingdoms of organisms, speciation and evolutionary theory, and ecology at multiple levels of the biological hierarchy.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 102",
            "target": "ANSCI/DYSCI 373"
        }
    },
    {
        "data": {
            "source": "BIOCORE 382",
            "target": "ANSCI/DYSCI 361"
        }
    },
    {
        "data": {
            "source": "CHEM 343",
            "target": "BIOCHEM 501"
        }
    },
    {
        "data": {
            "id": "BIOCORE",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ANSCI/DYSCI 101",
            "target": "DYSCI 233"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "ANSCI/DYSCI 370"
        }
    },
    {
        "data": {
            "description": "Integrates nutritional and biochemical concepts to understand digestive and metabolic processes in dairy and beef cattle, which are then quantitatively represented to predict and manipulate production and health outcomes.",
            "id": "ANSCI/DYSCI 414",
            "title": "RUMINANT NUTRITION & METABOLISM"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 101"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 501",
            "target": "DYSCI 378"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "description": "Focuses on rumen microbiology, metabolite modeling, as well as protein and VFA nutrition and metabolism.",
            "id": "ANSCI/DYSCI 824",
            "title": "RUMINANT NUTRITIONAL PHYSIOLOGY I"
        }
    },
    {
        "data": {
            "id": "DYSCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Various topics in Dairy Science of current interest to undergraduate students.",
            "id": "DYSCI 375",
            "parent": "DYSCI",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "Writing-intensive with opportunities to make observations and generate and test questions. Includes ecology field trips and research projects that focus on genetics and evolution.",
            "id": "BIOCORE 382",
            "parent": "BIOCORE",
            "title": "EVOLUTION, ECOLOGY, AND GENETICS LABORATORY"
        }
    },
    {
        "data": {
            "source": "ANSCI/DYSCI 101",
            "target": "ANSCI/DYSCI 102"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 102",
            "target": "ANSCI/DYSCI 434"
        }
    },
    {
        "data": {
            "source": "ANSCI/DYSCI 434",
            "target": "DYSCI 534"
        }
    },
    {
        "data": {
            "description": "Honors research work under direct guidance of a faculty member in an area of Dairy Science. Students are responsible for arranging the work and credits with the supervising instructor.",
            "id": "DYSCI 289",
            "parent": "DYSCI",
            "title": "HONORS INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "The molecular basis for inheritance of monogenic and polygenic traits related to animal disease and production. An introduction to the principles of improving animal health and performance by selection and mating systems in companion animals, horses, livestock, and poultry.",
            "id": "ANSCI/DYSCI 361",
            "title": "INTRODUCTION TO ANIMAL AND VETERINARY GENETICS"
        }
    },
    {
        "data": {
            "description": "Specialized subject matter of current interest to graduate students.",
            "id": "DYSCI 875",
            "parent": "DYSCI",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "Examines issues related to global agriculture and healthy sustainable development. Using a regional approach and focusing on crops and livestock case studies, students will learn the interdependence between US agriculture and agriculture in emerging economies. Some topics covered include population and food, immigration, the environment; crop and livestock agriculture; global trade; sustainability; food security, the role of women in agriculture, and the role of dairy products in a healthy diet.",
            "id": "ANSCI/DYSCI/FOODSCI/SOILSCI 472",
            "title": "ANIMAL AGRICULTURE AND GLOBAL SUSTAINABLE DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Individual advanced work in an area of Dairy Sciences under the direct guidance of a faculty member.",
            "id": "DYSCI 699",
            "parent": "DYSCI",
            "title": "SPECIAL PROBLEMS"
        }
    },
    {
        "data": {
            "description": "Basic principles of ecology and interrelations between individuals, populations, communities, ecosystems and their environment; transmission genetics and introduction to population genetics; origin of life, evolutionary mechanisms, ancestral relationships among species, and the diversity of life.",
            "id": "BIOCORE 381",
            "parent": "BIOCORE",
            "title": "EVOLUTION, ECOLOGY, AND GENETICS"
        }
    },
    {
        "data": {
            "source": "ANSCI/DYSCI 101",
            "target": "DYSCI 205"
        }
    },
    {
        "data": {
            "description": "Dairy cattle evaluation and selection, including: linear type appraisal, dairy cattle judging, mating programs, breed comparisons, cattle marketing, and national genetic improvement programs.",
            "id": "DYSCI 205",
            "parent": "DYSCI",
            "title": "DAIRY CATTLE IMPROVEMENT PROGRAMS"
        }
    },
    {
        "data": {
            "description": "Stoichiometry and the mole concept, the behavior of gases, liquids and solids, thermochemistry, electronic structure of atoms and chemical bonding, descriptive chemistry of selected elements and compounds, intermolecular forces, and chemistry laboratory skills.",
            "id": "CHEM 103",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY I"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ANSCI/DYSCI 320"
        }
    },
    {
        "data": {
            "description": "Examines issues related to global agriculture and healthy sustainable development. Using a regional approach and focusing on crops and livestock case studies, students will learn the interdependence between US agriculture and agriculture in emerging economies. Some topics covered include population and food, immigration, the environment; crop and livestock agriculture; global trade; sustainability; and the role of women in agriculture and the role of dairy products in a healthy diet.",
            "id": "ANSCI/DYSCI/FOODSCI/SOILSCI 473",
            "title": "INTERNATIONAL FIELD STUDY IN ANIMAL AGRICULTURE AND SUSTAINABLE DEVELOPMENT"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ANSCI/DYSCI 361",
            "target": "ANSCI/DYSCI 363"
        }
    },
    {
        "data": {
            "description": "The second of a two course sequence designed as an overview of practical dairy herd management with components of animal welfare and handling, health, calf and heifer rearing, facilities and production economics. Laboratories emphasize practical applications, investigation of alternatives and decision making.",
            "id": "DYSCI 234",
            "parent": "DYSCI",
            "title": "DAIRY HERD MANAGEMENT II"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "DYSCI 378"
        }
    },
    {
        "data": {
            "description": "Covers physiological processes that regulate the body and the anatomy and function of different physiological systems. Includes interactions between organ systems, analysis of a single organ system from the molecular to the organismal, and comparisons and contrasts of organ systems among different domestic animal species.",
            "id": "ANSCI/DYSCI 373",
            "title": "ANIMAL PHYSIOLOGY"
        }
    },
    {
        "data": {
            "description": "Provides an area equivalency for courses taken on Madison Study Abroad Programs that do not equate to existing UW courses.",
            "id": "DYSCI 400",
            "parent": "DYSCI",
            "title": "STUDY ABROAD IN DAIRY SCIENCE"
        }
    },
    {
        "data": {
            "source": "ANSCI/DYSCI/FOODSCI/SOILSCI 472",
            "target": "ANSCI/DYSCI/FOODSCI/SOILSCI 473"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 109"
        }
    },
    {
        "data": {
            "source": "ANSCI/DYSCI/NUTRSCI 311",
            "target": "ANSCI/DYSCI 414"
        }
    },
    {
        "data": {
            "description": "Focuses on calf and heifer nutrition, regulation of dry matter intake, plant and forage chemistry, vitamins, lipids, and starch.",
            "id": "ANSCI/DYSCI 825",
            "title": "RUMINANT NUTRITIONAL PHYSIOLOGY II"
        }
    },
    {
        "data": {
            "description": "General biological principles. Topics include: evolution, ecology, animal behavior, cell structure and function, genetics and molecular genetics and the physiology of a variety of organ systems emphasizing function in humans.",
            "id": "BIOLOGY/ZOOLOGY 101",
            "title": "ANIMAL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Focuses on lactation physiology across mammalian species. Structure and function of mammary glands; hormonal control of mammary development and lactation; cellular mechanisms of milk synthesis; the chemistry of milk synthesis; mastitis and other abnormalities of mammary functions.",
            "id": "DYSCI 378",
            "parent": "DYSCI",
            "title": "LACTATION PHYSIOLOGY"
        }
    },
    {
        "data": {
            "description": "Individual study for majors completing theses for Honors degrees as arranged with a faculty member.",
            "id": "DYSCI 681",
            "parent": "DYSCI",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 102",
            "target": "ANSCI/DYSCI 361"
        }
    },
    {
        "data": {
            "description": "Provides the technical knowledge and practical skills to design and execute an effective reproductive management program for dairy cattle. Study key reproductive physiology and practical research results that underlie reproductive management programs. Participate in hands-on laboratories to learn, practice, and demonstrate practical reproductive management techniques including: semen handling, artificial insemination, and ultrasound of ovaries and uterus.",
            "id": "DYSCI 534",
            "parent": "DYSCI",
            "title": "REPRODUCTIVE MANAGEMENT OF DAIRY CATTLE"
        }
    },
    {
        "data": {
            "description": "Individual introductory to intermediate work under direct guidance of a faculty member in an area of Dairy Science. Students are responsible for arranging the work and credits with the supervising instructor.",
            "id": "DYSCI 299",
            "parent": "DYSCI",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "source": "CHEM 341",
            "target": "BIOCHEM 501"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 152"
        }
    },
    {
        "data": {
            "description": "Physical, biological and social nature of animal agriculture systems and their improvement in developing countries; analysis of the state of livestock research and development in the developing countries and the world role of U.S. animal agriculture.",
            "id": "ANSCI/DYSCI 370",
            "title": "LIVESTOCK PRODUCTION AND HEALTH IN AGRICULTURAL DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Principles of nutrition, breeding, reproduction, and management at the farm level are integrated. Develop skills in decision making, information gathering, problem solving, and interpersonal communication through field trips to working commercial dairy operations.",
            "id": "DYSCI 535",
            "parent": "DYSCI",
            "title": "DAIRY FARM MANAGEMENT PRACTICUM"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ANSCI/DYSCI 361"
        }
    },
    {
        "data": {
            "source": "DYSCI 234",
            "target": "DYSCI 535"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "description": "Provides an introduction to and exploration of the interconnectivity between factors that affect health and disease and the central role of the immune system using infectious disease in animals as a key focus. Explores principal causes and identification of animal diseases, common diseases of farm animals, zoonoses and public health, disease prevention and management including biosecurity measures and host immune responses. Fosters appreciation for the translatability and universality of knowledge between human and animal health and disease.",
            "id": "ANSCI/DYSCI 320",
            "title": "ANIMAL HEALTH AND DISEASE"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 343"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 102",
            "target": "ANSCI/DYSCI 320"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 501",
            "target": "ANSCI/DYSCI 414"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ANSCI/DYSCI 434"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ANSCI/DYSCI 373"
        }
    },
    {
        "data": {
            "description": "Overview of practical dairy herd management with components of reproduction, nutrition, milk quality, raising dairy replacements, facilities and records. Laboratories emphasize practical applications, analyses of alternatives and decision making.",
            "id": "DYSCI 233",
            "parent": "DYSCI",
            "title": "DAIRY HERD MANAGEMENT I"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 151"
        }
    },
    {
        "data": {
            "source": "ANSCI/DYSCI 361",
            "target": "ANSCI/DYSCI 362"
        }
    },
    {
        "data": {
            "description": "Hands-on experience and demonstrations to develop practical skills with animals and to better understand the application of science to food production animals. It covers anatomy, physiology, nutrition, reproduction, genetics, management, animal welfare, and behavior of domesticated animals.",
            "id": "ANSCI/DYSCI 102",
            "title": "INTRODUCTION TO ANIMAL SCIENCES LABORATORY"
        }
    },
    {
        "data": {
            "description": "Chemistry, nutrition, and metabolism of biological systems.",
            "id": "BIOCHEM 501",
            "parent": "BIOCHEM",
            "title": "INTRODUCTION TO BIOCHEMISTRY"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "DYSCI 378"
        }
    },
    {
        "data": {
            "description": "An internship under guidance of a faculty or instructional academic staff member in Animal and Dairy Sciences and internship site supervisor. Students are responsible for arranging the work and credits with the faculty or instructional academic staff member and the internship site supervisor.",
            "id": "DYSCI 399",
            "parent": "DYSCI",
            "title": "COORDINATIVE INTERNSHIP/COOPERATIVE EDUCATION"
        }
    },
    {
        "data": {
            "description": "The genetic basis for predisposition to disease or resistance to disease in livestock and companion animal species. Genetic defects, their discovery, diagnosis and treatment.",
            "id": "ANSCI/DYSCI 362",
            "title": "VETERINARY GENETICS"
        }
    },
    {
        "data": {
            "source": "DYSCI 233",
            "target": "DYSCI 234"
        }
    }
]