[
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for Physics, AMEP, and Astronomy-Physics majors. Mechanics, waves, thermodynamics and statistical mechanics, topics in modern physics; with computation.  A more mathematically rigorous and in-depth introduction to physics than the other introductory physics sequences.",
            "id": "PHYSICS 247",
            "parent": "PHYSICS",
            "title": "A MODERN INTRODUCTION TO PHYSICS"
        }
    },
    {
        "data": {
            "source": "ECE 376",
            "target": "ECE 377"
        }
    },
    {
        "data": {
            "description": "Principles and characterization of logic circuits. Design and analysis techniques for applied logic circuits. Transmission lines in digital applications. Families of circuit logic currently in use and their characteristics.",
            "id": "ECE 555",
            "parent": "ECE",
            "title": "DIGITAL CIRCUITS AND COMPONENTS"
        }
    },
    {
        "data": {
            "description": "Introduction to calculus of functions of several variables; calculus on parameterized curves, derivatives of functions of several variables, multiple integrals, vector calculus.",
            "id": "MATH 234",
            "parent": "MATH",
            "title": "CALCULUS--FUNCTIONS OF SEVERAL VARIABLES"
        }
    },
    {
        "data": {
            "description": "General theory of free, forced, and transient vibrations; vibration transmission, isolation, and measurement; normal modes and generalized coordinates; method of matrix equation formulation and solution. The application of theory and methods to the analysis, measurement and design of dynamic systems.",
            "id": "EMA 545",
            "parent": "EMA",
            "title": "MECHANICAL VIBRATIONS"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "MATH 321"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "ECE 204"
        }
    },
    {
        "data": {
            "source": "EMA 545",
            "target": "ME 446"
        }
    },
    {
        "data": {
            "description": "Fundamentals of electromagnetic induction and application to transformers and induction heating; Lorentz forces with a focus on the operation and control of DC and AC motors and linear actuators; electrical power conversion using power electronics for motor drives and direct power converters.",
            "id": "ECE 377",
            "parent": "ECE",
            "title": "FUNDAMENTALS OF ELECTRICAL AND ELECTRO-MECHANICAL POWER CONVERSION"
        }
    },
    {
        "data": {
            "description": "Equilibrium points and linearization; natural and forced response of state equations; system equivalence and Jordan form; Lyapunov, asymptotic, and BIBO stability; controllability and duality; control-theoretic concepts such as pole-placement, stabilization, observers, dynamic compensation, and the separation principle. Knowledge of linear algebra [such asMATH 340] required.",
            "id": "ECE 717",
            "parent": "ECE",
            "title": "LINEAR SYSTEMS"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 234"
        }
    },
    {
        "data": {
            "description": "Emphasis on obtaining equations which define the behavior of physical systems frequently subjected to control; mechanical processing, fluid power, and thermal systems; analytical, experimental, and computer techniques. Knowledge of Automatic Controls [such asM E 446orE C E 332] is required.",
            "id": "ME 746",
            "parent": "ME",
            "title": "DYNAMICS OF CONTROLLED SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Introduction to some fundamental properties of semiconductor materials and devices through the use of characterization techniques common in modern electronic industry. These concepts include: charge carriers; energy bands; space charge regions; carrier drift, diffusion and recombination; light emission; and lattice vibrations.",
            "id": "ECE 305",
            "parent": "ECE",
            "title": "SEMICONDUCTOR PROPERTIES LABORATORY"
        }
    },
    {
        "data": {
            "source": "ECE 730",
            "target": "ECE 830"
        }
    },
    {
        "data": {
            "description": "Advanced topics of special interest to students in various areas of Electrical and Computer Engineering.",
            "id": "ECE 601",
            "parent": "ECE",
            "title": "SPECIAL TOPICS IN ELECTRICAL AND COMPUTER ENGINEERING"
        }
    },
    {
        "data": {
            "source": "ECE/PHYSICS 235",
            "target": "ECE 434"
        }
    },
    {
        "data": {
            "description": "A hands-on introduction to Data Science using the Python programming language. Data-centric and computational thinking. Describe, analyze, and make predictions using data from real-world phenomena. Programming in Python. Importing, manipulating, summarizing, and visualizing data of various types. Notions of bias, fairness, and ethics in data science.",
            "id": "ECE 204",
            "parent": "ECE",
            "title": "DATA SCIENCE & ENGINEERING"
        }
    },
    {
        "data": {
            "source": "MATH 375",
            "target": "MATH 376"
        }
    },
    {
        "data": {
            "source": "MATH 376",
            "target": "MATH 321"
        }
    },
    {
        "data": {
            "description": "The real numbers, elements of set theory, metric spaces and basic topology, sequences and series, limits, continuity, differentiation, integration, sequences and series of functions, uniform convergence.",
            "id": "MATH 521",
            "parent": "MATH",
            "title": "ANALYSIS I"
        }
    },
    {
        "data": {
            "source": "COMPSCI/ECE 252",
            "target": "ECE 353"
        }
    },
    {
        "data": {
            "description": "User-centered software design: (1) principles of and methods for understanding user needs; designing and prototyping interface solutions; and evaluating their usability, (2) their applications in designing multiple types of interfaces through group projects.",
            "id": "COMPSCI 570",
            "parent": "COMPSCI",
            "title": "INTRODUCTION TO HUMAN-COMPUTER INTERACTION"
        }
    },
    {
        "data": {
            "source": "ECE 340",
            "target": "ECE 313"
        }
    },
    {
        "data": {
            "description": "A rigorous introduction to probability theory at an advanced undergraduate level. Only a minimal amount of measure theory is used, in particular, the theory of Lebesgue integrals is not needed. It is aimed at math majors and Master's degree students, or students in other fields who will need probability in their future careers. Gives an introduction to the basics (Kolmogorov axioms, conditional probability and independence, random variables, expectation) and discusses some classical results with proofs (DeMoivre-Laplace limit theorems, the study of simple random walk on the one dimensional lattice, applications of generating functions).",
            "id": "MATH 531",
            "parent": "MATH",
            "title": "PROBABILITY THEORY"
        }
    },
    {
        "data": {
            "source": "ME 446",
            "target": "ME 747"
        }
    },
    {
        "data": {
            "source": "ECE 411",
            "target": "ECE 713"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "MATH 320",
            "target": "ME 446"
        }
    },
    {
        "data": {
            "description": "MHD equations and validity in hot plasmas; magnetic structure and magnetic flux coordinates; equilibrium in various configurations; stability formulation, energy principle, classification of instabilities; ideal and resistive instability in various configurations, evolution of nonlinear tearing modes; force-free equilibria, helicity, MHD dynamo; experimental applications. Basic knowledge of plasmas [such asPHYSICS/​E C E/​N E  525] and advanced electromagnetics [such asPHYSICS 721orE C E 740] strongly encouraged.",
            "id": "ECE/NE/PHYSICS 726",
            "title": "PLASMA MAGNETOHYDRODYNAMICS"
        }
    },
    {
        "data": {
            "source": "ECE 427",
            "target": "ECE 511"
        }
    },
    {
        "data": {
            "description": "Transport of carriers in electronic devices, starting from the Boltzmann equation and the quantum mechanical treatment of scattering, and covering applications to devices; transport in 2D structures; modeling of transport; experiments and devices involving hot electrons.",
            "id": "ECE 845",
            "parent": "ECE",
            "title": "TRANSPORT IN SEMICONDUCTOR DEVICES"
        }
    },
    {
        "data": {
            "source": "ECE 554",
            "target": "ECE 453"
        }
    },
    {
        "data": {
            "source": "MATH 320",
            "target": "COMPSCI/ECE 533"
        }
    },
    {
        "data": {
            "source": "STAT 340",
            "target": "ISYE 562"
        }
    },
    {
        "data": {
            "description": "Estimation and decision theory applied to random processes and signals in noise: Bayesian, maximum likelihood, and least squares estimation; the Kalman filter; maximum likelihood and maximum aposteriori detection; adaptive receivers for channels with unknown parameters or dispersive, fading characteristics; the RAKE receiver; detection systems with learning features.",
            "id": "ECE 830",
            "parent": "ECE",
            "title": "ESTIMATION AND DECISION THEORY"
        }
    },
    {
        "data": {
            "description": "Definition of measures of information and their properties, capacity of discrete and continuous channels with noise, source and channel coding theorems, fundamentals of channel coding, noiseless source coding, and source coding with a fidelity criterion. Knowledge of basic probability analysis [such asE C E 331,STAT/​MATH  431, orSTAT 311] required.",
            "id": "ECE 729",
            "parent": "ECE",
            "title": "INFORMATION THEORY"
        }
    },
    {
        "data": {
            "source": "COMPSCI/ECE 552",
            "target": "COMPSCI/ECE 506"
        }
    },
    {
        "data": {
            "source": "COMPSCI 300",
            "target": "ECE 353"
        }
    },
    {
        "data": {
            "description": "Theory, design and analysis of mobile wireless communication systems from a signal processing perspective. Emphasis on code-division multiple-access (CDMA) systems employing direct-sequence spread-spectrum (DS-SS) signaling. Topics include characterization of mobile wireless channels, demodulation of DS-SS signals, diversity techniques, interference suppression methods, and low-complexity adaptive receivers. Knowledge of probability [such asE C E 730] and digital communication [such asE C E 437] strongly encouraged.",
            "id": "ECE 736",
            "parent": "ECE",
            "title": "WIRELESS COMMUNICATIONS"
        }
    },
    {
        "data": {
            "description": "Basic description of plasmas: collective phenomena and sheaths, collisional processes, single particle motions, fluid models, equilibria, waves, electromagnetic properties, instabilities, and introduction to kinetic theory and nonlinear processes. Examples from fusion, astrophysical and materials processing processing plasmas.",
            "id": "ECE/NE/PHYSICS 525",
            "title": "INTRODUCTION TO PLASMAS"
        }
    },
    {
        "data": {
            "source": "ECE 745",
            "target": "ECE 845"
        }
    },
    {
        "data": {
            "description": "Work experience that combines classroom theory with practical knowledge of operations to provide students with a background on which to develop and enhance a professional career.  The work experience is tailored for MS students from within the U.S. as well as eligible international students.",
            "id": "ECE 702",
            "parent": "ECE",
            "title": "GRADUATE COOPERATIVE EDUCATION PROGRAM"
        }
    },
    {
        "data": {
            "source": "ECE 412",
            "target": "ECE 714"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 222"
        }
    },
    {
        "data": {
            "description": "Light-matter interactions with quantum systems and their applications in quantum computing, communications, and sensing. Brief review of quantum mechanics and derivation of quantum structure of atoms. Deeper exploration of concepts and applications of quantum optics (such as use of nonclassical light, entangled photons) and experimental techniques on how to control and measure quantum systems with photons (including atom cooling and trapping, coherent interactions, putting atoms in cavities). Knowledge of introductory-level classical electromagnetism (such asE C E 220orPHYSICS 202) and modern physics (such asPHYSICS/​E C E  235orPHYSICS 241) required.",
            "id": "ECE 835",
            "parent": "ECE",
            "title": "LIGHT INTERACTIONS WITH QUANTUM MATERIALS"
        }
    },
    {
        "data": {
            "source": "ECE 377",
            "target": "ECE 411"
        }
    },
    {
        "data": {
            "source": "ECE 340",
            "target": "ECE 271"
        }
    },
    {
        "data": {
            "source": "PHYSICS 248",
            "target": "PHYSICS 208"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 320"
        }
    },
    {
        "data": {
            "source": "ECE 270",
            "target": "ECE 271"
        }
    },
    {
        "data": {
            "source": "MATH 319",
            "target": "MATH 321"
        }
    },
    {
        "data": {
            "id": "PHYSICS",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for engineering students. Mechanics: kinematics, statics, dynamics; energy and momentum.",
            "id": "PHYSICS 201",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "source": "ECE 412",
            "target": "ECE 512"
        }
    },
    {
        "data": {
            "source": "ECE 203",
            "target": "ECE 340"
        }
    },
    {
        "data": {
            "source": "ECE 340",
            "target": "ECE 555"
        }
    },
    {
        "data": {
            "source": "ECE 548",
            "target": "ECE 549"
        }
    },
    {
        "data": {
            "description": "Deterministic and stochastic spatio-temporal image models, transform domain processing, Markov random fields and anisotropic diffusion; MAP parameter estimation, ill-posed inverse problems, robust statistics and non-linear digital filtering in image processing. Applications to image restoration, motion estimation, (video) image compression (MPEG, JPEG) and tomography. Knowledge of image processing [such asE C E/​COMP SCI  533] strongly encouraged.",
            "id": "ECE 738",
            "parent": "ECE",
            "title": "ADVANCED DIGITAL IMAGE PROCESSING"
        }
    },
    {
        "data": {
            "description": "An introduction to the physical principles underlying solid-state electronic and photonic devices, including elements of quantum mechanics, crystal structure, semiconductor band theory, carrier statistics, and band diagrams. Offers examples of modern semiconductor structures. Prior experience with MATLAB [such asE C E 203] is strongly encouraged but not required.",
            "id": "ECE/PHYSICS 235",
            "title": "INTRODUCTION TO SOLID STATE ELECTRONICS"
        }
    },
    {
        "data": {
            "source": "PHYSICS 201",
            "target": "PHYSICS 202"
        }
    },
    {
        "data": {
            "description": "Coulomb Collisions, Boltzmann equation, Fokker-Planck methods, dynamical friction, neoclassical diffusion, collision operators radiation processes and experimental applications. Basic knowledge of plasmas [such asPHYSICS/​E C E/​N E  525] and advanced electromagnetics [such asPHYSICS 721orE C E 740] strongly encouraged.",
            "id": "ECE/NE/PHYSICS 725",
            "title": "PLASMA KINETIC THEORY AND RADIATION PROCESSES"
        }
    },
    {
        "data": {
            "description": "Probabilistic tools for machine learning and analysis of real-world datasets. Introductory topics include classification, regression, probability theory, decision theory and quantifying information with entropy, relative entropy and mutual information. Additional topics include naive Bayes, probabilistic graphical models, discriminant analysis, logistic regression, expectation maximization, source coding and variational inference.",
            "id": "COMPSCI/ECE 561",
            "title": "PROBABILITY AND INFORMATION THEORY IN MACHINE LEARNING"
        }
    },
    {
        "data": {
            "source": "PHYSICS 202",
            "target": "ECE 230"
        }
    },
    {
        "data": {
            "source": "ECE 220",
            "target": "ECE 222"
        }
    },
    {
        "data": {
            "description": "State estimation based on line-flow measurements. Detection and correction of incorrect on-line measurements. Reduction techniques. Network security evaluation. On-line contingency studies and contingency remedial action. Calculation of penalty factors and optimal power dispatch strategies. On-line stability determination. Parallel processors for on-line studies. Knowledge of basic probability analysis [such asE C E 331,STAT/​MATH  431, orSTAT 311] strongly encouraged.",
            "id": "ECE 723",
            "parent": "ECE",
            "title": "ON-LINE CONTROL OF POWER SYSTEMS"
        }
    },
    {
        "data": {
            "source": "PHYSICS 202",
            "target": "PHYSICS 322"
        }
    },
    {
        "data": {
            "source": "ECE 554",
            "target": "ECE 454"
        }
    },
    {
        "data": {
            "description": "An introduction to electrical and electronic devices, circuits and systems including software and hardware focusing on a real-world project.",
            "id": "ECE 210",
            "parent": "ECE",
            "title": "INTRODUCTORY EXPERIENCE IN ELECTRICAL ENGINEERING"
        }
    },
    {
        "data": {
            "source": "COMPSCI 220",
            "target": "COMPSCI 300"
        }
    },
    {
        "data": {
            "source": "PHYSICS 201",
            "target": "PHYSICS 207"
        }
    },
    {
        "data": {
            "source": "MATH 319",
            "target": "ME 446"
        }
    },
    {
        "data": {
            "source": "ECE 332",
            "target": "ECE/ME 577"
        }
    },
    {
        "data": {
            "source": "MATH 521",
            "target": "MATH 531"
        }
    },
    {
        "data": {
            "description": "A hands-on introduction to a variety of different sensor types. Labs incorporate implementation concerns involving interference, isolation, linearity, amplification, and grounding.",
            "id": "ECE 317",
            "parent": "ECE",
            "title": "SENSORS LABORATORY"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "MATH/STAT 431"
        }
    },
    {
        "data": {
            "description": "Operating characteristics of power semiconductor devices such as Bipolar Junction Transistors, IGBTs, MOSFETs and Thyristors. Fundamentals of power converter circuits including dc/dc converters, phase controlled ac/dc rectifiers and dc/ac inverters. Practical issues in the design and operation of converters.",
            "id": "ECE 412",
            "parent": "ECE",
            "title": "POWER ELECTRONIC CIRCUITS"
        }
    },
    {
        "data": {
            "source": "ECE 210",
            "target": "ECE 270"
        }
    },
    {
        "data": {
            "source": "ECE 330",
            "target": "COMPSCI/ECE 533"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Light detection using photovoltaic and photoconductive detectors and phototransistors. Light generation using light emitting diodes and laser diodes. Light transmission using optical fibers. Optoisolators and optical switches. Light emitting diode and liquid crystal displays.",
            "id": "ECE 313",
            "parent": "ECE",
            "title": "OPTOELECTRONICS LAB"
        }
    },
    {
        "data": {
            "source": "ECE 411",
            "target": "ECE 511"
        }
    },
    {
        "data": {
            "source": "PHYSICS 248",
            "target": "ECE 376"
        }
    },
    {
        "data": {
            "source": "ECE 335",
            "target": "ECE 549"
        }
    },
    {
        "data": {
            "description": "Electromagnetic design concepts and application to AC machines, magnetic circuit concepts, calculation of equivalent circuit parameters of induction, synchronous and permanent magnet machines from geometric data, copper and iron loss calculations, theory and application of finite elements to electromagnetic devices.",
            "id": "ECE 713",
            "parent": "ECE",
            "title": "ELECTROMAGNETIC DESIGN OF AC MACHINES"
        }
    },
    {
        "data": {
            "description": "Sampling continuous-time signals and reconstruction of continuous-time signals from samples; spectral analysis of signals using the discrete Fourier transform; the fast Fourier transform and fast convolution methods; z-transforms; finite and infinite impulse response filter design techniques; signal flow graphs and introduction to filter implementation.",
            "id": "ECE 431",
            "parent": "ECE",
            "title": "DIGITAL SIGNAL PROCESSING"
        }
    },
    {
        "data": {
            "description": "Introduction to mathematical optimization from a modeling and solution perspective. Formulation of applications as discrete and continuous optimization problems and equilibrium models. Survey and appropriate usage of basic algorithms, data and software tools, including modeling languages and subroutine libraries.",
            "id": "COMPSCI/ECE/ISYE 524",
            "title": "INTRODUCTION TO OPTIMIZATION"
        }
    },
    {
        "data": {
            "description": "Continuation ofPHYSICS 247. Electromagnetism, circuits, optics, additional topics in modern physics; with computation.",
            "id": "PHYSICS 248",
            "parent": "PHYSICS",
            "title": "A MODERN INTRODUCTION TO PHYSICS"
        }
    },
    {
        "data": {
            "description": "Introduces reproducible data management, modeling, analysis, and statistical inference through a practical, hands-on case studies approach. Topics include the use of an integrated statistical computing environment, data wrangling, the R programming language, data graphics and visualization, random variables and concepts of probability including the binomial and normal distributions, data modeling, statistical inference in one- and two- sample settings for proportions and means, simple linear regression, and report generation using R Markdown with applications to a wide variety of data to address open-ended questions.",
            "id": "STAT 240",
            "parent": "STAT",
            "title": "DATA SCIENCE MODELING I"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for engineering students. Electricity, magnetism, light, and sound.",
            "id": "PHYSICS 202",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 213"
        }
    },
    {
        "data": {
            "description": "Mathematical representation of continuous and digital images; models of image degradation; picture enhancement, restoration, segmentation, and coding; pattern recognition, tomography.",
            "id": "COMPSCI/ECE 533",
            "title": "IMAGE PROCESSING"
        }
    },
    {
        "data": {
            "description": "Sturm-Liouville theory; Fourier series, including mean convergence; boundary value problems for linear second order partial differential equations, including separation of variables and eigenfunction expansions.",
            "id": "MATH 322",
            "parent": "MATH",
            "title": "APPLIED MATHEMATICAL ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Logic components, Boolean algebra, combinational logic analysis and synthesis, synchronous and asynchronous sequential logic analysis and design, digital subsystems, computer organization and design.",
            "id": "COMPSCI/ECE 352",
            "title": "DIGITAL SYSTEM FUNDAMENTALS"
        }
    },
    {
        "data": {
            "source": "MATH 531",
            "target": "COMPSCI/ECE 561"
        }
    },
    {
        "data": {
            "source": "COMPSCI 310",
            "target": "COMPSCI 300"
        }
    },
    {
        "data": {
            "source": "ECE 454",
            "target": "ECE 455"
        }
    },
    {
        "data": {
            "description": "Control theory is reduced to engineering practice through the analysis and design of actual systems in the laboratory. Experiments are conducted with modern servo systems using both analog and digital control. Systems identification and modern controls design are applied to motion and torque control.",
            "id": "ECE/ME 577",
            "title": "AUTOMATIC CONTROLS LABORATORY"
        }
    },
    {
        "data": {
            "description": "Techniques of integration, improper integrals, first order ordinary differential equations, sequences and series, Taylor series, vector geometry in two and three dimensions.",
            "id": "MATH 222",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 2"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "ISYE 210"
        }
    },
    {
        "data": {
            "source": "EMA 202",
            "target": "EMA 545"
        }
    },
    {
        "data": {
            "description": "Study of communication networks with focus on performance analysis. Layered network structure. Basic protocol functions such as addressing, multiplexing, routing, forwarding, flow control, error control, and congestion response.  Overview of transport, network, and link layer protocol standards.  Introduction to wireless and mobile networks.",
            "id": "ECE 537",
            "parent": "ECE",
            "title": "COMMUNICATION NETWORKS"
        }
    },
    {
        "data": {
            "description": "General considerations of linear wave phenomena; one dimensional waves; two and three dimensional waves; wave equations with constant coefficients; inhomogenous media; random media. Lagrangian and Hamiltonian formulations; asymptotic methods. Knowledge of electromagnetics [such asE C E 320orPHYSICS 321], mechanics [such asM E 340], or vibrations [such asM E 440] strongly encouraged.",
            "id": "ECE/PHYSICS 748",
            "title": "LINEAR WAVES"
        }
    },
    {
        "data": {
            "description": "Mathematical foundations of large-scale machine learning and optimization.  Focus on recent texts in machine learning, optimization, and randomized algorithms, focused on tradeoffs that are driving algorithmic design in this new discipline. These trade-offs revolve around speed of convergence, statistical accuracy, robustness, scalability, algorithmic complexity, and implementation.",
            "id": "ECE 826",
            "parent": "ECE",
            "title": "THEORETICAL FOUNDATIONS OF LARGE-SCALE MACHINE LEARNING"
        }
    },
    {
        "data": {
            "description": "Optics/photonics at nanometer and micrometer length scales, including EM waves in dielectrics and metals, computational electromagnetics, waveguides and waveguide coupling, optical resonators, basic nanofabrication techniques, thin-film interference, surface-plasmon polaritons, localized surface-plasmon resonances, applications of plasmonics, super-resolution imaging, photonic crystals, composite materials and metamaterials, metasurfaces. Knowledge of Maxwell's equation and basic ray/wave optics, as would typically be obtained from junior-level or higher electromagnetics or optics courses [such asE C E 320orE C E 434], is strongly encouraged.",
            "id": "ECE 747",
            "parent": "ECE",
            "title": "NANOPHOTONICS"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 319"
        }
    },
    {
        "data": {
            "description": "Review of basic probability. Advanced probability concepts. Random vectors; linear filtering of random processes; stationarity; power spectral densities; estimation; convergence; Markov chains; Poisson process; Wiener process. Knowledge of basic probability analysis [such asE C E 331,STAT/​MATH  431, orSTAT 311] strongly encouraged.",
            "id": "ECE 730",
            "parent": "ECE",
            "title": "PROBABILITY AND RANDOM PROCESSES"
        }
    },
    {
        "data": {
            "source": "ECE 353",
            "target": "ECE 315"
        }
    },
    {
        "data": {
            "description": "Measurements at VHF and microwave frequencies; characteristics of microwave generators, amplifiers, passive devices and detection systems; measurement of frequency, noise and simple antenna patterns; time domain reflectometry, swept frequency network and spectrum analyzer techniques; lecture and lab.",
            "id": "ECE 545",
            "parent": "ECE",
            "title": "ADVANCED MICROWAVE MEASUREMENTS FOR COMMUNICATIONS"
        }
    },
    {
        "data": {
            "source": "COMPSCI 220",
            "target": "COMPSCI/ECE/ME 539"
        }
    },
    {
        "data": {
            "description": "Digital control theory, design methodology, and techniques for controller implementation on digital computers. Advanced single and multi-axis motion generation algorithms. Multiple processor control systems. Multiple objective control systems for machinery guidance and manufacturing processes. Precision control. Knowledge of continuous and discrete time control [such asM E 447orE C E 332] is required.",
            "id": "ECE/ME 733",
            "title": "ADVANCED COMPUTER CONTROL OF MACHINES AND PROCESSES"
        }
    },
    {
        "data": {
            "source": "MATH 321",
            "target": "MATH 322"
        }
    },
    {
        "data": {
            "source": "ECE 320",
            "target": "ECE/NE 528"
        }
    },
    {
        "data": {
            "description": "Security and privacy issues in software, networks, and hardware systems. Security vulnerabilities, privacy threats, threats modeling, and mitigation strategies. Privacy issues related to user interaction with devices, online systems, and networks. In addition, a selection of more advanced topics will be covered. Possible examples include applied cryptography in the context of systems, security and privacy policies, user authentication, and cyber-physical systems. Builds on prior experiences with one or more of the following: networking, security, modern machine learning, embedded systems, and mobile computing.",
            "id": "COMPSCI/ECE 782",
            "title": "ADVANCED COMPUTER SECURITY AND PRIVACY"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "PHYSICS 247"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Waves in a cold plasma, wave-plasma interactions, waves in a hot plasma, Landau damping, cyclotron damping, magneto-hydrodynamic equilibria and instabilities, microinstabilities, introduction to nonlinear processes, and experimental applications. Basic knowledge of plasmas [such asPHYSICS/​E C E/​N E  525] and advanced electromagnetics [such asPHYSICS 721orE C E 740] strongly encouraged.",
            "id": "ECE/NE/PHYSICS 724",
            "title": "WAVES AND INSTABILITIES IN PLASMAS"
        }
    },
    {
        "data": {
            "source": "ECE 420",
            "target": "ECE 447"
        }
    },
    {
        "data": {
            "description": "Introduction to ray optics, physical optics and interference, applications of Fourier optics, absorption, dispersion, and polarization of light. Light sources, including lasers (gas, solid state, and semiconductor), modulation and detection of light.",
            "id": "ECE 434",
            "parent": "ECE",
            "title": "PHOTONICS"
        }
    },
    {
        "data": {
            "description": "Overview of MOS devices and circuits; introduction to integrated circuit fabrication; topological design of data flow and control; interactive graphics layout; circuit simulation; system timing; organizational and architectural considerations; alternative implementation approaches; design project.E C E 555or equivalent experience is strongly recommended.",
            "id": "COMPSCI/ECE 755",
            "title": "VLSI SYSTEMS DESIGN"
        }
    },
    {
        "data": {
            "source": "COMPSCI 200",
            "target": "BME/ECE 463"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "MATH 421"
        }
    },
    {
        "data": {
            "description": "An overview of modern photonic technology and an introduction to key parameters and concepts; the basic mechanisms determining the relationship between optical gain and current density, and quantum-well laser structures; physics of high-power phase-locked laser arrays or other optoelectronics devices. Knowledge of electromagnetics [such asE C E 320] and solid-state electronics [such asE C E 335] strongly encouraged.",
            "id": "ECE 741",
            "parent": "ECE",
            "title": "SEMICONDUCTOR DIODE LASERS AND OTHER OPTOELECTRONIC DEVICES"
        }
    },
    {
        "data": {
            "source": "ISYE 210",
            "target": "ISYE 521"
        }
    },
    {
        "data": {
            "source": "COMPSCI/ECE 252",
            "target": "COMPSCI/ECE 354"
        }
    },
    {
        "data": {
            "description": "Principles of mechanics, force systems, equilibrium, structures, distributed forces, moments of inertia of areas, and friction.",
            "id": "EMA 201",
            "parent": "EMA",
            "title": "STATICS"
        }
    },
    {
        "data": {
            "source": "ECE 340",
            "target": "ECE 317"
        }
    },
    {
        "data": {
            "source": "ECE 203",
            "target": "ECE 331"
        }
    },
    {
        "data": {
            "description": "Hands-on introduction to key concepts and tools underpinning robotic systems in use and development today. Intended to give students the tools to understand robotic systems, to explore robotics for their own purposes, and to pursue advanced study in the field. Students are expected to have familiarity with a high level programming language such as Python (recommended), MATLAB, Java or Julia.",
            "id": "ECE/ME 439",
            "title": "INTRODUCTION TO ROBOTICS"
        }
    },
    {
        "data": {
            "source": "STAT 324",
            "target": "ISYE 521"
        }
    },
    {
        "data": {
            "description": "Vector analysis: algebra and geometry of vectors, vector differential and integral calculus, theorems of Green, Gauss, and Stokes; complex analysis: analytic functions, complex integrals and residues, Taylor and Laurent series.",
            "id": "MATH 321",
            "parent": "MATH",
            "title": "APPLIED MATHEMATICAL ANALYSIS"
        }
    },
    {
        "data": {
            "source": "ECE 222",
            "target": "ECE 320"
        }
    },
    {
        "data": {
            "source": "PHYSICS 248",
            "target": "ECE 230"
        }
    },
    {
        "data": {
            "description": "The idealized three phase synchronous machine time domain model including saliency, time invariant form using Park's transformation, sudden short circuits and other transient conditions, reduced order models, excitation system and turbine/governor control, dynamics of multiple machine systems, transient stability and subsynchronous resonance.",
            "id": "ECE 511",
            "parent": "ECE",
            "title": "THEORY AND CONTROL OF SYNCHRONOUS MACHINES"
        }
    },
    {
        "data": {
            "source": "ECE 330",
            "target": "ECE 431"
        }
    },
    {
        "data": {
            "description": "Introduction to MEMS technology, devices and systems. Fundamentals of MEMS in fabrication, process integration, material mechanics of MEMS structures, sensors and actuators. Main topics in MEMS - microfluidics, optical MEMS, RF MEMS, BioMEMS, packaging, and CAD.",
            "id": "ECE 542",
            "parent": "ECE",
            "title": "INTRODUCTION TO MICROELECTROMECHANICAL SYSTEMS"
        }
    },
    {
        "data": {
            "source": "PHYSICS 208",
            "target": "PHYSICS 322"
        }
    },
    {
        "data": {
            "description": "An introduction to fundamental structures of computer systems and the C programming language with a focus on the low-level interrelationships and impacts on performance. Topics include the virtual address space and virtual memory, the heap and dynamic memory management, the memory hierarchy and caching, assembly language and the stack, communication and interrupts/signals, compiling and assemblers/linkers.",
            "id": "COMPSCI/ECE 354",
            "title": "MACHINE ORGANIZATION AND PROGRAMMING"
        }
    },
    {
        "data": {
            "source": "ECE 271",
            "target": "ECE 370"
        }
    },
    {
        "data": {
            "id": "EMA",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Coding theory. Codes (linear, Hamming, Golay, dual); decoding-encoding; Shannon's theorem; sphere-packing; singleton and Gilbert-Varshamov bounds; weight enumerators; MacWilliams identities; finite fields; other codes (Reed-Muller, cyclic, BCH, Reed-Solomon) and error-correction algorithms.",
            "id": "ECE/MATH 641",
            "title": "INTRODUCTION TO ERROR-CORRECTING CODES"
        }
    },
    {
        "data": {
            "description": "Hardware and software design for modern microprocessor-based embedded systems; study of the design process; emphasis on major team design project.",
            "id": "ECE 453",
            "parent": "ECE",
            "title": "EMBEDDED MICROPROCESSOR SYSTEM DESIGN"
        }
    },
    {
        "data": {
            "source": "ECE 455",
            "target": "ECE 454"
        }
    },
    {
        "data": {
            "source": "PHYSICS 208",
            "target": "PHYSICS 202"
        }
    },
    {
        "data": {
            "description": "An introduction to linear algebra and differential equations with emphasis on the relationship between the theory of linear algebra and analytical and numerical techniques for solving differential equations. Linear algebra topics include linear systems, matrices and their algebra, vector spaces and linear transformations, eigenvalues and eigenvectors. Topics from differential equations include first order ODE, homogeneous and nonhomogeneous linear systems, and numerical methods.",
            "id": "MATH 320",
            "parent": "MATH",
            "title": "LINEAR ALGEBRA AND DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "source": "PHYSICS 322",
            "target": "ECE 434"
        }
    },
    {
        "data": {
            "source": "ECE 330",
            "target": "BME/ECE 463"
        }
    },
    {
        "data": {
            "source": "ECE 203",
            "target": "ECE 436"
        }
    },
    {
        "data": {
            "source": "MATH 340",
            "target": "ECE/ME 441"
        }
    },
    {
        "data": {
            "source": "ECE 411",
            "target": "ECE 711"
        }
    },
    {
        "data": {
            "description": "This laboratory introduces the student to measurement and simulation of important operating characteristics of power electronic circuits and power semiconductor devices. Emphasis is on devices, circuits, gating methods and power quality.",
            "id": "ECE 512",
            "parent": "ECE",
            "title": "POWER ELECTRONICS LABORATORY"
        }
    },
    {
        "data": {
            "description": "Independent work on doctoral research overseen by a qualified instructor.",
            "id": "ECE 890",
            "parent": "ECE",
            "title": "PRE-DISSERTATOR'S RESEARCH"
        }
    },
    {
        "data": {
            "source": "MATH 376",
            "target": "MATH/STAT 431"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for students majoring in biological sciences. Mechanics: kinematics, statics, dynamics; energy and momentum. Heat and sound.",
            "id": "PHYSICS 207",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Descriptive statistics, probability concepts and distributions, random variables. Hypothesis tests and confidence intervals for one- and two-sample problems. Linear regression, model checking, and inference. Analysis of variance and basic ideas in experimental design. Utilizes the R programming language.",
            "id": "STAT 324",
            "parent": "STAT",
            "title": "INTRODUCTORY APPLIED STATISTICS FOR ENGINEERS"
        }
    },
    {
        "data": {
            "source": "MATH 376",
            "target": "MATH 322"
        }
    },
    {
        "data": {
            "source": "ECE 376",
            "target": "ECE 355"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "COMPSCI 400",
            "target": "ECE 537"
        }
    },
    {
        "data": {
            "source": "COMPSCI/ECE/ISYE 524",
            "target": "ISYE 521"
        }
    },
    {
        "data": {
            "source": "ECE 511",
            "target": "ECE 713"
        }
    },
    {
        "data": {
            "description": "Modelling nonlinear systems, linearization, equilibria, solution concepts, phase plane analysis, stability concepts, Lyapunov methods, oscillations, vector space methods, control system nonlinearities and design. Selected topics from the following: input-output methods, switching and variable structure systems, feedback linearization, and Lyapunov robustness. Knowledge of linear systems [such asE C E 717] strongly encouraged.",
            "id": "ECE 817",
            "parent": "ECE",
            "title": "NONLINEAR SYSTEMS"
        }
    },
    {
        "data": {
            "source": "COMPSCI 300",
            "target": "ECE 553"
        }
    },
    {
        "data": {
            "description": "Special advanced topics across Electrical and Computer Engineering. The topics covered, instructors, and prerequisites all vary with semester and with section. Particular topics typically reflect state-of-the-art ideas and research.",
            "id": "ECE 901",
            "parent": "ECE",
            "title": "SPECIAL TOPICS IN ELECTRICAL AND COMPUTER ENGINEERING"
        }
    },
    {
        "data": {
            "source": "MATH 320",
            "target": "MATH 541"
        }
    },
    {
        "data": {
            "source": "ECE 230",
            "target": "ECE 376"
        }
    },
    {
        "data": {
            "source": "ECE 356",
            "target": "ECE 411"
        }
    },
    {
        "data": {
            "source": "ME 747",
            "target": "ECE/ME 733"
        }
    },
    {
        "data": {
            "description": "Survey of topics within the department of electrical and computer engineering that introduce students to the materials/techniques to assist them in being successful graduate students. Faculty seminars spanning energy and power systems, applied physics, electromagnetic fields, plasmas, communications and signal processing, controls, photonics, solid state, and computers will be given. Additionally, students will participate in weekly group exercises to enhance their skills in engineering/technical communications, writing, ethics, and project management.",
            "id": "ECE 610",
            "parent": "ECE",
            "title": "SEMINAR IN ELECTRICAL AND COMPUTER ENGINEERING"
        }
    },
    {
        "data": {
            "source": "MATH 320",
            "target": "ECE/ME 441"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Introduction to Data Science programming using Python.  No previous programming experience required.  Emphasis on analyzing real datasets in a variety of forms and visual communication.",
            "id": "COMPSCI 220",
            "parent": "COMPSCI",
            "title": "DATA SCIENCE PROGRAMMING I"
        }
    },
    {
        "data": {
            "source": "PHYSICS 322",
            "target": "ECE/NE 528"
        }
    },
    {
        "data": {
            "source": "COMPSCI/ECE 352",
            "target": "ECE 551"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Electronic, optical and thermal properties of crystalline solids. Energy-momentum dispersion of fundamental particles and excitations in solids leading to microscopic theories of conductivity, polarizability and permeability. Influence of materials characteristics on the performance of electronic and photonic devices.",
            "id": "ECE 466",
            "parent": "ECE",
            "title": "ELECTRONICS OF SOLIDS"
        }
    },
    {
        "data": {
            "source": "ECE 551",
            "target": "ECE 554"
        }
    },
    {
        "data": {
            "source": "ECE/NE/PHYSICS 525",
            "target": "ECE/NE/PHYSICS 527"
        }
    },
    {
        "data": {
            "source": "MATH 340",
            "target": "COMPSCI/ECE 533"
        }
    },
    {
        "data": {
            "description": "Reviews basic calculations in electromagnetic engineering upon which all higher level concepts and physical model construction are based. It emphasizes quantitative calculation mastery in three spatial dimensions. Applies analysis tools from vector calculus to the calculation and prediction of electrical system properties. Examples include calculating electric and magnetic fields, electric potentials, total electric charge, and electric flux from change or current sources.",
            "id": "ECE 219",
            "parent": "ECE",
            "title": "ANALYTICAL METHODS FOR ELECTROMAGNETICS ENGINEERING"
        }
    },
    {
        "data": {
            "source": "EMA 201",
            "target": "EMA 202"
        }
    },
    {
        "data": {
            "description": "Introduction to modern statistical practice in the life sciences, using the R programming language. Topics include: exploratory data analysis, probability and random variables; one-sample testing and confidence intervals, role of assumptions, sample size determination, two-sample inference; basic ideas in experimental design, analysis of variance, linear regression, goodness-of fit; biological applications.",
            "id": "STAT 371",
            "parent": "STAT",
            "title": "INTRODUCTORY APPLIED STATISTICS FOR THE LIFE SCIENCES"
        }
    },
    {
        "data": {
            "description": "Amplitude, frequency, pulse, and pulse-code modulation. Narrow-band noise representation and signal-to-noise ratios for various modulation schemes. Pulse shaping, timing recovery, carrier synchronization, and equalization. Sampling, quantization and coding.",
            "id": "ECE 436",
            "parent": "ECE",
            "title": "COMMUNICATION SYSTEMS I"
        }
    },
    {
        "data": {
            "description": "Teaches how to explore, model, and analyze data using R. Topics include basic probability models; the central limit theorem; Monte Carlo simulation; one- and two-sample hypothesis testing; Bayesian inference; linear and logistic regression; ANOVA; the bootstrap; random forests and cross-validation. Features the analysis of real-world data sets and the communication of findings in a clear and reproducible manner within a project setting.",
            "id": "STAT 340",
            "parent": "STAT",
            "title": "DATA SCIENCE MODELING II"
        }
    },
    {
        "data": {
            "description": "Review of linear differential equations; series solution of linear differential equations; boundary value problems; Laplace transforms; possibly numerical methods and two dimensional autonomous systems.",
            "id": "MATH 319",
            "parent": "MATH",
            "title": "TECHNIQUES IN ORDINARY DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "source": "ECE 335",
            "target": "ECE 305"
        }
    },
    {
        "data": {
            "source": "MATH 213",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "description": "Embedded applications, embedded processors and multiprocessors, embedded system design and simulation, configurable/reconfigurable embedded systems, embedded compilers and tool chains, run-time systems, application design and customization, hardware and software co-design, low-power design. Knowledge of computer architecture [such as E C E  552] strongly encouraged.",
            "id": "ECE 751",
            "parent": "ECE",
            "title": "EMBEDDED COMPUTING SYSTEMS"
        }
    },
    {
        "data": {
            "source": "ECE 203",
            "target": "ECE 537"
        }
    },
    {
        "data": {
            "description": "Steady state and dynamic performance of electric machines in combination with power electronic converters. Parameter measurement, performance evaluation, design of experimental procedures for problem solving, use of digital data acquisition systems and signal processing equipment in system evaluation.",
            "id": "ECE 504",
            "parent": "ECE",
            "title": "ELECTRIC MACHINE & DRIVE SYSTEM LABORATORY"
        }
    },
    {
        "data": {
            "source": "MATH 340",
            "target": "MATH 541"
        }
    },
    {
        "data": {
            "source": "MATH/STAT 431",
            "target": "COMPSCI/ECE 561"
        }
    },
    {
        "data": {
            "source": "PHYSICS 202",
            "target": "ECE 220"
        }
    },
    {
        "data": {
            "source": "COMPSCI/ECE 354",
            "target": "COMPSCI/ECE 552"
        }
    },
    {
        "data": {
            "id": "ISYE",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Applied topics with emhasis on algebraic constructions and structures. Examples include: algebraic coding theory; codes (algebraic-geometric, convolutional, low-density-parity-check, space-time); curve and lattice based cryptography; watermarking; computer vision (face recognition, multiview geometry).",
            "id": "ECE/MATH 842",
            "title": "TOPICS IN APPLIED ALGEBRA"
        }
    },
    {
        "data": {
            "source": "COMPSCI/ECE 352",
            "target": "COMPSCI/ECE 552"
        }
    },
    {
        "data": {
            "source": "ECE 340",
            "target": "ECE 541"
        }
    },
    {
        "data": {
            "source": "ECE 420",
            "target": "ECE 536"
        }
    },
    {
        "data": {
            "source": "MATH 421",
            "target": "MATH 531"
        }
    },
    {
        "data": {
            "source": "COMPSCI 300",
            "target": "ECE 432"
        }
    },
    {
        "data": {
            "description": "The design of computer systems and components. Processor design, instruction set design, and addressing; control structures and microprogramming; memory management, caches, and memory hierarchies; and interrupts and I/O structures.E C E 551or knowledge of Verilog is recommended.",
            "id": "COMPSCI/ECE 552",
            "title": "INTRODUCTION TO COMPUTER ARCHITECTURE"
        }
    },
    {
        "data": {
            "description": "Advanced interdisciplinary introduction to qualitative and geometric methods for dissipative nonlinear dynamical systems. Local bifurcations of ordinary differential equations and maps. Chaotic attractors, horseshoes and detection of chaos.",
            "id": "CBE/ECE/MATH 777",
            "title": "NONLINEAR DYNAMICS, BIFURCATIONS AND CHAOS"
        }
    },
    {
        "data": {
            "description": "Groups, normal subgroups, Cayley's theorem, rings, ideals, homomorphisms, polynomial rings, abstract vector spaces.",
            "id": "MATH 541",
            "parent": "MATH",
            "title": "MODERN ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Gives students an introduction to computer and analytical skills to use in their subsequent course work and professional development. Discusses several methods of using computers to solve problems, including elementary programming techniques, symbolic manipulation languages, and software packages. Techniques will be illustrated using sample problems drawn from elementary engineering. Emphasis is on introduction of algorithms with the use of specific tools to illustrate the methods.",
            "id": "COMPSCI 310",
            "parent": "COMPSCI",
            "title": "PROBLEM SOLVING USING COMPUTERS"
        }
    },
    {
        "data": {
            "description": "Robotics analysis and design, focusing on the analytical fundamentals specific to robotic manipulators.  Serial chain robotic manipulator forward and inverse kinematics, differential kinematics, dynamics, trajectory generation, and controls. Builds on knowledge of high-level computational programming language such as Matlab.",
            "id": "ECE/ME 441",
            "title": "KINEMATICS, DYNAMICS, AND CONTROL OF ROBOTIC MANIPULATORS"
        }
    },
    {
        "data": {
            "description": "Vector calculus application to electrodynamics problems; potential theory; static and dynamic electric and magnetic fields; macroscopic theory of dielectric and magnetic materials; Maxwell's equations; boundary conditions; wave equation; introduction to transmission lines.",
            "id": "ECE 222",
            "parent": "ECE",
            "title": "ELECTRODYNAMICS I"
        }
    },
    {
        "data": {
            "description": "Advanced course in power electronics which provides an understanding of switching power converters. Included are DC-to-DC, AC-to-DC, DC-to-AC, and AC-to-AC converters, commutation techniques, converter control, interfacing converters with real sources and loads.",
            "id": "ECE 712",
            "parent": "ECE",
            "title": "SOLID STATE POWER CONVERSION"
        }
    },
    {
        "data": {
            "source": "ECE 330",
            "target": "ECE 334"
        }
    },
    {
        "data": {
            "description": "Faults and fault modeling, test equipment, test generation for combinational and sequential circuits, fault simulation, memory and microprocessor testing, design for testability, built-in self-test techniques, and fault location.",
            "id": "ECE 553",
            "parent": "ECE",
            "title": "TESTING AND TESTABLE DESIGN OF DIGITAL SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Ohm's law, Kirchhoff's laws, resistive circuits, nodal and mesh analysis, superposition, equivalent circuits using Thevenin and Norton Theorems, op amps and op amp circuits, capacitors and inductors in first-order circuits, sinusoidal steady state, phasors, RMS value, complex power, power factor, mutual inductance, linear and ideal transformers.",
            "id": "ECE 376",
            "parent": "ECE",
            "title": "ELECTRICAL AND ELECTRONIC CIRCUITS"
        }
    },
    {
        "data": {
            "source": "ISYE 210",
            "target": "ISYE 562"
        }
    },
    {
        "data": {
            "description": "Statistical analysis of information transmission systems. Probability of error, design of receivers for digital transmission through additive white Gaussian noise channels and bandlimited channels. Spread spectrum communication systems. Channel capacity, source and error control coding.",
            "id": "ECE 437",
            "parent": "ECE",
            "title": "COMMUNICATION SYSTEMS II"
        }
    },
    {
        "data": {
            "description": "Independent work on master's research overseen by a qualified instructor.",
            "id": "ECE 790",
            "parent": "ECE",
            "title": "MASTER'S RESEARCH"
        }
    },
    {
        "data": {
            "description": "Topics covered include axioms of probability, random variables, the most important discrete and continuous probability distributions, expectation and variance, moment generating functions, conditional probability and conditional expectations, multivariate distributions, Markov's and Chebyshev's inequalities, laws of large numbers, and the central limit theorem.",
            "id": "MATH/STAT 431",
            "title": "INTRODUCTION TO THE THEORY OF PROBABILITY"
        }
    },
    {
        "data": {
            "description": "Advanced mathematical theory and methods of machine learning. Statistical learning theory, Vapnik-Chevronenkis Theory, model selection, high-dimensional models, nonparametric methods, probabilistic analysis, optimization, learning paradigms.",
            "id": "COMPSCI/ECE/STAT 861",
            "title": "THEORETICAL FOUNDATIONS OF MACHINE LEARNING"
        }
    },
    {
        "data": {
            "description": "An overview of hardware and software solutions that enable the use of advanced computing in tackling computationally intensive Engineering problems. Hands-on learning promoted through programming assignments that leverage emerging hardware architectures and use parallel computing programming languages. Students are strongly encourage to have completed COMP SCI 367 orCOMP SCI 400or to have equivalent experience.",
            "id": "COMPSCI/ECE/EMA/EP/ME 759",
            "title": "HIGH PERFORMANCE COMPUTING FOR APPLICATIONS IN ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Terminal characteristics of electric machines, elements of speed control, voltage regulation, and applications in systems. Emphasis on the experimental approach to the solution of complex physical problems.",
            "id": "ECE 304",
            "parent": "ECE",
            "title": "ELECTRIC MACHINES LABORATORY"
        }
    },
    {
        "data": {
            "description": "Ideas and techniques for designing, developing, and modifying large software systems. Topics include software engineering processes; requirements and specifications; project team organization and management; software architectures; design patterns; testing and debugging; and cost and quality metrics and estimation. Students will work in large teams on a substantial programming project.",
            "id": "COMPSCI/ECE 506",
            "title": "SOFTWARE ENGINEERING"
        }
    },
    {
        "data": {
            "description": "The electric power industry, operation of power systems, load flow, fault calculations, economic dispatch, general technical problems of electric power networks.",
            "id": "ECE 427",
            "parent": "ECE",
            "title": "ELECTRIC POWER SYSTEMS"
        }
    },
    {
        "data": {
            "source": "ECE 355",
            "target": "ECE 304"
        }
    },
    {
        "data": {
            "source": "ECE 315",
            "target": "ECE 453"
        }
    },
    {
        "data": {
            "description": "Logic components built with transistors, rudimentary Boolean algebra, basic combinational logic design, basic synchronous sequential logic design, basic computer organization and design, introductory machine- and assembly-language programming.",
            "id": "COMPSCI/ECE 252",
            "title": "INTRODUCTION TO COMPUTER ENGINEERING"
        }
    },
    {
        "data": {
            "source": "MATH 319",
            "target": "ME 340"
        }
    },
    {
        "data": {
            "source": "ECE 427",
            "target": "ECE 714"
        }
    },
    {
        "data": {
            "description": "Time-domain response and convolution; frequency-domain response using Fourier series, Fourier transform, Laplace transform; discrete Fourier series and transform; sampling; z-transform; relationships between time and frequency descriptions of discrete and continuous signals and systems.",
            "id": "ECE 330",
            "parent": "ECE",
            "title": "SIGNALS AND SYSTEMS"
        }
    },
    {
        "data": {
            "source": "MATH 320",
            "target": "COMPSCI/ECE/ME 532"
        }
    },
    {
        "data": {
            "description": "Experiments cover electronic device characteristics, limitations and applications of operational amplifiers, and feedback circuits.",
            "id": "ECE 271",
            "parent": "ECE",
            "title": "CIRCUITS LABORATORY II"
        }
    },
    {
        "data": {
            "source": "MATH 322",
            "target": "MATH 521"
        }
    },
    {
        "data": {
            "description": "Monolithic integrated circuit fabrication; mask making, photolithography, oxidation, diffusion, junction evaluation, metallization, packaging, and testing.",
            "id": "ECE 549",
            "parent": "ECE",
            "title": "INTEGRATED CIRCUIT FABRICATION LABORATORY"
        }
    },
    {
        "data": {
            "source": "PHYSICS 247",
            "target": "PHYSICS 248"
        }
    },
    {
        "data": {
            "description": "First order differential equations, introduction to multivariable calculus and constrained optimization, infinite sequences and series, methods of approximation, and a brief introduction to probability. Models and applications from business and the social sciences.",
            "id": "MATH 213",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 2"
        }
    },
    {
        "data": {
            "description": "Introduction to architecture, operation, and application of microprocessors; microprocessor programming; address decoding; system timing; parallel, serial, and analog I/O; interrupts and direct memory access; interfacing to static and dynamic RAM; microcontrollers.",
            "id": "ECE 353",
            "parent": "ECE",
            "title": "INTRODUCTION TO MICROPROCESSOR SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Elementary aspects of Lagrange theory of fields and field quantization; Bose, Fermi and Pauli operators; interaction of fields; quantum theory of damping and fluctuations; applications to lasers, nonlinear optics, and quantum optics. Knowledge of lasers [such as PHYSICS 546] and graduate-level electromagnetics [such asE C E 740orPHYSICS 721] strongly encouraged.",
            "id": "ECE/PHYSICS 746",
            "title": "QUANTUM ELECTRONICS"
        }
    },
    {
        "data": {
            "source": "ECE 203",
            "target": "ECE 330"
        }
    },
    {
        "data": {
            "source": "ECE 420",
            "target": "ECE 547"
        }
    },
    {
        "data": {
            "description": "Processor design, computer arithmetic, pipelining, multi-operation processors, vector processors, control units, precise interrupts, main memory, cache memories, instruction set design, stack machines, busses and I/O, protection and security.  Students are strongly encouraged to have knowledge of computer architecture (e.g.,E C E/​COMP SCI  552).",
            "id": "COMPSCI/ECE 752",
            "title": "ADVANCED COMPUTER ARCHITECTURE I"
        }
    },
    {
        "data": {
            "source": "ECE 376",
            "target": "ECE 356"
        }
    },
    {
        "data": {
            "source": "ECE 230",
            "target": "ECE/ME 576"
        }
    },
    {
        "data": {
            "description": "Principles, algorithms, and industrial engineering applications of machine learning. Predictive analytics, with a focus on combining data and models to improve decision-making. Methods include: statistics, linear regression, logistic regression, regularization, over-fitting, clustering, classification and regression trees, boosting, bagging, deep learning, and neural networks. Applications areas include: healthcare, transportation, and the public sector.",
            "id": "ISYE 521",
            "parent": "ISYE",
            "title": "MACHINE LEARNING IN ACTION FOR INDUSTRIAL ENGINEERS"
        }
    },
    {
        "data": {
            "source": "COMPSCI/ECE 761",
            "target": "COMPSCI/ECE/STAT 861"
        }
    },
    {
        "data": {
            "source": "ECE 320",
            "target": "ECE 420"
        }
    },
    {
        "data": {
            "description": "Potential theory; static and dynamic electric and magnetic fields; macroscopic theory of dielectric and magnetic materials; Maxwell's equations; boundary conditions; wave equation; introduction to transmission lines.",
            "id": "ECE 220",
            "parent": "ECE",
            "title": "ELECTRODYNAMICS I"
        }
    },
    {
        "data": {
            "description": "Topics of special interest to undergrads in electrical and computer engineering.",
            "id": "ECE 379",
            "parent": "ECE",
            "title": "SPECIAL TOPICS IN ELECTRICAL AND COMPUTER ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Electrical transients due to faults and switching. Effect on power system design and operation. Traveling waves and surge protection. Computerized analysis of power transients.",
            "id": "ECE 731",
            "parent": "ECE",
            "title": "ADVANCED POWER SYSTEM ANALYSIS"
        }
    },
    {
        "data": {
            "source": "COMPSCI 310",
            "target": "COMPSCI/ECE/ME 539"
        }
    },
    {
        "data": {
            "source": "ECE 330",
            "target": "ECE 436"
        }
    },
    {
        "data": {
            "source": "ECE 412",
            "target": "ECE 712"
        }
    },
    {
        "data": {
            "source": "COMPSCI 300",
            "target": "COMPSCI/ECE/ISYE 524"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "EMA 201"
        }
    },
    {
        "data": {
            "source": "MATH 341",
            "target": "MATH 321"
        }
    },
    {
        "data": {
            "description": "Ohm's law, Kirchhoff's laws, resistive circuits, nodal and mesh analysis, superposition, equivalent circuits using Thevenin-Norton theories, op amps and op amp circuits, first-order circuits, second-order circuits, sinusoidal steady state, phasors, RMS value, complex power, power factor, mutual inductance, linear and ideal transformers, ideal filters and transfer functions.",
            "id": "ECE 230",
            "parent": "ECE",
            "title": "CIRCUIT ANALYSIS"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "ECE 203"
        }
    },
    {
        "data": {
            "source": "ECE/PHYSICS 235",
            "target": "ECE 335"
        }
    },
    {
        "data": {
            "source": "MATH 340",
            "target": "MATH 321"
        }
    },
    {
        "data": {
            "source": "PHYSICS 207",
            "target": "PHYSICS 201"
        }
    },
    {
        "data": {
            "source": "ECE 335",
            "target": "ECE 542"
        }
    },
    {
        "data": {
            "description": "An examination of the \"human side\" of data science. Issues of bias, fairness, trust, and understandability. Unique characteristics of behavioral data, such as representative sampling, human adaptation, and grouped data. Practical skills in behavioral data analytics with a focus on important conceptual, design, and ethical issues specific to behavioral data. Survey of machine learning techniques including supervised learning, unsupervised learning, reinforcement learning, deep learning, and text analysis. Methods are contextualized through engineering case studies.",
            "id": "ISYE 562",
            "parent": "ISYE",
            "title": "HUMAN FACTORS OF DATA SCIENCE AND MACHINE LEARNING"
        }
    },
    {
        "data": {
            "description": "Experiments cover Kirchhoff's laws, inductors, basic operational amplifier circuits, and frequency response.",
            "id": "ECE 270",
            "parent": "ECE",
            "title": "CIRCUITS LABORATORY I"
        }
    },
    {
        "data": {
            "source": "ECE 331",
            "target": "ECE/ISYE 570"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "ME 240"
        }
    },
    {
        "data": {
            "description": "Rectilinear and curvilinear motion of a particle; force, mass, acceleration; work, potential, and kinetic energy; impulse and momentum; kinematics of rigid bodies; moving coordinate systems with relative motion; general planar rigid body kinematics and kinetics. Applications to linkages, cams and geared systems.",
            "id": "ME 240",
            "parent": "ME",
            "title": "DYNAMICS"
        }
    },
    {
        "data": {
            "source": "PHYSICS 202",
            "target": "ECE/PHYSICS 235"
        }
    },
    {
        "data": {
            "description": "Concepts and machine learning techniques for ultrasound beamforming for image formation and reconstruction to image analysis and interpretation will be presented. Key machine learning and deep learning concepts applied to beamforming, compressed sampling, speckle reduction, segmentation, photoacoustics, and elasticity imaging will be evaluated utilizing current peer-reviewed publications.",
            "id": "BME/ECE/MEDPHYS 778",
            "title": "MACHINE LEARNING IN ULTRASOUND IMAGING"
        }
    },
    {
        "data": {
            "source": "ECE 340",
            "target": "ECE 342"
        }
    },
    {
        "data": {
            "source": "PHYSICS 322",
            "target": "ECE/NE/PHYSICS 525"
        }
    },
    {
        "data": {
            "description": "Time harmonic fields and waves in linear media with applications to radiation, guiding and scattering; wave and surface impedance and admittance concepts; duality, uniqueness, image theory, equivalence principle, induction and compensation theorems, reciprocity, Green's functions, wave functions, potential and transform theory. Knowledge of electromagnetics [such asE C E 420] strongly encouraged.",
            "id": "ECE 740",
            "parent": "ECE",
            "title": "ELECTROMAGNETIC THEORY"
        }
    },
    {
        "data": {
            "description": "Exploration of additive fabrication of thin-film electronics. Various techniques, materials, and applications of printable electronics with a key focus on mechanically flexible electronic devices. Identify the appropriate printing technology and materials to achieve desired device performance.",
            "id": "ECE/ME 576",
            "title": "PRINTED AND FLEXIBLE ELECTRONICS: MANUFACTURING, DEVICES, AND APPLICATIONS"
        }
    },
    {
        "data": {
            "description": "General considerations of nonlinear wave phenomena; nonlinear hyperbolic waves; nonlinear dispersion; nonlinear geometrical optics; Whitham's variational theory; nonlinear and parametric instabilities; solitary waves; inverse scattering method. Knowledge of electromagnetics [such asE C E 320orPHYSICS 321] or mechanics [such asM E 340] encouraged.",
            "id": "ECE/PHYSICS 848",
            "title": "NONLINEAR WAVES"
        }
    },
    {
        "data": {
            "source": "ECE 340",
            "target": "ECE 447"
        }
    },
    {
        "data": {
            "source": "MATH 375",
            "target": "MATH 321"
        }
    },
    {
        "data": {
            "description": "The theory of linear algebra with an introduction to proofs and proof writing. Topics include vector spaces, linear dependence, span, basis, linear transformations, kernel, image, inner products and inner product spaces, geometry, eigenvalues, eigenvectors, standard matrix factorizations. Other content includes basic set theory, logical operations, quantifiers, direct and indirect arguments, and induction. Differential equations [MATH 320] not covered.",
            "id": "MATH 341",
            "parent": "MATH",
            "title": "LINEAR ALGEBRA"
        }
    },
    {
        "data": {
            "source": "ECE 203",
            "target": "ECE 303"
        }
    },
    {
        "data": {
            "description": "Kinematics, force-mass-acceleration relations, work and energy, impulse and momentum, moments of inertia and mass.",
            "id": "EMA 202",
            "parent": "EMA",
            "title": "DYNAMICS"
        }
    },
    {
        "data": {
            "description": "Variational principles in optimization and optimal control, constrained control and reachability analysis, stability of optimal control, data-driven methods for optimal control. Knowledge of linear systems [such asE C E 717] strongly encouraged.",
            "id": "ECE 821",
            "parent": "ECE",
            "title": "OPTIMAL CONTROL AND VARIATIONAL METHODS"
        }
    },
    {
        "data": {
            "description": "Signals and their representation. Signal synthesis subject to constraints on peak voltage, energy, duration-bandwidth product. The theory of alternating projections onto convex sets and applications to inverse problems in signal processing: signal recovery using incomplete data, image recovery in tomography using limited views, phase retrieval in optical astronomy.",
            "id": "ECE 735",
            "parent": "ECE",
            "title": "SIGNAL SYNTHESIS AND RECOVERY TECHNIQUES"
        }
    },
    {
        "data": {
            "source": "ECE 331",
            "target": "COMPSCI/ECE 561"
        }
    },
    {
        "data": {
            "description": "Directed study projects as arranged with instructor.",
            "id": "ECE 699",
            "parent": "ECE",
            "title": "ADVANCED INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "source": "ECE 340",
            "target": "ECE 370"
        }
    },
    {
        "data": {
            "description": "Scattering matrices; symmetrical junctions; impedance and ABCD matrices; equivalent circuits. Wave propagation in periodic structures and anisotropic media; Floquet's theorem; Brillouin diagrams; Hartree harmonics; tensor permeability, conductivity, and permittivity; coupled wave equations; normal modes; applications in ferrite devices. Knowledge of advanced engineering electromagnetics [such asE C E 740] strongly encouraged.",
            "id": "ECE 744",
            "parent": "ECE",
            "title": "THEORY OF MICROWAVE CIRCUITS AND DEVICES"
        }
    },
    {
        "data": {
            "description": "Physics and properties of semiconductors, p-n junctions, metal-semiconductor contacts, homojunction and heterojunction bipolar transistor and physics, metal-oxide-semiconductor and heterostructure field-effect transistor and physics, thin-film resistors, memory devices, quantum devices.",
            "id": "ECE 445",
            "parent": "ECE",
            "title": "SEMICONDUCTOR PHYSICS AND DEVICES"
        }
    },
    {
        "data": {
            "source": "ECE 332",
            "target": "ME 747"
        }
    },
    {
        "data": {
            "source": "ECE 230",
            "target": "ECE 340"
        }
    },
    {
        "data": {
            "source": "ISYE 521",
            "target": "ECE/ISYE 570"
        }
    },
    {
        "data": {
            "description": "Emphasizes the implementation of DSP algorithms on a digital signal processor in \"real-time.\" Many of the signal processing algorithms that were used inE C E 203will be reviewed in MATLAB and then will be implemented on a floating point signal processor in \"real-time\" using the C programming language. Explore many basic digital signal processing processes in real-time. Gain the ability to create and develop your own Digital Signal Processing projects for a modern digital signal precessor using an Integrated Development Environment. Lab hardware will be provided.",
            "id": "ECE 303",
            "parent": "ECE",
            "title": "INTRODUCTION TO REAL-TIME DIGITAL SIGNAL PROCESSING"
        }
    },
    {
        "data": {
            "source": "ME 240",
            "target": "EMA 545"
        }
    },
    {
        "data": {
            "description": "Modeling of continuous systems; computer-aided solutions to systems problems; feedback control systems; stability, frequency response and transient response using root locus, frequency domain and state variable methods.",
            "id": "ECE 332",
            "parent": "ECE",
            "title": "FEEDBACK CONTROL SYSTEMS"
        }
    },
    {
        "data": {
            "source": "PHYSICS 202",
            "target": "ECE 222"
        }
    },
    {
        "data": {
            "id": "ECE",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Part of a 2-semester sequence withMATH 217; these two courses together are equivalent toMATH 114and221.",
            "id": "MATH 171",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY I"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "Basic concepts of electric drive systems. Emphasis on system analysis and application. Topics include: dc machine control, variable frequency operation of induction and synchronous machines, unbalanced operation, scaling laws, adjustable speed drives, adjustable torque drives, coupled circuit modeling of ac machines.",
            "id": "ECE 411",
            "parent": "ECE",
            "title": "INTRODUCTION TO ELECTRIC DRIVE SYSTEMS"
        }
    },
    {
        "data": {
            "source": "MATH 320",
            "target": "COMPSCI/ECE/MATH 435"
        }
    },
    {
        "data": {
            "source": "ECE 320",
            "target": "ECE/NE/PHYSICS 525"
        }
    },
    {
        "data": {
            "description": "An introduction to linear algebra. Topics include matrix algebra, linear systems of equations, vector spaces, sub-spaces, linear dependence, span, basis, rank of matrices, determinants, linear transformations, coordinate representations, kernel, range, eigenvalues and eigenvectors, diagonalization, inner products and orthogonal vectors, symmetric matrices. Covers linear algebra topics in greater depth and detail thanMATH 320. Formal techniques in mathematical argument [MATH 341] not covered.",
            "id": "MATH 340",
            "parent": "MATH",
            "title": "ELEMENTARY MATRIX AND LINEAR ALGEBRA"
        }
    },
    {
        "data": {
            "source": "ECE 203",
            "target": "ECE 437"
        }
    },
    {
        "data": {
            "source": "COMPSCI 300",
            "target": "ECE 556"
        }
    },
    {
        "data": {
            "source": "ME 746",
            "target": "ECE/ME 732"
        }
    },
    {
        "data": {
            "source": "ECE 340",
            "target": "BME/ECE 462"
        }
    },
    {
        "data": {
            "source": "PHYSICS 207",
            "target": "PHYSICS 208"
        }
    },
    {
        "data": {
            "source": "ECE 271",
            "target": "ECE 305"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "PHYSICS 248",
            "target": "ECE/PHYSICS 235"
        }
    },
    {
        "data": {
            "source": "ECE 427",
            "target": "ECE 731"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "MATH 341"
        }
    },
    {
        "data": {
            "source": "ECE 330",
            "target": "ECE 332"
        }
    },
    {
        "data": {
            "description": "A first course in modeling, characterization, and application of semiconductor devices and integrated circuits. Development of appropriate models for circuit-level behavior of diodes, bi-polar and field effect transistors, and non-ideal op-amps. Application in analysis and design of linear amplifiers. Frequency domain characterization of transistor circuits.",
            "id": "ECE 340",
            "parent": "ECE",
            "title": "ELECTRONIC CIRCUITS I"
        }
    },
    {
        "data": {
            "description": "Mathematical modeling and analysis of dynamic systems with mechanical, thermal, and fluid elements. Topics: time domain solutions, analog computer simulation, linearization techniques, block diagram representation, numerical methods and frequency domain solutions. Students are assumed to have basic competence in particle and planar rigid body dynamics, matrix and vector algebra, and linear differential equations.",
            "id": "ME 340",
            "parent": "ME",
            "title": "DYNAMIC SYSTEMS"
        }
    },
    {
        "data": {
            "source": "ECE 554",
            "target": "ECE 455"
        }
    },
    {
        "data": {
            "description": "Learn the process of incrementally developing small (200-500 lines) programs along with the fundamental Computer Science topics. These topics include: problem abstraction and decomposition, the edit-compile-run cycle, using variables of primitive and more complex data types, conditional and loop-based flow control, basic testing and debugging techniques, how to define and call functions (methods), and IO processing techniques. Also teaches and reinforces good programming practices including the use of a consistent style, and meaningful documentation. Intended for students who have no prior programming experience.",
            "id": "COMPSCI 200",
            "parent": "COMPSCI",
            "title": "PROGRAMMING I"
        }
    },
    {
        "data": {
            "description": "A focus on topics within the department of electrical and computer engineering that introduce students to the materials/techniques that will assist them in being successful graduate students. Faculty seminars spanning energy and power systems, applied physics, electromagnetic fields, plasmas, communications and signal processing, controls, photonics, solid state, and computers will be given. Additionally, students will participate in weekly group exercises to enhance their skills in engineering/technical communications, writing, ethics, and project management. Graded homework and a final project are assigned.",
            "id": "ECE 611",
            "parent": "ECE",
            "title": "INTRODUCTION TO DOCTORAL RESEARCH IN ELECTRICAL & COMPUTER ENGINEERING"
        }
    },
    {
        "data": {
            "source": "COMPSCI/ECE 352",
            "target": "ECE 553"
        }
    },
    {
        "data": {
            "description": "Parallel algorithms, principles of parallelism detection and vectorizing compilers, interconnection networks, MIMD machines, processor synchronization, data coherence, multis, dataflow machines, special purpose processors.  Students are strongly encouraged to have knowledge of computer architecture (e.g.,E C E/​COMP SCI  552).",
            "id": "COMPSCI/ECE 757",
            "title": "ADVANCED COMPUTER ARCHITECTURE II"
        }
    },
    {
        "data": {
            "source": "STAT 324",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "source": "ME 340",
            "target": "ECE/ME 441"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "description": "Energy storage and conversion, force and emf production, coupled circuit analysis of systems with both electrical and mechanical inputs. Applications to electric motors and generators and other electromechanical transducers.",
            "id": "ECE 355",
            "parent": "ECE",
            "title": "ELECTROMECHANICAL ENERGY CONVERSION"
        }
    },
    {
        "data": {
            "description": "Broad introduction to computer-aided design tools for VLSI, emphasizing implementation algorithms and data structures. Topics covered: design styles, layout editors, symbolic compaction, module generators, placement and routing, automatic synthesis, design-rule checking, circuit extraction, simulation and verification.  Students are strongly encourage to have programming skills and to  have taken a course in Digital System Fundamentals such asE C E/​COMP SCI  352.",
            "id": "COMPSCI/ECE 756",
            "title": "COMPUTER-AIDED DESIGN FOR VLSI"
        }
    },
    {
        "data": {
            "source": "ME 240",
            "target": "ME 340"
        }
    },
    {
        "data": {
            "source": "ECE 455",
            "target": "ECE 453"
        }
    },
    {
        "data": {
            "description": "Digital control theory, design methodology, and techniques for controller implementation on digital computers. Advanced single and multi-axis motion generation algorithms. Multiple processor control systems. Multiple objective control systems for machinery guidance and manufacturing processes. Precision control. Knowledge of digital control [such asM E 447] strongly encouraged.",
            "id": "ME 747",
            "parent": "ME",
            "title": "ADVANCED COMPUTER CONTROL OF MACHINES AND PROCESSES"
        }
    },
    {
        "data": {
            "source": "ECE 711",
            "target": "ECE 504"
        }
    },
    {
        "data": {
            "source": "ECE 330",
            "target": "ECE 432"
        }
    },
    {
        "data": {
            "description": "Electrostatic fields, capacitance, multi-pole expansion, dielectric theory; magnetostatics; electromagnetic induction; magnetic properties of matter; Maxwell's equations and electromagnetic waves; relativity and electromagmetism. Experiments for this course are covered in PHYSICS 308.",
            "id": "PHYSICS 322",
            "parent": "PHYSICS",
            "title": "ELECTROMAGNETIC FIELDS"
        }
    },
    {
        "data": {
            "description": "Characteristics of semiconductors; study of physical mechanisms and circuit modeling of solid state electronic and photonic devices; principles of microelectronic processing and examples of integrated circuits.",
            "id": "ECE 335",
            "parent": "ECE",
            "title": "MICROELECTRONIC DEVICES"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "STAT 340"
        }
    },
    {
        "data": {
            "source": "COMPSCI 570",
            "target": "COMPSCI/ECE 506"
        }
    },
    {
        "data": {
            "source": "ECE 330",
            "target": "ECE 427"
        }
    },
    {
        "data": {
            "source": "COMPSCI/ECE 252",
            "target": "COMPSCI/ECE 352"
        }
    },
    {
        "data": {
            "source": "COMPSCI/ECE 761",
            "target": "ECE 826"
        }
    },
    {
        "data": {
            "source": "COMPSCI/ECE 552",
            "target": "ECE 554"
        }
    },
    {
        "data": {
            "description": "Continuation ofPHYSICS 207: calculus-based introduction to physics intended for students majoring in biological sciences. Electricity, magnetism, light, and modern physics.",
            "id": "PHYSICS 208",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Current topics in plasma physics.",
            "id": "ECE/NE/PHYSICS 922",
            "title": "SEMINAR IN PLASMA PHYSICS"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "source": "PHYSICS 248",
            "target": "PHYSICS 322"
        }
    },
    {
        "data": {
            "description": "Introduction to probability, random variables, and random processes. Confidence intervals, introduction to experimental design and hypothesis testing. Statistical averages, correlation, and spectral analysis for wide sense stationary processes. Random signals and noise in linear systems.",
            "id": "ECE 331",
            "parent": "ECE",
            "title": "INTRODUCTION TO RANDOM SIGNAL ANALYSIS AND STATISTICS"
        }
    },
    {
        "data": {
            "description": "Implementation of digital signal processing algorithms on special-purpose and general-purpose hardware. Use of assembly and high-level languages, and simulator to develop and test IIR, FIR filters and the FFT for modern DSP chips. Scaling for fixed point arithmetic. Use of high level languages to implement real time, object oriented component based DSP systems in general purpose computers. DSP applications, including data and voice communication systems.",
            "id": "ECE 432",
            "parent": "ECE",
            "title": "DIGITAL SIGNAL PROCESSING LABORATORY"
        }
    },
    {
        "data": {
            "source": "ME 340",
            "target": "ME 446"
        }
    },
    {
        "data": {
            "description": "Applications of Maxwell's field equations to radiation problems; transmission of radio waves; radiation and impedance characteristics of various antennas and arrays. Analysis of complete antenna systems.",
            "id": "ECE 841",
            "parent": "ECE",
            "title": "ANTENNAS"
        }
    },
    {
        "data": {
            "description": "Work experience which combines classroom theory with practical knowledge of operations to provide students with a background upon which to base a professional career.",
            "id": "ECE 1",
            "parent": "ECE",
            "title": "COOPERATIVE EDUCATION PROGRAM"
        }
    },
    {
        "data": {
            "source": "MATH 541",
            "target": "ECE/MATH 641"
        }
    },
    {
        "data": {
            "description": "Principles of plane and spherical sound waves; acoustical, mechanical, and electrical analogies; electroacoustic transducer materials and techniques; specific types of transducers such as microphones and loudspeakers.",
            "id": "ECE 401",
            "parent": "ECE",
            "title": "ELECTRO-ACOUSTICAL ENGINEERING"
        }
    },
    {
        "data": {
            "source": "MATH 376",
            "target": "MATH 521"
        }
    },
    {
        "data": {
            "source": "ECE 335",
            "target": "ECE 536"
        }
    },
    {
        "data": {
            "description": "Use of digital computers to simulate, partition, place and interconnect digital electronic systems.",
            "id": "ECE 556",
            "parent": "ECE",
            "title": "DESIGN AUTOMATION OF DIGITAL SYSTEMS"
        }
    },
    {
        "data": {
            "source": "ECE 453",
            "target": "ECE 455"
        }
    },
    {
        "data": {
            "source": "COMPSCI 310",
            "target": "COMPSCI/ECE/ISYE 524"
        }
    },
    {
        "data": {
            "source": "STAT 240",
            "target": "STAT 340"
        }
    },
    {
        "data": {
            "description": "Theory and applications of artificial neural networks: multi-layer perceptron, self-organization mapdeep neural network convolutional neural network, recurrent network, support vector machines genetic algorithm, and evolution computing. Applications to control, pattern recognition, prediction, and object detection and tracking.",
            "id": "COMPSCI/ECE/ME 539",
            "title": "INTRODUCTION TO ARTIFICIAL NEURAL NETWORKS"
        }
    },
    {
        "data": {
            "source": "MATH 376",
            "target": "ECE 219"
        }
    },
    {
        "data": {
            "source": "ECE 434",
            "target": "ECE 536"
        }
    },
    {
        "data": {
            "source": "PHYSICS 248",
            "target": "ECE 377"
        }
    },
    {
        "data": {
            "description": "Individual or team project to gain hands-on-experience applying machine learning and signal processing concepts.",
            "id": "ECE 697",
            "parent": "ECE",
            "title": "CAPSTONE PROJECT IN MACHINE LEARNING AND SIGNAL PROCESSING"
        }
    },
    {
        "data": {
            "description": "Design and application of electrodes, biopotential amplifiers, biosensors, therapeutic devices. Medical imaging. Electrical safety. Measurement of ventilation, blood pressure and flow.",
            "id": "BME/ECE 462",
            "title": "MEDICAL INSTRUMENTATION"
        }
    },
    {
        "data": {
            "description": "Principles of magnetic confinement and heating of plasmas for controlled thermonuclear fusion: magnetic field structures, single particle orbits, equilibrium, stability, collisions, transport, heating, modeling and diagnostics. Discussion of current leading confinement concepts: tokamaks, tandem mirrors, stellarators, reversed field pinches, etc.",
            "id": "ECE/NE/PHYSICS 527",
            "title": "PLASMA CONFINEMENT AND HEATING"
        }
    },
    {
        "data": {
            "description": "Apply electrical and computer engineering knowledge and skills acquired to real-world electrical and computer engineering design projects.",
            "id": "ECE 455",
            "parent": "ECE",
            "title": "CAPSTONE DESIGN IN ELECTRICAL AND COMPUTER ENGINEERING"
        }
    },
    {
        "data": {
            "source": "ECE 335",
            "target": "ECE 445"
        }
    },
    {
        "data": {
            "source": "COMPSCI/ECE 352",
            "target": "ECE 556"
        }
    },
    {
        "data": {
            "source": "ECE 305",
            "target": "ECE 466"
        }
    },
    {
        "data": {
            "description": "Introduction to basic probability and statistical tools and methods from an industrial application perspective. Random variables and probability distributions; descriptive statistics; point estimates. Perform hypothesis testing, construct confidence intervals, and understand design of experiments in the context of motivating case studies. Regression and correlation analysis. Focus on applying statistical methods and tools to solve engineering problems. Use of Microsoft Excel to interpret and analyze data.",
            "id": "ISYE 210",
            "parent": "ISYE",
            "title": "INTRODUCTION TO INDUSTRIAL STATISTICS"
        }
    },
    {
        "data": {
            "description": "Power electronic application to utility systems is a rapidly growing field with major impact on the industry. Covers material on HVDC transmission, energy storage systems, renewable sources, static compensators, and flexible ac transmission systems.",
            "id": "ECE 714",
            "parent": "ECE",
            "title": "UTILITY APPLICATION OF POWER ELECTRONICS"
        }
    },
    {
        "data": {
            "source": "COMPSCI/ECE 352",
            "target": "ECE 555"
        }
    },
    {
        "data": {
            "description": "Fundamentals of image analysis and computer vision; image acquisition and geometry; image enhancement; recovery of physical scene characteristics; shape-from techniques; segmentation and perceptual organization; representation and description of two-dimensional objects; shape analysis; texture analysis; goal-directed and model-based systems; parallel algorithms and special-purpose architectures. Students are strongly encouraged to have basic proficiency in calculus and linear algebra, such asMATH 340, and basic programming such asCOMP SCI 300.",
            "id": "COMPSCI/ECE 766",
            "title": "COMPUTER VISION"
        }
    },
    {
        "data": {
            "source": "ECE 447",
            "target": "ECE 547"
        }
    },
    {
        "data": {
            "description": "Computational imaging includes all imaging methods that produce images as a result of computation on collected signals. Learn the tools to design new computational imaging methods to solve specific imaging problems. Provides an understanding of the physics of light propagation and measurement, and the computational tools to model it, including wave propagation, ray tracing, the radon transform, and linear algebra using matrix and integral operators and the computational tools to reconstruct an image, including linear inverse problems, neural networks, convex optimization, and filtered back-projection. Covers a variety of example computational imaging techniques and their applications including coded apertures, structured illumination, digital holography, computed tomography, imaging through scattering media, compressed sensing, and non-line-of-sight imaging.",
            "id": "BMI/COMPSCI/ECE/MEDPHYS 722",
            "title": "COMPUTATIONAL OPTICS AND IMAGING"
        }
    },
    {
        "data": {
            "source": "ECE 222",
            "target": "ECE 335"
        }
    },
    {
        "data": {
            "source": "ECE 335",
            "target": "ECE 548"
        }
    },
    {
        "data": {
            "description": "Design and implementation of protocols, systems, and applications for mobile and wireless networking, particularly at the media access control, network, transport, and application layers. Focus is on the unique problems and challenges presented by the properties of wireless transmission, various device constraints such as limited battery power, and node mobility. Knower of computer networking is strongly encouraged, such as fromCOMP SCI 640orE C E 537.",
            "id": "COMPSCI/ECE 707",
            "title": "MOBILE AND WIRELESS NETWORKING"
        }
    },
    {
        "data": {
            "source": "ECE 219",
            "target": "ECE 220"
        }
    },
    {
        "data": {
            "source": "MATH 340",
            "target": "COMPSCI/ECE/ME 532"
        }
    },
    {
        "data": {
            "description": "Topics in multi-variable calculus and introduction to differential equations.",
            "id": "MATH 376",
            "parent": "MATH",
            "title": "TOPICS IN MULTI-VARIABLE CALCULUS AND DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "source": "ECE 340",
            "target": "ECE 542"
        }
    },
    {
        "data": {
            "description": "Software and hardware experiments with a microcomputer system. Assembly language programming, simple input/output interfacing, and interrupt processing in microcomputer systems.",
            "id": "ECE 315",
            "parent": "ECE",
            "title": "INTRODUCTORY MICROPROCESSOR LABORATORY"
        }
    },
    {
        "data": {
            "source": "ECE 330",
            "target": "ECE 437"
        }
    },
    {
        "data": {
            "source": "MATH 320",
            "target": "COMPSCI/ECE/ISYE 524"
        }
    },
    {
        "data": {
            "source": "MATH 341",
            "target": "COMPSCI/ECE/ME 532"
        }
    },
    {
        "data": {
            "description": "Directed study projects as arranged with instructor.",
            "id": "ECE 399",
            "parent": "ECE",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Fundamental theory and recent advances in coherent radiation charged particle beam sources (microwave to X-ray wavelengths) including free electron lasers, wiggler/wave-particle dynamics, Cerenkov masers, gyrotrons, coherent gain and efficiency, spontaneous emission, beam sources and quality, related accelerator concepts experimental results and applications.",
            "id": "ECE/NE/PHYSICS 749",
            "title": "COHERENT GENERATION AND PARTICLE BEAMS"
        }
    },
    {
        "data": {
            "description": "Introduction to ethical issues in data engineering and principled solutions. Algorithmic fairness (individual fairness, group fairness, counterfactual fairness), differential privacy and its applications, and robustness.",
            "id": "ECE/ISYE 570",
            "title": "ETHICS OF DATA FOR ENGINEERS"
        }
    },
    {
        "data": {
            "source": "MATH 341",
            "target": "COMPSCI/ECE/MATH 435"
        }
    },
    {
        "data": {
            "source": "ECE 335",
            "target": "ECE 466"
        }
    },
    {
        "data": {
            "description": "Independent work on dissertation overseen by a qualified instructor.",
            "id": "ECE 990",
            "parent": "ECE",
            "title": "DISSERTATOR'S RESEARCH"
        }
    },
    {
        "data": {
            "source": "ECE 271",
            "target": "ECE 317"
        }
    },
    {
        "data": {
            "description": "Fault modeling, redundancy techniques and reliability evaluation, error detecting and correcting codes, self-checking circuits, fault diagnosis, software fault tolerance, and case studies. Knowledge of probability [such asE C E 431] and computer architecture [such asE C E/​COMP SCI  552] strongly encouraged.",
            "id": "ECE 753",
            "parent": "ECE",
            "title": "FAULT-TOLERANT COMPUTING"
        }
    },
    {
        "data": {
            "description": "Introduction to electrical power processing technologies that are necessary to convert energy from alternative sources into useful electrical forms. Several specific alternative energy sources are examined, providing platforms for introducing basic concepts in power electronics, electric machines, and adjustable-speed drives.",
            "id": "ECE 356",
            "parent": "ECE",
            "title": "ELECTRIC POWER PROCESSING FOR ALTERNATIVE ENERGY SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Cryptography is the art and science of transmitting digital information in a secure manner. Provides an introduction to its technical aspects.",
            "id": "COMPSCI/ECE/MATH 435",
            "title": "INTRODUCTION TO CRYPTOGRAPHY"
        }
    },
    {
        "data": {
            "source": "COMPSCI 300",
            "target": "COMPSCI/ECE 354"
        }
    },
    {
        "data": {
            "description": "Undergraduate honors research projects supervised by faculty members.",
            "id": "ECE 489",
            "parent": "ECE",
            "title": "HONORS IN RESEARCH"
        }
    },
    {
        "data": {
            "description": "Vector spaces and linear transformations, differential calculus of scalar and vector fields, determinants, eigenvalues and eigenvectors, multiple integrals, line integrals, and surface integrals. Freshmen students are invited to enroll by the Department of Mathematics.",
            "id": "MATH 375",
            "parent": "MATH",
            "title": "TOPICS IN MULTI-VARIABLE CALCULUS AND LINEAR ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Directed study projects as arranged with instructor.",
            "id": "ECE 999",
            "parent": "ECE",
            "title": "ADVANCED INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Characteristics of semiconductors; study of physical mechanisms and modeling of solid state electronic and photonic devices; principles of optoelectronic processing and examples of integrated optoelectronics.",
            "id": "ECE 536",
            "parent": "ECE",
            "title": "INTEGRATED OPTICS AND OPTOELECTRONICS"
        }
    },
    {
        "data": {
            "source": "MATH 421",
            "target": "MATH 521"
        }
    },
    {
        "data": {
            "source": "ECE 230",
            "target": "ECE 355"
        }
    },
    {
        "data": {
            "description": "End-to-end project management; teamwork; fundamentals of disciplined development practices; introduction to mobile computing platforms and systems; design, implementation, and deployment of mobile systems and applications.",
            "id": "ECE 454",
            "parent": "ECE",
            "title": "MOBILE COMPUTING LABORATORY"
        }
    },
    {
        "data": {
            "source": "COMPSCI 300",
            "target": "BME/ECE 463"
        }
    },
    {
        "data": {
            "source": "STAT 371",
            "target": "STAT 324"
        }
    },
    {
        "data": {
            "source": "COMPSCI/ECE 252",
            "target": "COMPSCI 300"
        }
    },
    {
        "data": {
            "description": "Transmission lines: frequency domain analysis of radio frequency and microwave transmission circuits including power relations and graphical and computer methods. Electromagnetic waves: planar optical components, pulse dispersion, phase front considerations for optical components, conducting waveguides, dielectric waveguides. Radiation: retarded potentials, elemental dipoles, radiating antenna characterization, receiving mode.",
            "id": "ECE 420",
            "parent": "ECE",
            "title": "ELECTROMAGNETIC WAVE TRANSMISSION"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 340"
        }
    },
    {
        "data": {
            "source": "MATH 376",
            "target": "PHYSICS 248"
        }
    },
    {
        "data": {
            "description": "Single-mode diode lasers and amplifiers and their applications; an in-depth treatment of the four basic types of high-power coherent diodes: phase-locked arrays, master-oscillator power amplifiers, unstable resonators, and external-cavity-controlled resonators. Knowledge of electromagnetics [such asE C E 320] and solid-state electronics [such asE C E 335] strongly encouraged.",
            "id": "ECE 743",
            "parent": "ECE",
            "title": "HIGH-POWER DIODE LASERS AND AMPLIFIERS"
        }
    },
    {
        "data": {
            "description": "Computational techniques for solving differential and integral equations that govern static, frequency-domain, and time-domain electromagnetic field phenomena. Applications of the finite-difference time-domain method, finite-element method, and method of moments to practical electromagnetics engineering problems. Knowledge of high-level programming language like MATLAB strongly encouraged. Knowledge of electromagnetics [such asE C E 320] strongly encouraged.",
            "id": "ECE 742",
            "parent": "ECE",
            "title": "COMPUTATIONAL METHODS IN ELECTROMAGNETICS"
        }
    },
    {
        "data": {
            "source": "COMPSCI 200",
            "target": "COMPSCI 300"
        }
    },
    {
        "data": {
            "description": "Physical principles underlying the action of semiconductor devices, chemical bonding and energy band structure, Boltzmann transport theory, optical and high frequency effects, diffusion and drift, interfaces, properties of elemental and compound semiconductors.",
            "id": "ECE 745",
            "parent": "ECE",
            "title": "SOLID STATE ELECTRONICS"
        }
    },
    {
        "data": {
            "description": "Covers material in first and second semester calculus but it is intended to teach math majors to write and understand proofs in mathematics in general and in calculus in particular.",
            "id": "MATH 421",
            "parent": "MATH",
            "title": "THE THEORY OF SINGLE VARIABLE CALCULUS"
        }
    },
    {
        "data": {
            "description": "Principles underlying the design of r.f. and microwave communications circuits. Analysis and design of wideband nonlinear power amplifiers, S-parameter techniques for r.f. active circuit design, computer aided design techniques, r.f. integrated circuits, fundamentals of low noise r.f. design.",
            "id": "ECE 547",
            "parent": "ECE",
            "title": "ADVANCED COMMUNICATIONS CIRCUIT DESIGN"
        }
    },
    {
        "data": {
            "source": "ISYE 562",
            "target": "ECE/ISYE 570"
        }
    },
    {
        "data": {
            "description": "Introduction to the use of hardware description languages and automated synthesis in design. Advanced design principles. Verilog and VHDL description languages. Synthesis from hardware description languages. Timing-oriented synthesis. Relation of integrated circuit layout to timing-oriented design. Design for reuse.",
            "id": "ECE 551",
            "parent": "ECE",
            "title": "DIGITAL SYSTEM DESIGN AND SYNTHESIS"
        }
    },
    {
        "data": {
            "description": "A second course in modeling and application of semiconductor devices and integrated circuits. Advanced transistor amplifier analysis, including feedback effects. Design for power amplifiers, op-amps, analog filters, oscillators, A/D and D/A converters, and power converters. Introduction to transistor level design of CMOS digital circuits.",
            "id": "ECE 342",
            "parent": "ECE",
            "title": "ELECTRONIC CIRCUITS II"
        }
    },
    {
        "data": {
            "source": "ECE 740",
            "target": "ECE/NE/PHYSICS 749"
        }
    },
    {
        "data": {
            "source": "ECE 376",
            "target": "ECE/ME 576"
        }
    },
    {
        "data": {
            "source": "ECE 740",
            "target": "ECE 841"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "COMPSCI 310"
        }
    },
    {
        "data": {
            "description": "Principles of power converters, two axis models of AC machines and AC drives, simulation of drive systems, analytical modeling of drives, dynamic behavior of induction and synchronous motors and drive systems. Knowledge of Simulink required.",
            "id": "ECE 711",
            "parent": "ECE",
            "title": "DYNAMICS AND CONTROL OF AC DRIVES"
        }
    },
    {
        "data": {
            "source": "EMA 201",
            "target": "ME 240"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ECE 342",
            "target": "ECE 412"
        }
    },
    {
        "data": {
            "description": "Introduction to basic understanding and techniques. Plasma processing of materials for semiconductors, polymers, plasma spray coatings, ion implantation, etching, arcs, extractive metallurgy and welding. Plasma and materials diagnostics.",
            "id": "ECE/NE 528",
            "title": "PLASMA PROCESSING AND TECHNOLOGY"
        }
    },
    {
        "data": {
            "source": "ECE 447",
            "target": "ECE 545"
        }
    },
    {
        "data": {
            "description": "Advanced topics in the mathematical foundations of data science",
            "id": "ECE/MATH/STAT 888",
            "title": "TOPICS IN MATHEMATICAL DATA SCIENCE"
        }
    },
    {
        "data": {
            "description": "Engineering design projects supervised by faculty members.",
            "id": "ECE 491",
            "parent": "ECE",
            "title": "SENIOR DESIGN PROJECT"
        }
    },
    {
        "data": {
            "id": "STAT",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Analysis, design and applications of modern analog circuits using integrated bipolar and field-effect transistor technologies. Provides the student with a working knowledge of the basic circuits used in modern analog integrated circuits and techniques for analysis and design.",
            "id": "ECE 541",
            "parent": "ECE",
            "title": "ANALOG MOS INTEGRATED CIRCUIT DESIGN"
        }
    },
    {
        "data": {
            "id": "COMPSCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ECE 355",
            "target": "ECE 411"
        }
    },
    {
        "data": {
            "description": "Study of microprocessor-based medical instrumentation. Emphasis on real-time analysis of electrocardiograms. Labs and programming project involve design of biomedical digital signal processing algorithms. Knowledge of computer programming language like C, C++ or Java, strongly encouraged.",
            "id": "BME/ECE 463",
            "title": "COMPUTERS IN MEDICINE"
        }
    },
    {
        "data": {
            "description": "Analysis with design problems of electronic communications circuits. Emphasis on the nonlinear effects of large-signal operation of active devices. Complete design of r.f. oscillator, amplifier, and mixer circuits.",
            "id": "ECE 447",
            "parent": "ECE",
            "title": "APPLIED COMMUNICATIONS SYSTEMS"
        }
    },
    {
        "data": {
            "source": "ECE 271",
            "target": "ECE 313"
        }
    },
    {
        "data": {
            "description": "Practical aspects of computer system design. Design, construction, and testing of significant digital subsystems. Design, construction, and programming of pipelined digital computers.",
            "id": "ECE 554",
            "parent": "ECE",
            "title": "DIGITAL ENGINEERING LABORATORY"
        }
    },
    {
        "data": {
            "description": "Experiments related to the required core material.",
            "id": "ECE 370",
            "parent": "ECE",
            "title": "ADVANCED LABORATORY"
        }
    },
    {
        "data": {
            "description": "Introduction to the unique issues in the design and analysis of computer systems for real-time applications. Hardware and software support for guaranteeing timeliness with and without failures. Resource management, time-constrained communication, scheduling and imprecise computations, real-time kernels and case studies.  Students are strongly encouraged to have knowledge of computer architecture (e.g.,E C E/​COMP SCI  552) and operating system functions (e.g.,COMP SCI 537)",
            "id": "COMPSCI/ECE 750",
            "title": "REAL-TIME COMPUTING SYSTEMS"
        }
    },
    {
        "data": {
            "source": "MATH 341",
            "target": "MATH 541"
        }
    },
    {
        "data": {
            "description": "Linear algebraic foundations of machine learning featuring real-world applications of matrix methods from classification and clustering to denoising and data analysis. Mathematical topics include: linear equations, regression, regularization, the singular value decomposition, and iterative algorithms. Machine learning topics include: the lasso, support vector machines, kernel methods, clustering, dictionary learning, neural networks, and deep learning. Previous exposure to numerical computing (e.g. Matlab, Python, Julia, R) required.",
            "id": "COMPSCI/ECE/ME 532",
            "title": "MATRIX METHODS IN MACHINE LEARNING"
        }
    },
    {
        "data": {
            "description": "Computational approaches to learning: including inductive inference, explanation-based learning, analogical learning, connectionism, and formal models. What it means to learn. Algorithms for learning. Comparison and evaluation of learning algorithms. Cognitive modeling and relevant psychological results.",
            "id": "COMPSCI/ECE 760",
            "title": "MACHINE LEARNING"
        }
    },
    {
        "data": {
            "description": "Bipolar and MOS devices in monolithic circuits. Device physics, fabrication technology. IC-design for linear and nonlinear circuitry.",
            "id": "ECE 548",
            "parent": "ECE",
            "title": "INTEGRATED CIRCUIT DESIGN"
        }
    },
    {
        "data": {
            "description": "Overview of linear feedback control analysis and design techniques for mechanical systems. Modeling of linear dynamic mechanical systems (review), derivation of their defining differential equations, and analysis of their response using both transient and frequency response techniques; Analysis and design of feedback control of mechanical systems using classical control transform techniques such as root locus and frequency response; Analysis of system robustness through evaluation of phase and gain margins and the Nyquist stability criterion. Design of feedback controllers for mechanical systems using frequency domain loop-shaping methods. Design domains, including mechanical, thermal, and fluid feedback control systems. Effects of non-ideal system characteristics commonly encountered in mechanical systems, such as compliance, delay, and actuator and sensor saturation. Builds on knowledge of high-level computational programming language such as Matlab or Simulink.",
            "id": "ME 446",
            "parent": "ME",
            "title": "INTRODUCTION TO FEEDBACK CONTROL"
        }
    },
    {
        "data": {
            "source": "COMPSCI 400",
            "target": "COMPSCI/ECE 506"
        }
    },
    {
        "data": {
            "source": "MATH 320",
            "target": "MATH 321"
        }
    },
    {
        "data": {
            "description": "An overview of the architectures and design methodologies of VLSI array processors for digital signal processing. Emphasis is placed on the techniques of mapping algorithms onto array structures for real time signal processing. Knowledge of digital signal processing [such asE C E 431] and computer architecture [such asE C E/​COMP SCI  552] strongly encouraged.",
            "id": "ECE 734",
            "parent": "ECE",
            "title": "VLSI ARRAY STRUCTURES FOR DIGITAL SIGNAL PROCESSING"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "description": "Introduction to Object-Oriented Programming using classes and objects to solve more complex problems. Introduces array-based and linked data structures: including lists, stacks, and queues. Programming assignments require writing and developing multi-class (file) programs using interfaces, generics, and exception handling to solve challenging real world problems. Topics reviewed include reading/writing data and objects from/to files and exception handling, and command line arguments. Topics introduced: object-oriented design; class vs. object; create and define interfaces and iterators; searching and sorting; abstract data types (List,Stack,Queue,PriorityQueue(Heap),Binary Search Tree); generic interfaces (parametric polymorphism); how to design and write test methods and classes; array based vs. linked node implementations; introduction to complexity analysis; recursion.",
            "id": "COMPSCI 300",
            "parent": "COMPSCI",
            "title": "PROGRAMMING II"
        }
    },
    {
        "data": {
            "description": "Analysis of systems using matrix methods to write and solve state-variable differential equations. Additional topics include stability, controllability, observability, state feedback, observers, and dynamic output feedback.",
            "id": "ECE 334",
            "parent": "ECE",
            "title": "STATE SPACE SYSTEMS ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Emphasis on obtaining equations which define the behavior of physical systems frequently subjected to control; mechanical processing, fluid power, and thermal systems; analytical, experimental, and computer techniques. Knowledge of Automatic Controls [such asM E 446or E C E 322] is required.",
            "id": "ECE/ME 732",
            "title": "DYNAMICS OF CONTROLLED SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Introduction to the signals, information, and computational techniques in electrical engineering.",
            "id": "ECE 203",
            "parent": "ECE",
            "title": "SIGNALS, INFORMATION, AND COMPUTATION"
        }
    },
    {
        "data": {
            "description": "Mathematical foundations of machine learning theory and algorithms. Probabilistic, algebraic, and geometric models and representations of data, mathematical analysis of state-of-the-art learning algorithms and optimization methods, and applications of machine learning. Knowledge of probability [such asMATH/​STAT  431orCOMP SCI/​E C E  561] and linear algebra [such asMATH 341orM E/​COMP SCI/​E C E  532] is required.",
            "id": "COMPSCI/ECE 761",
            "title": "MATHEMATICAL FOUNDATIONS OF MACHINE LEARNING"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "source": "ECE 320",
            "target": "ECE 434"
        }
    },
    {
        "data": {
            "source": "COMPSCI 300",
            "target": "COMPSCI 400"
        }
    },
    {
        "data": {
            "id": "ME",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "The third course in our programming fundamentals sequence. It presumes that students understand and use functional and object-oriented design and abstract data types as needed. This course introduces balanced search trees, graphs, graph traversal algorithms, hash tables and sets, and complexity analysis and about classes of problems that require each data type. Students are required to design and implement using high quality professional code, a medium sized program, that demonstrates knowledge and use of latest language features, tools, and conventions. Additional topics introduced will include as needed for projects: inheritance and polymorphism; anonymous inner classes, lambda functions, performance analysis to discover and optimize critical code blocks. Students learn about industry standards for code development. Students will design and implement a medium size project with a more advanced user-interface design, such as a web or mobile application with a GUI and event- driven implementation; use of version-control software.",
            "id": "COMPSCI 400",
            "parent": "COMPSCI",
            "title": "PROGRAMMING III"
        }
    },
    {
        "data": {
            "description": "Static and dynamic electromagnetic fields; forces and work in electromechanical systems; magnetic circuits; plane wave propagation; reflection of plane waves; generalized transmission line equations; current and voltage on transmission lines; impedance transformation and matching; Smith charts.",
            "id": "ECE 320",
            "parent": "ECE",
            "title": "ELECTRODYNAMICS II"
        }
    },
    {
        "data": {
            "source": "ECE 203",
            "target": "ECE 401"
        }
    },
    {
        "data": {
            "source": "ECE 230",
            "target": "ECE 270"
        }
    }
]