[
    {
        "data": {
            "description": "Analysis of the health care industry. Markets for hospitals and physicians' care, markets for health manpower, and the role of health insurance.",
            "id": "ECON/POPHLTH/PUBAFFR 548",
            "title": "THE ECONOMICS OF HEALTH CARE"
        }
    },
    {
        "data": {
            "description": "Econometric methods, theory, and applications. Matrix algebra will be used. Topics include linear regression, least-squares estimation, inference, and hypothesis testing. Primarily for Master's level students. It is expected that students will have completed three semesters calculus (such asMATH 234) and linear algebra (such asMATH 340).",
            "id": "ECON 704",
            "parent": "ECON",
            "title": "ECONOMETRICS I"
        }
    },
    {
        "data": {
            "description": "Emphasizes current economic issues and illustrates how the economist's perspective helps understand them. Academic readings and popular books such as Freakonomics will be used to indicate the breadth and scope of questions that can be analyzed from an economic perspective.",
            "id": "ECON 100",
            "parent": "ECON",
            "title": "ECONOMIC APPROACH TO CURRENT ISSUES"
        }
    },
    {
        "data": {
            "description": "The history of China's economic reforms and development, the nature of its growth, and the fundamental institutions that underlie its transformation into an economic powerhouse.  China's integration into and impact on the world economy through trade and financial flows. Major challenges modern China faces, such as regional inequalities, environmental concerns, and the prospects for sustainable growth in the future.",
            "id": "ECON 350",
            "parent": "ECON",
            "title": "THE CHINESE ECONOMY"
        }
    },
    {
        "data": {
            "description": "A critical look at the portrayal of housing, homelessness, globalization, and economic mobility in popular media (primarily films, documentaries, and popular sociological studies), both using the discipline of economic theory and from the perspective of broader economic data.",
            "id": "ECON 340",
            "parent": "ECON",
            "title": "MICROECONOMICS IN POPULAR CULTURE"
        }
    },
    {
        "data": {
            "description": "A historico-institutional analysis of development problems in the principal Latin American countries, with attention to differentiation of national growth patterns and alternative development strategies.",
            "id": "AAE/ECON/INTLBUS 462",
            "title": "LATIN AMERICAN ECONOMIC DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "A mathematical approach to the principles and theories of national income determination, analysis of savings, consumption, investment and other aggregates in the national and international economy and relation to employment, inflation, and stabilization.",
            "id": "ECON 312",
            "parent": "ECON",
            "title": "INTERMEDIATE MACROECONOMIC THEORY - ADVANCED TREATMENT"
        }
    },
    {
        "data": {
            "description": "A mathematical approach to the study of aggregate output determination, including analysis of consumption, labor markets, economic growth, and business cycles. Analysis of fiscal and monetary policies and their interactions. It is expected that students will have completed three semesters calculus (such asMATH 234) and linear algebra (such asMATH 340).",
            "id": "ECON 702",
            "parent": "ECON",
            "title": "MACROECONOMICS I"
        }
    },
    {
        "data": {
            "description": "A mathematical approach to the theory of consumption, production, pricing and resource allocation.",
            "id": "ECON 311",
            "parent": "ECON",
            "title": "INTERMEDIATE MICROECONOMIC THEORY - ADVANCED TREATMENT"
        }
    },
    {
        "data": {
            "description": "A review of theories of the firm, oligopoly, and imperfect competition. Includes applications of economic theory and game theory to agency theory, product diversity, technological change, and strategic behavior by firms--among other problems.",
            "id": "ECON 761",
            "parent": "ECON",
            "title": "INDUSTRIAL ORGANIZATION THEORY"
        }
    },
    {
        "data": {
            "description": "A study of measurement in industrial organization and a survey of empirical tests of hypotheses in the field. The theory and practice of antitrust is also covered. Each student will produce an original piece of research.",
            "id": "ECON 762",
            "parent": "ECON",
            "title": "EMPIRICAL ANALYSIS OF INDUSTRIAL ORGANIZATION AND PUBLIC POLICY"
        }
    },
    {
        "data": {
            "description": "A survey of mathematical techniques used in economic analysis. Linear algebra and optimization techniques are emphasized.",
            "id": "ECON 703",
            "parent": "ECON",
            "title": "MATHEMATICAL ECONOMICS I"
        }
    },
    {
        "data": {
            "description": "Addresses current issues in modern macroeconomic policymaking. Topics include: fiscal and monetary policy, financial and sovereign debt crisis, and financial regulation.",
            "id": "ECON 442",
            "parent": "ECON",
            "title": "MACROECONOMIC POLICY"
        }
    },
    {
        "data": {
            "description": "Advanced appraisal of theory and institutions of the financial system, monetary theory, the credit system and financial intermediaries.",
            "id": "ECON 735",
            "parent": "ECON",
            "title": "MONETARY AND FINANCIAL THEORY"
        }
    },
    {
        "data": {
            "description": "Advanced econometric theory.",
            "id": "ECON 716",
            "parent": "ECON",
            "title": "ECONOMETRIC METHODS"
        }
    },
    {
        "data": {
            "description": "Advanced public finance problems and literature, research; subject changes each semester; may be repeated. Modules.",
            "id": "ECON/URBRPL 845",
            "title": "ADVANCED TOPICS IN PUBLIC FINANCE"
        }
    },
    {
        "data": {
            "description": "Algebraic and geometric modeling of open macroeconomics with unbalanced trade and payments, focussing analytically on the foreign exchange market and the determinants of the exchange rate.",
            "id": "ECON 872",
            "parent": "ECON",
            "title": "ADVANCED INTERNATIONAL ECONOMICS"
        }
    },
    {
        "data": {
            "description": "An analysis of the U.S. financial system, its responsiveness to and impact on economic activity and policy, its procedures for assessing and pricing risks on various financial instruments, and its role in the allocation of funds to different sectors in the economy.",
            "id": "FINANCE 305",
            "parent": "FINANCE",
            "title": "FINANCIAL MARKETS, INSTITUTIONS AND ECONOMIC ACTIVITY"
        }
    },
    {
        "data": {
            "description": "An examination of the economics behind major professional and intercollegiate sports teams and franchises. Topics covered include the organization of leagues, competitive balance, cooperative and collusive behavior, measurement of productivity, the market for franchises, sale and resale of tickets, and public financing of facilities.",
            "id": "ECON 321",
            "parent": "ECON",
            "title": "SPORTS ECONOMICS"
        }
    },
    {
        "data": {
            "description": "An examination of the use of laboratory or field experiments to examine questions of interest to economists.  How to design economic experiments and understand their results.  Understanding answers to key questions about economic policy, development economics, learning in uncertain situations, behavior in markets, market design, auctions, finance, altruism and selfishness, bargaining, and many other topics, as well as the processes that produced these answers, using principles from statistical models, survey design, game theory, understanding of incentives, and behavioral economics.",
            "id": "ECON 535",
            "parent": "ECON",
            "title": "EXPERIMENTAL ECONOMICS"
        }
    },
    {
        "data": {
            "description": "An introduction to applied econometrics - the statistical methods economists use to evaluate empirical relationships and test economic theory. Emphasis on application of econometrics to real world data using modern statistical software and developing skills needed to understand empirical work in economics.",
            "id": "ECON 400",
            "parent": "ECON",
            "title": "INTRODUCTION TO APPLIED ECONOMETRICS"
        }
    },
    {
        "data": {
            "description": "An introduction to regression with emphasis on the practical aspects. Topics include: straight-line model, role of assumptions, residual analysis, transformations, multiple regression (with some use of matrix notation), multicollinearity, subset selection, and a brief introduction to mixed models.",
            "id": "STAT 333",
            "parent": "STAT",
            "title": "APPLIED REGRESSION ANALYSIS"
        }
    },
    {
        "data": {
            "description": "An investigation into the various ways that markets determine the allocation of scarce resources: via a single market-clearing price, waiting in line or other forms of rationing, search, a centralized matching algorithm, an auction, or a contest.  We will examine real-world examples of each type of market, and introduce and solve a formal theoretical model of each to see what insights it leads to.",
            "id": "ECON 621",
            "parent": "ECON",
            "title": "MARKETS AND MODELS"
        }
    },
    {
        "data": {
            "description": "An overview of the theory of industrial organization, including the study of oligopolistic behavior, monopolistic competition, product differentiation and the dynamic behavior of competitive industries under uncertainty.",
            "id": "ECON 468",
            "parent": "ECON",
            "title": "INDUSTRIAL ORGANIZATION AND IMPERFECT COMPETITION"
        }
    },
    {
        "data": {
            "description": "An understanding of the commonly used statistical language R. Topics will include using R to manipulate data and perform exploratory data analysis.",
            "id": "STAT 303",
            "parent": "STAT",
            "title": "R FOR STATISTICS I"
        }
    },
    {
        "data": {
            "description": "Analysis of competition among firms and its effect on industrial structure. Theoretical models and case studies are used. Topics include: entry barriers, price competition dynamics, entry and exit strategies, and competitive tactics such as product differentiation, advertising, and technological change.",
            "id": "ECON 458",
            "parent": "ECON",
            "title": "INDUSTRIAL STRUCTURE AND COMPETITIVE STRATEGY"
        }
    },
    {
        "data": {
            "description": "Analysis of current research in wage determination and the functioning of labor markets.",
            "id": "ECON 955",
            "parent": "ECON",
            "title": "WORKSHOP IN LABOR ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Analysis of patterns and causes of poverty and inequality. Topics include theoretical approaches, measurement, historical perspectives and policy responses.",
            "id": "ECON 370",
            "parent": "ECON",
            "title": "ECONOMICS OF POVERTY AND INEQUALITY"
        }
    },
    {
        "data": {
            "description": "Analyzes aggregate growth, income distribution and poverty in lower income economies. Uses microeconomics of imperfect labor, capital and insurance markets to explore why some individuals advance economically as their economies grow and others fall behind. Considers implications of aggregate and micro analysis for national and international economic policy.",
            "id": "AAE/ECON 474",
            "title": "ECONOMIC PROBLEMS OF DEVELOPING AREAS"
        }
    },
    {
        "data": {
            "description": "Analyzes the problems of the public sector in dealing with domestic issues of education, urban areas, welfare, natural resources, and the environment; provides students with opportunity to apply the tools of economic analysis that are pertinent to domestic public sector problems.",
            "id": "ECON 441",
            "parent": "ECON",
            "title": "ANALYTICAL PUBLIC FINANCE"
        }
    },
    {
        "data": {
            "description": "Applied cross section and panel methods.",
            "id": "ECON 717",
            "parent": "ECON",
            "title": "APPLIED ECONOMETRICS"
        }
    },
    {
        "data": {
            "description": "Applied time series methods.",
            "id": "ECON 718",
            "parent": "ECON",
            "title": "TOPICS IN APPLIED ECONOMETRICS"
        }
    },
    {
        "data": {
            "description": "Banking, credit markets and financial institutions, monetary and debt management policies; relation of national monetary and credit institutions to the international system.",
            "id": "ECON 435",
            "parent": "ECON",
            "title": "THE FINANCIAL SYSTEM"
        }
    },
    {
        "data": {
            "description": "Build fundamental skills and processes to develop a strong foundation in business analysis utilizing Excel. Learn the fundamentals of data construction, manipulation, summarization, analysis and presentation.",
            "id": "GENBUS 106",
            "parent": "GENBUS",
            "title": "FOUNDATIONAL SKILLS FOR BUSINESS ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Composition, organization, and techniques of agricultural production; economic change and development of agriculture, economic policies, special problems of developing African agriculture.",
            "id": "AAE/ECON 477",
            "title": "AGRICULTURAL AND ECONOMIC DEVELOPMENT IN AFRICA"
        }
    },
    {
        "data": {
            "description": "Concepts and techniques in corporate finance and investments. Topics include the financial environment, securities markets, financial markets, financial statements and analysis, working capital management, capital budgeting, cost of capital, dividend policy, asset valuation, investments, decision-making under uncertainty, mergers, options, and futures.",
            "id": "ECON/FINANCE 300",
            "title": "INTRODUCTION TO FINANCE"
        }
    },
    {
        "data": {
            "description": "Conditioning, distribution theory, approximation to distributions, modes of convergence, limit theorems, statistical models, parameter estimation, comparision of estimators, confidence sets, theory of hypothesis tests, introduction to Bayesian inference and nonparametric estimation.",
            "id": "STAT 610",
            "parent": "STAT",
            "title": "INTRODUCTION TO STATISTICAL INFERENCE"
        }
    },
    {
        "data": {
            "description": "Contemporary theory of International Trade, focusing on why nations trade and what do they trade, and in what sense international trade is beneficial to trading countries. Current policy issues will be examined to demonstrate the usefulness as well as the limitations of the theory.",
            "id": "ECON 464",
            "parent": "ECON",
            "title": "INTERNATIONAL TRADE"
        }
    },
    {
        "data": {
            "description": "Contemporary theory of consumption, production, pricing and resource allocation.",
            "id": "ECON 301",
            "parent": "ECON",
            "title": "INTERMEDIATE MICROECONOMIC THEORY"
        }
    },
    {
        "data": {
            "description": "Covers advanced topics in international trade and investment, including foreign direct investment, dynamic models of trade, and models of firm-level heterogeneity.",
            "id": "ECON 664",
            "parent": "ECON",
            "title": "ISSUES IN INTERNATIONAL TRADE"
        }
    },
    {
        "data": {
            "description": "Covers risks related to health and aging, rationales for social insurance programs to protect against these risks, and costs and benefits of these programs.  Broad topics include health insurance, disability insurance, and Social Security and pension policy.",
            "id": "ECON/RMI 530",
            "title": "INSURING LIFE'S RISKS: HEALTH, AGING, AND POLICY"
        }
    },
    {
        "data": {
            "description": "Covers techniques to compute and estimate structural models.  Transition from formal Econometrics, Macroeconomics and Theory training to applications.",
            "id": "ECON 880",
            "parent": "ECON",
            "title": "TOPICS IN COMPUTATIONAL ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Critical discussion of topics in the field of economic theory.",
            "id": "ECON 902",
            "parent": "ECON",
            "title": "WORKSHOP IN ECONOMIC THEORY"
        }
    },
    {
        "data": {
            "description": "Current research in econometric model building, estimation and inference in econometrics",
            "id": "ECON 913",
            "parent": "ECON",
            "title": "WORKSHOP IN ECONOMETRICS"
        }
    },
    {
        "data": {
            "description": "Current research in international trade; a wide range of topics in theory, quantitative analysis, statistics, and policy. For graduate students in their second or later years when working on theses.",
            "id": "ECON 977",
            "parent": "ECON",
            "title": "WORKSHOP IN INTERNATIONAL ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Current research on macroeconomic models, monetary theory and policy, the theory of portfolio selection, and the allocative and distributive performance of capital markets.",
            "id": "ECON 965",
            "parent": "ECON",
            "title": "WORKSHOP ON QUANTITATIVE MACRO-ECONOMIC ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Current research on the operation of markets in which individuals and firms act with imperfect information, are limited in their responses, may purchase heterogeneous commodities or factor services, and are concerned with conflicting goals.",
            "id": "ECON 903",
            "parent": "ECON",
            "title": "WORKSHOP ON INDUSTRIAL ORGANIZATION"
        }
    },
    {
        "data": {
            "description": "Descriptive statistics, probability concepts and distributions, random variables. Hypothesis tests and confidence intervals for one- and two-sample problems. Linear regression, model checking, and inference. Analysis of variance and basic ideas in experimental design. Utilizes the R programming language.",
            "id": "STAT 324",
            "parent": "STAT",
            "title": "INTRODUCTORY APPLIED STATISTICS FOR ENGINEERS"
        }
    },
    {
        "data": {
            "description": "Development of economic thought from the middle ages to the present; emphasis on major schools of thought including Classical, Marxian, Neo-Classical, and Keynesian schools.",
            "id": "ECON/HISTSCI 305",
            "title": "DEVELOPMENT OF ECONOMIC THOUGHT"
        }
    },
    {
        "data": {
            "description": "Development of quantitative intuition through practical applications and use of analysis tools. Specifically, emphasis will be on how to manage, summarize, explore, and visualize databases. The essentials of probability will be introduced and applied to decision problems where there is uncertainty. Emphasis on hypothesis testing and regression analysis and include an introduction to simulation methods. Throughout, attention will be paid to effective communication of data analysis. The use of business cases will connect the course material to both real world settings and recent advances in data analysis, including big data and data mining.",
            "id": "GENBUS 306",
            "parent": "GENBUS",
            "title": "BUSINESS ANALYTICS I"
        }
    },
    {
        "data": {
            "description": "Directed study projects for graduate students as arranged with a faculty member.",
            "id": "ECON 999",
            "parent": "ECON",
            "title": "INDEPENDENT WORK"
        }
    },
    {
        "data": {
            "description": "Distributions, measures of central tendency, dispersion and shape, the normal distribution; experiments to compare means, standard errors, confidence intervals; effects of departure from assumption; method of least squares, regression, correlation, assumptions and limitations; basic ideas of experimental design.",
            "id": "STAT 301",
            "parent": "STAT",
            "title": "INTRODUCTION TO STATISTICAL METHODS"
        }
    },
    {
        "data": {
            "description": "Econometric methods, theory, and applications. Topics include instrumental variables, GMM, panel data, limited dependent variables, time series, and vector autoregressions.",
            "id": "ECON 705",
            "parent": "ECON",
            "title": "ECONOMETRICS II"
        }
    },
    {
        "data": {
            "description": "Economic analysis of legal rules and institutions with emphases on how different areas of law influence individual incentives. Specific topics include: (1) property, (2) contracts, (3) torts, (4) legal procedure and (5) criminal law.",
            "id": "ECON 522",
            "parent": "ECON",
            "title": "LAW AND ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Economic and institutional forces which determine labor supply and demand; wage theories, wages in the economy, the labor force, unemployment, wages, labor mobility, functioning of labor markets.",
            "id": "ECON 450",
            "parent": "ECON",
            "title": "WAGES AND THE LABOR MARKET"
        }
    },
    {
        "data": {
            "description": "Economic behavior under uncertainty; measure of risk, information structure, stock market and asset pricing, insurance theory, asymmetric information and incentive mechanisms.",
            "id": "ECON 805",
            "parent": "ECON",
            "title": "ADVANCED MICROECONOMIC THEORY I"
        }
    },
    {
        "data": {
            "description": "Economic concepts and tools relating to management and use of natural resources, including pricing principles, cost-benefit analysis, equity, externalities, economic rent, renewable and nonrenewable resources, and resource policy issues.",
            "id": "AAE/ECON/F&WECOL 531",
            "title": "NATURAL RESOURCE ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Economic problems of individuals, firms and industries with emphasis on value, price, and distribution of income.",
            "id": "ECON 101",
            "parent": "ECON",
            "title": "PRINCIPLES OF MICROECONOMICS"
        }
    },
    {
        "data": {
            "description": "Economics examined from the viewpoint of the philosophy of science. Normative and positive aspects of economic theory. Deterministic and statistical explanation. Arrow impossibility theorem. Radical economics.",
            "id": "ECON/PHILOS 524",
            "title": "PHILOSOPHY AND ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Emergence of the large corporation; growth and instability since the mid-nineteenth century; increasing government participation in the economy; the impact of war, depression, discrimination, and international responsibilities.",
            "id": "ECON/HISTORY 466",
            "title": "THE AMERICAN ECONOMY SINCE 1865"
        }
    },
    {
        "data": {
            "description": "Empirical evidence documenting departures in human decision making from rational norms, and alternative theoretical approaches to explaining this behavior grounded based upon psychological enrichments of standard rational actor model. Topics include paradox of choice, loss aversion, time inconsistent preferences, and social preferences.",
            "id": "ECON 455",
            "parent": "ECON",
            "title": "BEHAVIORAL ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "Evaluates economic development strategies in Southeast Asia and their implications for growth, distribution and environment. Students learn trade and development theory as well as specific knowledge of Southeast Asian economic development.",
            "id": "AAE/ECON 473",
            "title": "ECONOMIC GROWTH AND DEVELOPMENT IN SOUTHEAST ASIA"
        }
    },
    {
        "data": {
            "description": "Examination of economic determinants of population change and demographic behavior including household formation, marriage, child bearing and rearing, mortality (especially infant) and key forms of human capital investments including schooling and migration.",
            "id": "ECON 623",
            "parent": "ECON",
            "title": "POPULATION ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Examination of major theories of regional economic development, with special emphasis upon the evolution and amelioration of regional economic problems. Selected techniques of regional analysis, including economic base multipliers, input/output models, and shift-share analysis are used in the context of setting regional development goals.",
            "id": "ECON/PUBAFFR/URBRPL 734",
            "title": "REGIONAL ECONOMIC PROBLEM ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Examines both financial and managerial accounting for business decisions. Emphasizes preparation and interpretation of financial statements, analysis of financial information, determination of costs for products and services, and use of accounting information for planning and control of business operations.",
            "id": "ACCTIS 300",
            "parent": "ACCTIS",
            "title": "ACCOUNTING PRINCIPLES"
        }
    },
    {
        "data": {
            "description": "Examines generally accepted accounting principles for measurement and reporting of financial information in a balance sheet, income statement, and statement of cash flows; introduction to analysis and interpretation of financial accounting data for decision-making purposes.",
            "id": "ACCTIS 100",
            "parent": "ACCTIS",
            "title": "INTRODUCTORY FINANCIAL ACCOUNTING"
        }
    },
    {
        "data": {
            "description": "Examines the economics of international financial markets, and how international considerations affect financial economic models. It provides an introduction to foreign exchange markets and risk; it investigates international parity conditions and foreign exchange rate determination; it studies international capital markets; it looks at the basics of international corporate finance; and, it discusses foreign currency derivatives.",
            "id": "ECON 730",
            "parent": "ECON",
            "title": "INTERNATIONAL FINANCIAL ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Examines the macroeconomics of open economies (countries that can trade goods and assets with other countries).  Takes a systematic approach to building and examining macroeconomic models of the open economy, to try to understand the determination of output and employment, trade balance, capital flows, the foreign currency exchange rate, international prices, and the role of uncertainty and asset choice.",
            "id": "ECON 661",
            "parent": "ECON",
            "title": "ISSUES IN INTERNATIONAL MACROECONOMICS"
        }
    },
    {
        "data": {
            "description": "Extensions of the linear regression model; introduction to multiple equation models.",
            "id": "ECON 710",
            "parent": "ECON",
            "title": "ECONOMIC STATISTICS AND ECONOMETRICS II"
        }
    },
    {
        "data": {
            "description": "Faculty guided honors level original research.",
            "id": "ECON 681",
            "parent": "ECON",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Faculty guided honors level original research.",
            "id": "ECON 682",
            "parent": "ECON",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Faculty guided original research.",
            "id": "ECON 691",
            "parent": "ECON",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Faculty guided original research.",
            "id": "ECON 692",
            "parent": "ECON",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "First course in a two semester sequence: commodity, money and labor markets, their components and general equilibrium; intertemporal optimization and growth theory. It is expected that students will have completed three semesters calculus (such asMATH 234) and linear algebra (such asMATH 340).",
            "id": "ECON 712",
            "parent": "ECON",
            "title": "ECONOMIC THEORY-MACROECONOMICS SEQUENCE"
        }
    },
    {
        "data": {
            "description": "First course in a two-semester sequence covering: consumer theory, producer theory, and markets under partial and general equilibrium, and with externalities or market power. The sequence will include an introduction to decision theory and game theory, and applications to auction theory and partially informed trade. It is expected that students will have completed three semesters calculus (such asMATH 234) and linear algebra (such asMATH 340).",
            "id": "ECON 701",
            "parent": "ECON",
            "title": "MICROECONOMICS I"
        }
    },
    {
        "data": {
            "description": "First course in a two-semester sequence: theories of firms, consumers, and markets; or partial and general equilibria in market and centralized economies; topics in welfare economics. It is expected that students will have completed three semesters calculus (such asMATH 234) and linear algebra (such asMATH 340).",
            "id": "ECON 711",
            "parent": "ECON",
            "title": "ECONOMIC THEORY-MICROECONOMICS SEQUENCE"
        }
    },
    {
        "data": {
            "description": "First in a two seminar sequence on critical discussion of topics in the field of economic theory.",
            "id": "ECON 901",
            "parent": "ECON",
            "title": "WORKSHOP IN MATHEMATICAL ECONOMIC THEORY"
        }
    },
    {
        "data": {
            "description": "First order differential equations, introduction to multivariable calculus and constrained optimization, infinite sequences and series, methods of approximation, and a brief introduction to probability. Models and applications from business and the social sciences.",
            "id": "MATH 213",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 2"
        }
    },
    {
        "data": {
            "description": "Focus on using econometric methods to address empirical questions, conduct empirical research, and write empirical papers in economics.",
            "id": "ECON 706",
            "parent": "ECON",
            "title": "ECONOMETRICS III"
        }
    },
    {
        "data": {
            "description": "Focuses on the behavior of international firms and the public policies that affect them. Study theoretical models of strategic competition, evaluate the effects of government policies, review aggregate empirical evidence and learn from case studies.",
            "id": "ECON 467",
            "parent": "ECON",
            "title": "INTERNATIONAL INDUSTRIAL ORGANIZATIONS"
        }
    },
    {
        "data": {
            "description": "Focuses on the study of the allocation of scarce resources across space. Uses economic methods to analyze urban real  estate. Topics covered include the determinants of real estate values, the location decisions  of households and firms, land use, urban growth and agglomeration, real estate pricing, cycles, development, housing market and policies, and sustainable development.",
            "id": "ECON/REALEST/URBRPL 420",
            "title": "URBAN AND REGIONAL ECONOMICS"
        }
    },
    {
        "data": {
            "description": "General equilibrium algebraic and geometric modeling of open economies with balanced trade, and the welfare economics of international exchange and barriers thereto.",
            "id": "ECON 871",
            "parent": "ECON",
            "title": "ADVANCED INTERNATIONAL ECONOMICS"
        }
    },
    {
        "data": {
            "description": "General equilibrium analysis existence and computation of fixed points and competitive equilibrium, regular economics, core, non-competitive approach to perfect competition and monopolistic competition.",
            "id": "ECON 806",
            "parent": "ECON",
            "title": "ADVANCED MICROECONOMIC THEORY II"
        }
    },
    {
        "data": {
            "description": "Health economics issues including demand, supply and pricing, market structure, medical malpractice, technological change, value of life, role of insurance, and other aspects of uncertainty.",
            "id": "ECON/POPHLTH 848",
            "title": "HEALTH ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Historical and contemporary sources and causes of, and potential policy responses to, racial and ethnic economic inequality in the United States. Topics covered include healthcare, education, labor markets, housing and neighborhoods, wealth, and criminal justice, with a focus on aspects of the economy where there are differences in economic outcomes for racial or racial minority groups. Questions include how these differences can result from disparities in how people, markets, or policies treat or impact different groups using economic theory as a foundation, and how economists have studied and measured these differences. In light of the history and range of economic opportunity and change in some communities, particular attention is given to the African American experience.",
            "id": "ECON 325",
            "parent": "ECON",
            "title": "ECONOMICS OF RACE IN THE UNITED STATES"
        }
    },
    {
        "data": {
            "description": "Incidence of tax burdens and expenditure benefits on relative incomes; effect of taxation on microeconomic decisions relating to work effort, investment, and consumption; analysis of the stabilization, growth, and debt management policies in the context of the economy as a whole; problems in international taxation.",
            "id": "ECON 742",
            "parent": "ECON",
            "title": "THEORY OF PUBLIC FINANCE AND FISCAL POLICY"
        }
    },
    {
        "data": {
            "description": "Independent research and writing for graduate students under the supervision of a faculty member.",
            "id": "ECON 990",
            "parent": "ECON",
            "title": "THESIS"
        }
    },
    {
        "data": {
            "description": "Individual research and group discussion of public expenditure programs with attention to investment in human capital, education, training, health information, and welfare programs. Reports on research in progress by students, staff, visiting scholars.",
            "id": "ECON 968",
            "parent": "ECON",
            "title": "WORKSHOP ON PUBLIC ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Integrated treatment of macroeconomics and microeconomics (seeECON 101andECON 102). Accelerated approach to economics training, especially for Economics: Math Emphasis majors.",
            "id": "ECON 111",
            "parent": "ECON",
            "title": "PRINCIPLES OF ECONOMICS-ACCELERATED TREATMENT"
        }
    },
    {
        "data": {
            "description": "Interdisciplinary inquiry in African societies and cultures.",
            "id": "AFRICAN/ANTHRO/ECON/GEOG/HISTORY/POLISCI 983",
            "title": "INTERDEPARTMENTAL SEMINAR IN AFRICAN STUDIES TOPICS"
        }
    },
    {
        "data": {
            "description": "International macroeconomics, focusing on the international exchange of financial instruments - currencies, bonds, equities, derivatives, and more - and how decisions and policies made in one country spill over into other markets.",
            "id": "ECON 461",
            "parent": "ECON",
            "title": "INTERNATIONAL MACROECONOMICS"
        }
    },
    {
        "data": {
            "description": "Internship in economics related field. Students must be declared in the Economics major.",
            "id": "ECON 228",
            "parent": "ECON",
            "title": "INTERNSHIP ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Introduces reproducible data management, modeling, analysis, and statistical inference through a practical, hands-on case studies approach. Topics include the use of an integrated statistical computing environment, data wrangling, the R programming language, data graphics and visualization, random variables and concepts of probability including the binomial and normal distributions, data modeling, statistical inference in one- and two- sample settings for proportions and means, simple linear regression, and report generation using R Markdown with applications to a wide variety of data to address open-ended questions.",
            "id": "STAT 240",
            "parent": "STAT",
            "title": "DATA SCIENCE MODELING I"
        }
    },
    {
        "data": {
            "description": "Introduces the theory, methods, and computational procedures needed to perform advanced Bayesian data analyses. Predictive and decision-theoretic motivations including subjective probability, risk, admissibility, and exchangeability; highlights key components of Bayesian analysis (i.e., prior, likelihood, posterior, and predictive distributions) within standard parametric models and advanced hierarchical and multilevel models; demonstrates the iterative process of model specification, implementation, criticism, and revision with applied case studies; implements computational techniques (e.g., Markov chain Monte Carlo, variational inference) in modern probabilistic programming languages.",
            "id": "ECON/GENBUS/STAT 775",
            "title": "BAYESIAN STATISTICS"
        }
    },
    {
        "data": {
            "description": "Introduction to analysis of economic data. The techniques of descriptive statistics and statistical inference (hypothesis testing and estimation) as directed toward application in economic research.",
            "id": "ECON 310",
            "parent": "ECON",
            "title": "STATISTICS: MEASUREMENT IN ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Introduction to econometric analysis of financial time series. Covers linear econometric time series models, multivariate time series, volatility estimation, and estimating and testing financial econometric models.",
            "id": "ECON 724",
            "parent": "ECON",
            "title": "FINANCIAL ECONOMETRICS"
        }
    },
    {
        "data": {
            "description": "Introduction to econometric time series analysis, forecasting methods, and forecast evaluation. Covers theoretical, methodological, and applied topics, and much of the work will be hands-on data analysis.",
            "id": "ECON 460",
            "parent": "ECON",
            "title": "ECONOMIC FORECASTING"
        }
    },
    {
        "data": {
            "description": "Introduction to economic ways of thinking about a wide range of problems and issues. Topics include consumption, production, prices, markets, finance, trade, pollution, growth, farms, taxes, and development.",
            "id": "AAE 101",
            "parent": "AAE",
            "title": "INTRODUCTION TO AGRICULTURAL AND APPLIED ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Introduction to modern statistical practice in the life sciences, using the R programming language. Topics include: exploratory data analysis, probability and random variables; one-sample testing and confidence intervals, role of assumptions, sample size determination, two-sample inference; basic ideas in experimental design, analysis of variance, linear regression, goodness-of fit; biological applications.",
            "id": "STAT 371",
            "parent": "STAT",
            "title": "INTRODUCTORY APPLIED STATISTICS FOR THE LIFE SCIENCES"
        }
    },
    {
        "data": {
            "description": "Introduction to the data that underlies quantitative economic analysis. Learn how to formulate a research question, access economic data sources, conduct preliminary and formal analysis, and report findings in a professional manner.",
            "id": "ECON 570",
            "parent": "ECON",
            "title": "FUNDAMENTALS OF DATA ANALYTICS FOR ECONOMISTS"
        }
    },
    {
        "data": {
            "description": "Introduction to the fundamental concepts of economic data visualization and analysis. Develop a toolkit of skills to visualize, interpret, and communicate data. After examining the fundamentals of data visualization, emphasis is on methods using Tableau to design and develop dashboards, graphs, and charts to ease quick and accurate interpretation of economic relationships. Move beyond tabular results to display and demonstrate the findings of economic research.",
            "id": "ECON 315",
            "parent": "ECON",
            "title": "DATA VISUALIZATION FOR ECONOMISTS"
        }
    },
    {
        "data": {
            "description": "Introduction to the use of Machine Learning (ML) in economic analysis. Covers basic techniques of ML, much attention will be devoted to evaluating the use of these tools in economics. Learn how economists are integrating the tools of ML with econometric techniques in current empirical research. Gain hands on experience in using these techniques to answer traditional questions of interest to economists. Topics include (i) an in-depth discussion of the differences and similarities in goals, empirical settings and tools between ML and econometrics, (ii) supervised learning methods for regression and classification, unsupervised learning methods, large data analysis and data mining, (iii) recent methods at the intersection of ML and econometrics, designed for causal inference, optimal policy estimation, estimation of counterfactual effects. The methods are taught with an emphasis on practical application.",
            "id": "ECON 725",
            "parent": "ECON",
            "title": "MACHINE LEARNING FOR ECONOMISTS"
        }
    },
    {
        "data": {
            "description": "Introductory overview focused on the key aspects of the real estate process: developing real estate, permitting real estate, buying and selling real estate, understanding the economics of real estate, financing real estate, valuing real estate, leasing real estate, and managing real estate.",
            "id": "AAE/ECON/REALEST/URBRPL 306",
            "title": "THE REAL ESTATE PROCESS"
        }
    },
    {
        "data": {
            "description": "Macroeconomic measurement and models of aggregate demand and supply; fiscal and monetary policy for unemployment, inflation, and growth.",
            "id": "ECON 102",
            "parent": "ECON",
            "title": "PRINCIPLES OF MACROECONOMICS"
        }
    },
    {
        "data": {
            "description": "Managerial oriented, applied presentation of microeconomic theory. Quantitative emphasis with extensive homework use of spreadsheets and written executive summaries of applied economic analyses. Applications on natural resources and agricultural markets.",
            "id": "AAE/ECON 421",
            "title": "ECONOMIC DECISION ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Mathematical techniques used in economics analysis at a Master level. Topics include: proof techniques, optimization, introductory topology, functional analysis, linear algebra for microeconomists and differential equations. It is expected that students will have completed three semesters calculus (such asMATH 234) and linear algebra (such asMATH 340).",
            "id": "ECON 700",
            "parent": "ECON",
            "title": "MATHEMATICS FOR ECONOMISTS"
        }
    },
    {
        "data": {
            "description": "Microeconomic principles underlying the use of natural resources such as air, water, forests, fisheries, minerals and energy. These principles are applied in the examination of pollution control, preservation vs. development, deforestation, and other environmental issues.",
            "id": "AAE/ECON/ENVIRST 343",
            "title": "ENVIRONMENTAL ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Modern institutions, history, and controversies of international financial relations. Foreign exchange market, the Euro-currency banking system, and central bank intervention in both.",
            "id": "ECON 666",
            "parent": "ECON",
            "title": "ISSUES IN INTERNATIONAL FINANCE"
        }
    },
    {
        "data": {
            "description": "Monetary economics; the role of money in the determination of output, prices and interest rates; commercial and central banking, monetary policy, the international monetary system.",
            "id": "ECON 330",
            "parent": "ECON",
            "title": "MONEY AND BANKING"
        }
    },
    {
        "data": {
            "description": "Nonlinear econometric theory.",
            "id": "ECON 715",
            "parent": "ECON",
            "title": "ECONOMETRIC METHODS"
        }
    },
    {
        "data": {
            "description": "Organization, design, and performance of food and agricultural markets. Industrial organization; firm boundaries, contracting, and collective action; spatial, temporal, and quality dimensions of market design.",
            "id": "AAE/ECON 747",
            "title": "FRONTIERS IN AGRICULTURAL ECONOMICS 2"
        }
    },
    {
        "data": {
            "description": "Principles and theories of national income determination, analysis of savings, consumption, investment and other aggregates in the national and international economy and relation to employment, inflation and stabilization.",
            "id": "ECON 302",
            "parent": "ECON",
            "title": "INTERMEDIATE MACROECONOMIC THEORY"
        }
    },
    {
        "data": {
            "description": "Probability distributions, statistical inference; multiple linear regression; introduction to econometric methods. It is expected that students will have completed three semesters calculus (such asMATH 234) and linear algebra (such asMATH 340).",
            "id": "ECON 709",
            "parent": "ECON",
            "title": "ECONOMIC STATISTICS AND ECONOMETRICS I"
        }
    },
    {
        "data": {
            "description": "Problems of public policy and administration for development and use of natural resources.",
            "id": "ECON/ENVIRST/POLISCI/URBRPL 449",
            "title": "GOVERNMENT AND NATURAL RESOURCES"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Provides an equivalency for advanced level economics courses taken on UW-Madison study abroad programs for which there is no exact UW-Madison equivalent. Course must be of equal rigor to those offered on campus. To receive this equivalent, departmental pre-approval is required.",
            "id": "ECON 409",
            "parent": "ECON",
            "title": "STUDY ABROAD IN ADVANCED ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Provides an equivalency for intermediate level economics courses taken on UW-Madison study abroad programs.",
            "id": "ECON 309",
            "parent": "ECON",
            "title": "STUDY ABROAD IN INTERMEDIATE ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Provides an equivalency for introductory level economics courses taken on UW-Madison study abroad programs.",
            "id": "ECON 109",
            "parent": "ECON",
            "title": "STUDY ABROAD IN INTRODUCTORY ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Search theory provides framework for understanding markets; is used to study questions in monetary, public, financial economics.  This course will develop theoretical tools used to introduce frictions in formal models; will address the role of frictions in several applied scenarios.",
            "id": "ECON/FINANCE 503",
            "title": "MARKETS WITH FRICTIONS"
        }
    },
    {
        "data": {
            "description": "Second course in a two-semester sequence covering: consumer theory, producer theory, and markets under partial and general equilibrium, and with externalities or market power. The sequence will include an introduction to decision theory and game theory, and applications to auction theory and partially informed trade.",
            "id": "ECON 708",
            "parent": "ECON",
            "title": "MICROECONOMICS II"
        }
    },
    {
        "data": {
            "description": "Second course in a two-semester sequence. Topics include: asset pricing; fiscal and monetary policy; mechanism design, estimation and calibration of business cycle models.",
            "id": "ECON 714",
            "parent": "ECON",
            "title": "ECONOMIC THEORY; MACROECONOMICS SEQUENCE"
        }
    },
    {
        "data": {
            "description": "Second course in a two-semester sequence: the theory of market, their efficiency properties, externalities, and the role of prices, and an introduction to the economics of information, including moral hazard and adverse selection.",
            "id": "ECON 713",
            "parent": "ECON",
            "title": "ECONOMIC THEORY: MICROECONOMICS SEQUENCE"
        }
    },
    {
        "data": {
            "description": "Second in a two seminar sequence on current research in econometric model building, estimation and inference in econometrics.",
            "id": "ECON 914",
            "parent": "ECON",
            "title": "WORKSHOP IN ECONOMETRICS"
        }
    },
    {
        "data": {
            "description": "Second in a two seminar sequence on current research on macroeconomic models, monetary theory and policy, the theory of portfolio selection, and the allocative and distributive performance of capital markets.",
            "id": "ECON 966",
            "parent": "ECON",
            "title": "WORKSHOP ON QUANTITATIVE MACRO-ECONOMIC ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Second in a two seminar sequence on current research on the operation of markets in which individuals and firms act with imperfect information, are limited in their responses, may purchase heterogeneous commodities or factor services, and are concerned with conflicting goals.",
            "id": "ECON 904",
            "parent": "ECON",
            "title": "WORKSHOP ON INDUSTRIAL ORGANIZATION"
        }
    },
    {
        "data": {
            "description": "Second in a two seminar sequence on individual research and group discussion of public expenditure programs with attention to investment in human capital, education, training, health information, and welfare programs. Reports on research in progress by students, staff, visiting scholars.",
            "id": "ECON 969",
            "parent": "ECON",
            "title": "WORKSHOP ON PUBLIC ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Second in a two seminar sequence on the analysis of current research in wage determination and the functioning of labor markets.",
            "id": "ECON 956",
            "parent": "ECON",
            "title": "WORKSHOP IN LABOR ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Second in a two seminar sequence on the current research in international trade; a wide range of topics in theory, quantitative analysis, statistics, and policy. For graduate students in their second or later years when working on theses.",
            "id": "ECON 978",
            "parent": "ECON",
            "title": "WORKSHOP IN INTERNATIONAL ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Selections from all fields of economic research.",
            "id": "ECON 899",
            "parent": "ECON",
            "title": "RECENT ADVANCES IN ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Social and economic determinants and consequences of contemporary and historical population trends in both developed and developing societies. Fertility, mortality, migration, population distribution, age structure, population growth.",
            "id": "ECON/SOC 663",
            "title": "POPULATION AND SOCIETY"
        }
    },
    {
        "data": {
            "description": "Social and economic factors relating to stability, growth, and change in the non-Western areas of the contemporary world.",
            "id": "ANTHRO/C&ESOC/ECON/SOC 925",
            "title": "SEMINAR: SOCIO-ECONOMIC CHANGE IN UNDERDEVELOPED AREAS"
        }
    },
    {
        "data": {
            "description": "Social, economic, and political problems affected by birth and death rates, population size and distribution, voluntary and forced migration. World ecology, limits to growth, economic development, international conflict, environmental quality, metropolitan expansion, segregation by age, race, and wealth. Policies affecting reproduction, nuptiality, morbidity, mortality, migration.",
            "id": "SOC 170",
            "parent": "SOC",
            "title": "POPULATION PROBLEMS"
        }
    },
    {
        "data": {
            "description": "Statistical methods used in applied economic research. Topics include: survey methods and data sources; multiple regression and analysis of variance; econometric estimation; forecasting and policy applications.",
            "id": "ECON 410",
            "parent": "ECON",
            "title": "INTRODUCTORY ECONOMETRICS"
        }
    },
    {
        "data": {
            "description": "Structure and functioning of securities markets; principles of portfolio construction; models of the tradeoff between risk and expected return.",
            "id": "ECON/FINANCE 320",
            "title": "INVESTMENT THEORY"
        }
    },
    {
        "data": {
            "description": "Students will be required to criticize research by others, to draft a research proposal and to complete a project that requires original research.",
            "id": "ECON 580",
            "parent": "ECON",
            "title": "HONORS TUTORIAL IN RESEARCH PROJECT DESIGN"
        }
    },
    {
        "data": {
            "description": "Students will work on their honor thesis.",
            "id": "ECON 581",
            "parent": "ECON",
            "title": "HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Study of topics at elementary undergraduate level as arranged with a faculty member.",
            "id": "ECON 299",
            "parent": "ECON",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Study of topics or research at an advanced undergraduate as arranged with a faculty member.",
            "id": "ECON 698",
            "parent": "ECON",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Study of topics or research at an advanced undergraduate as arranged with a faculty member.",
            "id": "ECON 699",
            "parent": "ECON",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Survey of the forces underlying American economic development and the distribution of income; rise of regional economies; origins of manufacturing; effects of slavery; influence of government and politics on growth.",
            "id": "ECON 465",
            "parent": "ECON",
            "title": "THE AMERICAN ECONOMY TO 1865"
        }
    },
    {
        "data": {
            "description": "Taught on a modular basis: Labor Theories and Labor History; Union Political Activities; Collective Bargaining and Public Policy. For use in analysis of problems in areas of labor markets, wages and human resources.",
            "id": "ECON 751",
            "parent": "ECON",
            "title": "SURVEY OF INSTITUTIONAL ASPECTS OF LABOR ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Techniques of integration, improper integrals, first order ordinary differential equations, sequences and series, Taylor series, vector geometry in two and three dimensions.",
            "id": "MATH 222",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 2"
        }
    },
    {
        "data": {
            "description": "The contemporary theory of financial markets, portfolio choice, and asset pricing.",
            "id": "ECON 721",
            "parent": "ECON",
            "title": "FINANCIAL MICROECONOMICS"
        }
    },
    {
        "data": {
            "description": "The method, application, and limitations of traditional economic approaches to the study of energy problems. Topics include microeconomic foundations of energy demand and supply; optimal pricing and allocation of energy resources; energy market structure, conduct, and performance; macro linkages of energy and the economy; and the economics of regulatory and other public policy approaches to the social control of energy.",
            "id": "AAE/ECON/ENVIRST/URBRPL 671",
            "title": "ENERGY ECONOMICS"
        }
    },
    {
        "data": {
            "description": "The objective of this course is to refine the quantitative skills necessary to succeed in intermediate- and advanced-level economics courses. The principle focus will be on applying the skills acquired in your math courses to the questions, models, and optimization problems that are common in economics. Topics include specific economic applications of algebra, financial mathematics, and calculus.",
            "id": "ECON 205",
            "parent": "ECON",
            "title": "QUANTITATIVE TOOLS FOR ECONOMICS"
        }
    },
    {
        "data": {
            "description": "The study of multi-agent, interactive decision problems, with emphasis on questions of coordination, cooperation and conflict. Applications include relations between countries, competition between firms, bargaining between unions and firms, and contests between political candidates.",
            "id": "ECON 521",
            "parent": "ECON",
            "title": "GAME THEORY AND ECONOMIC ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Theoretical analysis of issues in growth and development. Models will be motivated by country experiences. Topics include: factors affecting saving, investment and cross-country differentials on per capita income; the role of government institutions, market regulation, technology and trade.",
            "id": "ECON 475",
            "parent": "ECON",
            "title": "ECONOMICS OF GROWTH"
        }
    },
    {
        "data": {
            "description": "Theoretical and empirical analysis of labor markets, labor mobility, the determination of earnings and employment, and labor supply of the household unit; emphasizes recent research on current issues in public policy.",
            "id": "ECON 750",
            "parent": "ECON",
            "title": "LABOR ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Theoretical and empirical analysis of public and private investment in people, emphasizing the contribution to productivity of education, training, health, and mobility.",
            "id": "ECON 448",
            "parent": "ECON",
            "title": "HUMAN RESOURCES AND ECONOMIC GROWTH"
        }
    },
    {
        "data": {
            "description": "Theoretical development of the functions of government in a mixed economy; welfare criteria for efficient government expenditures and taxation; nature of public goods and of redistribution activities of governments. Program budgeting and theoretical issues in cost-benefit analysis.",
            "id": "ECON 741",
            "parent": "ECON",
            "title": "THEORY OF PUBLIC FINANCE AND FISCAL POLICY"
        }
    },
    {
        "data": {
            "description": "Theoretical, empirical, and institutional aspects of the use of monetary, fiscal, and income policies to affect inflation, unemployment, and other policy goals.",
            "id": "ECON 736",
            "parent": "ECON",
            "title": "MACROECONOMIC POLICY"
        }
    },
    {
        "data": {
            "description": "Topics in economic theory and policy.",
            "id": "ECON 690",
            "parent": "ECON",
            "title": "TOPICS IN ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Topics in microeconomic theory.",
            "id": "ECON 809",
            "parent": "ECON",
            "title": "TOPICS IN MICROECONOMIC THEORY"
        }
    },
    {
        "data": {
            "description": "Topics in macroeconomic research.",
            "id": "ECON 810",
            "parent": "ECON",
            "title": "ADVANCED MACROECONOMIC THEORY"
        }
    },
    {
        "data": {
            "description": "Topics reflect interests of instructor and students.",
            "id": "ECON/LAW 961",
            "title": "SELECTED PROBLEMS IN TRADE REGULATION-SEMINAR"
        }
    },
    {
        "data": {
            "description": "Topics vary, including current developments in all fields of economics.",
            "id": "ECON 390",
            "parent": "ECON",
            "title": "CONTEMPORARY ECONOMIC ISSUES"
        }
    },
    {
        "data": {
            "description": "Use core economic datasets such as the Panel Study on Income Dynamics, Consumer Expenditure Survey, National Income and Product Accounts, and the American Community Survey for quantitative economic research.  Learn to clean and manipulate data to create datasets usable for economic research and to implement theory-based and atheoretic econometric models.",
            "id": "ECON 770",
            "parent": "ECON",
            "title": "DATA ANALYTICS FOR ECONOMISTS"
        }
    },
    {
        "data": {
            "description": "Use microeconomic theory to analyze energy markets. Discuss the economics of oil, gas, and electricity and learn about applications to contemporary issues and policy questions.",
            "id": "AAE/ECON 371",
            "title": "ENERGY, RESOURCES AND ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Use of quantitative methods (mathematics, statistics, and optimization) to analyze problems faced by decision makers in natural resources and agriculture. Extensive homework requiring use of quantitative methods via spreadsheet tools to solve problems from an applied decision context.",
            "id": "AAE/ECON 526",
            "title": "QUANTITATIVE METHODS IN AGRICULTURAL AND APPLIED ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Various advanced topics on the use of data to answer important economic questions.",
            "id": "ECON 695",
            "parent": "ECON",
            "title": "TOPICS IN ECONOMIC DATA ANALYSIS"
        }
    },
    {
        "data": {
            "description": "What does economics have to say about how or why people decide to go to school, get married (or divorced), or have children? Use economic models to investigate these \"every day occurrences.\" Start with early childhood and trace out the life cycle from schooling to retirement, concentrating on six stages of life: early childhood; schooling; adolescence; marriage and divorce; fertility; and retirement decisions.",
            "id": "ECON 355",
            "parent": "ECON",
            "title": "THE ECONOMICS OF GROWING-UP AND GETTING OLD"
        }
    },
    {
        "data": {
            "id": "AAE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ACCTIS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ECON",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "FINANCE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "GENBUS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "SOC",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "STAT",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "AAE 101",
            "target": "AAE/ECON 473"
        }
    },
    {
        "data": {
            "source": "AAE 101",
            "target": "AAE/ECON 477"
        }
    },
    {
        "data": {
            "source": "AAE 101",
            "target": "AAE/ECON/ENVIRST 343"
        }
    },
    {
        "data": {
            "source": "AAE 101",
            "target": "AAE/ECON/ENVIRST/URBRPL 671"
        }
    },
    {
        "data": {
            "source": "AAE 101",
            "target": "AAE/ECON/INTLBUS 462"
        }
    },
    {
        "data": {
            "source": "AAE 101",
            "target": "AAE/ECON/REALEST/URBRPL 306"
        }
    },
    {
        "data": {
            "source": "AAE 101",
            "target": "ECON/HISTSCI 305"
        }
    },
    {
        "data": {
            "source": "ACCTIS 100",
            "target": "ACCTIS 300"
        }
    },
    {
        "data": {
            "source": "ACCTIS 300",
            "target": "ACCTIS 100"
        }
    },
    {
        "data": {
            "source": "ACCTIS 300",
            "target": "ECON/FINANCE 300"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "AAE/ECON 371"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "AAE/ECON 473"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "AAE/ECON 474"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "AAE/ECON 477"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "AAE/ECON/ENVIRST/URBRPL 671"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON 100"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON 301"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON 310"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON 311"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON 315"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON 321"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON 325"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON 330"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON 340"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON 350"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON 370"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON 390"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON 465"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON/FINANCE 300"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON/HISTORY 466"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON/HISTSCI 305"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON/REALEST/URBRPL 420"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON/SOC 663"
        }
    },
    {
        "data": {
            "source": "ECON 102",
            "target": "ECON 111"
        }
    },
    {
        "data": {
            "source": "ECON 102",
            "target": "ECON 205"
        }
    },
    {
        "data": {
            "source": "ECON 102",
            "target": "ECON 302"
        }
    },
    {
        "data": {
            "source": "ECON 102",
            "target": "ECON 310"
        }
    },
    {
        "data": {
            "source": "ECON 102",
            "target": "ECON 312"
        }
    },
    {
        "data": {
            "source": "ECON 102",
            "target": "ECON 330"
        }
    },
    {
        "data": {
            "source": "ECON 102",
            "target": "ECON 370"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "AAE/ECON/ENVIRST/URBRPL 671"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON 101"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON 102"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON 205"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON 311"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON 312"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON/FINANCE 300"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON/HISTSCI 305"
        }
    },
    {
        "data": {
            "source": "ECON 301",
            "target": "AAE/ECON 526"
        }
    },
    {
        "data": {
            "source": "ECON 301",
            "target": "AAE/ECON/F&WECOL 531"
        }
    },
    {
        "data": {
            "source": "ECON 301",
            "target": "ECON 311"
        }
    },
    {
        "data": {
            "source": "ECON 301",
            "target": "ECON 441"
        }
    },
    {
        "data": {
            "source": "ECON 301",
            "target": "ECON 442"
        }
    },
    {
        "data": {
            "source": "ECON 301",
            "target": "ECON 448"
        }
    },
    {
        "data": {
            "source": "ECON 301",
            "target": "ECON 450"
        }
    },
    {
        "data": {
            "source": "ECON 301",
            "target": "ECON 455"
        }
    },
    {
        "data": {
            "source": "ECON 301",
            "target": "ECON 458"
        }
    },
    {
        "data": {
            "source": "ECON 301",
            "target": "ECON 464"
        }
    },
    {
        "data": {
            "source": "ECON 301",
            "target": "ECON 467"
        }
    },
    {
        "data": {
            "source": "ECON 301",
            "target": "ECON 468"
        }
    },
    {
        "data": {
            "source": "ECON 301",
            "target": "ECON 475"
        }
    },
    {
        "data": {
            "source": "ECON 301",
            "target": "ECON 521"
        }
    },
    {
        "data": {
            "source": "ECON 301",
            "target": "ECON 522"
        }
    },
    {
        "data": {
            "source": "ECON 301",
            "target": "ECON 535"
        }
    },
    {
        "data": {
            "source": "ECON 301",
            "target": "ECON 570"
        }
    },
    {
        "data": {
            "source": "ECON 301",
            "target": "ECON 580"
        }
    },
    {
        "data": {
            "source": "ECON 301",
            "target": "ECON 621"
        }
    },
    {
        "data": {
            "source": "ECON 301",
            "target": "ECON 623"
        }
    },
    {
        "data": {
            "source": "ECON 301",
            "target": "ECON 666"
        }
    },
    {
        "data": {
            "source": "ECON 301",
            "target": "ECON 690"
        }
    },
    {
        "data": {
            "source": "ECON 301",
            "target": "ECON/FINANCE 503"
        }
    },
    {
        "data": {
            "source": "ECON 301",
            "target": "ECON/POPHLTH/PUBAFFR 548"
        }
    },
    {
        "data": {
            "source": "ECON 301",
            "target": "ECON/RMI 530"
        }
    },
    {
        "data": {
            "source": "ECON 302",
            "target": "ECON 312"
        }
    },
    {
        "data": {
            "source": "ECON 302",
            "target": "ECON 435"
        }
    },
    {
        "data": {
            "source": "ECON 302",
            "target": "ECON 442"
        }
    },
    {
        "data": {
            "source": "ECON 302",
            "target": "ECON 461"
        }
    },
    {
        "data": {
            "source": "ECON 302",
            "target": "ECON 475"
        }
    },
    {
        "data": {
            "source": "ECON 302",
            "target": "ECON 661"
        }
    },
    {
        "data": {
            "source": "ECON 302",
            "target": "ECON 666"
        }
    },
    {
        "data": {
            "source": "ECON 310",
            "target": "AAE/ECON 421"
        }
    },
    {
        "data": {
            "source": "ECON 310",
            "target": "ECON 315"
        }
    },
    {
        "data": {
            "source": "ECON 310",
            "target": "ECON 355"
        }
    },
    {
        "data": {
            "source": "ECON 310",
            "target": "ECON 370"
        }
    },
    {
        "data": {
            "source": "ECON 310",
            "target": "ECON 400"
        }
    },
    {
        "data": {
            "source": "ECON 310",
            "target": "ECON 410"
        }
    },
    {
        "data": {
            "source": "ECON 310",
            "target": "ECON 455"
        }
    },
    {
        "data": {
            "source": "ECON 310",
            "target": "ECON 535"
        }
    },
    {
        "data": {
            "source": "ECON 310",
            "target": "ECON 570"
        }
    },
    {
        "data": {
            "source": "ECON 310",
            "target": "ECON 623"
        }
    },
    {
        "data": {
            "source": "ECON 310",
            "target": "ECON 661"
        }
    },
    {
        "data": {
            "source": "ECON 310",
            "target": "ECON 664"
        }
    },
    {
        "data": {
            "source": "ECON 310",
            "target": "ECON 695"
        }
    },
    {
        "data": {
            "source": "ECON 310",
            "target": "ECON/RMI 530"
        }
    },
    {
        "data": {
            "source": "ECON 310",
            "target": "STAT 333"
        }
    },
    {
        "data": {
            "source": "ECON 311",
            "target": "AAE/ECON/F&WECOL 531"
        }
    },
    {
        "data": {
            "source": "ECON 311",
            "target": "ECON 301"
        }
    },
    {
        "data": {
            "source": "ECON 311",
            "target": "ECON 455"
        }
    },
    {
        "data": {
            "source": "ECON 311",
            "target": "ECON 468"
        }
    },
    {
        "data": {
            "source": "ECON 311",
            "target": "ECON 521"
        }
    },
    {
        "data": {
            "source": "ECON 311",
            "target": "ECON 621"
        }
    },
    {
        "data": {
            "source": "ECON 311",
            "target": "ECON 623"
        }
    },
    {
        "data": {
            "source": "ECON 311",
            "target": "ECON 690"
        }
    },
    {
        "data": {
            "source": "ECON 311",
            "target": "ECON/FINANCE 503"
        }
    },
    {
        "data": {
            "source": "ECON 311",
            "target": "ECON/RMI 530"
        }
    },
    {
        "data": {
            "source": "ECON 312",
            "target": "ECON 302"
        }
    },
    {
        "data": {
            "source": "ECON 312",
            "target": "ECON 435"
        }
    },
    {
        "data": {
            "source": "ECON 312",
            "target": "ECON 442"
        }
    },
    {
        "data": {
            "source": "ECON 312",
            "target": "ECON 475"
        }
    },
    {
        "data": {
            "source": "ECON 312",
            "target": "ECON 661"
        }
    },
    {
        "data": {
            "source": "ECON 312",
            "target": "ECON 666"
        }
    },
    {
        "data": {
            "source": "ECON 330",
            "target": "ECON 435"
        }
    },
    {
        "data": {
            "source": "ECON 400",
            "target": "ECON 410"
        }
    },
    {
        "data": {
            "source": "ECON 400",
            "target": "ECON 460"
        }
    },
    {
        "data": {
            "source": "ECON 400",
            "target": "ECON/FINANCE 320"
        }
    },
    {
        "data": {
            "source": "ECON 410",
            "target": "ECON 400"
        }
    },
    {
        "data": {
            "source": "ECON 410",
            "target": "ECON 460"
        }
    },
    {
        "data": {
            "source": "ECON 410",
            "target": "ECON 580"
        }
    },
    {
        "data": {
            "source": "ECON 464",
            "target": "ECON 664"
        }
    },
    {
        "data": {
            "source": "ECON 701",
            "target": "ECON 708"
        }
    },
    {
        "data": {
            "source": "ECON 704",
            "target": "ECON 705"
        }
    },
    {
        "data": {
            "source": "ECON 704",
            "target": "ECON 724"
        }
    },
    {
        "data": {
            "source": "ECON 705",
            "target": "ECON 706"
        }
    },
    {
        "data": {
            "source": "ECON 709",
            "target": "AAE/ECON 747"
        }
    },
    {
        "data": {
            "source": "ECON 709",
            "target": "ECON 710"
        }
    },
    {
        "data": {
            "source": "ECON 711",
            "target": "AAE/ECON 747"
        }
    },
    {
        "data": {
            "source": "ECON 711",
            "target": "ECON 713"
        }
    },
    {
        "data": {
            "source": "ECON 712",
            "target": "ECON 714"
        }
    },
    {
        "data": {
            "source": "ECON 713",
            "target": "ECON/URBRPL 845"
        }
    },
    {
        "data": {
            "source": "ECON 714",
            "target": "ECON/URBRPL 845"
        }
    },
    {
        "data": {
            "source": "ECON/FINANCE 300",
            "target": "ECON/FINANCE 320"
        }
    },
    {
        "data": {
            "source": "ECON/FINANCE 300",
            "target": "FINANCE 305"
        }
    },
    {
        "data": {
            "source": "FINANCE 305",
            "target": "ECON/FINANCE 503"
        }
    },
    {
        "data": {
            "source": "GENBUS 106",
            "target": "GENBUS 306"
        }
    },
    {
        "data": {
            "source": "GENBUS 306",
            "target": "AAE/ECON 421"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "AAE/ECON 526"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "GENBUS 306"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 213"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "source": "MATH 213",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "ECON 621"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "ECON 664"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 222"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "ECON 521"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "SOC 170",
            "target": "ECON/SOC 663"
        }
    },
    {
        "data": {
            "source": "STAT 240",
            "target": "ECON 570"
        }
    },
    {
        "data": {
            "source": "STAT 240",
            "target": "STAT 303"
        }
    },
    {
        "data": {
            "source": "STAT 301",
            "target": "AAE/ECON 526"
        }
    },
    {
        "data": {
            "source": "STAT 303",
            "target": "ECON 695"
        }
    },
    {
        "data": {
            "source": "STAT 324",
            "target": "STAT 301"
        }
    },
    {
        "data": {
            "source": "STAT 324",
            "target": "STAT 333"
        }
    },
    {
        "data": {
            "source": "STAT 324",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "source": "STAT 333",
            "target": "ECON 570"
        }
    },
    {
        "data": {
            "source": "STAT 333",
            "target": "ECON 695"
        }
    },
    {
        "data": {
            "source": "STAT 371",
            "target": "STAT 303"
        }
    },
    {
        "data": {
            "source": "STAT 371",
            "target": "STAT 324"
        }
    },
    {
        "data": {
            "source": "STAT 610",
            "target": "ECON/GENBUS/STAT 775"
        }
    }
]