[
    {
        "data": {
            "description": "Addresses political economic issues related to migration and education. Drawing on the anthropology of globalization and sociology of immigration, the course reviews major theories of immigrant incorporation and exclusion processes, examines case studies of im/migrants, refugees, and displaced persons and their adaptation processes in countries in the Global North and the Global South, and considers educational practices and policies that develop to address mobility in diverse contexts. The course examines how cultural, social, political, and economic factors influence im/migrant incorporation, and how educators can facilitate im/migrant students' opportunities for learning through changes in policies, pedagogies, and curricula.",
            "id": "EDPOL 761",
            "parent": "EDPOL",
            "title": "MIGRATION AND EDUCATION"
        }
    },
    {
        "data": {
            "description": "Examines teachers' and administrators' practice through research on teachers and teaching as an occupation, the everyday realities of classrooms, and a variety of frameworks for understanding the relationship between policy and educators' daily work. Considers teachers and administrators as implementers of local, state, and federal policies, while simultaneously designing and creating policies and practices themselves.",
            "id": "EDPOL 575",
            "parent": "EDPOL",
            "title": "EDUCATION POLICY AND PRACTICE"
        }
    },
    {
        "data": {
            "description": "Explore urban education in the United States and its relationship to broader political, social, and economic contexts; focuses on contemporary urban educational issues and students' experiences in school and community settings, the experiences of students and families of color and the relationship between race, class, gender, and inequality in urban education.",
            "id": "EDPOL 505",
            "parent": "EDPOL",
            "title": "ISSUES IN URBAN EDUCATION IN THE U.S."
        }
    },
    {
        "data": {
            "description": "Explores questions related to human rights and education, from the individual to the global level; from the abstract to the practical: What does it mean to be human? How do we learn to be human? What rights mark a human being? Do all human have rights? If they have a right to education, do they have a right to a particular kind of education? Can one global education and human rights model best meet the needs of our incredibly diverse global population? Can the global human rights framework improve current educational, national, social, and economic inequities? How so? How does education as a human right relate to human rights education? and who should decide the answers to these questions, and how? Investigates the tensions and boundaries of the human rights framework to reduce social inequality through methodological inquires in educational case studies, including: educational inequality; victims of the war on drugs; working children's rights; and climate change.",
            "id": "EDPOL/INTLST 220",
            "title": "HUMAN RIGHTS AND EDUCATION"
        }
    },
    {
        "data": {
            "description": "Investigates how the systems of incarceration and education operate alongside, within, around and through one another. Provides a historical examination of how education and incarceration have interacted. Examines how prisons operate as 'teaching institutions,' what it teaches all of us impacted by it, and what interventions have been designed to facilitate particular kinds of learning. Presents firsthand accounts of those who work and live in the carceral system currently.",
            "id": "CURRIC/EDPOL/LEGALST 250",
            "title": "INCARCERATION AND EDUCATION"
        }
    },
    {
        "data": {
            "description": "Survey of the college access landscape in the US with particular attention to historical and contemporary social, economic, and political contexts from the individual to federal level. Specifically focus on students' transitions from K12 to higher education, including policy aspects of college-going affecting college preparation, search, application, choice, and enrollment. Review, discuss, and apply evidence-based perspectives on related issues, including affordability and postsecondary sectors, with an emphasis on interventions seeking to reduce social and economic inequality in access to college.",
            "id": "EDPOL 525",
            "parent": "EDPOL",
            "title": "IS COLLEGE POSSIBLE? COLLEGE ACCESS AND ADMISSIONS IN THE US"
        }
    },
    {
        "data": {
            "description": "",
            "id": "EDPOL 399",
            "parent": "EDPOL",
            "title": "INDEPENDENT READING"
        }
    },
    {
        "data": {
            "description": "",
            "id": "EDPOL 699",
            "parent": "EDPOL",
            "title": "INDEPENDENT READING"
        }
    },
    {
        "data": {
            "description": "",
            "id": "EDPOL 990",
            "parent": "EDPOL",
            "title": "RESEARCH OR THESIS"
        }
    },
    {
        "data": {
            "description": "",
            "id": "EDPOL 999",
            "parent": "EDPOL",
            "title": "INDEPENDENT READING"
        }
    },
    {
        "data": {
            "description": "An examination of the social, economic, political, and cultural issues influencing the education of Black Americans from the early nineteenth century to the 1960s.",
            "id": "AFROAMER/EDPOL 567",
            "title": "HISTORY OF AFRICAN AMERICAN EDUCATION"
        }
    },
    {
        "data": {
            "description": "An exploration of the foundational concepts and methods of educational anthropology. Examines anthropological inquiry on educational research with particular reference to cultural perspectives on education and educational systems, learning as cultural transmission, and application of anthropological knowledge to curriculum.",
            "id": "ANTHRO/EDPOL 570",
            "title": "ANTHROPOLOGY AND EDUCATION"
        }
    },
    {
        "data": {
            "description": "An intensive, practice-oriented exploration of one qualitative research method such as participant-observation, interviewing, narrative analysis, oral history or ethnography. Treatment of the method includes: logics of inquiry, analysis of data obtained through the method, and uses of the method.",
            "id": "EDPOL/SOC 955",
            "title": "SEMINAR-QUALITATIVE METHODOLOGY"
        }
    },
    {
        "data": {
            "description": "An introduction to diverse scholarly perspectives in educational policy studies.",
            "id": "EDPOL 701",
            "parent": "EDPOL",
            "title": "INTRODUCTION TO EDUCATIONAL POLICY STUDIES"
        }
    },
    {
        "data": {
            "description": "An introduction to fundamental educational questions, concepts, perspectives and ideas, designed to enable thoughtful examination and assessment of proposed and existing educational policies and practices.",
            "id": "EDPOL 140",
            "parent": "EDPOL",
            "title": "INTRODUCTION TO EDUCATION"
        }
    },
    {
        "data": {
            "description": "An introduction to statistical analysis for research and evaluation. Draw on current events and policy debates when possible. Describe data and distributions; internal/external validity; sampling, inference, and evaluation designs (RCT, regression, DiD). Expect to use real data and computer software to complete assignments.",
            "id": "EDPOL 602",
            "parent": "EDPOL",
            "title": "STATISTICS FOR RESEARCH AND EVALUATION"
        }
    },
    {
        "data": {
            "description": "An overview and discussion on the values, histories, systems, policies, problems, and reforms of education in East Asian societies. Examines extended issues in comparative education, including education and its relation to economic development, social inequality and stratification, gender and family, ethnicity and migration, identity formation, and student movements.",
            "id": "EDPOL 245",
            "parent": "EDPOL",
            "title": "EDUCATION IN EAST ASIA"
        }
    },
    {
        "data": {
            "description": "Analysis of several social theories emphasizing the explanation of social change, the role of education in the change process, and the implications for educational policy in contemporary society.",
            "id": "EDPOL 870",
            "parent": "EDPOL",
            "title": "THEORIES OF SOCIAL AND EDUCATIONAL CHANGE"
        }
    },
    {
        "data": {
            "description": "Anthropological theory, methodology, and field techniques with specific reference to school ethnography and cross-cultural studies of socialization and education. Topics vary.",
            "id": "ANTHRO/EDPOL 970",
            "title": "SEMINAR IN ANTHROPOLOGY AND EDUCATION"
        }
    },
    {
        "data": {
            "description": "Contemporary bases for collecting and distributing local, state, and federal funds for elementary and secondary education; problems and issues in financial support of education; current, alternative and more effective uses of educational resources.",
            "id": "EDPOL/ELPA/PUBAFFR 830",
            "title": "SCHOOL FINANCE AND RESOURCE ALLOCATION"
        }
    },
    {
        "data": {
            "description": "Critical analysis of theories, methods, and intellectual perspectives that have been employed in comparative studies of education.",
            "id": "EDPOL 860",
            "parent": "EDPOL",
            "title": "PROSEMINAR: THEORY AND METHOD IN COMPARATIVE EDUCATION"
        }
    },
    {
        "data": {
            "description": "Critical examination of classical and contemporary conceptions of moral education.",
            "id": "EDPOL/PHILOS 550",
            "title": "PHILOSOPHY OF MORAL EDUCATION"
        }
    },
    {
        "data": {
            "description": "Critical examination of debates in contemporary higher education policy. Explores the sociocultural tensions among key policy goals such as quality, equity, and efficiency, and the results (including unintended consequences) of those tensions. Examines the theory and research brought to bear on policy debates, and how they are used-or not used-to shape policy agendas.",
            "id": "EDPOL 518",
            "parent": "EDPOL",
            "title": "INTRODUCTION TO DEBATES IN HIGHER EDUCATION POLICY"
        }
    },
    {
        "data": {
            "description": "Critical survey of issues and trends; their social, educational basis; implications for elementary schools; examination and analysis of major problems.",
            "id": "CURRIC/EDPOL 855",
            "title": "ISSUES IN ELEMENTARY EDUCATION"
        }
    },
    {
        "data": {
            "description": "Development of colleges, universities, and higher learning in Europe and America.",
            "id": "EDPOL/HISTORY 713",
            "title": "HISTORY OF HIGHER EDUCATION IN EUROPE AND AMERICA"
        }
    },
    {
        "data": {
            "description": "Discuss the ways education is inextricably linked to global political, economic, and social contexts. Reflect on both scholarly research and popular conceptions of market, society and schools in different geographic and cultural contexts. Approach globalization from a context-sensitive, place-based approach, rather than abstract, predictive method through interdisciplinary analysis. Explore the concept of globalization across disciplinary frameworks including anthropology, geography, and history. Provides critical analysis to understand the challenges facing education in a globalization era, to build stronger commitment to helping address those challenges, and a set of skills for researching and writing about them. Examine the following \"problem-spaces\": globalization and migration; globalization and race; global testing and assessment; marketization of education; global city development and higher education; youth culture and globalization.",
            "id": "EDPOL/INTLST 335",
            "title": "GLOBALIZATION AND EDUCATION"
        }
    },
    {
        "data": {
            "description": "Engage with and discuss the historical, ideological, and contemporary issues surrounding community-based spaces and programs serving youth. Topics will include: grassroots organizing and activism, pedagogies of the home, academic outcomes and access to higher education, full-service community-schools/school-community partnerships, social identity, funding and philanthropy, neoliberalism and education privatization, and after school and out-of-school time education. Examine the social and political context of community-based educational efforts in order to understand how they can be nurturing spaces of resistance for youth, as well as spaces of conflict and social reproduction.",
            "id": "EDPOL 810",
            "parent": "EDPOL",
            "title": "EDUCATION AND RESISTANCE IN COMMUNITY-BASED SPACES"
        }
    },
    {
        "data": {
            "description": "Engages with contemporary issues in the economics of education across the K-12 and postsecondary policy arenas in the US and beyond. With foundations in human capital and the education production function, covers a wide variety of topics, including teacher labor markets and teacher quality, school choice, K-12 and higher education finance, and the individual and collective returns to education. Discuss, present, and critique education policy issues through the lens of economics and apply course content to current issues in education policy, including creation and dissemination of recommendations for education policy and practice.",
            "id": "EDPOL 345",
            "parent": "EDPOL",
            "title": "ECONOMICS OF EDUCATION"
        }
    },
    {
        "data": {
            "description": "Examination and analysis of conceptions of teaching and learning in classical philosophical works and in contemporary literature in the philosophy of education.",
            "id": "EDPOL/PHILOS 545",
            "title": "PHILOSOPHICAL CONCEPTIONS OF TEACHING AND LEARNING"
        }
    },
    {
        "data": {
            "description": "Examine cultural and language politics, policies, and practices in education. Read in the fields of anthropology, sociolinguistics, and language policy to consider how language policies, politics, and practices either reinforce or reduce educational and social inequality.",
            "id": "EDPOL 205",
            "parent": "EDPOL",
            "title": "LANGUAGE AND SOCIAL INEQUALITY"
        }
    },
    {
        "data": {
            "description": "Examine the historical relationships between metropolitan change, economic transformation, and the construction of race and how those processes have shaped mass incarceration, educational, housing, and income inequality, and the experiences of racial/ethnic minorities who have been marginalized or discriminated against. Key questions include: What is the historical nature of inequality and opportunity in metropolitan America? What policies and ideas have historically promoted inequality, and how have those policies and ideas shifted over time? How have marginalized people responded to inequality, and what impacts have various modes of resistance had? Lastly, what is \"race,\" how has its meaning changed over time, and how has it historically shaped inequality and opportunity?",
            "id": "EDPOL/HISTORY 143",
            "title": "HISTORY OF RACE AND INEQUALITY IN URBAN AMERICA"
        }
    },
    {
        "data": {
            "description": "Examines a variety of topics related to educational policies, practices, and issues in social, cultural, historical, and political economic contexts in the U.S. and around the world.",
            "id": "EDPOL 150",
            "parent": "EDPOL",
            "title": "EDUCATION AND PUBLIC POLICY"
        }
    },
    {
        "data": {
            "description": "Examines applied research and evaluation design. Explains the basic components of the research process: conceptualization and measurement, sample selection, and techniques for data generation. Explores and practices research techniques, including survey, focus groups, interviews, etc. Entails a developmental sequence of assignments culminating in a research proposal.",
            "id": "EDPOL 603",
            "parent": "EDPOL",
            "title": "RESEARCH AND EVALUATION DESIGN AND METHODS"
        }
    },
    {
        "data": {
            "description": "Examines claims in education stories, the various forms of bias that surround them, and how our changing media landscape impacts what stories are told, who tells them and how they impact education policy and practice.",
            "id": "EDPOL 134",
            "parent": "EDPOL",
            "title": "MEDIA LITERACY AND MISINFORMATION IN EDUCATION"
        }
    },
    {
        "data": {
            "description": "Examines contemporary topics and debates in education studies; develops research, analytical, and other skills to work in education careers.",
            "id": "EDPOL 350",
            "parent": "EDPOL",
            "title": "TOPICS IN EDUCATION STUDIES"
        }
    },
    {
        "data": {
            "description": "Examines educational inequality across the Americas through the lens of imperialism, different forms of colonialism, and capitalism. By exploring the logics and actions of different education stakeholders, critically examine how educational policy across the hemisphere has a shared history of oppression and contestation.",
            "id": "CHICLA/EDPOL/LACIS 342",
            "title": "EDUCATION ACROSS THE AMERICAS: EMPIRE, CAPITALISM, AND RESISTANCE"
        }
    },
    {
        "data": {
            "description": "Examines how and why different families and communities engage in education, with an emphasis on issues of power and equity. Focuses on social science approaches to understanding family and community engagement in K-12 schooling in the U.S. Opportunity to explore historical and philosophical approaches, and family and community engagement in international, higher education, and other contexts.",
            "id": "EDPOL 585",
            "parent": "EDPOL",
            "title": "FAMILY AND COMMUNITY ENGAGEMENT IN EDUCATION"
        }
    },
    {
        "data": {
            "description": "Examines how policies shape the educational experiences of students with disabilities in education and the broader educational landscape.",
            "id": "EDPOL 215",
            "parent": "EDPOL",
            "title": "DISABILITY AND EDUCATION POLICY"
        }
    },
    {
        "data": {
            "description": "Examines policy issues surrounding the education of children from immigrant families in K-16 educational settings in the U.S. Explores the economic, social, political, and ideological contexts of immigration and education, as well as school factors and home-school relations through readings, discussions, and assignments. Considers the impact of various policy and pedagogical approaches. Course readings draw from relevant literature in educational anthropology, sociology of education, educational policy, sociolinguistics, and language pedagogy.",
            "id": "EDPOL 460",
            "parent": "EDPOL",
            "title": "IMMIGRATION, EDUCATION, AND EQUITY"
        }
    },
    {
        "data": {
            "description": "Examines poverty, inequality, and education from a theoretical, historical, and practical perspective through an introduction to historical and contemporary debates on wealth, poverty, and inequality. Interrogates these debates in relation to policies, practice, and institutions of education.",
            "id": "EDPOL 237",
            "parent": "EDPOL",
            "title": "WEALTH, POVERTY AND INEQUALITY: TRANSNATIONAL PERSPECTIVES ON POLICY AND PRACTICE IN EDUCATION"
        }
    },
    {
        "data": {
            "description": "Examines qualitative research methods for educational research - specifically, the role of theory, how to develop a research question, how to design a study, interviewing, conducting observations, doing initial data analysis, and presenting an original qualitative research project. Complete a series of \"stepping stone\" assignments (practica) and peer feedback activities designed to scaffold the research experience in an organized, supportive, informed, and meaningful way.",
            "id": "EDPOL 308",
            "parent": "EDPOL",
            "title": "INTRODUCTION TO QUALITATIVE RESEARCH METHODS IN EDUCATION"
        }
    },
    {
        "data": {
            "description": "Examines the comparative history of radical and experimental education in the United States and United Kingdom since 1800. It focuses on the social, cultural, and intellectual history of diverse educational experiments, including experiments related to socialism, abolitionism, anarchism, and religious fundamentalism.",
            "id": "EDPOL/HISTORY 622",
            "title": "HISTORY OF RADICAL AND EXPERIMENTAL EDUCATION IN THE US AND UK"
        }
    },
    {
        "data": {
            "description": "Examines the following questions focusing on: goals and values for urban schools, framings of \"the problem\" of K-12 urban schooling in the United States, evidence of the complexities and research evidence on contemporary policies for improving urban schools, and theories of urban school politics, policy, and equity-oriented school reform. Focuses on system-level educational problems, politics, and policies.",
            "id": "EDPOL 510",
            "parent": "EDPOL",
            "title": "URBAN SCHOOL POLICY"
        }
    },
    {
        "data": {
            "description": "Examines the growth of modern childhood and adolescent sub-cultures, class differences, literary and pictorial representations, legal and demographic developments, and the growth of educational theories and institutions.",
            "id": "EDPOL/HISTORY 478",
            "title": "COMPARATIVE HISTORY OF CHILDHOOD AND ADOLESCENCE"
        }
    },
    {
        "data": {
            "description": "Examines the history of education in America from the colonization of North America to the present to consider education in its broadest sense - as a process of individual development and cultural transmission. Explores such topics as the rise of common schools in the urban North; the education of Native Americans, immigrants, slaves, and free blacks; the evolution of teacher training (primarily for women); various philosophies of \"progressive\" school reform; the politics of desegregation, bilingual education, and special education; the articulation between high school and college work; and the evolving federal role in American education.",
            "id": "EDPOL/HISTORY 412",
            "title": "HISTORY OF AMERICAN EDUCATION"
        }
    },
    {
        "data": {
            "description": "Examines the history of federal aid to education from 1776 to the present, with heavy emphasis on the post-World War II period. Explores the federal role in public education in the Early Republic and during Reconstruction; Traces the evolution of federal policies concerning racial desegregation, compensatory education for low-income students, bilingual education, and special education for the disabled. Critically reflect on the tradition of \"local control,\" policy implementation and evaluation, accountability, block grants, interest groups and lobbies; nationally standardized testing, and the different goals assigned to public schooling in the United States (e.g., social integration/inclusion, individual academic achievement, etc.).",
            "id": "EDPOL/HISTORY 665",
            "title": "HISTORY OF THE FEDERAL ROLE IN AMERICAN EDUCATION"
        }
    },
    {
        "data": {
            "description": "Examines the legal issues related to the policy decisions and delivery of public education (elementary and secondary) in the United States. Learn how law impacts both curriculum development and curricular delivery, explore current legal controversies, constitutional issues, and learn about legal reasoning and analysis. Examines how both legislation and litigation affects public education. Particular attention is paid to law as public policy and the analysis of the same.",
            "id": "EDPOL/ELPA/LEGALST 542",
            "title": "LAW AND PUBLIC EDUCATION"
        }
    },
    {
        "data": {
            "description": "Examines the relationship between gender and education and explores notions of gender as socially constructed categories and identities. Identify the ways schools (re)produce and mediate gender identities and explore the experiences of students. Draws on critical and feminist perspectives to analyze the ways gender intersects with understandings of identity performance and expression such as masculinity and femininity, as well as at the intersection of race, ethnicity, class, and sexuality in schooling processes.",
            "id": "EDPOL/GEN&WS 560",
            "title": "GENDER AND EDUCATION"
        }
    },
    {
        "data": {
            "description": "Examines the socio-cultural, political and economic forces that shape education around the world, including in the U.S. Explores a series of essential questions about the means and ends of education, including: the purposes of schooling in different locations; the role of schooling in producing inequality or supporting social change, particularly in relation to class, race, gender, migration, language, and abilities; global educational reform; global educational assessments; curriculum and pedagogy; and teacher education.",
            "id": "EDPOL 240",
            "parent": "EDPOL",
            "title": "COMPARATIVE EDUCATION"
        }
    },
    {
        "data": {
            "description": "Examines theories and practices related to the role of religion in public schooling and its accompanying tensions: political and philosophical, practical and personal.",
            "id": "CURRIC/EDPOL/RELIGST 516",
            "title": "RELIGION AND PUBLIC EDUCATION"
        }
    },
    {
        "data": {
            "description": "Examines theories, institutions, and issues in international educational development.",
            "id": "EDPOL 260",
            "parent": "EDPOL",
            "title": "INTRODUCTION TO INTERNATIONAL EDUCATION DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Examines various debates in the field of education policy specific to special topic identified by instructor/faculty. Policy area and faculty vary each semester.",
            "id": "EDPOL 600",
            "parent": "EDPOL",
            "title": "PROBLEMS IN EDUCATIONAL POLICY"
        }
    },
    {
        "data": {
            "description": "Exploration and analysis of recent debates related to gender issues in international educational policy, including the intersection of education and demographic processes, the play of history and culture, and the social construction of gender.",
            "id": "EDPOL/GEN&WS/PUBAFFR 805",
            "title": "GENDER ISSUES IN INTERNATIONAL EDUCATIONAL POLICY"
        }
    },
    {
        "data": {
            "description": "Explore contemporary social issues or problems and their significance for educational purposes and practices. Designed for various special topics on social issues and education.",
            "id": "EDPOL 500",
            "parent": "EDPOL",
            "title": "TOPICS ON SOCIAL ISSUES AND EDUCATION"
        }
    },
    {
        "data": {
            "description": "Explore the history of student activism in the United States, with an emphasis on the experiences racial/ethnic minority youths who have been marginalized or discriminated against. What motivated students to become politically active, and what forms did their activism take? How did student activism vary across time and space and from one group of activists to another? Why did some students become activists while others did not? What role did education and educational institutions play in their activism? What impact have student activists had, and what do their histories reveal about the capacity and mechanisms for achieving racial equity in particular and for affecting social, political, and economic change more broadly?",
            "id": "EDPOL/HISTORY 612",
            "title": "HISTORY OF STUDENT ACTIVISM FROM THE POPULAR FRONT TO BLACK LIVES MATTER"
        }
    },
    {
        "data": {
            "description": "Explores both the form(s) of education in democracies and the controversies that shape education in the contemporary U.S. context. Examines the history of elements of mass schooling in the U.S., analyzes the competing values at play in contemporary issues, and explores some of the human stories behind some of the most enduring problems in U.S. education. Discusses the necessity of education for democratic life, the challenges inherent in mass schooling in the U.S., and the varying positions that animate contemporary educational debates. Evaluates a variety of educational issues on the basis of democratic criteria such as equality, liberty, and justice.",
            "id": "EDPOL 305",
            "parent": "EDPOL",
            "title": "DEMOCRACY AND EDUCATION"
        }
    },
    {
        "data": {
            "description": "Explores how gender, sexuality, and gender identity are conceptualized, practiced, protected, and policed in K-12 schools and in out-of-school contexts in the United States and globally. Examines how gender, sexuality, and gender identity intersect with race, class, language, nationality, and religion to shape the experiences of school-age children and youth.",
            "id": "EDPOL/GEN&WS 160",
            "title": "GENDER, SEXUALITY, AND EDUCATION POLICY"
        }
    },
    {
        "data": {
            "description": "Explores the complex relationships among race, ethnicity and inequality in U.S. public education through theoretical, historical, social, and cultural frameworks and perspectives. Specifically, examine how schools serve are sites where racial/ethnic inequality is produced, reproduced, and resisted through institutional structures and the \"everyday\" practices of teachers, students, parents, and community members. Examine how race and ethnicity intersect with other identities (e.g. gender, social class, sexual orientation, etc.). It is centrally focused on K-12 education and working in multicultural contexts.",
            "id": "EDPOL 200",
            "parent": "EDPOL",
            "title": "RACE, ETHNICITY, AND INEQUALITY IN AMERICAN EDUCATION"
        }
    },
    {
        "data": {
            "description": "Explores the historical relationship between education and the African American freedom struggle from the early twentieth century to the present. Topics include school segregation, desegregation, and resegregation; high school and college student activism; Black Power; civil rights protest strategies and tactics, and the role of the federal government.",
            "id": "AFROAMER/EDPOL/HISTORY 712",
            "title": "EDUCATION AND THE CIVIL RIGHTS MOVEMENT"
        }
    },
    {
        "data": {
            "description": "Explores the meaning, value, and potential of an education/social sciences major for a variety of education-related careers in the contemporary workplace. Includes a review of theories of the relationships among education, work, skills and society, analyses of contextual forces shaping education and the labor market (the Covid-19 pandemic, inequality and racism, and climate change), individual and collaborative assignments focused on developing key competencies (e.g., oral and written communication, critical thinking), and hands-on activities to provide practical tools for succeeding in college and the 21st century workplace (e.g., writing a cover letter, conducting literature reviews).",
            "id": "EDPOL 202",
            "parent": "EDPOL",
            "title": "CAREERS IN EDUCATION"
        }
    },
    {
        "data": {
            "description": "Explores the study of youth through theoretical, historical, social, and cultural perspectives with a focus on Minoritized Youth; interrogates the concept of \"youth\" as a socially constructed category; examines how \"youth\" have been positioned within educational, political, economic, and social contexts; analyzes how youth's racialized experiences intersect with other social identities: social class, gender, and sexuality. Themes explored: conceptions of youth as a social category, education and schooling, race, gender, sexuality, politics and activism, community-based learning, criminal justice, media, and popular culture. Uses historical and contemporary \"texts\" and current events to study the lived experiences of young people within diverse racial, cultural, gendered, sexualized and classed contexts. Reflect on own experiences as \"youth,\" their relationship to education and other social institutions, and how it informs understanding of society, educational theory and practice.",
            "id": "EDPOL 210",
            "parent": "EDPOL",
            "title": "YOUTH, EDUCATION, AND SOCIETY"
        }
    },
    {
        "data": {
            "description": "Explores the ways in which Holocaust history, memory and education are mutually entangled, politically charged and morally complex. Using primarily American sites of memory, critically analyze a variety of representations of the Shoah--in literature, films, memoirs, monuments, museums and classrooms.",
            "id": "CURRIC/EDPOL/HISTORY/JEWISH 515",
            "title": "HOLOCAUST: HISTORY, MEMORY AND EDUCATION"
        }
    },
    {
        "data": {
            "description": "Focus on data analysis and translation of finds and implications. Gain theoretical and practical knowledge and skills regarding coding and analysis techniques, use of qualitative analytic tools, strategies for sharing findings with audiences beyond research team.",
            "id": "COUNPSY/CURRIC/EDPOL/EDPSYCH/ELPA/RP&SE 789",
            "title": "QUALITATIVE RESEARCH METHODS IN EDUCATION: FIELD METHODS II"
        }
    },
    {
        "data": {
            "description": "Focuses on the interplay between schools and society by examining societal and cultural influences on school processes, policies, practices, and pedagogy; or, how society shapes schooling, and conversely, the ways in which schools assist in shaping society. Reflect on the purposes of schools and how these purposes have shifted over time. Examines how assumptions regarding the purposes of schooling interact with debates over how we teach, what we teach, and how we evaluate schools, teachers, and students. Identify the foundations of education in the United States and critically examine the ways in which educational practices and policies impact the lives of students.",
            "id": "EDPOL 300",
            "parent": "EDPOL",
            "title": "SCHOOL AND SOCIETY"
        }
    },
    {
        "data": {
            "description": "Focuses on the role of research and evaluation in program development. Design, plan, and manage research and program evaluations. Includes discussion and debate regarding a series of case studies. Asks how, and under what conditions, research and evaluation contribute to equity goals.",
            "id": "EDPOL 606",
            "parent": "EDPOL",
            "title": "RESEARCH AND EVALUATION PLANNING AND MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Historical and contemporary urban educational issues and policies. Emphasis on the relationship between educational issues in U.S. cities and other issues in cities and metropolitan regions (e.g. housing, poverty, gentrification, community development), as well as the policies and practices that seek to address these issues.",
            "id": "EDPOL 911",
            "parent": "EDPOL",
            "title": "SEMINAR IN URBAN EDUCATION"
        }
    },
    {
        "data": {
            "description": "How can research and evaluation serve as mechanisms for advancing equity and justice? Interdisciplinary approach to foundational understanding of educational research and program evaluation. Explores common types of program evaluation and examine how equity-oriented frameworks can inform research and evaluation projects. Considers how politics shape who evaluates, for what reasons, and with what consequences. Engage in systematic inquiry using evaluation research methods, including data collection, analysis, and interpretation.",
            "id": "EDPOL 601",
            "parent": "EDPOL",
            "title": "RESEARCH AND EVALUATION FOR EQUITY"
        }
    },
    {
        "data": {
            "description": "How do people conceptualize and utilize education to (attempt to) create individual, familial, community, institutional, national, and global change? Push collective understanding about the diverse ways that people have conceptualized change, its goals, and the mechanisms through which to produce change around the world. Explore a diverse range of educational approaches (including formal, informal, non-formal, and \"traditional\" educational models) to transforming the world. Draw on a range of disciplinary and sectoral approaches, including education, public health, and public policy; and a broad range of change models, including individual and peer behavior change, social marketing, social movements, chaos theory, and liberation theory.",
            "id": "EDPOL 423",
            "parent": "EDPOL",
            "title": "EDUCATION FOR GLOBAL CHANGE"
        }
    },
    {
        "data": {
            "description": "Introduce methods for managing secondary data or data not collected for specific research purposes and analyzing it to address educational policies. Focus on quantitative techniques. Use secondary data and statistical software to complete assignments",
            "id": "EDPOL 605",
            "parent": "EDPOL",
            "title": "USING SECONDARY DATA: APPLIED QUANTITATIVE ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Introduces global educational issues, policies, and practices through films. Considers education in context, thinking critically about the role of education in the world. Compares across issues, places, policies, and practices. Examines the diversity of global educational spaces and practices, both in and out the classroom, and the purposes of education in society, including how political socialization, economic development, social mobility, and social solidarity are often in conflict.",
            "id": "EDPOL 112",
            "parent": "EDPOL",
            "title": "GLOBAL EDUCATION THROUGH FILM"
        }
    },
    {
        "data": {
            "description": "Introduces how quantitative research methods are applied in empirical education research. Focused on data exploration, manipulation, visualization, and simple analyses with secondary datasets and R or other programming language.",
            "id": "EDPOL 309",
            "parent": "EDPOL",
            "title": "APPLIED QUANTITATIVE EDUCATION RESEARCH"
        }
    },
    {
        "data": {
            "description": "Introduces qualitative, or ethnographic, research methods, emphasizing those suitable for educational and other organizational settings. Considers strengths and limitations of qualitative approaches in relation to varied research problems. Explores methodological procedures from entry into the field through writing.",
            "id": "C&ESOC/EDPOL/SOC 755",
            "title": "METHODS OF QUALITATIVE RESEARCH"
        }
    },
    {
        "data": {
            "description": "Introduction and application of methods of economic evaluation in education focusing on the use of cost, cost-effectiveness, and benefit-cost analyses. Topics include collecting inputs; pricing; estimating costs; adjusting for inflation, amortization, and units; sensitivity analyses; measuring effectiveness; quantifying benefits; computing rates of return; and communicating results. Lecture and project based with focus on real-world application, data collection, replication, and peer review.",
            "id": "EDPOL 743",
            "parent": "EDPOL",
            "title": "COST-EFFECTIVENESS & BENEFIT-COST ANALYSIS IN EDUCATION"
        }
    },
    {
        "data": {
            "description": "Introduction to K-12 education policy, policy processes, and school governance in the United States. Examines the multiple and sometimes conflicting goals that animate education debates; the discourses and representations of schools, students, and education policies that shape policy and politics; research on education and education policy; and the various lenses and conceptual tools that can help us understand education policy. Includes original policy texts, empirical and conceptual research, current events, and film. Considers how key themes may be useful (or not) for thinking about early childhood education, higher education, and K-12 education in historical and contemporary, US and and global, contexts.",
            "id": "EDPOL 145",
            "parent": "EDPOL",
            "title": "INTRODUCTION TO EDUCATION POLICY"
        }
    },
    {
        "data": {
            "description": "Introduction to conceptual and practical tools for planning, designing, and conducting survey research on education-related issues. Provides an overview of principles in survey methods and relevant issues, including data collection modes, sampling methods, questionnaires and measurement design, possible sources of bias and errors, non-response, and other extended topics. Provides a substantial experience with practical research skills.",
            "id": "EDPOL 688",
            "parent": "EDPOL",
            "title": "INTRODUCTION TO SURVEY METHODS FOR EDUCATION RESEARCH"
        }
    },
    {
        "data": {
            "description": "Introduction to how quantitative inference is used in education policy. Focuses on the use of quantitative reasoning as a tool to analyze and interpret data. Activities support understanding the basics of generating and interpreting data in both visual and numerical form. Includes a practical component that provides opportunities to practice interpreting and writing about data.",
            "id": "EDPOL 209",
            "parent": "EDPOL",
            "title": "INTRODUCTION TO QUANTITATIVE METHODS IN EDUCATION POLICY"
        }
    },
    {
        "data": {
            "description": "Introduction to the origins and development of the field of comparative and international education (CIE) and to explore how scholars engage some of the theoretical, ideological, methodological, and topical debates that characterize research in the field of CIE policy.",
            "id": "EDPOL 675",
            "parent": "EDPOL",
            "title": "INTRODUCTION TO COMPARATIVE AND INTERNATIONAL EDUCATION"
        }
    },
    {
        "data": {
            "description": "Introduction to the relationship between education, technology, and society. Consider issues related to educational technology and society in both domestic and global contexts. Critically examine how different types of educational technology interact with a variety of sociopolitical factors viewed through various stakeholder perspectives.",
            "id": "EDPOL 123",
            "parent": "EDPOL",
            "title": "EDUCATION, TECHNOLOGY, AND SOCIETY: AI, BIG DATA, AND THE DIGITAL DIVIDE"
        }
    },
    {
        "data": {
            "description": "Introductory field methods experience in qualitative research. Learn to define good research questions, determine which methods of data collection and analysis are useful for addressing those questions, engage in these methods, reflect on their utility in education research.",
            "id": "COUNPSY/CURRIC/EDPOL/EDPSYCH/ELPA/RP&SE 788",
            "title": "QUALITATIVE RESEARCH METHODS IN EDUCATION: FIELD METHODS I"
        }
    },
    {
        "data": {
            "description": "Learn theories and practices of educating for social justice, a pedagogical-political approach based on participatory methodologies that is committed to positive social change. Discuss popular education, peace and human rights education, critical pedagogy, and related approaches. Engage in theoretical debates, focusing on the ideas of transformative educators such as Paulo Freire and bell hooks, and learn about radical educator collectives and transformative education efforts in districts, schools, classrooms, community associations, and NGOs from around the world.",
            "id": "EDPOL 212",
            "parent": "EDPOL",
            "title": "EDUCATION FOR SOCIAL JUSTICE"
        }
    },
    {
        "data": {
            "description": "Legal requirements and issues relative to special education and pupil services programs; special education, juvenile justice, programs for English language learners, programs for children who are homeless; examination of applicable federal and state statutes and case law.",
            "id": "EDPOL/EDPSYCH/ELPA/RP&SE 842",
            "title": "LEGAL FOUNDATIONS OF SPECIAL EDUCATION AND PUPIL SERVICES"
        }
    },
    {
        "data": {
            "description": "Overview of language politics, policies, and practices in global perspective; draws on the work of anthropologists, sociolinguists, and language policy scholars to examine how language choices in and regarding schooling interact with ethnic and linguistic diversity. Consider the following questions: How and under what conditions do language policies, practices, and pedagogies redress or exacerbate inequalities? How people at the local level, including educators, negotiate language and literacy policies and politics. Uses a global lens to expand local understandings and practices.",
            "id": "EDPOL 595",
            "parent": "EDPOL",
            "title": "LANGUAGE POLITICS AND EDUCATION"
        }
    },
    {
        "data": {
            "description": "Presents a comprehensive and critical understanding of the international educational development (IED) arena; the paradigms and theories that shape the field; the relationships among major actors and institutions; and themes and issues that have arisen in international educational development over the past decades.",
            "id": "EDPOL 760",
            "parent": "EDPOL",
            "title": "CRITICAL DEVELOPMENT STUDIES AND EDUCATION"
        }
    },
    {
        "data": {
            "description": "Provides an opportunity to engage with and discuss historical, ideological, and contemporary issues within community-based after school programs at large and within the Madison context. Examine the social and political context of after school programs to better understand the ways in which they have the potential to meet important needs.",
            "id": "EDPOL 450",
            "parent": "EDPOL",
            "title": "RETHINKING \"AFTER-SCHOOL\" EDUCATION"
        }
    },
    {
        "data": {
            "description": "Provides an overview of diverse theories and models of human-earth relations, and the causes and consequences of climate and environmental crisis. Centering a global ecological justice lens, develops a critical approach to examining how different people around the world learn about and experience the climate crisis. Provides a range of tools to use in responding to the climate crisis, including learning about and engaging with Teejop and Traditional Ecological Knowledge frameworks, exploring how increased diversity can sustain human survival, and examining the concept of sustainability.",
            "id": "EDPOL 320",
            "parent": "EDPOL",
            "title": "CLIMATE CHANGE, SUSTAINABILITY, AND EDUCATION"
        }
    },
    {
        "data": {
            "description": "Provides an overview of qualitative inquiry, examining assumptions, standards, and methods for generating and communicating interpretations. Methodological and theoretical works illustrate case study, ethnography, narrative, and action research. Does not include a field method component.",
            "id": "COUNPSY/CURRIC/EDPOL/EDPSYCH/ELPA/RP&SE 719",
            "title": "INTRODUCTION TO QUALITATIVE RESEARCH"
        }
    },
    {
        "data": {
            "description": "Provides an overview of the construction of racialized identity in the US and around the world. Examines the relationship between race, ethnicity, and white supremacy as social constructions and connects this to historical and current models of schooling. Explores the concept of settler colonialism and introduces its history in the US and in Wisconsin. Fosters understanding of white supremacy and of formal schooling as national systems that often work to reinforce one another, and of alternative approaches to schooling and society that can foster equity and justice.",
            "id": "EDPOL 180",
            "parent": "EDPOL",
            "title": "EDUCATION AND WHITE SUPREMACY"
        }
    },
    {
        "data": {
            "description": "Provides the opportunity to reflect and critically analyze workplace experience in the field of education, arts, and/or health and enhance career opportunities through the exposure to the nexus of career development theory and practice.",
            "id": "EDPOL 203",
            "parent": "EDPOL",
            "title": "INTERNSHIP IN EDUCATION, ARTS, OR HEALTH"
        }
    },
    {
        "data": {
            "description": "Public education in the United States is an inherently political site that offers an important institution to understand politics, power, and injustice broadly. Explore these themes from multiple angles: (a) the layered histories of injustice at the intersection of race, class, gender, and more in historical and present cases; (b) the power of ideas in shaping policy possibilities; (c) shifting levels of governance and questions of injustice; and (c) perspectives of key actors, interests, and stakeholders. Consider the politics of education in relation to broader social, spatial, historical, and political economic contexts. Develop critical analytic and conceptual tools to deeply understand and analyze how power and politics are impacting contemporary educational policy events. By drawing from grassroots and subjugated perspectives, cultivate a policy imagination towards more just educational possibilities, and explore the necessary policy infrastructure and movements to sustain them.",
            "id": "EDPOL 355",
            "parent": "EDPOL",
            "title": "THE POLITICS OF EDUCATION INJUSTICE IN THE US"
        }
    },
    {
        "data": {
            "description": "Reading in European or American educational history.",
            "id": "EDPOL/HISTORY 906",
            "title": "PROSEMINAR ON THE HISTORY OF EDUCATION"
        }
    },
    {
        "data": {
            "description": "Seeks to provide an introduction to political economy in the field of education from a theoretical, historical, and comparative perspective.",
            "id": "EDPOL 745",
            "parent": "EDPOL",
            "title": "POLITICAL ECONOMY AND EDUCATION"
        }
    },
    {
        "data": {
            "description": "Selected topics, issues and themes concerning the history of education of various groups of people of color in the United States, as well as selected issues, topics and themes focusing on immigration and ethnicity.",
            "id": "EDPOL/HISTORY 903",
            "title": "HISTORY OF EDUCATION OF MULTICULTURAL AMERICA"
        }
    },
    {
        "data": {
            "description": "Selected topics.",
            "id": "EDPOL/SOC 908",
            "title": "SEMINAR-SOCIOLOGY OF EDUCATION"
        }
    },
    {
        "data": {
            "description": "Studies in European and American educational history.",
            "id": "EDPOL/HISTORY 907",
            "title": "SEMINAR-HISTORY OF EDUCATION"
        }
    },
    {
        "data": {
            "description": "Survey of indigenous and introduced forms of African education, formal and informal, in comparative format. The impact of Islam and Christianity on traditional educational styles. The struggle for modernity and cultural autonomy within the context of imperialism and international rivalries. Problems of nation-building, popular participation, and human resource development; educational planning and international cooperation.",
            "id": "EDPOL 750",
            "parent": "EDPOL",
            "title": "AFRICAN EDUCATION: PAST, PRESENT AND FUTURE"
        }
    },
    {
        "data": {
            "description": "Teaches the goals, purposes and methods associated with community-engaged, participatory research and evaluation, including the following: 1) the political and philosophical underpinnings of the approach, and specifically of participatory action research (PAR); 2) qualitative research methods; 3) examples of community-engaged, participatory studies.",
            "id": "EDPOL 580",
            "parent": "EDPOL",
            "title": "PARTICIPATORY AND COMMUNITY-BASED RESEARCH AND EVALUATION"
        }
    },
    {
        "data": {
            "description": "The United Nations High Commissioner for Refugees (UNHCR) estimates that more than 82.4 million individuals have been forcibly displaced from their homes. More than a third of them are refugees, and more than 13 million are under the age of 18. In contrast to the portrayals of children wandering among the iconic UNHCR white tents in refugee camps, new images of refugee boys and girls attending public schools raise questions about the role of humanitarianism and education across the world. What are the causes of forced migration? Who counts as a refugee today? What do camp refugees and urban refugees have in common? How do we guarantee access to school for these populations? What would a high-quality curriculum look like for these students?",
            "id": "EDPOL 435",
            "parent": "EDPOL",
            "title": "EDUCATION IN EMERGENCIES"
        }
    },
    {
        "data": {
            "description": "Theory, research, and practical experience in educational policy analysis, including the social construction of policy problems in education; the design, implementation, and evaluation of policy responses; and the practical and ethical dilemmas of the policy analyst.",
            "id": "EDPOL/ELPA/PUBAFFR 765",
            "title": "ISSUES IN EDUCATIONAL POLICY ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Topics vary each semester.",
            "id": "EDPOL 780",
            "parent": "EDPOL",
            "title": "SPECIAL TOPICS IN EDUCATIONAL POLICY STUDIES"
        }
    },
    {
        "data": {
            "description": "Topics vary reflecting the specializations, expertise, and curricula of study-abroad programs.",
            "id": "EDPOL 274",
            "parent": "EDPOL",
            "title": "EDUCATION STUDIES--STUDY ABROAD/GLOBAL EDUCATION"
        }
    },
    {
        "data": {
            "description": "Topics vary. Examples: education and the formation of elites; education and socio-economic development; the social functions of examinations; comparative studies in church-state-school relationships; the status of teachers; American overseas programs in educational modernization.",
            "id": "EDPOL 962",
            "parent": "EDPOL",
            "title": "SEMINAR IN CROSS NATIONAL STUDIES OF EDUCATIONAL PROBLEMS"
        }
    },
    {
        "data": {
            "description": "Traces the development of higher education and, specifically, the institution known as the \"university,\" in the United States and Europe since the Middle Ages. Concentrates on the intellectual, political, and social history of higher education, focusing particularly on the history of the \"university\" as an IDEA, an INSTITUTION, and as a community of PEOPLE, including students and faculty.",
            "id": "EDPOL/HISTORY 107",
            "title": "THE HISTORY OF THE UNIVERSITY IN THE WEST"
        }
    },
    {
        "data": {
            "description": "Utilizes a sociological lens to examine American schools and schooling, with a particular focus on social inequality in the U.S. and how class, race, and gender intersect in the experiences of students. Examine how schools and schooling relate to broader social structures, institutions, and practices with a focus on inequality in public education.",
            "id": "EDPOL/SOC 648",
            "title": "SOCIOLOGY OF EDUCATION"
        }
    },
    {
        "data": {
            "description": "What if our best teacher is all around us, even under our feet? For Indigenous peoples, whose worldviews, languages, and lifeways emerge from, and sustain, reciprocal relations to place, land is always teaching. Reflect on \"land as first teacher\" by considering Indigenous approaches to learning, Indigenous languages in relation to land, and the current environmental health of land. Seeks to live the principles of Indigenous learning through Indigenous foodways and experiential, place-based learning activities. Together, develop a personal relationship to Teejop (Four Lakes, or the Madison region), and explore generational responsibilities to Teejop. What does the land teach? And how do people learn to listen?",
            "id": "EDPOL 197",
            "parent": "EDPOL",
            "title": "LISTENING TO THE LAND"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "EDPOL",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "COUNPSY/CURRIC/EDPOL/EDPSYCH/ELPA/RP&SE 719",
            "target": "COUNPSY/CURRIC/EDPOL/EDPSYCH/ELPA/RP&SE 788"
        }
    },
    {
        "data": {
            "source": "COUNPSY/CURRIC/EDPOL/EDPSYCH/ELPA/RP&SE 788",
            "target": "COUNPSY/CURRIC/EDPOL/EDPSYCH/ELPA/RP&SE 789"
        }
    },
    {
        "data": {
            "source": "EDPOL 209",
            "target": "EDPOL 309"
        }
    },
    {
        "data": {
            "source": "EDPOL 300",
            "target": "CHICLA/EDPOL/LACIS 342"
        }
    }
]