[
    {
        "data": {
            "source": "EDPSYCH 763",
            "target": "EDPSYCH 960"
        }
    },
    {
        "data": {
            "description": "",
            "id": "EDPSYCH 999",
            "parent": "EDPSYCH",
            "title": "INDEPENDENT READING"
        }
    },
    {
        "data": {
            "description": "Reviews major psychological disorders of childhood and adolescence as relevant to schools; examines etiology and developmental course, documenting major characteristics and behavior correlates of disorders; provides a comparison of major diagnostic and classification systems for childhood psychopathology.",
            "id": "EDPSYCH 844",
            "parent": "EDPSYCH",
            "title": "CHILDHOOD AND ADOLESCENT PSYCHOPATHOLOGY IN SCHOOLS"
        }
    },
    {
        "data": {
            "description": "Introduces concepts and tools of statistical thinking and analysis, coordinated with activities designed to develop statistical literacy and decision-making skills in real-world problem contexts.",
            "id": "EDPSYCH 215",
            "parent": "EDPSYCH",
            "title": "PROBABLY CORRECT: HOW TO THINK WITH STATISTICS AND DATA"
        }
    },
    {
        "data": {
            "description": "Registration for Ph.D. students who have successfully defended the dissertation and are in the process of completing the required predoctoral internship.",
            "id": "COUNPSY/EDPSYCH/PSYCH/RP&SE 995",
            "title": "PREDOCTORAL INTERNSHIP"
        }
    },
    {
        "data": {
            "source": "EDPSYCH 761",
            "target": "EDPSYCH 871"
        }
    },
    {
        "data": {
            "description": "Provides an in-depth review and analysis of specific areas of human development, such as cognitive, moral, language, neurological, social, and personality development.",
            "id": "EDPSYCH 925",
            "parent": "EDPSYCH",
            "title": "ADVANCED SEMINAR IN HUMAN DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "An introduction to issues in consuming and conducting education research. Focus on research paradigms and methods frequently used in education research.",
            "id": "EDPSYCH 752",
            "parent": "EDPSYCH",
            "title": "ENGAGING WITH EDUCATION RESEARCH"
        }
    },
    {
        "data": {
            "description": "Focus on research and measurement methods, special topics, technical writing, and ethical principles in conducting research in school psychology. Emphasis on skills needed to design and complete individual research projects.",
            "id": "EDPSYCH 948",
            "parent": "EDPSYCH",
            "title": "RESEARCH AND MEASUREMENT SEMINAR IN SCHOOL PSYCHOLOGY"
        }
    },
    {
        "data": {
            "description": "",
            "id": "EDPSYCH 990",
            "parent": "EDPSYCH",
            "title": "RESEARCH OR THESIS"
        }
    },
    {
        "data": {
            "description": "Culminating project that must be completed successfully to qualify to earn the degree. Integrates knowledge, skills, and experiential learning to demonstrate a broad mastery of learning across the program curriculum.",
            "id": "EDPSYCH 791",
            "parent": "EDPSYCH",
            "title": "MASTER OF SCIENCE FOR PROFESSIONAL EDUCATORS CAPSTONE"
        }
    },
    {
        "data": {
            "description": "Individual differences in and contextual influences on physical, cognitive, social, and personality development.",
            "id": "EDPSYCH 721",
            "parent": "EDPSYCH",
            "title": "ADOLESCENT DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Focuses on knowledge and skills teachers need to be leaders in their schools in facilitating the development of strong learning communities that include students, teachers, families, administrators, and other educators. Understand key concepts, theories, and models used in building and sustaining effective learning communities; develop skills in creating practices that contribute to effective teacher leadership; and identify and strengthen skills needed to lead schools to build learning communities that promote student learning.",
            "id": "EDPSYCH/ELPA 780",
            "title": "TEACHER LEADERSHIP AND LEARNING COMMUNITIES"
        }
    },
    {
        "data": {
            "description": "Introduction to the theory and practice of structural equation modeling in the educational and social sciences, including path analysis, confirmatory factor analysis and hybrid models.",
            "id": "EDPSYCH 960",
            "parent": "EDPSYCH",
            "title": "STRUCTURAL EQUATION MODELING"
        }
    },
    {
        "data": {
            "description": "",
            "id": "EDPSYCH 699",
            "parent": "EDPSYCH",
            "title": "INDEPENDENT READING UNDERGRAD"
        }
    },
    {
        "data": {
            "description": "Current issues in educational psychology.",
            "id": "EDPSYCH 711",
            "parent": "EDPSYCH",
            "title": "CURRENT TOPICS IN EDUCATIONAL PSYCHOLOGY"
        }
    },
    {
        "data": {
            "description": "Assessments provide teachers with multiple types and sets of data which can inform their  instructional practices. Engages participants in discussions about data sets and then provide them with opportunities to conduct analyses that link to instructional adjustments.  Continually focus on how to engage in productive coaching conversations with teachers and other instructional leaders about effectively designing and using assessment data to enhance student learning outcomes.",
            "id": "EDPSYCH 642",
            "parent": "EDPSYCH",
            "title": "ASSESSMENT ANALYSIS AND INSTRUCTIONAL DECISION-MAKING"
        }
    },
    {
        "data": {
            "source": "EDPSYCH 829",
            "target": "EDPSYCH 830"
        }
    },
    {
        "data": {
            "description": "Procedures for development and analysis of educational tests and questionnaires; strategies for measurement of achievement, attitude, and interests; procedures for item analysis and assessment of reliability and validity.",
            "id": "EDPSYCH 771",
            "parent": "EDPSYCH",
            "title": "TEST CONSTRUCTION"
        }
    },
    {
        "data": {
            "source": "EDPSYCH 301",
            "target": "EDPSYCH 551"
        }
    },
    {
        "data": {
            "description": "Areas of research in field, emphasis on logic of inquiry and development of strategies for investigating particular problems.",
            "id": "EDPSYCH 709",
            "parent": "EDPSYCH",
            "title": "SEMINAR IN RESEARCH IN EDUCATIONAL PSYCHOLOGY I"
        }
    },
    {
        "data": {
            "description": "This course covers both classic and contemporary theories, providing students with a firm grounding in the theoretical perspectives that have shaped and are shaping  understandings of human development across the life-span. The course explores the historical roots of contemporary perspectives and examines the development of theoretical conceptualizations both within and across theoretical perspectives.",
            "id": "EDPSYCH/HDFS 725",
            "title": "THEORY AND ISSUES IN HUMAN DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Methods and concepts of survey research methods as they are commonly used in education research. Strategies include surveys (phone, mail, electronic, in person), logs/diaries, and experience sampling instruments. Emphasis is given to self-administered surveys, including periodic surveys, since these strategies are the most common in education research.",
            "id": "EDPSYCH/ELPA 827",
            "title": "SURVEYS AND OTHER QUANTITATIVE DATA COLLECTION STRATEGIES"
        }
    },
    {
        "data": {
            "description": "Explores the theoretical foundations and practical use of learning analytics for instructional design. Preparation for professional practice with hands-on experience designing learning environments modeled to predict success and retention. Focuses on understanding the ways in which learning analytics can be used to develop experiences and environments that support strategic learning outcomes.",
            "id": "EDPSYCH 575",
            "parent": "EDPSYCH",
            "title": "INSTRUCTIONAL DESIGN FOR LEARNING ANALYTICS"
        }
    },
    {
        "data": {
            "description": "An introduction to principles and techniques used in the supervision of school personnel, including pre-service candidates and professional school staff. A range of supervisory strategies aimed at enhancing teaching and learning in the classroom will be examined. Gain knowledge in clinical supervision, adult learning theory, and evaluation systems used to improve teaching and learning.",
            "id": "EDPSYCH 631",
            "parent": "EDPSYCH",
            "title": "SUPERVISION OF SCHOOL PERSONNEL"
        }
    },
    {
        "data": {
            "description": "Presents introductory research procedures in the social sciences, including the exploration of theoretical foundations and practical use of basic tools and programs needed for quantitative and qualitative data analysis. Examines how different methodologies can complement or compete with the other, and showcases how pertinent quantitative and qualitative methods are applied in the field of learning analytics with particular emphasis on data about - and therefore issues in - learning environments such as classrooms, online courses, apprenticeships and internships, museum exhibits, after school programs, and other formal and informal educational contexts.",
            "id": "EDPSYCH 560",
            "parent": "EDPSYCH",
            "title": "FOUNDATIONS OF QUANTITATIVE AND QUALITATIVE RESEARCH METHODS"
        }
    },
    {
        "data": {
            "description": "Designed to enhance the practical application of principles and techniques used in the supervision of school personnel covered in Supervision of School Personnel. A variety of interactive exercises and activities are incorporated into the course to assist in the development of practical skills. Apply principles covered in the course in school settings and with supervisees.",
            "id": "EDPSYCH 632",
            "parent": "EDPSYCH",
            "title": "PRACTICUM IN SUPERVISION OF SCHOOL PERSONNEL"
        }
    },
    {
        "data": {
            "description": "Increases the capacity of graduate students to conduct high-quality single-case intervention research, by improving the scientific credibility of both the methodology; and the visual and statistical analysis of their studies. Equip skills and knowledge to critically analyze published intervention research and to implement quality intervention research studies.",
            "id": "EDPSYCH 743",
            "parent": "EDPSYCH",
            "title": "DESIGN AND ANALYSIS OF SINGLE-CASE RESEARCH"
        }
    },
    {
        "data": {
            "source": "EDPSYCH 795",
            "target": "EDPSYCH 796"
        }
    },
    {
        "data": {
            "description": "Introduction to the professional roles and functions of school psychologists; historical development; legal and ethical issues; overview of assessment, intervention, and consultation for children and adolescents at risk for, or with, academic, behavioral, emotional, and social difficulties; applied research in school psychology.",
            "id": "EDPSYCH 540",
            "parent": "EDPSYCH",
            "title": "INTRODUCTION TO PROFESSIONAL SCHOOL PSYCHOLOGY"
        }
    },
    {
        "data": {
            "description": "Review of empirical and theoretical research on ethnic/racial diversity in social development across childhood, adolescence and early adulthood with emphasis on implications for counseling and school psychology.",
            "id": "COUNPSY/EDPSYCH/HDFS 726",
            "title": "ETHNIC AND RACIAL DIVERSITY IN SOCIAL DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Designed to explore the psychological principles that are relevant to learning, knowing, and teaching. Focuses on ideas, questions, and contextual applications. Reflect on personal approaches to learning, knowing, and teaching, and think about past, present, and future experiences through a variety of different lenses.",
            "id": "EDPSYCH 501",
            "parent": "EDPSYCH",
            "title": "THINKING AND LEARNING"
        }
    },
    {
        "data": {
            "description": "Normative processes and individual differences in physical, mental, social and emotional development and behavior from infancy through late childhood.",
            "id": "EDPSYCH 320",
            "parent": "EDPSYCH",
            "title": "HUMAN DEVELOPMENT IN INFANCY AND CHILDHOOD"
        }
    },
    {
        "data": {
            "description": "Physiological, social, and cognitive changes which characterize the transition from childhood to adult life.",
            "id": "EDPSYCH 321",
            "parent": "EDPSYCH",
            "title": "HUMAN DEVELOPMENT IN ADOLESCENCE"
        }
    },
    {
        "data": {
            "description": "Provides knowledge and skills necessary to effectively and efficiently engage with students and manage the classroom environment. Ability to support the academic and social-emotional growth of children enhanced through knowledge gained regarding children's self-regulation, motivation, school climate, multi-tiered behavioral interventions, and school wide positive behavior support.",
            "id": "EDPSYCH 745",
            "parent": "EDPSYCH",
            "title": "DESIGNING AND MANAGING THE LEARNING ENVIRONMENT"
        }
    },
    {
        "data": {
            "description": "Principles of learning emphasizing higher order cognitive and social processes.",
            "id": "EDPSYCH 796",
            "parent": "EDPSYCH",
            "title": "INTRODUCTION TO THE LEARNING SCIENCES II"
        }
    },
    {
        "data": {
            "description": "Seminar in the psychology of individual differences, providing broad and general coverage of theory and research related to individual and cultural differences.",
            "id": "COUNPSY/EDPSYCH/RP&SE 736",
            "title": "SEMINAR IN PSYCHOLOGY OF INDIVIDUAL DIFFERENCES"
        }
    },
    {
        "data": {
            "description": "Legal requirements and issues relative to special education and pupil services programs; special education, juvenile justice, programs for English language learners, programs for children who are homeless; examination of applicable federal and state statutes and case law.",
            "id": "EDPOL/EDPSYCH/ELPA/RP&SE 842",
            "title": "LEGAL FOUNDATIONS OF SPECIAL EDUCATION AND PUPIL SERVICES"
        }
    },
    {
        "data": {
            "source": "EDPSYCH 760",
            "target": "EDPSYCH 761"
        }
    },
    {
        "data": {
            "description": "Research experience under the supervision of a faculty member in Educational Psychology. Develop an understanding of research in a topic area and  participate in team-based research. Reading includes published research studies relevant to the selected topic, and evaluation includes presentations in group meetings or a paper based on the research conducted.",
            "id": "EDPSYCH 470",
            "parent": "EDPSYCH",
            "title": "RESEARCH EXPERIENCE IN EDUCATIONAL PSYCHOLOGY"
        }
    },
    {
        "data": {
            "description": "Introduction to communication methods using learning analytics data. Presentation modes include verbal conversations and visual representations. Addresses questions including: What data is consumable? How can we make this data meaningful for a client? Etc. Practice with stakeholder reports and presentations allows engagement in meaningful and effective communication strategies to enhance understanding of learning analytics data.",
            "id": "EDPSYCH 615",
            "parent": "EDPSYCH",
            "title": "CONVERSATIONS AND VISUALIZATIONS"
        }
    },
    {
        "data": {
            "description": "Survey of major theories and elementary cognitive and social processes in learning.",
            "id": "EDPSYCH 795",
            "parent": "EDPSYCH",
            "title": "INTRODUCTION TO LEARNING SCIENCES I"
        }
    },
    {
        "data": {
            "source": "COUNPSY/CURRIC/EDPOL/EDPSYCH/ELPA/RP&SE 719",
            "target": "COUNPSY/CURRIC/EDPOL/EDPSYCH/ELPA/RP&SE 788"
        }
    },
    {
        "data": {
            "description": "Covers the cognitive and emotional foundations of behavior with special reference to processes of learning and change. How does the science of thinking and feeling inform interventions such as teaching, counseling, or parenting? Topics covered include: dual-systems theories, neural and behavioral aspects of emotion and cognitive control, intuition, and expertise. Focus on the relation between unconscious, automatic processes and deliberate, effortful processes guiding behavior.",
            "id": "EDPSYCH 533",
            "parent": "EDPSYCH",
            "title": "THINKING, FEELING, & LEARNING"
        }
    },
    {
        "data": {
            "description": "Social and psychological aspects of human development from early childhood through adolescence; implications for education.",
            "id": "EDPSYCH 331",
            "parent": "EDPSYCH",
            "title": "HUMAN DEVELOPMENT FROM CHILDHOOD THROUGH ADOLESCENCE"
        }
    },
    {
        "data": {
            "description": "Expand competence in delivering a range of psychological services in a variety of health service psychology settings. Specific experiences will be individualized and may allow for specialization in a specific area of practice or provide training to enhance foundational skills.",
            "id": "EDPSYCH 840",
            "parent": "EDPSYCH",
            "title": "ADVANCED PRACTICUM IN SCHOOL PSYCHOLOGY"
        }
    },
    {
        "data": {
            "description": "Applies principles of educational psychology to the study of various aspects of diversity in human learning and development. Course readings and participation in diversity events sponsored by the department or other university organizations form the basis for class discussions of how diversity impacts the study of educational psychology.",
            "id": "EDPSYCH 712",
            "parent": "EDPSYCH",
            "title": "EDUCATIONAL PSYCHOLOGY DIVERSITY SEMINAR"
        }
    },
    {
        "data": {
            "description": "Designed to integrate and apply concepts and practices from the previous coaching courses, engage in discussions and readings to think critically and reflect on coaching practices. Engage in coaching activities at the individual and/or team level and take an active role in the online Instructional Coaching Professional Learning Community at UW-Madison. Provides additional opportunities to engage in collaborative inquiry into coaching practices that account for sociocultural and student-centered instructional practices, attention to components of adult learning theory, and analysis of coaching roles through language use and norms of facilitation.",
            "id": "EDPSYCH 643",
            "parent": "EDPSYCH",
            "title": "PRACTICUM FOR INSTRUCTIONAL COACHING"
        }
    },
    {
        "data": {
            "description": "Focus on data analysis and translation of finds and implications. Gain theoretical and practical knowledge and skills regarding coding and analysis techniques, use of qualitative analytic tools, strategies for sharing findings with audiences beyond research team.",
            "id": "COUNPSY/CURRIC/EDPOL/EDPSYCH/ELPA/RP&SE 789",
            "title": "QUALITATIVE RESEARCH METHODS IN EDUCATION: FIELD METHODS II"
        }
    },
    {
        "data": {
            "description": "Seminar in the history of psychology, providing broad and general coverage of the development of psychology as a scientific discipline. Includes coverage of philosophy of science and systems of psychological inquiry, with applications to current research in psychology.",
            "id": "COUNPSY/EDPSYCH/RP&SE 737",
            "title": "SEMINAR IN HISTORY AND SYSTEMS OF PSYCHOLOGY"
        }
    },
    {
        "data": {
            "source": "EDPSYCH 828",
            "target": "EDPSYCH 829"
        }
    },
    {
        "data": {
            "description": "Introduction to the statistical methodology of hierarchical linear modeling, including random intercept and random slope and intercept models; models for longitudinal data; and multilevel generalized linear models.",
            "id": "EDPSYCH 964",
            "parent": "EDPSYCH",
            "title": "HIERARCHICAL LINEAR MODELING"
        }
    },
    {
        "data": {
            "description": "Selected aspects of intellectual, emotional, physiological, personality and social development in adolescence. Understanding adolescent behavior in educational settings.",
            "id": "EDPSYCH 921",
            "parent": "EDPSYCH",
            "title": "SEMINAR IN ADOLESCENT DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Advanced level seminar that involves critical analysis of conceptual and methodological issues underlying empirical research on how social media affect and are affected by adolescent development, provides a venue for feedback on design of research studies involving youth and social media, and fosters interdisciplinary approaches to studying connections between youth development and social media use.",
            "id": "COMARTS/EDPSYCH 626",
            "title": "YOUTH DEVELOPMENT AND SOCIAL MEDIA: INTERDISCIPLINARY TRAINING SEMINAR"
        }
    },
    {
        "data": {
            "description": "Overview of physical, cognitive, emotional, and social development during adolescence as these factors influence and are influenced by young people's experiences in educational institutions.",
            "id": "EDPSYCH 621",
            "parent": "EDPSYCH",
            "title": "ADOLESCENT DEVELOPMENT IN EDUCATIONAL CONTEXTS"
        }
    },
    {
        "data": {
            "description": "Develop competence in delivering school psychological services in a school or other applied setting under the supervision of a practicing psychologist. Provide assessment, consultation, and intervention with increasing independence under the direct supervision of field supervisors and the university coordinator.",
            "id": "EDPSYCH 830",
            "parent": "EDPSYCH",
            "title": "FIELD PRACTICUM IN SCHOOL PSYCHOLOGY"
        }
    },
    {
        "data": {
            "description": "Introduces guest speakers who specialize in applying learning analytics in a variety of professional environments and to a variety of time-sensitive topics (spanning between the student-level within a classroom, institutional effectiveness at a university, educational technology development, national standardized assessments, and beyond). Engage in a comprehensive consulting project that pairs student teams with a learning organization of their choice to design and produce a consulting report to be presented to key stakeholders. Builds on knowledge and skills learned in prior courses and requires application of program concepts in authentic contexts.",
            "id": "EDPSYCH 695",
            "parent": "EDPSYCH",
            "title": "CAPSTONE IN LEARNING ANALYTICS"
        }
    },
    {
        "data": {
            "source": "EDPSYCH 761",
            "target": "EDPSYCH 763"
        }
    },
    {
        "data": {
            "source": "EDPSYCH 640",
            "target": "EDPSYCH 641"
        }
    },
    {
        "data": {
            "description": "Theory underlying validity, scoring procedures, prediction and classification, normal, binomial, Poisson and logistic model, including item response theory models.",
            "id": "EDPSYCH 871",
            "parent": "EDPSYCH",
            "title": "TEST THEORY II"
        }
    },
    {
        "data": {
            "source": "EDPSYCH 642",
            "target": "EDPSYCH 643"
        }
    },
    {
        "data": {
            "description": "An opportunity to meet with prevention professionals and scholars from across campus and the community to explore current and emerging issues of prevention research and professional practice.  Students must completeHDFS/​ED PSYCH/​NURSING/​SOC WORK  880before taking this course.",
            "id": "EDPSYCH/HDFS/NURSING/SOCWORK 881",
            "title": "CAPSTONE SEMINAR IN PREVENTION SCIENCE"
        }
    },
    {
        "data": {
            "description": "Provides a broad overview of ways of formulating and investigating novel questions with tools from educational data mining and learning analytics including social network analysis, natural language processing, Markov modeling, Bayesian inference, and agent-based modeling.",
            "id": "CURRIC/EDPSYCH/LIS 803",
            "title": "COMPUTATIONAL RESEARCH METHODS"
        }
    },
    {
        "data": {
            "description": "Planning and conducting empirical research project, with assistance from faculty advisor and course faculty.",
            "id": "EDPSYCH 710",
            "parent": "EDPSYCH",
            "title": "SEMINAR IN RESEARCH IN EDUCATIONAL PSYCHOLOGY II"
        }
    },
    {
        "data": {
            "description": "A comprehensive introduction to practice of program evaluation research in social welfare and human development. Developments in descriptive, experimental, quasi-experimental, theory-driven, and naturalistic evaluations detailed. Topics include assessment, evaluation design, monitoring, outcome evaluation, selection bias, program theory, meta-analysis and utilization.",
            "id": "EDPSYCH/SOCWORK 945",
            "title": "EVALUATION RESEARCH"
        }
    },
    {
        "data": {
            "source": "EDPSYCH 641",
            "target": "EDPSYCH 642"
        }
    },
    {
        "data": {
            "description": "Develop foundational competencies in the practice of professional psychology, including professional values and attitudes, individual and cultural diversity; ethical standards and policy; reflective practice/self-care; relationships; scientific knowledge and method; and research/evaluation. Develop professional identities as psychologists and emerging clinical skills.",
            "id": "EDPSYCH 828",
            "parent": "EDPSYCH",
            "title": "BEGINNING PRACTICUM IN SCHOOL PSYCHOLOGY"
        }
    },
    {
        "data": {
            "description": "Survey of constructionist theory, research, and tools. Develop a deeper understanding of the history, theories, philosophies, tools, research, and technologies of constructionism and its children.",
            "id": "CURRIC/EDPSYCH 821",
            "title": "CONSTRUCTIONISM"
        }
    },
    {
        "data": {
            "source": "EDPSYCH 763",
            "target": "EDPSYCH 964"
        }
    },
    {
        "data": {
            "description": "Introduction to the psychology of forgiveness, including development and variations in appropriation of forgiveness, consequences of forgiving, and separating ideas of reconciliation and forgiveness.",
            "id": "EDPSYCH 322",
            "parent": "EDPSYCH",
            "title": "THE PSYCHOLOGY AND MORAL DEVELOPMENT OF FORGIVENESS"
        }
    },
    {
        "data": {
            "description": "Introduction to theories of learning in formal and informal settings, including theories related to memory, learning, and intelligence; cognitive, social, and affective aspects of learning; the influence of context on learning, including learning with psychological tools, such as language and technological resources; individual differences that may affect learning; and practical applications of learning theory.",
            "id": "EDPSYCH 301",
            "parent": "EDPSYCH",
            "title": "HOW PEOPLE LEARN"
        }
    },
    {
        "data": {
            "source": "EDPSYCH 740",
            "target": "EDPSYCH 741"
        }
    },
    {
        "data": {
            "description": "Introductory descriptive statistics and statistical inference; measures of central tendency and variability, confidence intervals, theory of hypothesis testing, correlation techniques.",
            "id": "EDPSYCH 760",
            "parent": "EDPSYCH",
            "title": "STATISTICAL METHODS APPLIED TO EDUCATION I"
        }
    },
    {
        "data": {
            "description": "Application of behavioral analysis to educational situations for both exceptional and normal children and adolescents.",
            "id": "EDPSYCH 541",
            "parent": "EDPSYCH",
            "title": "APPLIED BEHAVIOR ANALYSIS IN CLASSROOMS"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Application of data mining techniques to large educational datasets to gain important insights into how people learn. Examines the spectrum of prevalent learning analytics methods and applications, from institutional effectiveness, to classroom-level interventions, to standardized assessments, and beyond.",
            "id": "EDPSYCH 525",
            "parent": "EDPSYCH",
            "title": "LEARNING ANALYTICS THEORY AND PRACTICE"
        }
    },
    {
        "data": {
            "description": "Supervised individualized placements in appropriate schools, institutions, and community agencies; controlled exposure to job demands of school psychologists; experience in dealing with problem children, adolescents, and their families.",
            "id": "EDPSYCH 943",
            "parent": "EDPSYCH",
            "title": "INTERNSHIP IN SCHOOL PSYCHOLOGY"
        }
    },
    {
        "data": {
            "description": "Major types of factor models, nonmetric multidimensional scaling methods and clustering procedures. Methods of data collection, mathematical algorithms, estimating the number of factors, transformation and identification of factors.",
            "id": "EDPSYCH 773",
            "parent": "EDPSYCH",
            "title": "FACTOR ANALYSIS, MULTIDIMENSIONAL SCALING AND CLUSTER ANALYSIS"
        }
    },
    {
        "data": {
            "id": "EDPSYCH",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "EDPSYCH 760",
            "target": "EDPSYCH 771"
        }
    },
    {
        "data": {
            "description": "Principles of human-computer interaction (HCI); human subjects research methods and procedures, qualitative and quantitative data analysis; and semester-long research project situated in critical domains of HCI, including applications in ubiquitous, affective, assistive, social, and embodied computing.",
            "id": "COMPSCI/EDPSYCH/PSYCH 770",
            "title": "HUMAN-COMPUTER INTERACTION"
        }
    },
    {
        "data": {
            "source": "EDPSYCH 761",
            "target": "EDPSYCH 773"
        }
    },
    {
        "data": {
            "description": "Individual development in infancy and childhood. Individual differences in and contextual influences on physical, cognitive, social, and personality development.",
            "id": "EDPSYCH 720",
            "parent": "EDPSYCH",
            "title": "CHILD DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Classical experimental designs and their application to educational research, factorial treatment arrangements, confounding, repeated measures design, and related topics.",
            "id": "EDPSYCH 762",
            "parent": "EDPSYCH",
            "title": "INTRODUCTION TO THE DESIGN OF EDUCATIONAL EXPERIMENTS"
        }
    },
    {
        "data": {
            "description": "Theoretical, empirical and practical foundation for prevention science as it relates to the prevention of human social problems. Research and evaluation methods, program design strategies, best practices and policy as they relate to the field of prevention are also examined.",
            "id": "EDPSYCH/HDFS/NURSING/SOCWORK 880",
            "title": "PREVENTION SCIENCE"
        }
    },
    {
        "data": {
            "description": "Explore perspectives related to human flourishing from the sciences and humanities; investigate themes such as transformation, resilience, compassion, diversity, gratitude, community; expand self-awareness, enhanced social connectivity, and ability to change; formulate a sense of what it means to lead a flourishing life that sustains meaningful and fulfilling engagement with studies, relationships, community, and career.",
            "id": "ASIAN/COUNPSY/EDPSYCH/PSYCH 120",
            "title": "THE ART AND SCIENCE OF HUMAN FLOURISHING"
        }
    },
    {
        "data": {
            "description": "Influence of educational psychology upon issues and innovations in education.",
            "id": "EDPSYCH 506",
            "parent": "EDPSYCH",
            "title": "CONTEMPORARY ISSUES IN EDUCATIONAL PSYCHOLOGY"
        }
    },
    {
        "data": {
            "source": "COUNPSY/CURRIC/EDPOL/EDPSYCH/ELPA/RP&SE 788",
            "target": "COUNPSY/CURRIC/EDPOL/EDPSYCH/ELPA/RP&SE 789"
        }
    },
    {
        "data": {
            "description": "An applied introduction to regression techniques is given, covering nonparametric regression, multiple linear regression and logistic regression. All applied analyses are done in the statistical programming language R.",
            "id": "EDPSYCH 763",
            "parent": "EDPSYCH",
            "title": "REGRESSION MODELS IN EDUCATION"
        }
    },
    {
        "data": {
            "description": "Life-span perspective on studying individual development from conception to death. Emphasis on multidisciplinary, multidirectional, and contextual approaches to physical, psychological, social, and intellectual developmental processes.",
            "id": "COUNPSY/EDPSYCH 723",
            "title": "DEVELOPMENTAL PROCESSES ACROSS THE LIFE SPAN"
        }
    },
    {
        "data": {
            "description": "As instructional leaders, coaches play an important role in building the capacity and collective efficacy of school teams. Begin to explore the strategies at the heart of this process by engaging in discussions about the role of the instructional coach, the various models of instructional coaching, and the diverse ways instructional coaches collaborate with teachers and school leaders in and out of the classroom to support students as learners. Explore effective questioning techniques, coaching conversations, facilitation strategies, working with adult learners, navigating conflict, and verbal and nonverbal communication skills. While instructional coaches provide confidential, non-evaluative, job-embedded professional learning for fellow educators, they must also advocate for their own ongoing needs as learners, build trusting relationships with colleagues, and garner support from administration.",
            "id": "EDPSYCH 640",
            "parent": "EDPSYCH",
            "title": "FOUNDATIONS OF INSTRUCTIONAL COACHING"
        }
    },
    {
        "data": {
            "description": "Theories of embodied cognition, and related theories of enacted, extended, and embedded cognition, have had increasing influence on general theories of cognition and philosophy of mind, and therefore have importance for education. Featuring interdisciplinary work, with readings and topics drawn from scholarly literature from several fields, including: neuroscience, psychology, philosophy, robotics and artificial intelligence, phenomenology, linguistics, and anthropology. Develop familiarity with the prevailing theories, empirical findings, and methodologies used to investigate ways that the body and body-based processes (such as perception) influence and constitute cognition, and the implications and applications of embodied cognition for education, including learning, assessment, and teaching practices. Apply these theories to research and design projects.",
            "id": "EDPSYCH 509",
            "parent": "EDPSYCH",
            "title": "EMBODIED COGNITION & EDUCATION"
        }
    },
    {
        "data": {
            "source": "EDPSYCH 762",
            "target": "EDPSYCH 963"
        }
    },
    {
        "data": {
            "source": "EDPSYCH 761",
            "target": "EDPSYCH 762"
        }
    },
    {
        "data": {
            "description": "Designed to support coaches and coaching supervisors in leadership, management, and the design of educational organizations. Explore how to build collective knowledge, effective systemic processes, and progress monitoring capacity across an organization. Includes designing and leveraging coaching roles so that they can advance organizational and student learning outcomes.",
            "id": "EDPSYCH 641",
            "parent": "EDPSYCH",
            "title": "ORGANIZATIONAL CHANGE AND INSTRUCTIONAL COACHING"
        }
    },
    {
        "data": {
            "description": "Focuses on neuroscience foundational concepts relevant to clinical mental health practice, neuroanatomy, neurophysiology, psychopharmacology, disease states; ontological and phylogenic neurodevelopment. Provides an overview of ethical/cultural implications of these scientific advances.  Ethical/Cultural/Economic Applications.",
            "id": "EDPSYCH 542",
            "parent": "EDPSYCH",
            "title": "THE BIOLOGICAL BASIS OF BEHAVIOR"
        }
    },
    {
        "data": {
            "source": "EDPSYCH 709",
            "target": "EDPSYCH 710"
        }
    },
    {
        "data": {
            "description": "Provides an overview of methods and findings at the interface between education and neuroscience. Findings on brain development from birth to adolescence, brain changes in response to learning and how individual differences in brains relate to individual differences in learning. Educationally relevant domains including language acquisition and bilingualism, the brain basis of reading and mathematics and executive functions like memory, attention and emotion will be highlighted.",
            "id": "EDPSYCH 326",
            "parent": "EDPSYCH",
            "title": "MIND, BRAIN AND EDUCATION"
        }
    },
    {
        "data": {
            "description": "Provides an overview of qualitative inquiry, examining assumptions, standards, and methods for generating and communicating interpretations. Methodological and theoretical works illustrate case study, ethnography, narrative, and action research. Does not include a field method component.",
            "id": "COUNPSY/CURRIC/EDPOL/EDPSYCH/ELPA/RP&SE 719",
            "title": "INTRODUCTION TO QUALITATIVE RESEARCH"
        }
    },
    {
        "data": {
            "source": "EDPSYCH 760",
            "target": "EDPSYCH 740"
        }
    },
    {
        "data": {
            "description": "Utilize the concepts and methods of quantitative social science research to conduct research on education issues. Topics include hypothesis testing, statistical inference, point estimates, graphic and numerical data displays, correlation and regression.",
            "id": "EDPSYCH/ELPA 822",
            "title": "INTRODUCTION TO QUANTITATIVE INQUIRY IN EDUCATION"
        }
    },
    {
        "data": {
            "description": "Introductory field methods experience in qualitative research. Learn to define good research questions, determine which methods of data collection and analysis are useful for addressing those questions, engage in these methods, reflect on their utility in education research.",
            "id": "COUNPSY/CURRIC/EDPOL/EDPSYCH/ELPA/RP&SE 788",
            "title": "QUALITATIVE RESEARCH METHODS IN EDUCATION: FIELD METHODS I"
        }
    },
    {
        "data": {
            "description": "Advanced assessment practices and the corresponding link to intervention; intervention strategies and programs designed to improve the academic, emotional, behavioral and social functioning of children and adolescents.",
            "id": "EDPSYCH 946",
            "parent": "EDPSYCH",
            "title": "ADVANCED ASSESSMENT AND INTERVENTION TECHNIQUES"
        }
    },
    {
        "data": {
            "description": "Critical review of various psychotherapeutic approaches (cognitive, behavioral, psychodynamic) with special emphasis on identifying and implementing evidence-based assessment and interventions for a variety of behavioral and emotional problems experienced by children and adolescents.",
            "id": "EDPSYCH 947",
            "parent": "EDPSYCH",
            "title": "EVIDENCED-BASED CHILD AND ADOLESCENT PSYCHOTHERAPY"
        }
    },
    {
        "data": {
            "source": "EDPSYCH 763",
            "target": "EDPSYCH 963"
        }
    },
    {
        "data": {
            "description": "Theories of intelligence and intelligence testing, construction and validation of the Binet and Wechsler tests, administration of tests, interpretation of test results and report writing, recent research in intelligence testing.",
            "id": "EDPSYCH 740",
            "parent": "EDPSYCH",
            "title": "COGNITIVE ASSESSMENT OF CHILDREN IN THE SCHOOLS"
        }
    },
    {
        "data": {
            "description": "Theory of mental measurement, types of scales, reliability, validity, psychometric evaluation of published tests.",
            "id": "EDPSYCH 570",
            "parent": "EDPSYCH",
            "title": "FOUNDATIONS OF EDUCATIONAL MEASUREMENT"
        }
    },
    {
        "data": {
            "description": "Explores the theoretical foundations and practical use of quantitative ethnography, focusing on new insights in the field of cognitive modeling and automated coding and their use in applied fields such as anthropology, education, market research, product development, assessment, and training.",
            "id": "EDPSYCH 551",
            "parent": "EDPSYCH",
            "title": "QUANTITATIVE ETHNOGRAPHY"
        }
    },
    {
        "data": {
            "description": "Develop competence in broad areas of school psychological practice, including assessment, consultation, and intervention. Deliver a wide range of psychological and educational services to clients including individual and group interventions; academic, social, emotional, and behavioral assessments; and parent and/or teacher consultation.",
            "id": "EDPSYCH 829",
            "parent": "EDPSYCH",
            "title": "CLINIC PRACTICUM IN SCHOOL PSYCHOLOGY"
        }
    },
    {
        "data": {
            "description": "Discuss a different current article from the educational statistics and measurement literature. Explore a variety of subjects in which one might like to eventually conduct research.",
            "id": "EDPSYCH 971",
            "parent": "EDPSYCH",
            "title": "ADVANCED SEMINAR IN EDUCATIONAL MEASUREMENT AND STATISTICS"
        }
    },
    {
        "data": {
            "description": "Examines promotion, prevention, and intervention approaches and strategies relating to how to best address students' social, emotional, and behavioral needs within the school setting. Examine ways to promote positive development within students. Evaluate prevention programs and approaches and how to implement these in school settings. Explore systematic approaches for addressing social, emotional, and behavioral needs once they are present. Explore these strategies at each level of K-12 education (i.e., elementary, middle, and high).",
            "id": "EDPSYCH 633",
            "parent": "EDPSYCH",
            "title": "SUPPORTING STUDENTS' SOCIAL/EMOTIONAL WELL-BEING"
        }
    },
    {
        "data": {
            "source": "EDPSYCH 763",
            "target": "EDPSYCH 965"
        }
    },
    {
        "data": {
            "description": "Covers the basic elements of Bayesian statistics through lecture, discussion and practice.  Focuses on why the Bayesian perspective provides a powerful alternative to the frequentist perspective.  Topics to be covered include; Bayes' theorem, Markov chain Monte Carlo sampling and the \"rjags\" program, Bayesian hypothesis testing, Bayesian model building and evaluation, Bayesian approaches to missing data, Bayesian model averaging, Bayesian multilevel models and latent variable models, and philosophical debates within the Bayesian paradigm of statistics.",
            "id": "EDPSYCH 965",
            "parent": "EDPSYCH",
            "title": "APPLIED BAYESIAN STATISTICS FOR EDUCATION RESEARCH"
        }
    },
    {
        "data": {
            "description": "Analysis of variance and covariance, multiple linear regression; chi-square and various nonparametric techniques.",
            "id": "EDPSYCH 761",
            "parent": "EDPSYCH",
            "title": "STATISTICAL METHODS APPLIED TO EDUCATION II"
        }
    },
    {
        "data": {
            "description": "Provides an overview of psychopharmacological treatments of childhood and adolescent disorders in educational settings. Topics covered include basic biological principles of drugs and drug treatment, specific drug classifications and their biological actions, drug treatments for childhood disorders, and professional issues.",
            "id": "EDPSYCH 845",
            "parent": "EDPSYCH",
            "title": "PSYCHOPHARMACOLOGICAL TREATMENTS FOR CHILDREN AND ADOLESCENTS"
        }
    },
    {
        "data": {
            "description": "Logic and methods of statistics used in the field of learning analytics. Emphasizes concepts and application rather than computational details to build fundamentals in the areas of inferential statistics. Reliability and validity, scalability, and the implications of inference in applied statistical methodology.",
            "id": "EDPSYCH 505",
            "parent": "EDPSYCH",
            "title": "FUNDAMENTAL STATISTICS IN LEARNING ANALYTICS"
        }
    },
    {
        "data": {
            "description": "Assessment methods and intervention strategies for children with academic skill problems in educational settings; practice in application of assessment and intervention approaches to case studies.",
            "id": "EDPSYCH 742",
            "parent": "EDPSYCH",
            "title": "ASSESSMENT AND INTERVENTION FOR ACADEMIC SKILL PROBLEMS"
        }
    },
    {
        "data": {
            "description": "An applied introduction to causal inference with regression discontinuity designs, interrupted time series designs, non-equivalent control group designs (matching designs), and instrumental variable designs is given.",
            "id": "EDPSYCH 963",
            "parent": "EDPSYCH",
            "title": "DESIGN & ANALYSIS OF QUASI-EXPERIMENTS FOR CAUSAL INFERENCE"
        }
    },
    {
        "data": {
            "source": "EDPSYCH 830",
            "target": "EDPSYCH 840"
        }
    },
    {
        "data": {
            "description": "Mental health, behavioral and organization development models of consultation in school psychology. Overview of evidence-based prevention and intervention programs as implemented in a consultation problem-solving process.",
            "id": "EDPSYCH 942",
            "parent": "EDPSYCH",
            "title": "SYSTEMS OF CONSULTATION IN SCHOOL PSYCHOLOGY"
        }
    },
    {
        "data": {
            "description": "Knowledge and skills necessary to conduct comprehensive assessments of social, emotional, and behavioral difficulties in children and adolescents; theoretical foundations; assessment procedures and instruments; diagnostic and eligibility criteria; early identification and intervention.",
            "id": "EDPSYCH 741",
            "parent": "EDPSYCH",
            "title": "SOCIAL, EMOTIONAL, AND BEHAVIORAL ASSESSMENT"
        }
    }
]