[
    {
        "data": {
            "description": "A comprehensive understanding of leadership and administration of higher education study abroad programs and international student services. Delving into the latest discussion and debates on this subject from both researchers' and practitioners' points of view, serves as a venue to develop knowledge and expertise in developing and implementing policies, programs, and strategies for optimizing leadership for study abroad programs, international student services, and international enrollment management.",
            "id": "ELPA 885",
            "parent": "ELPA",
            "title": "LEADERSHIP FOR STUDY ABROAD PROGRAMS AND INTERNATIONAL STUDENT SERVICES"
        }
    },
    {
        "data": {
            "description": "Addresses policies, trends, and debates in the evolution of the American community college from the beginning of the 20th century to the present, as well as current research on the community college and the diverse body of students it serves. Topics include, but are not limited to, governance and administration, faculty and advising, credential completion and transfer, enrollment patterns, developmental education, complexities surrounding students' goals and aspirations, and the cooling-out versus warming-up effect of the community college. Through class discussions and the culminating course project (research study or policy proposal), course participants will engage in a critical, scholarly examination of the American community college, considering its strengths and weaknesses, as well as opportunities and challenges within the broader context of education.",
            "id": "ELPA 878",
            "parent": "ELPA",
            "title": "THE AMERICAN COMMUNITY COLLEGE"
        }
    },
    {
        "data": {
            "description": "Concentrates on a specific formulation of authentic intellectual work that has a compelling research base. Critical analysis of some of the roots of authentic pedagogy, its research base, its connections to other formulations (critical pedagogy, culturally relevant pedagogy), as well as theoretical perspectives and empirical studies on pedagogy's role in the reproduction of inequality and its possibilities for social justice. Read seminal works on pedagogy and assessment, in the sociology of education, and in critical/post-structural theory applied to teaching, and relate them to both current assessment practices/policies and education leadership.",
            "id": "ELPA 911",
            "parent": "ELPA",
            "title": "AUTHENTIC PEDAGOGY AND ACHIEVEMENT"
        }
    },
    {
        "data": {
            "description": "Dimensions of school-level leadership includes a focus on dimensions of the principal's leadership role, leadership tasks needed to advance equity and excellence in student learning, and distributed leadership.",
            "id": "ELPA 845",
            "parent": "ELPA",
            "title": "SCHOOL-LEVEL LEADERSHIP"
        }
    },
    {
        "data": {
            "description": "Examines educators' professional learning in organizations and its contributions to organizational change, learning, and renewal.",
            "id": "ELPA 848",
            "parent": "ELPA",
            "title": "PROFESSIONAL DEVELOPMENT AND ORGANIZATIONAL LEARNING"
        }
    },
    {
        "data": {
            "description": "Examines key principles of psychology relating to athletics. Addresses psychological aspects of leading. Examines research on psychology in competition. Considers how attention to psychology improves processes and outcomes. Supports coaches' and leaders' holistic development.",
            "id": "ELPA 753",
            "parent": "ELPA",
            "title": "PSYCHOLOGY AND COACHING IN SPORTS"
        }
    },
    {
        "data": {
            "description": "Examines the legal issues confronting the classroom teacher on a daily basis. An emphasis will be placed on understanding legal analysis in order to empower teachers to better balance the multiple interests confronting them. Also, understanding of how law can further the development of a democratic classroom. Specific topics to be examined include: curricular control, teachers' academic freedom, religion in the curriculum, equity in programming, special education, student records, student discipline, teacher contracts, teacher discipline, and negligence.",
            "id": "ELPA 640",
            "parent": "ELPA",
            "title": "LEGAL RIGHTS AND RESPONSIBILITIES FOR TEACHERS"
        }
    },
    {
        "data": {
            "description": "Interpretation and critique of legal authority impacting education. Topics may include education and religion, students' rights, teachers' rights, and federal involvement in education.",
            "id": "ELPA 910",
            "parent": "ELPA",
            "title": "SEMINAR IN EDUCATIONAL LAW"
        }
    },
    {
        "data": {
            "description": "Learn to create and sustain successful teaching and learning environments. Designed to provide teachers, learning specialists, principals, and other administrators with the foundations of research, theory, and best practices of instructional leadership to enhance teachers' capacity for equity and excellence in student learning.",
            "id": "ELPA 847",
            "parent": "ELPA",
            "title": "INSTRUCTIONAL LEADERSHIP AND TEACHER CAPACITY"
        }
    },
    {
        "data": {
            "description": "Legal aspects of public K-12 education. Legal structure; employee rights; employee discipline; curriculum; students' rights; student discipline, special education; torts; contracts, religion. Impact of federal and state constitutions, statutes, and court decisions on education.",
            "id": "ELPA 840",
            "parent": "ELPA",
            "title": "PUBLIC SCHOOL LAW"
        }
    },
    {
        "data": {
            "description": "Provides an opportunity to use concepts and theories learned in previous coursework to analyze professional issues facing higher education administrators. Assists with career transitions and provides a culminating experience for the master's program.",
            "id": "ELPA 777",
            "parent": "ELPA",
            "title": "HIGHER AND POST-SECONDARY EDUCATION CAPSTONE SEMINAR"
        }
    },
    {
        "data": {
            "description": "",
            "id": "ELPA 990",
            "parent": "ELPA",
            "title": "RESEARCH OR THESIS"
        }
    },
    {
        "data": {
            "description": "",
            "id": "ELPA 999",
            "parent": "ELPA",
            "title": "INDEPENDENT READING"
        }
    },
    {
        "data": {
            "description": "An introduction to identity and college student development theory that can either be applied to higher education administration practice or to research in higher education.",
            "id": "ELPA 883",
            "parent": "ELPA",
            "title": "PERSPECTIVES ON COLLEGE STUDENT IDENTITY AND DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "An overview of the key concepts, tools, and practices of assessment in academic and student services settings. A theoretical and practical basis for choosing, designing and using assessment and evaluation tools will also be provided.",
            "id": "ELPA 888",
            "parent": "ELPA",
            "title": "ASSESSMENT IN HIGHER EDUCATION"
        }
    },
    {
        "data": {
            "description": "Close look at issues, trends, and challenges concerning internationalization in higher education in both the U.S. and foreign countries. Focus includes internationalizing teaching and learning, international partnerships and collaborations, international student recruitment and advising, study abroad etc.",
            "id": "ELPA 886",
            "parent": "ELPA",
            "title": "INTERNATIONALIZATION OF HIGHER EDUCATION"
        }
    },
    {
        "data": {
            "description": "Connects the discussion on diversity, equity, and inclusion (DEI) with student mobility in the context of internationalization of higher education.  Delve into inquiries on why and how promoting mobility in international education and advancing DEI in higher education can benefit and enhance each other. Primarily serves as a venue to develop knowledge, expertise, and research skills in developing and implementing policies, programs, and strategies aiming at promoting international mobility in higher education through the lens of social justice. Strives for diversity, equity, and inclusion in the context of internationalization of higher education.",
            "id": "ELPA 856",
            "parent": "ELPA",
            "title": "MOBILITY AND INCLUSION IN GLOBAL HIGHER EDUCATION"
        }
    },
    {
        "data": {
            "description": "Contemporary bases for collecting and distributing funds for postsecondary education provided by two-year institutions, colleges and universities; problems and issues in financing postsecondary institutions; economic aspects of expenditures for postsecondary education.",
            "id": "ELPA 831",
            "parent": "ELPA",
            "title": "FINANCING POSTSECONDARY EDUCATION"
        }
    },
    {
        "data": {
            "description": "Contemporary bases for collecting and distributing local, state, and federal funds for elementary and secondary education; problems and issues in financial support of education; current, alternative and more effective uses of educational resources.",
            "id": "EDPOL/ELPA/PUBAFFR 830",
            "title": "SCHOOL FINANCE AND RESOURCE ALLOCATION"
        }
    },
    {
        "data": {
            "description": "Coordinating and effective utilization of school-based special services in the context of student diversity with attention to values, theory, and research underlying curriculum, instruction and policy, in terms of social class, gender, sexual orientation, disability, and race.",
            "id": "ELPA 735",
            "parent": "ELPA",
            "title": "LEADERSHIP FOR EQUITY AND DIVERSITY"
        }
    },
    {
        "data": {
            "description": "Critical examination of school-community engagement and collaboration. Examines theory and practice of mutually beneficial collaboration in diverse education settings, including leadership issues in collaborative settings, and facilitators and inhibitors to effective collaboration.",
            "id": "ELPA/INTER-HE 770",
            "title": "COMMUNITY, OPPORTUNITY, AND JUSTICE"
        }
    },
    {
        "data": {
            "description": "Critically examines race and class inequality in education, including the importance of race and class at multiple levels of analysis, including the classroom and school, as well as the family, neighborhood, and community.",
            "id": "ELPA 863",
            "parent": "ELPA",
            "title": "RACE, CLASS AND EDUCATIONAL INEQUALITY"
        }
    },
    {
        "data": {
            "description": "Employs an everyday practices conceptual framework. Core tenets: brokering, embedding, experimenting, targeting high doses, zeal. Examines complexities of coaching practice, including individual, organizational, and contextual variables. Draws from research on leadership. Uses research-driven framework to analyze coaching practice across five domains. Highlights processes that guide successful coaches at multiple levels. Encourages reflection upon coaching aspirations and trajectories.",
            "id": "ELPA 750",
            "parent": "ELPA",
            "title": "COACHING ATHLETICS 1: EVERYDAY PRACTICES OF TOP LEADERS"
        }
    },
    {
        "data": {
            "description": "Engages educational leaders in data-driven decision making from a system-wide perspective, and developing basic data analysis skills.",
            "id": "ELPA 726",
            "parent": "ELPA",
            "title": "DATA-BASED DECISION-MAKING FOR EDUCATIONAL LEADERSHIP"
        }
    },
    {
        "data": {
            "description": "Evaluate teaching practices and recognize and support quality classroom teaching in K-12 settings. Application of established evaluation frameworks to video cases of classroom practice.",
            "id": "ELPA 703",
            "parent": "ELPA",
            "title": "EVALUATING AND SUPPORTING QUALITY CLASSROOM TEACHING"
        }
    },
    {
        "data": {
            "description": "Examine leadership in K12 schools for more equitable outcomes. Delve into key social justice concepts, principal leadership, teacher leadership, the interplay between principals and informal/formal teacher leaders, and how a more robust, encompassing view of leadership can contribute to more equitable student learning outcomes.",
            "id": "ELPA 702",
            "parent": "ELPA",
            "title": "INTRODUCTION TO EDUCATIONAL LEADERSHIP"
        }
    },
    {
        "data": {
            "description": "Examine the administration of intercollegiate athletics in higher education institutions with particular emphasis on providing practical and theoretical approaches.",
            "id": "ELPA 710",
            "parent": "ELPA",
            "title": "INTRODUCTION TO INTERCOLLEGIATE ATHLETICS ADMINISTRATION"
        }
    },
    {
        "data": {
            "description": "Examines core components of championships sports programs. Uses case study design to examine how leadership unfolds across multiple levels within one setting. Draws from distributed leadership analytic framework. Considers how matters such as talent, culture, commitment, leadership, intelligence, organization, resilience, teamwork, integrity, health, resources, and opportunities intersect in a successful system.",
            "id": "ELPA 754",
            "parent": "ELPA",
            "title": "RUNNING A CHAMPIONSHIP SYSTEM: THE BADGER SPORTS LEADERSHIP ROAD COURSE"
        }
    },
    {
        "data": {
            "description": "Examines historical and organizational context of special education administration at the federal, state and local levels. Includes policy implementation, constituency management, coordination, communication, and current issues.",
            "id": "ELPA/RP&SE 835",
            "title": "LEADERSHIP FOR INCLUSIVE SCHOOLING"
        }
    },
    {
        "data": {
            "description": "Examines several legal issues confronting students and educators within the U.S. education system with a particular focus on race discrimination. Examines how civil rights laws and constitutional provisions can help create more equitable schooling experiences for students and educators from historically marginalized populations. Identifies pragmatic approaches to the law, and explores issues of the democratic underpinnings of education.",
            "id": "ELPA/LEGALST 442",
            "title": "CIVIL RIGHTS LAWS, THE COURTS, AND PUBLIC EDUCATION"
        }
    },
    {
        "data": {
            "description": "Examines the broad landscape of athletics, focusing on matters of human, social, economic, and cultural capital. Draws from prominent books, articles, documentaries, and other sources to develop expanded perspectives and nuanced understandings of leadership and social justice in sports. Specific learning foci include the social, cultural, and historical roles of sports and the traditional and emerging roles of athletes and coaches. Particular attention paid to matters of race, poverty, activism, youth sports, college sports reform, and the leadership that unfolds in these settings.",
            "id": "ELPA 751",
            "parent": "ELPA",
            "title": "LEADERSHIP AND JUSTICE IN SPORTS"
        }
    },
    {
        "data": {
            "description": "Examines the history and philosophy of higher and postsecondary education; the major participants; curriculum; governance and leadership; relations with state and federal government; and current issues.",
            "id": "ELPA 701",
            "parent": "ELPA",
            "title": "INTRODUCTION TO HIGHER AND POST-SECONDARY EDUCATION"
        }
    },
    {
        "data": {
            "description": "Examines the legal issues related to the policy decisions and delivery of public education (elementary and secondary) in the United States. Learn how law impacts both curriculum development and curricular delivery, explore current legal controversies, constitutional issues, and learn about legal reasoning and analysis. Examines how both legislation and litigation affects public education. Particular attention is paid to law as public policy and the analysis of the same.",
            "id": "EDPOL/ELPA/LEGALST 542",
            "title": "LAW AND PUBLIC EDUCATION"
        }
    },
    {
        "data": {
            "description": "Examines the origins, contemporary landscape, structures, and stakeholders of minority-serving institutions (MSIs) -- historically black colleges and universities (HBCUs), Hispanic-serving institutions (HSIs), and tribal colleges and universities (TCUs) -- including related challenges and opportunities for research and practice.",
            "id": "ELPA 882",
            "parent": "ELPA",
            "title": "MINORITY-SERVING INSTITUTIONS OF HIGHER EDUCATION"
        }
    },
    {
        "data": {
            "description": "Explores alternative images and models to guide universities in the twenty-first century by engaging a diverse range of voices representing multiple stakeholders.",
            "id": "ELPA 881",
            "parent": "ELPA",
            "title": "IDEAS OF THE UNIVERSITY: IMAGES OF HIGHER LEARNING FOR THE 21ST CENTURY"
        }
    },
    {
        "data": {
            "description": "Explores higher education curriculum including academic program philosophy and design, planning and development, program innovations, liberal education, academic majors, graduate and professional education, program review and evaluation.",
            "id": "ELPA 880",
            "parent": "ELPA",
            "title": "ACADEMIC PROGRAMS IN COLLEGES AND UNIVERSITIES"
        }
    },
    {
        "data": {
            "description": "Focus on data analysis and translation of finds and implications. Gain theoretical and practical knowledge and skills regarding coding and analysis techniques, use of qualitative analytic tools, strategies for sharing findings with audiences beyond research team.",
            "id": "COUNPSY/CURRIC/EDPOL/EDPSYCH/ELPA/RP&SE 789",
            "title": "QUALITATIVE RESEARCH METHODS IN EDUCATION: FIELD METHODS II"
        }
    },
    {
        "data": {
            "description": "Focuses on knowledge and skills teachers need to be leaders in their schools in facilitating the development of strong learning communities that include students, teachers, families, administrators, and other educators. Understand key concepts, theories, and models used in building and sustaining effective learning communities; develop skills in creating practices that contribute to effective teacher leadership; and identify and strengthen skills needed to lead schools to build learning communities that promote student learning.",
            "id": "EDPSYCH/ELPA 780",
            "title": "TEACHER LEADERSHIP AND LEARNING COMMUNITIES"
        }
    },
    {
        "data": {
            "description": "Focuses on research design, the major qualitative methods and techniques used in field research, data analysis, communicating field research, ethical challenges, and trustworthiness in conducting qualitative research.",
            "id": "ELPA 824",
            "parent": "ELPA",
            "title": "FIELD RESEARCH DESIGNS & METHODOLOGIES IN EDUCATIONAL ADMINISTRATN"
        }
    },
    {
        "data": {
            "description": "Focuses on the knowledge and skills required to support rigorous quantitative inquiry. Acquire and import data; combine (merge/append) multiple data sets; organize directories and files for optimal workflow; clean data; document data manipulations for reproducibility and transparency; write code to facilitate collaboration; and summarize data in visual (graph, chart, map) and tabular forms.",
            "id": "ELPA 823",
            "parent": "ELPA",
            "title": "DATA MANAGEMENT FOR EDUCATION POLICY ANALYSIS"
        }
    },
    {
        "data": {
            "description": "For participants in M.S. cooperative program to maintain UW-Madison status during terms when taking courses from partner institution.",
            "id": "ELPA 600",
            "parent": "ELPA",
            "title": "COOPERATIVE PROGRAM OFF-CAMPUS TERM"
        }
    },
    {
        "data": {
            "description": "Functions, organization, and administrative practices of colleges and universities; role of governing boards, administrators, faculty members, and students in policy making.",
            "id": "ELPA 715",
            "parent": "ELPA",
            "title": "GOVERNANCE AND ADMINISTRATION OF COLLEGES AND UNIVERSITIES"
        }
    },
    {
        "data": {
            "description": "Internship completed in a school setting. Provides the opportunity to practice the application of knowledge gained in the academic program, examine administrative practice, and use reflection to improve practice.",
            "id": "ELPA 900",
            "parent": "ELPA",
            "title": "INTERNSHIP IN EDUCATIONAL ADMINISTRATION"
        }
    },
    {
        "data": {
            "description": "Introduction to inquiry in the field of educational leadership and policy analysis for first semester doctoral students. Provides an introduction to research through engagement with ideas, including identifying and crystallizing meaningful problems, fundamentals of research design, and key challenges in conducting disciplined inquiry.",
            "id": "ELPA 810",
            "parent": "ELPA",
            "title": "DOCTORAL INQUIRY IN EDUCATIONAL LEADERSHIP AND POLICY ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Introductory field methods experience in qualitative research. Learn to define good research questions, determine which methods of data collection and analysis are useful for addressing those questions, engage in these methods, reflect on their utility in education research.",
            "id": "COUNPSY/CURRIC/EDPOL/EDPSYCH/ELPA/RP&SE 788",
            "title": "QUALITATIVE RESEARCH METHODS IN EDUCATION: FIELD METHODS I"
        }
    },
    {
        "data": {
            "description": "Investigates how school leaders develop and use technological tools and systems to improve student learning and effect change in schools.",
            "id": "ELPA 844",
            "parent": "ELPA",
            "title": "TECHNOLOGY AND SCHOOL LEADERSHIP"
        }
    },
    {
        "data": {
            "description": "Investigation of leadership and political theories, professional competencies, and the personal commitment involved in the role of the school superintendent. Covers the evolution of theoretical and practical perspectives of the school superintendence, including internship experiences.",
            "id": "ELPA 846",
            "parent": "ELPA",
            "title": "THE SCHOOL SUPERINTENDENCY"
        }
    },
    {
        "data": {
            "description": "Legal requirements and issues relative to special education and pupil services programs; special education, juvenile justice, programs for English language learners, programs for children who are homeless; examination of applicable federal and state statutes and case law.",
            "id": "EDPOL/EDPSYCH/ELPA/RP&SE 842",
            "title": "LEGAL FOUNDATIONS OF SPECIAL EDUCATION AND PUPIL SERVICES"
        }
    },
    {
        "data": {
            "description": "Legal structure of higher education, including historical evolution as well as current legal problems. Attempts to assess the impact of legal decisions, statutes, and regulations upon higher education and to discuss the implications of the interaction of the legal system and university governance for the practicing administrator.",
            "id": "ELPA 841",
            "parent": "ELPA",
            "title": "LEGAL ASPECTS OF HIGHER EDUCATION"
        }
    },
    {
        "data": {
            "description": "Methods and concepts of survey research methods as they are commonly used in education research. Strategies include surveys (phone, mail, electronic, in person), logs/diaries, and experience sampling instruments. Emphasis is given to self-administered surveys, including periodic surveys, since these strategies are the most common in education research.",
            "id": "EDPSYCH/ELPA 827",
            "title": "SURVEYS AND OTHER QUANTITATIVE DATA COLLECTION STRATEGIES"
        }
    },
    {
        "data": {
            "description": "Organization and administration of student services in higher education including philosophy, current issues, student development, program planning, financial aid, auxiliary services, housing, counseling, advising, social and health services, student organizations, legal aspects, and special populations.",
            "id": "ELPA 736",
            "parent": "ELPA",
            "title": "ADMINISTRATION OF STUDENT SERVICES IN HIGHER EDUCATION"
        }
    },
    {
        "data": {
            "description": "Orients contemporary policy issues in education by connecting education policy to rigorous research evidence, using a theoretically motivated and disciplinary-based approach to understand educational policies, processes, and outcomes. Considers current efforts to \"translate\" key research findings to practitioners, policymakers, and laypersons in schools and communities, where the results can help improve educational practice and results. Discusses how research evidence from a range of disciplines - including psychology, sociology, social work, and economics - has been, is being, and could be applied to educational practice and education policy.",
            "id": "ELPA 961",
            "parent": "ELPA",
            "title": "CRITICAL ISSUES IN EDUCATIONAL POLICY"
        }
    },
    {
        "data": {
            "description": "Policy development in education as a political process; community power, state and national politics in educational decision making; role of leadership and pressure groups, particularly the educational lobbies, in the shaping of educational policy at local, state, and national levels.",
            "id": "ELPA 870",
            "parent": "ELPA",
            "title": "THE POLITICS OF EDUCATION"
        }
    },
    {
        "data": {
            "description": "Practical problems derived from student interests and needs.",
            "id": "ELPA 502",
            "parent": "ELPA",
            "title": "WORKSHOP IN EDUCATIONAL LEADERSHIP AND POLICY ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Problems of financing education; school financial management; and related research.",
            "id": "ELPA 960",
            "parent": "ELPA",
            "title": "SEMINAR IN EDUCATIONAL FINANCE"
        }
    },
    {
        "data": {
            "description": "Provides an overview of qualitative inquiry, examining assumptions, standards, and methods for generating and communicating interpretations. Methodological and theoretical works illustrate case study, ethnography, narrative, and action research. Does not include a field method component.",
            "id": "COUNPSY/CURRIC/EDPOL/EDPSYCH/ELPA/RP&SE 719",
            "title": "INTRODUCTION TO QUALITATIVE RESEARCH"
        }
    },
    {
        "data": {
            "description": "Provides opportunities to learn about the theory and practice of instruction in athletics settings. Identifies the hallmarks of excellent teaching and learning. Synthesizes the characteristics and practices of teachers who achieve mastery. Considers how particular contexts (e.g., sport, developmental stage, physical environment) shape teaching and learning. Explores team curriculum. Examines methods of leading and evaluating teaching and learning in sport. Also addresses: practice planning, skills-teaching, feedback, technology, learning targets, on-field  instruction, and film room instruction.",
            "id": "ELPA 752",
            "parent": "ELPA",
            "title": "COACH AS TEACHER: MASTERING INSTRUCTIONAL PRACTICE ON AND OFF THE FIELD"
        }
    },
    {
        "data": {
            "description": "Provides opportunities to learn from specific models of coaching practice. Utilizes Bell Cow method. Articulates processes underlying successful coaching systems. Attends to personal characteristics and unique settings of coaching. Draws from leadership theory.",
            "id": "ELPA 755",
            "parent": "ELPA",
            "title": "COACHING ATHLETICS 2: A BELL COW WAY"
        }
    },
    {
        "data": {
            "description": "Research designs for problems in educational administration including role of theory and hypothesis testing; variable definition and measurement; correlational, survey, experimental and non-experimental, factorial and single-subject designs.",
            "id": "ELPA 825",
            "parent": "ELPA",
            "title": "ADVANCED RESEARCH METHODS IN EDUCATIONAL ADMINISTRATION"
        }
    },
    {
        "data": {
            "description": "Research on and/or discussion of selected topics in educational leadership and policy analysis.",
            "id": "ELPA 940",
            "parent": "ELPA",
            "title": "SPECIAL TOPICS SEMINAR IN EDUCATIONAL LEADERSHIP"
        }
    },
    {
        "data": {
            "description": "Role of theory and hypothesis testing in research. Introduction to research problems, questions, hypotheses, variables, constructs, definitions, measurement, research and experimental designs, sampling, descriptive statistics, proposal writing, types of research and statistical computing. Critical analysis of published research.",
            "id": "ELPA 725",
            "parent": "ELPA",
            "title": "RESEARCH METHODS AND PROCEDURES IN EDUCATIONAL ADMINISTRATION"
        }
    },
    {
        "data": {
            "description": "School finance and resource allocation for educational leaders, with an emphasis on educational adequacy, equity and efficiency. Includes an emphasis on the strategic deployment of human and material resources to address inequality and promote educational opportunity.",
            "id": "ELPA 832",
            "parent": "ELPA",
            "title": "RESOURCE ALLOCATION FOR EQUITY AND SOCIAL JUSTICE"
        }
    },
    {
        "data": {
            "description": "Supervised field experience: elementary, secondary, vocational, technical, higher, and/or special education at local, state, or national level.",
            "id": "ELPA 700",
            "parent": "ELPA",
            "title": "FIELD EXPERIENCE IN EDUCATIONAL LEADERSHIP"
        }
    },
    {
        "data": {
            "description": "Supervised research on topics in the administration of elementary and secondary education.",
            "id": "ELPA 890",
            "parent": "ELPA",
            "title": "APPLIED RESEARCH IN EDUCATIONAL ADMINISTRATION"
        }
    },
    {
        "data": {
            "description": "Survey of equity issues related to higher education access, admissions, transitions, persistence, and success. Focuses on the role of inequities across categories such as race, class, sex, gender, sexual orientation, language, nationality, or religion in higher education alongside considerations as to how researchers and practitioners can better communicate with one another about diversity issues.",
            "id": "ELPA 887",
            "parent": "ELPA",
            "title": "DIVERSITY AND INEQUALITY IN HIGHER EDUCATION"
        }
    },
    {
        "data": {
            "description": "Synthesize experiences in teaching, mentoring, and educational development into materials for use in next career stage(s) as future faculty.",
            "id": "ELPA 663",
            "parent": "ELPA",
            "title": "CAPSTONE SEMINAR IN TEACHING AND LEARNING"
        }
    },
    {
        "data": {
            "description": "Theoretical constructs and empirical research relating to administering organizations in education. Emphasis on administrative behavior with special attention to planning and organizational improvement.",
            "id": "ELPA 860",
            "parent": "ELPA",
            "title": "ORGANIZATIONAL THEORY AND BEHAVIOR IN EDUCATION"
        }
    },
    {
        "data": {
            "description": "Theory and research applied to the study of policy issues and problems in college and university administration.",
            "id": "ELPA 815",
            "parent": "ELPA",
            "title": "PROBLEMS IN COLLEGE AND UNIVERSITY ADMINISTRATION"
        }
    },
    {
        "data": {
            "description": "Theory, research and practice in advanced program planning and evaluation involving elementary, secondary and higher and post-secondary education.",
            "id": "ELPA 875",
            "parent": "ELPA",
            "title": "THEORY AND PRACTICE OF EDUCATIONAL PLANNING"
        }
    },
    {
        "data": {
            "description": "Theory, research, and practical experience in educational policy analysis, including the social construction of policy problems in education; the design, implementation, and evaluation of policy responses; and the practical and ethical dilemmas of the policy analyst.",
            "id": "EDPOL/ELPA/PUBAFFR 765",
            "title": "ISSUES IN EDUCATIONAL POLICY ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Use experiential learning to explore evidence-based and inclusive teaching approaches within different higher education learning contexts.",
            "id": "ELPA 662",
            "parent": "ELPA",
            "title": "EXPEDITIONS IN EVIDENCE-BASED TEACHING AND LEARNING"
        }
    },
    {
        "data": {
            "description": "Utilize the concepts and methods of quantitative social science research to conduct research on education issues. Topics include hypothesis testing, statistical inference, point estimates, graphic and numerical data displays, correlation and regression.",
            "id": "EDPSYCH/ELPA 822",
            "title": "INTRODUCTION TO QUANTITATIVE INQUIRY IN EDUCATION"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ELPA",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "COUNPSY/CURRIC/EDPOL/EDPSYCH/ELPA/RP&SE 719",
            "target": "COUNPSY/CURRIC/EDPOL/EDPSYCH/ELPA/RP&SE 788"
        }
    },
    {
        "data": {
            "source": "COUNPSY/CURRIC/EDPOL/EDPSYCH/ELPA/RP&SE 788",
            "target": "COUNPSY/CURRIC/EDPOL/EDPSYCH/ELPA/RP&SE 789"
        }
    },
    {
        "data": {
            "source": "ELPA 701",
            "target": "ELPA 882"
        }
    },
    {
        "data": {
            "source": "ELPA 715",
            "target": "ELPA 880"
        }
    },
    {
        "data": {
            "source": "ELPA 735",
            "target": "ELPA/RP&SE 835"
        }
    },
    {
        "data": {
            "source": "ELPA 750",
            "target": "ELPA 755"
        }
    },
    {
        "data": {
            "source": "ELPA 832",
            "target": "ELPA 960"
        }
    },
    {
        "data": {
            "source": "ELPA 840",
            "target": "ELPA 910"
        }
    }
]