[
    {
        "data": {
            "description": "Covers the graphs, properties and geometric significance of trigonometric functions of a real variable. Other topics include trigonometric equations and identities, application, trigonometric form of complex numbers, DeMoivre's theorem, and polar and parametric equations. The course also has a significant number of applications, especially related to other disciplines.",
            "id": "MATH 113",
            "parent": "MATH",
            "title": "TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "Dynamical systems theory, advanced rigid body attitude dynamics, Lagrange's equations of motion, conservation laws, quasi-coordinates, Routh's method for ignorable coordinates, Hamilton's equations of motion, dynamic stability, Liapunov stability methods, angular momentum methods for systems of rigid bodies, modeling of rotating elastic systems, Kane's equations of motion, deterministic chaos. Knowledge of advanced three-dimensional dynamics [such asE M A 542orPHYSICS 311] strongly encouraged.",
            "id": "EMA 742",
            "parent": "EMA",
            "title": "THEORY AND APPLICATIONS IN ADVANCED DYNAMICS"
        }
    },
    {
        "data": {
            "description": "Emphasis is placed on techniques used to analyze aerospace structures. Variational principles, Hamilton's extended principle, Lagrange's equations, mathematical models for continuous systems, natural modes of vibrations, dynamic response using mode superposition, mode acceleration, residual flexibility, vibration analysis using finite element methods, advanced substructure representations, component mode synthesis, systems with rigid body modes for aeronautical and astronautical systems. Knowledge of vibrations [such asE M A 545orM E 440] strongly encouraged.",
            "id": "EMA 745",
            "parent": "EMA",
            "title": "ADVANCED METHODS IN STRUCTURAL DYNAMICS"
        }
    },
    {
        "data": {
            "description": "Kinematics and kinetics of plane and three-dimensional motion, Coriolis acceleration, general methods of linear and angular momentum, central force motion, gyrodynamics, generalized coordinates. Lagrange's equations.",
            "id": "EMA 542",
            "parent": "EMA",
            "title": "ADVANCED DYNAMICS"
        }
    },
    {
        "data": {
            "description": "Methods of higher mathematics; stress on problem solving rather than rigorous proofs; linear algebra, calculus of variations, Green's function.",
            "id": "EMA/EP 547",
            "title": "ENGINEERING ANALYSIS I"
        }
    },
    {
        "data": {
            "description": "Review of Euler's equations, torque-free motion, stability of rotation, energy dissipation effects, gyroscopic instruments, gyrodynamics of the Earth, gravity gradient stabilized satellites, spin stabilized satellites, dual spin satellites, tethered satellites, mass movement techniques, space vehicle motion and rocket dynamics.",
            "id": "EMA 642",
            "parent": "EMA",
            "title": "SATELLITE DYNAMICS"
        }
    },
    {
        "data": {
            "description": "A first course in finite elements, with theory and applications in stress analysis and in areas related to structural mechanics. Practice in the use and/or development of computer programs.",
            "id": "EMA 605",
            "parent": "EMA",
            "title": "INTRODUCTION TO FINITE ELEMENTS"
        }
    },
    {
        "data": {
            "description": "Aircraft longitudinal and lateral static stability. Aircraft equations of motion. Stability derivatives. Longitudinal and lateral dynamic stability of uncontrolled motion. Open-loop aircraft control. Closed-loop aircraft control.",
            "id": "EMA 523",
            "parent": "EMA",
            "title": "FLIGHT DYNAMICS AND CONTROL"
        }
    },
    {
        "data": {
            "description": "An introduction to linear algebra and differential equations with emphasis on the relationship between the theory of linear algebra and analytical and numerical techniques for solving differential equations. Linear algebra topics include linear systems, matrices and their algebra, vector spaces and linear transformations, eigenvalues and eigenvectors. Topics from differential equations include first order ODE, homogeneous and nonhomogeneous linear systems, and numerical methods.",
            "id": "MATH 320",
            "parent": "MATH",
            "title": "LINEAR ALGEBRA AND DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "description": "An introduction to micro- and nanoscale science and engineering with a focus on the role of mechanics. A variety of micro- and nanoscale phenomena and applications covered, drawing connections to both established and new mechanics approaches.",
            "id": "EMA/EP 615",
            "title": "MICRO- AND NANOSCALE MECHANICS"
        }
    },
    {
        "data": {
            "description": "An introduction to test-based validation of finite element models for the design and analysis of dynamic structures.",
            "id": "EMA 610",
            "parent": "EMA",
            "title": "STRUCTURAL FINITE ELEMENT MODEL VALIDATION"
        }
    },
    {
        "data": {
            "description": "An introduction to the fields of mechanics and aerospace engineering. Fundamental concepts in engineering, including modeling, analysis, design, fabrication and experimental testing. Career paths, engineering ethics, shop safety, and oral and written technical communication.",
            "id": "EMA 200",
            "parent": "EMA",
            "title": "INTRODUCTION TO MECHANICS AND AEROSPACE"
        }
    },
    {
        "data": {
            "description": "An overview of hardware and software solutions that enable the use of advanced computing in tackling computationally intensive Engineering problems. Hands-on learning promoted through programming assignments that leverage emerging hardware architectures and use parallel computing programming languages. Students are strongly encourage to have completed COMP SCI 367 orCOMP SCI 400or to have equivalent experience.",
            "id": "COMPSCI/ECE/EMA/EP/ME 759",
            "title": "HIGH PERFORMANCE COMPUTING FOR APPLICATIONS IN ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Analysis and design of load-carrying members, shear center, unsymmetrical bending, curved beams, beams on elastic foundations, energy methods, theories of failure, thick-walled cylinders, stress concentrations, design to prevent failure by excessive elastic deformation, plastic deformation and fracture.",
            "id": "EMA 506",
            "parent": "EMA",
            "title": "ADVANCED MECHANICS OF MATERIALS I"
        }
    },
    {
        "data": {
            "description": "Application of digital data acquisition to the investigation of mechanical components, structures and systems using time histories, transforms and response functions to characterize free, forced and transient inputs. Introduction to sensors, instrumentation and methods appropriate for dynamic system response.",
            "id": "EMA/ME 540",
            "title": "EXPERIMENTAL VIBRATION AND DYNAMIC SYSTEM ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Background for professional numerical computation in Linux environments begins with shell scripting and software archiving. Programming skills in a compiled language are then developed through scientific and engineering examples. Engineering problem-solving skills are reinforced through applications that require numerical solutions to systems of differential and/or integral equations, while motivating progressively more advanced computational methods.",
            "id": "EMA/EP 476",
            "title": "INTRODUCTION TO SCIENTIFIC COMPUTING FOR ENGINEERING PHYSICS"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for engineering students. Electricity, magnetism, light, and sound.",
            "id": "PHYSICS 202",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for engineering students. Mechanics: kinematics, statics, dynamics; energy and momentum.",
            "id": "PHYSICS 201",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Contemporary topics such as new materials; smart materials/structures/systems; fatigue; fracture; experimental techniques; nondestructive evaluation; transient, micro, three-dimensional, nonlinear, inelastic and environmental effects; manufacturing methods: repair and applications. Knowledge of composite materials [such asE M A/​CIV ENGR/​M E  508] strongly encouraged.",
            "id": "EMA/ME 708",
            "title": "ADVANCED COMPOSITE MATERIALS"
        }
    },
    {
        "data": {
            "description": "Coordinate system transformations, central force motion, two body problem, three and n-body problem, theory of orbital perturbations, artificial satellites, elementary transfer orbits, and elementary rocket dynamics.",
            "id": "ASTRON/EMA 550",
            "title": "ASTRODYNAMICS"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Data processing, tension/compression tests, creep stress concentrations, fatigue, fracture, composite materials, combined stress, beam flexure, dynamic loads, buckling.",
            "id": "EMA/ME 307",
            "title": "MECHANICS OF MATERIALS LAB"
        }
    },
    {
        "data": {
            "description": "Directed study projects as arranged with instructor.",
            "id": "EMA 599",
            "parent": "EMA",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Directed study projects as arranged with instructor.",
            "id": "EMA 790",
            "parent": "EMA",
            "title": "MASTER'S RESEARCH AND THESIS"
        }
    },
    {
        "data": {
            "description": "Directed study projects as arranged with instructor.",
            "id": "EMA 890",
            "parent": "EMA",
            "title": "PRE-DISSERTATOR RESEARCH"
        }
    },
    {
        "data": {
            "description": "Directed study projects as arranged with instructor.",
            "id": "EMA 990",
            "parent": "EMA",
            "title": "RESEARCH AND THESIS"
        }
    },
    {
        "data": {
            "description": "Engineering achievements of the Renaissance period and their relation to modern engineering practice, key principles developed, and errors in understanding of that time. Innovative work of notable figures such as Galileo Galilei and Leonardo da Vinci and their contributions to fundamental mechanics principles of engineering, traced through modern engineering practice and current engineering applications. Introduction to concepts of stress, strain, tension, compression, deflection of beams, flaws, and fracture. Not for engineering majors.",
            "id": "EMA 103",
            "parent": "EMA",
            "title": "PRINCIPLES OF ENGINEERING FROM THE RENAISSANCE TO MODERN TIMES"
        }
    },
    {
        "data": {
            "description": "Equations of elasticity in curvilinear and rectangular coordinates; two dimensional problems; problems of prismatic bars; variational methods and energy principles; complex variable and numerical methods; thermal stress problems. Knowledge of advanced mechanics of materials [such asE M A 506] and vector calculus [such asMATH 321] strongly encouraged.",
            "id": "EMA 700",
            "parent": "EMA",
            "title": "THEORY OF ELASTICITY"
        }
    },
    {
        "data": {
            "description": "Exact solutions and sectorial linearization; free and forced vibration of mechanical systems with nonlinear restoring force; self-excited mechanical vibrations and relaxation vibrations; subharmonic responses; nonlinear vibration of mechanical systems with more than one degree of freedom; nonlinear vibration of bounded continuous media; random excitation and random response, random vibrations of mechanical systems and structures; random vibrations of nonlinear mechanical systems; failure of materials under random vibrations.",
            "id": "EMA 747",
            "parent": "EMA",
            "title": "NONLINEAR AND RANDOM MECHANICAL VIBRATIONS"
        }
    },
    {
        "data": {
            "description": "Experimental methods for aerodynamic measurements: wind tunnel tests with 6-component sting balance, pitot probe, hot wire anemometer; flow visualization with smoke generator and laser sheet; digital data acquisition; practical considerations for experimental design. Methods for comparing theoretical predictions to experimental measurements and computational simulations.",
            "id": "EMA 522",
            "parent": "EMA",
            "title": "AERODYNAMICS LAB"
        }
    },
    {
        "data": {
            "description": "Experimental methods for design and analysis of mechanical components, structures and materials. Electrically and optically recorded stress, strain and deformation data; computer acquisition/reduction/presentation techniques; applications to static and transient events, sensors, transducer design, NDT, fracture and residual stresses.",
            "id": "EMA/ME 570",
            "title": "EXPERIMENTAL MECHANICS"
        }
    },
    {
        "data": {
            "description": "Finite element methods for problems with linear and nonlinear media. Stress analysis, heat transfer, and fluid dynamics. Vibration and transient analysis. Weighted residual methods. Material and geometric nonlinearity. Nonlinear iteration methods. Instructor may also select additional material. Knowledge of finite element theory [such asE M A 605] strongly encouraged.",
            "id": "EMA 705",
            "parent": "EMA",
            "title": "ADVANCED TOPICS IN FINITE ELEMENTS"
        }
    },
    {
        "data": {
            "description": "First and second laws of thermodynamics; thermodynamic properties of gases, vapors, and gas-vapor mixtures; energy-systems analysis including power cycles, refrigeration cycles and air-conditioning processes. Introduction to thermodynamics of reacting mixtures.",
            "id": "ME 361",
            "parent": "ME",
            "title": "THERMODYNAMICS"
        }
    },
    {
        "data": {
            "description": "Formulation of constitutive equations using embedded base vectors. Viscosity, normal stress differences, stress relaxation, elastic recoil. Polymer rheology; homogeneous strain history. Knowledge of differential equations [such asMATH 320] strongly encouraged.",
            "id": "EMA/ME 722",
            "title": "INTRODUCTION TO POLYMER RHEOLOGY"
        }
    },
    {
        "data": {
            "description": "Function of complex variable, series solution of differential equations, partial differential equations. A year of math beyond calculus",
            "id": "EMA/EP 548",
            "title": "ENGINEERING ANALYSIS II"
        }
    },
    {
        "data": {
            "description": "General theory of free, forced, and transient vibrations; vibration transmission, isolation, and measurement; normal modes and generalized coordinates; method of matrix equation formulation and solution. The application of theory and methods to the analysis, measurement and design of dynamic systems.",
            "id": "EMA 545",
            "parent": "EMA",
            "title": "MECHANICAL VIBRATIONS"
        }
    },
    {
        "data": {
            "description": "Introduction to calculus of functions of several variables; calculus on parameterized curves, derivatives of functions of several variables, multiple integrals, vector calculus.",
            "id": "MATH 234",
            "parent": "MATH",
            "title": "CALCULUS--FUNCTIONS OF SEVERAL VARIABLES"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Introduction to the mechanics of fracture of linear and nonlinear materials. Crack stress and deformation fields; stress intensity factors; crack tip plastic zone; fracture toughness testing; energy release rate; J-integral. Criteria for crack growth initiation/stability; application to design.",
            "id": "EMA 519",
            "parent": "EMA",
            "title": "FRACTURE MECHANICS"
        }
    },
    {
        "data": {
            "description": "Kinematics, force-mass-acceleration relations, work and energy, impulse and momentum, moments of inertia and mass.",
            "id": "EMA 202",
            "parent": "EMA",
            "title": "DYNAMICS"
        }
    },
    {
        "data": {
            "description": "Laws of mechanics and thermodynamics applied to fluids at rest and in motion; potential flow; dimensional analysis; viscous flow; pipe flow; boundary-layer theory; compressible flow.",
            "id": "ME 363",
            "parent": "ME",
            "title": "FLUID DYNAMICS"
        }
    },
    {
        "data": {
            "description": "Linear theory of viscoelasticity; non-aging materials; Boltzmann superposition principle; time-temperature superposition boundary value problems. Applications: vibration damping, relaxation of stress, creep, droop, and sag in structural members, sound absorption, creep buckling, settlement of foundations, tire mechanics, and shock attenuation.",
            "id": "EMA 630",
            "parent": "EMA",
            "title": "VISCOELASTIC SOLIDS"
        }
    },
    {
        "data": {
            "description": "Origin and development of classical mechanics; mathematical techniques, especially vector analysis; conservation laws and their relation to symmetry principles; brief introduction to orbit theory and rigid-body dynamics; accelerated coordinate systems; introduction to the generalized-coordinate formalisms of Lagrange and Hamilton.",
            "id": "PHYSICS 311",
            "parent": "PHYSICS",
            "title": "MECHANICS"
        }
    },
    {
        "data": {
            "description": "Physical foundations of plasticity as a basis for choices made in the formulation of theories representing plastic deformation and their limitation. Motion of dislocations and formation and growth of deformation twins. Experimental results in the context of plasticity models. Traditional and research topics of plasticity and theories for rate-independent, rate-dependent, single and polycrystal descriptions. Numerical solution of equations and computational plasticity. Knowledge of mechanics of materials [such asE M A 303orM E 306] and continuum mechanics [such as E M A 622] required.",
            "id": "EMA/ME 703",
            "title": "PLASTICITY THEORY AND PHYSICS"
        }
    },
    {
        "data": {
            "description": "Physical properties and mechanical behavior of polymer, metal, ceramic, cementitious, cellulosic and biological composite systems; micro- and macro-mechanics; lamination and strength analyses; static and transient loading; fabrication; recycling; design; analytical-experimental correlation; applications.",
            "id": "CIVENGR/EMA/ME 508",
            "title": "COMPOSITE MATERIALS"
        }
    },
    {
        "data": {
            "description": "Potential flow theory; stream functions; vortex filaments and sheets. Two- and three-dimensional wing theory. Doublet and panels methods. Propeller theory.",
            "id": "EMA 521",
            "parent": "EMA",
            "title": "AERODYNAMICS"
        }
    },
    {
        "data": {
            "description": "Prepares students to operate Unmanned Aircraft Systems (UAS) for commercial purposes. Focuses on remote sensing, automation / artificial intelligence, data analytics and business applications / opportunities for UAS. Teaches all applicable subjects and provides hands-on experience necessary to 1) safely, legally and ethically operate UAS for commercial purposes; 2) effectively apply UAS to solve business problems and 3) manage, process and analyze data collected via UAS. Optional Federal Aviation Administration exam for a remote pilot-in-command (RPIC) certification. Group projects involving real-world drone flights to collect data and produce commercially viable products.",
            "id": "EMA 105",
            "parent": "EMA",
            "title": "INTRODUCTION TO UNMANNED AIRCRAFT SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Principles of mechanics, force systems, equilibrium, structures, distributed forces, moments of inertia of areas, and friction.",
            "id": "EMA 201",
            "parent": "EMA",
            "title": "STATICS"
        }
    },
    {
        "data": {
            "description": "Principles of the mechanics of solid multiphase systems. Role of heterogeneity and anisotropy in determining physical properties including elastic, dielectric and piezoelectric properties. Applications in lightweight structures, ultrastrong materials, materials for protection of the body, and materials for the replacement of human tissues. Materials with fibrous, lamellar, particular, and cellular structures.  Heterogeneous materials of biological origin. Biomimetic and bio-inspired materials.",
            "id": "EMA/MS&E 541",
            "title": "HETEROGENEOUS AND MULTIPHASE MATERIALS"
        }
    },
    {
        "data": {
            "description": "Properties and tests of materials used in the initial construction or repair of facilities (including buildings, transportation systems, utility systems, and reinforced earth). Introduction to laboratory and field measurement techniques to assess material performance capabilities. Technical report preparation.",
            "id": "CIVENGR/EMA 395",
            "title": "MATERIALS FOR CONSTRUCTED FACILITIES"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Review of linear differential equations; series solution of linear differential equations; boundary value problems; Laplace transforms; possibly numerical methods and two dimensional autonomous systems.",
            "id": "MATH 319",
            "parent": "MATH",
            "title": "TECHNIQUES IN ORDINARY DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "description": "Rocket performance. One dimensional gasdynamics. Thrust chambers, nozzle design criteria. Fundamentals of combustion. Rocket configurations.",
            "id": "EMA 524",
            "parent": "EMA",
            "title": "ROCKET PROPULSION"
        }
    },
    {
        "data": {
            "description": "Selected topics in such areas as structural mechanics, dynamics, experimental mechanics, vibrations, engineering materials, soil mechanics, engineering analysis, rheology, etc.",
            "id": "EMA 601",
            "parent": "EMA",
            "title": "SPECIAL TOPICS IN ENGINEERING MECHANICS"
        }
    },
    {
        "data": {
            "description": "Solution of engineering problems using commercially-available software tools (spreadsheets, symbolic manipulators, and equation solvers). The emphasis will be on nuclear engineering problems, including radioactive decay, nuclear cross sections, scattering, and criticality.",
            "id": "EP 271",
            "parent": "EP",
            "title": "ENGINEERING PROBLEM SOLVING I"
        }
    },
    {
        "data": {
            "description": "Stochastic methods in turbulent heat and momentum transfer; fully developed turbulence; numerical methods including model applications to boundary layers, reacting flows, mass transfer, and unsteady flows; linear and non-linear stability and transition; emphasis on applications of interest to Mechanical, Aerospace, and Environmental Engineers. Knowledge of fluid mechanics [such asM E 363orCBE 320] strongly encouraged.",
            "id": "CIVENGR/EMA/ME 775",
            "title": "TURBULENT HEAT AND MOMENTUM TRANSFER"
        }
    },
    {
        "data": {
            "description": "Stoichiometry and the mole concept, the behavior of gases, liquids and solids, thermochemistry, electronic structure of atoms and chemical bonding, descriptive chemistry of selected elements and compounds, intermolecular forces, and chemistry laboratory skills.",
            "id": "CHEM 103",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Stress and strain, torsion, bending of beams, shearing stresses in beams, compound stresses, principal stresses, deflections of beams, statically indeterminate members, columns. For civil engineers.",
            "id": "EMA 303",
            "parent": "EMA",
            "title": "MECHANICS OF MATERIALS"
        }
    },
    {
        "data": {
            "description": "Stress and strain, torsion, bending of beams, shearing stresses in beams, compound stresses, principal stresses, deflections of beams, statically indeterminate members, columns.",
            "id": "ME 306",
            "parent": "ME",
            "title": "MECHANICS OF MATERIALS"
        }
    },
    {
        "data": {
            "description": "Students will select specific engineering design projects. These projects will be student team efforts supervised by individual faculty members.",
            "id": "EMA 569",
            "parent": "EMA",
            "title": "SENIOR DESIGN PROJECT"
        }
    },
    {
        "data": {
            "description": "Sturm-Liouville theory; Fourier series, including mean convergence; boundary value problems for linear second order partial differential equations, including separation of variables and eigenfunction expansions.",
            "id": "MATH 322",
            "parent": "MATH",
            "title": "APPLIED MATHEMATICAL ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Techniques of integration, improper integrals, first order ordinary differential equations, sequences and series, Taylor series, vector geometry in two and three dimensions.",
            "id": "MATH 222",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 2"
        }
    },
    {
        "data": {
            "description": "Tensor analysis; analysis of stress, strain and rate of strain; application of Newtonian mechanics to deformable media; mechanical constitutive equations; field equations of fluid mechanics and elasticity. Knowledge of linear algebra [such asMATH 340] required.",
            "id": "EMA 710",
            "parent": "EMA",
            "title": "MECHANICS OF CONTINUA"
        }
    },
    {
        "data": {
            "description": "The design philosophy is presented. Students will be required to apply their knowledge of elementary mechanics, engineering and basic science to arrive at acceptable solutions to a variety of design problems.",
            "id": "EMA 469",
            "parent": "EMA",
            "title": "DESIGN PROBLEMS IN ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Theory and use of servo-controlled, electro-hydraulic equipment for research of mechanical properties of engineering materials. Measurement of stress, strain, hysteresis energy, and material properties during deformation and at fracture. Analysis of four significant components of total strain.",
            "id": "EMA 611",
            "parent": "EMA",
            "title": "ADVANCED MECHANICAL TESTING OF MATERIALS"
        }
    },
    {
        "data": {
            "description": "Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Part of a 2-semester sequence withMATH 217; these two courses together are equivalent toMATH 114and221.",
            "id": "MATH 171",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY I"
        }
    },
    {
        "data": {
            "description": "Undergraduate research and senior honors thesis in engineering mechanics and astronautics.",
            "id": "EMA 489",
            "parent": "EMA",
            "title": "HONORS IN RESEARCH"
        }
    },
    {
        "data": {
            "description": "Use of computational tools for the solution of problems encountered in engineering physics applications. Topics covered include orbital mechanics, structural vibrations, beam and plate deformations, heat transfer, neutron diffusion, and criticality. Emphasis will be on modeling, choice of appropriate algorithms, and model validation.",
            "id": "EMA/EP 471",
            "title": "INTERMEDIATE PROBLEM SOLVING FOR ENGINEERS"
        }
    },
    {
        "data": {
            "description": "Use of finite elements (FE) for solving practical problems in mechanics. Elementary theory of FE is discussed. A commercial computer program is used for applications. Major emphasis is on behavior of FE, modeling, and evaluation of results for correctness.",
            "id": "EMA 405",
            "parent": "EMA",
            "title": "PRACTICUM IN FINITE ELEMENTS"
        }
    },
    {
        "data": {
            "description": "Vector analysis: algebra and geometry of vectors, vector differential and integral calculus, theorems of Green, Gauss, and Stokes; complex analysis: analytic functions, complex integrals and residues, Taylor and Laurent series.",
            "id": "MATH 321",
            "parent": "MATH",
            "title": "APPLIED MATHEMATICAL ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Work experience that combines classroom theory with practical knowledge of operations to provide students with a background on which to develop and enhance a professional career. The work experience is tailored for MS students from within the U.S. as well as eligible international students.",
            "id": "EMA 702",
            "parent": "EMA",
            "title": "GRADUATE COOPERATIVE EDUCATION PROGRAM"
        }
    },
    {
        "data": {
            "description": "Work experience which combines classroom theory with practical knowledge of operations to provide students with a background upon which to base a professional career in industry.",
            "id": "EMA 1",
            "parent": "EMA",
            "title": "COOPERATIVE EDUCATION PROGRAM"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "EMA",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "EP",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ME",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "PHYSICS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "ME 361"
        }
    },
    {
        "data": {
            "source": "EMA 201",
            "target": "EMA 202"
        }
    },
    {
        "data": {
            "source": "EMA 201",
            "target": "EMA 303"
        }
    },
    {
        "data": {
            "source": "EMA 201",
            "target": "ME 306"
        }
    },
    {
        "data": {
            "source": "EMA 201",
            "target": "ME 361"
        }
    },
    {
        "data": {
            "source": "EMA 202",
            "target": "EMA 521"
        }
    },
    {
        "data": {
            "source": "EMA 202",
            "target": "EMA 542"
        }
    },
    {
        "data": {
            "source": "EMA 202",
            "target": "EMA 545"
        }
    },
    {
        "data": {
            "source": "EMA 303",
            "target": "CIVENGR/EMA 395"
        }
    },
    {
        "data": {
            "source": "EMA 303",
            "target": "EMA 405"
        }
    },
    {
        "data": {
            "source": "EMA 303",
            "target": "EMA 469"
        }
    },
    {
        "data": {
            "source": "EMA 303",
            "target": "EMA 519"
        }
    },
    {
        "data": {
            "source": "EMA 303",
            "target": "EMA 605"
        }
    },
    {
        "data": {
            "source": "EMA 303",
            "target": "EMA 630"
        }
    },
    {
        "data": {
            "source": "EMA 303",
            "target": "EMA/ME 570"
        }
    },
    {
        "data": {
            "source": "EMA 469",
            "target": "EMA 569"
        }
    },
    {
        "data": {
            "source": "EMA 506",
            "target": "EMA 611"
        }
    },
    {
        "data": {
            "source": "EMA 521",
            "target": "EMA 522"
        }
    },
    {
        "data": {
            "source": "EMA 521",
            "target": "EMA 523"
        }
    },
    {
        "data": {
            "source": "EMA 542",
            "target": "EMA 523"
        }
    },
    {
        "data": {
            "source": "EMA 542",
            "target": "EMA 642"
        }
    },
    {
        "data": {
            "source": "EMA 545",
            "target": "EMA 610"
        }
    },
    {
        "data": {
            "source": "EMA 545",
            "target": "EMA/ME 540"
        }
    },
    {
        "data": {
            "source": "EMA/EP 547",
            "target": "EMA/EP 548"
        }
    },
    {
        "data": {
            "source": "EMA/ME 307",
            "target": "EMA 611"
        }
    },
    {
        "data": {
            "source": "EP 271",
            "target": "EMA/EP 471"
        }
    },
    {
        "data": {
            "source": "EP 271",
            "target": "EMA/EP 476"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 113"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 113",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 222"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "PHYSICS 201"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "PHYSICS 202"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "EMA 201"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "EMA 303"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "EP 271"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 234"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 319"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 320"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "ME 306"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "MATH 321"
        }
    },
    {
        "data": {
            "source": "MATH 319",
            "target": "EMA/EP 476"
        }
    },
    {
        "data": {
            "source": "MATH 319",
            "target": "ME 363"
        }
    },
    {
        "data": {
            "source": "MATH 320",
            "target": "MATH 321"
        }
    },
    {
        "data": {
            "source": "MATH 321",
            "target": "EMA/EP 547"
        }
    },
    {
        "data": {
            "source": "MATH 321",
            "target": "MATH 322"
        }
    },
    {
        "data": {
            "source": "MATH 321",
            "target": "PHYSICS 311"
        }
    },
    {
        "data": {
            "source": "MATH 322",
            "target": "EMA/EP 548"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "ME 306",
            "target": "CIVENGR/EMA/ME 508"
        }
    },
    {
        "data": {
            "source": "ME 306",
            "target": "EMA 506"
        }
    },
    {
        "data": {
            "source": "ME 306",
            "target": "EMA/EP 615"
        }
    },
    {
        "data": {
            "source": "ME 306",
            "target": "EMA/ME 307"
        }
    },
    {
        "data": {
            "source": "ME 306",
            "target": "EMA/MS&E 541"
        }
    },
    {
        "data": {
            "source": "ME 361",
            "target": "ME 363"
        }
    },
    {
        "data": {
            "source": "ME 363",
            "target": "EMA 521"
        }
    },
    {
        "data": {
            "source": "ME 363",
            "target": "EMA 524"
        }
    },
    {
        "data": {
            "source": "PHYSICS 201",
            "target": "EP 271"
        }
    },
    {
        "data": {
            "source": "PHYSICS 201",
            "target": "PHYSICS 202"
        }
    },
    {
        "data": {
            "source": "PHYSICS 202",
            "target": "PHYSICS 311"
        }
    },
    {
        "data": {
            "source": "PHYSICS 311",
            "target": "ASTRON/EMA 550"
        }
    }
]