[
    {
        "data": {
            "description": "Develop clinical knowledge and skills necessary to care for patients in Pediatrics and Obstetrics and Gynecology, with emphasis on unique skills such as taking care of vulnerable populations as identified in women's and child health and working with caregivers in addition to the patient themselves. Increase knowledge of fundamental science concepts introduced in Human Family Tree during Phase 1 of the curriculum, such as embryology and teratology, genetic testing, and neurodevelopment. Clinical experiences will occur in a range of representative inpatient, outpatient and surgical settings. In structured educational sessions, compare and contrast selected topics in pediatric, obstetric, and gynecologic patient populations, highlighting the relevant physiology, pathophysiology, basic science, and public health topics.",
            "id": "MEDSC-M 810",
            "parent": "MEDSC-M",
            "title": "SPECIALIZED CARE OF OBSTETRIC, GYNECOLOGIC, AND PEDIATRIC PATIENTS (SCOPE)"
        }
    },
    {
        "data": {
            "description": "Focus on assessing patients with urgent medical conditions, providing acute inpatient care, and transitioning patients to other care settings or home under the care of other professionals. Provide acute care in inpatient and outpatient urgent care settings as well as on the inpatient wards, and develop acute management plans and subsequent transition of care plans. Clinical experiences in acute care settings such as the emergency department and inpatient medicine (both general and subspecialty), psychiatry, and neurology. Builds upon fundamental science concepts introduced in Body in Balance and Mind and Motion, including Ohm's Law, acid-base balance, and volume regulation. Organ system-based approach employing varied modalities. Complete an integrated patient-centered experience by participating in the care of a patient from an urgent admission through inpatient treatment and discharge.",
            "id": "MEDSC-M 812",
            "parent": "MEDSC-M",
            "title": "ACUTE CARE"
        }
    },
    {
        "data": {
            "description": "Gain comfort with necessary skills in leadership and communication to effectively run a resuscitation and to review the basic science, which guide the principles of resuscitation of a variety of critical-illness disease states. Students will first attain ACLS certification via AHA approved curriculum, followed by in-depth reviews of skills and underlying basic science behind the creation of ACLS guidelines. In addition to hands-on skills such as CPR, BVM respiration, I/O access, and airway management, simulation will be utilized to teach advanced skills in leadership, teamwork, and communication, which are integral to success in running ACLS-based resuscitation's. Crisis-Resource Management skills will be introduced and practiced in a variety simulated resuscitation scenarios, with students having the opportunity to practice various roles, including leading a code team.",
            "id": "EMERMED 920",
            "parent": "EMERMED",
            "title": "ART AND SCIENCE OF RESUSCITATION"
        }
    },
    {
        "data": {
            "description": "Builds on the skills students developed during the Guatemala Service Learning experience in their first-year. The Service Learning trip partners with the San Lucas Mission to provide traveling health clinics around the southern/eastern sides of Lake Atitlan. In this selective, students will take a leadership role in the Service Learning Trip. Course is intended for M4 or Phase 3 medical students who have participated in the Guatemala Service Learning Experience. Students should have intermediate Spanish-language skills. Exceptions to these requirements will be considered on a case-by-case basis by Clerkship Director.",
            "id": "EMERMED 912",
            "parent": "EMERMED",
            "title": "GUATEMALA HEALTH ADVANCED ELECTIVE"
        }
    },
    {
        "data": {
            "description": "Care for emergency medicine patients in the Emergency Department. Participate in multidisciplinary work to transition patients to the next level of care. Evaluate and manage patients requiring collaboration with consulting specialties. Complete other patient care related learning activities as assigned by instructors (e.g., literature reviews, presentations on specific topics); these are dependent on the individual student, attending physician, and clinical site.",
            "id": "EMERMED 919",
            "parent": "EMERMED",
            "title": "INDIVIDUALIZED PHASE 3 CLINICAL ELECTIVE IN EMERGENCY MEDICINE"
        }
    },
    {
        "data": {
            "description": "Care of adults and children undergoing an operation or procedure, including perioperative preparation, operative care, and post-operative cares for core clinical conditions in the specialties of anesthesia, neurosurgery, ophthalmology, general surgery, otolaryngology, urology, cardiothoracic surgery, peripheral vascular surgery, orthopedics, plastic and reconstructive surgery, and gynecology, as well as interventional radiology, procedural cardiology and gastroenterology. Basic science concepts include cerebral spinal fluid production and flow, fluids and electrolytes, consciousness, inflammation and wound healing, and cancer biology. Anatomic approach using case discussions, podcasts, curated independent reading, online nationally supported modules, and simulation skills. Longitudinal patient care experience integrating communication, evidence based medicine, health information technology, quality improvement  patient safety, professionalism, scientific inquiry, and public health.",
            "id": "MEDSC-M 813",
            "parent": "MEDSC-M",
            "title": "SURGICAL AND PROCEDURAL CARE"
        }
    },
    {
        "data": {
            "description": "Clinical experience in the Pediatric Emergency Department setting.  With guidance and supervision, provide primary and autonomous evaluation and care for the full spectrum of ED pediatric. Pediatric bronchiolitis, asthma, croup, appendicitis, orthopedic injuries, lacerations, and other common presentations.",
            "id": "EMERMED 940",
            "parent": "EMERMED",
            "title": "PEDIATRIC EMERGENCY MEDICINE ELECTIVE"
        }
    },
    {
        "data": {
            "description": "Complete an Advanced Wilderness Life Support Course, which will cover topics such as Altitude Illnesses, Hyper- and Hypothermia, Toxicology, Envenomations, general trauma, and more, through lectures, skills sessions, and simulation. Focus on medical decision-making that can be executed early in disease or injury processes, in austere environments, with a focus on acute stabilization and evacuation to appropriate medical care. Learn foundational backcountry skills such as land navigation; fire and stove operation; water and waste management; and Leave-No-Trace principles. Technical workshops and field experiences give participants the opportunity to learn from experienced kayakers and climbers from the area, to apply backcountry skills on a self-supported backpacking trip, and to continue exploring wilderness medicine through interactive sessions.",
            "id": "EMERMED 914",
            "parent": "EMERMED",
            "title": "WILDERNESS MEDICINE"
        }
    },
    {
        "data": {
            "description": "Design and implement a public health field project in the community of San Lucas Tolimán, Guatemala. This project will fulfill the field project for students on the path of distinction in public health or the dual MD-MPH program. In participating in the Guatemala service learning experience, students will have provided traveling health clinics to indigenous Mayan populations in rural Guatemala, collaborating with the San Lucas Mission. Course is intended for M4 or Phase 3 medical students who have participated in the Guatemala Service Learning Experience. Students should have intermediate Spanish-language skills. Exceptions to these requirements will be considered on a case-by-case basis by Clerkship Director.",
            "id": "EMERMED 913",
            "parent": "EMERMED",
            "title": "GUATEMALA PUBLIC HEALTH FIELD PROJECT"
        }
    },
    {
        "data": {
            "description": "Designed to highlight, review, and allow practice of key concepts in Emergency Medicine. Practice with case simulation, case discussion, didactics, panel discussions, and procedural skills to prepare for success in the first few weeks of an Emergency Medicine residency. Will lead and participate in simulations. Explore critical interplay between medical care and communication. Discuss common challenges encountered early in residency and throughout an EM career, and develop individualized plans to address these challenges.",
            "id": "EMERMED 909",
            "parent": "EMERMED",
            "title": "EMERGENCY MEDICINE INTERNSHIP PREP COURSE"
        }
    },
    {
        "data": {
            "description": "Develop clinical education skills and knowledge by teaching junior (Phase 2) medical students in a clinical setting. Learn effective teaching techniques. Become familiar with using and adept at researching the primary literature in health professions education. Understand effective approaches to providing feedback while spending clinical time advising and mentoring junior (Phase 2) students who are on their Acute Care Block (ACB) rotations in the Emergency Department (ED). Develop novel instructional, curricular, and interpersonal skills as an educator and use this knowledge to improve the clinical learning environment for future junior (Phase 2) students. Effectively assist junior (Phase 2) students with their approaches to undifferentiated patients in the ED, including developing an initial diagnostic and treatment plan, navigating a complex healthcare system, and setting personal learning goals in a clinical environment.",
            "id": "EMERMED 970",
            "parent": "EMERMED",
            "title": "TEACHING IN EMERGENCY MEDICINE"
        }
    },
    {
        "data": {
            "description": "Focus on learning and practicing skills in clinical ultrasound (US) in the Emergency Department setting, under direct supervision by Emergency Medicine faculty. Receive teaching in core clinical US skills including evaluation of the aorta, echocardiography, gallbladder, renal, inferior vena cava, female pelvis, FAST, deep vein thrombosis, ocular, and lung exams. Complete hands-on scanning with ultrasound-trained faculty focusing on the above areas of expertise.",
            "id": "EMERMED 958",
            "parent": "EMERMED",
            "title": "INTRODUCTION TO BEDSIDE ULTRASOUND ELECTIVE"
        }
    },
    {
        "data": {
            "description": "Focuses on molecular, genetic, embryologic, hormonal, anatomical and physiological factors that govern fertility, cell growth, fetal development, and pregnancy as well as the congenital anomalies that can occur when those processes are aberrant. Encompasses the full life-cycle spectrum including childhood growth and development, young adulthood/puberty, issues affecting adolescents and young adults, genetic basis of human disease, reproductive health, menopause, aging, unregulated cell growth (cancer) and end of life issues. Significant content from other competency domains, or \"longitudinal threads\", such as public health, advocacy, ethics, patient care/communication and clinical skills.",
            "id": "MEDSC-M 773",
            "parent": "MEDSC-M",
            "title": "HUMAN FAMILY TREE"
        }
    },
    {
        "data": {
            "description": "Individual Master or PhD student interests and research provide the opportunity to work with faculty members. Tailored to each specific student research proposal/project.",
            "id": "EMERMED 990",
            "parent": "EMERMED",
            "title": "INDEPENDENT READING AND RESEARCH IN EMERGENCY MEDICINE"
        }
    },
    {
        "data": {
            "description": "Introduces students to the epidemiology, pathophysiology and clinical practice of Wilderness Medicine: the care of patients in remote environments lacking typical health care resources, often under harsh conditions.",
            "id": "EMERMED 930",
            "parent": "EMERMED",
            "title": "WILDERNESS MEDICINE"
        }
    },
    {
        "data": {
            "description": "Learn and gain clinical experience in the Emergency Department setting. Evaluate and care for the full spectrum of Emergency Department patients primarily and autonomously under the guidance and supervision of Emergency Medicine Attendings.",
            "id": "EMERMED 960",
            "parent": "EMERMED",
            "title": "BASIC EMERGENCY MEDICINE (EM) ELECTIVE"
        }
    },
    {
        "data": {
            "description": "Learn and gain clinical experience in the Emergency Department setting. Evaluate and care for the full spectrum of Emergency Department patients primarily and autonomously under the guidance and supervision of Emergency Medicine Attendings.",
            "id": "EMERMED 961",
            "parent": "EMERMED",
            "title": "ADVANCED EM ELECTIVE"
        }
    },
    {
        "data": {
            "description": "Learn and gain clinical experience in the Emergency Department setting.  Evaluate and care for the full spectrum of Emergency Department patients under the guidance and supervision of Emergency Medicine attending physicians.",
            "id": "EMERMED 959",
            "parent": "EMERMED",
            "title": "EMERGENCY MEDICINE REGIONAL SITE"
        }
    },
    {
        "data": {
            "description": "Offers MD students interested in emergency medicine an opportunity to participate in advanced and translational research. Expands basic research knowledge and exposes MD students to current advanced research.",
            "id": "EMERMED 998",
            "parent": "EMERMED",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Offers undergraduates majoring in related fields an opportunity to participate in basic emergency medicine research. Assists in the preparation for graduate or medical school coursework.",
            "id": "EMERMED 699",
            "parent": "EMERMED",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Organized around physiological themes, the course includes material related to the cardiovascular system, hematology, nephrology, and pulmonology to present an integrated picture of how these systems function together to maintain homeostasis. In addition, there is significant content from other competency domains such as public health, ethics, evidence-based medicine, patient care/communication and clinical skills.",
            "id": "MEDSC-M 771",
            "parent": "MEDSC-M",
            "title": "BODY IN BALANCE"
        }
    },
    {
        "data": {
            "description": "Provides a unique opportunity for fourth year medical students to gain experience in the prehospital system while utilizing their public health knowledge to determine factors that lead to patient utilization of this system. During this course, students will gain understanding of the prehospital system through first-hand experience with prehospital providers while appreciating the environment in which their patients live and work. Students will be asked to observe patient care, conduct posttransport interviews in the emergency department, and examine the social and environmental determinants that led to activation of the prehospital system.",
            "id": "EMERMED 911",
            "parent": "EMERMED",
            "title": "INTRODUCTION TO PREHOSPITAL MEDICINE AND DETERMINANTS OF UTILIZATION OF THE PREHOSPITAL SYSTEM"
        }
    },
    {
        "data": {
            "id": "EMERMED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MEDSC-M",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "EMERMED 961",
            "target": "EMERMED 909"
        }
    },
    {
        "data": {
            "source": "EMERMED 961",
            "target": "EMERMED 970"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 771",
            "target": "MEDSC-M 810"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 773",
            "target": "MEDSC-M 810"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 810",
            "target": "EMERMED 940"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 812",
            "target": "EMERMED 909"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 812",
            "target": "EMERMED 914"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 812",
            "target": "EMERMED 920"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 812",
            "target": "EMERMED 940"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "EMERMED 914"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "EMERMED 920"
        }
    }
]