[
    {
        "data": {
            "description": "An introduction to literature in English about the natural world and humankind's relationship with it; specific topics will vary.",
            "id": "ENGL/ENVIRST 153",
            "title": "LITERATURE AND THE ENVIRONMENT"
        }
    },
    {
        "data": {
            "description": "An introduction to the linguistic study of child language within the generative theory. According to this theory, humans are born with genetically determined linguistic knowledge called Universal Grammar, which guides children in learning language. Learn the basic concepts of the generative theory and learn to apply them to the study of child language. Topics include universal linguistic principles that govern children's acquisition of syntax and semantics and cross-linguistic influence in children acquiring more than one language from birth or early childhood. Discuss empirical research studies testing the Universal Grammar theory of language acquisition.",
            "id": "ENGL 320",
            "parent": "ENGL",
            "title": "LINGUISTIC THEORY AND CHILD LANGUAGE"
        }
    },
    {
        "data": {
            "description": "Explores a variety of non-fictional prose writing forms including (at the instructor's discretion) personal essay, memoir, travel writing, opinion pieces, investigative journalism, public science writing, and natural history writing. Covers theory and technique, reading the work of established writers and some short writing exercises. Focuses  on student writing, both in the classroom and in individual conferences.",
            "id": "ENGL 407",
            "parent": "ENGL",
            "title": "CREATIVE WRITING: NONFICTION WORKSHOP"
        }
    },
    {
        "data": {
            "description": "Explores myths and ideologies about English language usage in the US (present and past) from a linguistic perspective. Discusses how common perceptions towards language use and language varieties, especially those associated with ethnic or racial minorities, are socially (not linguistically) constructed. Addresses questions like: Where do linguistic myths, especially those regarding varieties of American English used by persistently marginalized groups, come from and how does one check if there is a factual basis for them? Who gets to decide which words are entered into a dictionary or what constitutes 'proper' English? What perceptions do people have about 'good' and 'bad' dialects and accents? Who benefits and who is harmed by such perceptions? Approaches these and related questions within an anti-racist framework, showing that perceptions towards certain English varieties are often not grounded in linguistic facts but rather in bias against certain demographic groups.",
            "id": "ENGL 179",
            "parent": "ENGL",
            "title": "INTRODUCTION TO LANGUAGE AND IDEOLOGY"
        }
    },
    {
        "data": {
            "description": "Explores the relationship between descriptive and prescriptive grammar. Examines the role of prescriptivism in linguistics from a disciplinary view (why are linguists against it when the public is so clearly interested in singling out some constructions as 'bad grammar'). Provides a historical view (the tradition of grammar writing -- who gets to decide what is 'correct') and a variationist view (corpus-based studies on phenomena like preposition stranding, split infinitives, the distinction of who/whom etc.) of grammar writing. Covers the historical and cultural roots of beliefs about what constitutes 'good' and 'bad' grammar. Introduces linguistic tools and methods to check claims about grammar.",
            "id": "ENGL 412",
            "parent": "ENGL",
            "title": "BAD GRAMMAR AND METALINGUISTIC AWARENESS"
        }
    },
    {
        "data": {
            "description": "Feminist theory and women's writing in English.",
            "id": "ENGL/GEN&WS 545",
            "title": "FEMINIST THEORY AND WOMEN'S WRITING IN ENGLISH"
        }
    },
    {
        "data": {
            "description": "For further information, consult the department's Honors Coordinator or Undergraduate Advisor.",
            "id": "ENGL 680",
            "parent": "ENGL",
            "title": "HONORS PROJECT"
        }
    },
    {
        "data": {
            "description": "Intended for students with Junior or Senior standing who have undertaken previous or concurrent work at intermediate level in same subject. Junior or Senior standing; previous or concurrent work at intermediate level in same subject. Students should consult with the English department's academic advisor before enrolling.",
            "id": "ENGL 699",
            "parent": "ENGL",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Introduction to several of Shakespeare's most popular plays and their relation to other works of English and American literature.",
            "id": "ENGL 162",
            "parent": "ENGL",
            "title": "SHAKESPEARE"
        }
    },
    {
        "data": {
            "description": "Investigation of some specific topic in gender and women's studies related to gender and literature. Topic differs each semester.",
            "id": "ENGL/GEN&WS 350",
            "title": "SPECIAL TOPICS IN GENDER & LITERATURE"
        }
    },
    {
        "data": {
            "description": "Offers close instruction in the principles and practices of informed, engaged, critical reading and writing. While the texts and topics vary, each seminar will reinforce fundamental skills taught across the English major, strengthening students' capacities to write and speak powerfully and to build convincing, original, well-organized arguments that persuade audiences of their significance.",
            "id": "ENGL 245",
            "parent": "ENGL",
            "title": "SEMINAR IN THE MAJOR"
        }
    },
    {
        "data": {
            "description": "Representative twentieth-century plays from Glaspell and O'Neill to the present considered within contemporary cultural, theatrical and academic context.",
            "id": "ENGL/THEATRE 578",
            "title": "MODERN AMERICAN DRAMA AND THEATRE"
        }
    },
    {
        "data": {
            "description": "Study of Edmund Spenser's major poems.",
            "id": "ENGL 433",
            "parent": "ENGL",
            "title": "SPENSER"
        }
    },
    {
        "data": {
            "description": "Study of John Milton's poems and selected prose.",
            "id": "ENGL/RELIGST 434",
            "title": "MILTON"
        }
    },
    {
        "data": {
            "description": "The focus is on students' own writing in this workshop-oriented course for writers in any discipline. Theoretical and practical foundations for drafting, revising, and reviewing a range of academic genres and approaches. Students should be enrolled concurrently in another course where academic writing is assigned.",
            "id": "ENGL 200",
            "parent": "ENGL",
            "title": "WRITING STUDIO"
        }
    },
    {
        "data": {
            "description": "Topics will vary. All topics will emphasize the following learning outcomes: awareness of history's impact on the present, ability to recognize and question assumptions, development of critical thinking skills, awareness of relations between self and others, and effective participation in a multicultural society.",
            "id": "ASIANAM/ENGL 462",
            "title": "TOPIC IN ASIAN AMERICAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Uses writing in many forms and genres to help students explore how race, gender, and sexuality intersect with language and inform textual experiences. From marriage licenses, passports, and don't ask, don't tell policies to literacy requirements and gag rules, written texts have played major roles in enforcing expectations about race and sex in the United States. At the same time, anti-slavery petitions, letters to the editor, wheat-pasted posters, and hashtag activism all also harness the power of writing to challenge and revise those expectations. In light of that active textual production and negotiation, this class traces public debates and daily experiences where people write or talk about race and sex in order to make a difference. Ultimately, the class takes on the power of words to break bones and heal wounds. Through reading and writing informed by scholarship in writing studies and rhetoric, students in this class will examine historical and contemporary interconnections among race, sexuality, gender, and texts in the United States, developing analytical tools for understanding how language works on and in their world.",
            "id": "ENGL/GEN&WS 401",
            "title": "RACE, SEX, AND TEXTS (HOW TO DO THINGS WITH WRITING)"
        }
    },
    {
        "data": {
            "description": "What do texts do? How? For whom? How and why do writers and readers compose texts that have an impact? Approaches these enduring questions of English studies from the perspective of Composition  Rhetoric, one of English's subfields. Emphasizing critical reading and writing and built around a central theme that varies by semester, the course prepares students to analyze historical and/or contemporary examples of how texts create communities, influence beliefs, and shape knowledge.",
            "id": "ENGL 204",
            "parent": "ENGL",
            "title": "STUDIES IN WRITING, RHETORIC, AND LITERACY"
        }
    },
    {
        "data": {
            "description": "What happens to English drama after Shakespeare's death?  Public theaters closed, considered too racy for the moral health of the population. When they reopened in 1660, sex took center stage in productions of plays both old and new. Women acted on stages in London for the first time, both in roles originally written for cross-dressing boys and in new ones designed for female actors. Female playwrights entered the scene as well, writing for financial profit alongside their male counterparts. Read a sampling of plays and theatrical entertainments performed during the Restoration and eighteenth century as well as publications surrounding the world of the theater to gain a sense of drama on the page and on the stage.",
            "id": "ENGL 335",
            "parent": "ENGL",
            "title": "STAGE AND PAGE IN THE LONG EIGHTEENTH CENTURY"
        }
    },
    {
        "data": {
            "description": "",
            "id": "ENGL 799",
            "parent": "ENGL",
            "title": "INDEPENDENT READING"
        }
    },
    {
        "data": {
            "description": "A course carried with a UW-Madison Study Abroad Program which has no equivalent on this campus. Current enrollment in a UW-Madison study abroad program",
            "id": "ENGL 622",
            "parent": "ENGL",
            "title": "TOPICS IN ENGLISH: STUDY ABROAD"
        }
    },
    {
        "data": {
            "description": "A course on literature written in English that satisfies the Comm B requirement. Topic will vary by semester.",
            "id": "ENGL 140",
            "parent": "ENGL",
            "title": "COMM B TOPICS IN ENGLISH LITERATURE"
        }
    },
    {
        "data": {
            "description": "A focus on understanding English grammar from a pedagogical perspective for the purpose of teaching English as a second or foreign language. The emphasis is on theory and techniques applicable to teaching English grammar.",
            "id": "ENGL 614",
            "parent": "ENGL",
            "title": "TESOL: PEDAGOGICAL GRAMMAR II"
        }
    },
    {
        "data": {
            "description": "A focus on understanding English grammar from a pedagogical perspective for the purpose of teaching English as a second or foreign language.",
            "id": "ENGL 613",
            "parent": "ENGL",
            "title": "TESOL: PEDAGOGICAL GRAMMAR I"
        }
    },
    {
        "data": {
            "description": "A gateway course that introduces students to theories and methods that are important to literary studies.",
            "id": "ENGL 800",
            "parent": "ENGL",
            "title": "CRITICAL METHODS IN LITERARY STUDIES"
        }
    },
    {
        "data": {
            "description": "A humanities-oriented analysis of cultural representations of women and men within the social and historical contexts of race, class, gender and sexuality; engages with a range of traditions and modes of representation including literature, mass media and popular culture.",
            "id": "GEN&WS 101",
            "parent": "GEN&WS",
            "title": "GENDER, WOMEN, AND CULTURAL REPRESENTATION"
        }
    },
    {
        "data": {
            "description": "A low-enrollment course developing skills in critical reading, logical thinking, use of evidence, and use of library resources. Emphasis on writing in the conventions of specific fields.",
            "id": "ENGL 236",
            "parent": "ENGL",
            "title": "BASCOM COURSE"
        }
    },
    {
        "data": {
            "description": "A review of English grammar through intensive written and oral practice to promote accurate and appropriate language use for students who have already studied grammar extensively and need to refine the ability to produce acceptable academic English. Not open to auditors",
            "id": "ESL 115",
            "parent": "ESL",
            "title": "GRAMMAR FOR ACADEMIC USE"
        }
    },
    {
        "data": {
            "description": "A selected topic relating to gender and sexuality in literature.",
            "id": "ENGL 171",
            "parent": "ENGL",
            "title": "LITERATURE, GENDER, AND SEXUALITY"
        }
    },
    {
        "data": {
            "description": "A selected topic studying the intersection of literature and popular culture in various forms and media.",
            "id": "ENGL 177",
            "parent": "ENGL",
            "title": "LITERATURE AND POPULAR CULTURE"
        }
    },
    {
        "data": {
            "description": "A study of novels, plays, poems, and films that focus on individuals who strive to achieve success and security in America.",
            "id": "ENGL 145",
            "parent": "ENGL",
            "title": "AMERICAN DREAMERS"
        }
    },
    {
        "data": {
            "description": "A survey covering most of the plays after 1600.",
            "id": "ENGL 220",
            "parent": "ENGL",
            "title": "SHAKESPEAREAN DRAMA"
        }
    },
    {
        "data": {
            "description": "A survey of elements and styles of poetic form. Readings will be selected from British and American literature written in English.",
            "id": "ENGL 224",
            "parent": "ENGL",
            "title": "INTRODUCTION TO POETRY"
        }
    },
    {
        "data": {
            "description": "A thematic introduction to literary works in a variety of genres written in English from the turn of the twentieth century to the present day. Emphasis may vary between writers from the U.S., Britain, Ireland, and other Anglophone nations.",
            "id": "ENGL 168",
            "parent": "ENGL",
            "title": "MODERN LITERATURE"
        }
    },
    {
        "data": {
            "description": "A workshop intended for high school teachers or other post-baccalaureate students. Intended for University Special Students, the class generally does not satisfy requirements for any graduate or undergraduate major in English.",
            "id": "ENGL 719",
            "parent": "ENGL",
            "title": "SUMMER WRITING WORKSHOP"
        }
    },
    {
        "data": {
            "description": "Academic writing, critical reading and argumentation, documentation, and style and organization of research papers; oral communication skills for effective class participation and presentations. Not open to auditors.",
            "id": "ESL 118",
            "parent": "ESL",
            "title": "ACADEMIC WRITING II"
        }
    },
    {
        "data": {
            "description": "American literature by and about women, written by authors from ethnic groups.",
            "id": "ENGL/GEN&WS 248",
            "title": "WOMEN IN ETHNIC AMERICAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "An examination of linguistic, psychological, and sociological theories of second language acquisition and their application to research in syntax, phonology, lexicon, or pragmatics of a second language.",
            "id": "ENGL 715",
            "parent": "ENGL",
            "title": "ADVANCED SECOND LANGUAGE ACQUISITION"
        }
    },
    {
        "data": {
            "description": "An exploration of Jewish literature in English and in Anglophone contexts.",
            "id": "ENGL/JEWISH 539",
            "title": "JEWISH LITERATURES IN DIASPORA"
        }
    },
    {
        "data": {
            "description": "An exploration of Victorian poets, such as the Brownings, Tennyson, and Christina Rossetti.",
            "id": "ENGL 346",
            "parent": "ENGL",
            "title": "VICTORIAN POETRY"
        }
    },
    {
        "data": {
            "description": "An exploration of mystery and crime fiction written in English.",
            "id": "ENGL 142",
            "parent": "ENGL",
            "title": "MYSTERY AND CRIME FICTION"
        }
    },
    {
        "data": {
            "description": "An exploration of the methods and principles of criticism; generally an experiment in the application of a particular critical method or a group of related critical presuppositions to an appropriate body of English and American literature. Content varies.",
            "id": "ENGL 559",
            "parent": "ENGL",
            "title": "TOPIC IN LITERARY OR CULTURAL THEORY"
        }
    },
    {
        "data": {
            "description": "An intensive analysis of specific themes in the Afro-American experience. Subjects vary with instructor.",
            "id": "AFROAMER/ENGL 672",
            "title": "SELECTED TOPICS IN AFRO-AMERICAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "An intensive study of a major work or works of Old English, usually focusing on either Beowulf or the poems of a single manuscript. Line-by-line translation of the text will be supplemented by discussion of related issues (whether linguistic, thematic, or contextual) as well as by readings from relevant critical literature. Primary texts will be read in Old English.",
            "id": "ENGL/MEDIEVAL 521",
            "title": "ADVANCED OLD ENGLISH LITERATURE"
        }
    },
    {
        "data": {
            "description": "An introduction to British and American literature through particular writers and themes.",
            "id": "ENGL 167",
            "parent": "ENGL",
            "title": "BRITISH AND AMERICAN WRITERS"
        }
    },
    {
        "data": {
            "description": "An introduction to graphic story-telling in English, including attention to its history and developing form in the present day.",
            "id": "ENGL 143",
            "parent": "ENGL",
            "title": "THE GRAPHIC NOVEL"
        }
    },
    {
        "data": {
            "description": "An introduction to literature in English written by women in various periods and places; specific topics will vary.",
            "id": "ENGL/GEN&WS 144",
            "title": "WOMEN'S WRITING"
        }
    },
    {
        "data": {
            "description": "An introduction to selected fiction, prose, drama and poetry written by Americans from the early twentieth century to the present day.",
            "id": "ENGL 169",
            "parent": "ENGL",
            "title": "MODERN AMERICAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "An introduction to the interplay of literature and film in English, with a focus on the analysis of novels, stories, poems and other writings and their representation and transformation in and through film; specific topics will vary.",
            "id": "ENGL 176",
            "parent": "ENGL",
            "title": "TOPICS IN LITERATURE AND FILM"
        }
    },
    {
        "data": {
            "description": "An introduction to the intersection of ever-evolving digital technologies with the production and reception of literature. Examine the role of digital media in structuring the knowledge and experience of literary works; and provides an opportunity for critical and potentially creative practice.",
            "id": "ENGL 178",
            "parent": "ENGL",
            "title": "DIGITAL MEDIA, LITERATURE, AND CULTURE"
        }
    },
    {
        "data": {
            "description": "An introduction to the literature of science fiction and fantasy; specific topics will vary.",
            "id": "ENGL 141",
            "parent": "ENGL",
            "title": "SCIENCE FICTION AND FANTASY"
        }
    },
    {
        "data": {
            "description": "An introduction to the multiple ways writers have used literary texts to engage with pressing questions about class, race, gender, equality, immigration, and other issues of social justice. Specific topics will vary.",
            "id": "ENGL 174",
            "parent": "ENGL",
            "title": "LITERATURE AND SOCIAL JUSTICE"
        }
    },
    {
        "data": {
            "description": "An introduction to various research paradigms in applied linguistics and second language acquisition. A preparation for critically evaluating published research in applied linguistics and second language acquisition.",
            "id": "ENGL 711",
            "parent": "ENGL",
            "title": "RESEARCH METHODS IN APPLIED LINGUISTICS"
        }
    },
    {
        "data": {
            "description": "An overview of listening and speaking skills and how to teach them.",
            "id": "ENGL 615",
            "parent": "ENGL",
            "title": "TESOL: TEACHING LISTENING AND SPEAKING"
        }
    },
    {
        "data": {
            "description": "An overview of reading and vocabulary skills and how to teach them.",
            "id": "ENGL 616",
            "parent": "ENGL",
            "title": "TESOL: TEACHING OF READING"
        }
    },
    {
        "data": {
            "description": "An overview of the features of English pronunciation and how to teach them.",
            "id": "ENGL 618",
            "parent": "ENGL",
            "title": "TESOL: TEACHING PRONUNCIATION"
        }
    },
    {
        "data": {
            "description": "An overview of the structure, use, and development of the English language and its varieties.",
            "id": "ENGL 214",
            "parent": "ENGL",
            "title": "THE ENGLISH LANGUAGE"
        }
    },
    {
        "data": {
            "description": "Basic elements of academic writing, emphasizing improved fluency and accuracy, paragraph structure, summarizing and paraphrasing, short essays, and a final research project. Not open to auditors.",
            "id": "ESL 117",
            "parent": "ESL",
            "title": "ACADEMIC WRITING I"
        }
    },
    {
        "data": {
            "description": "Basic principles of phonetics and phonology applied to the description of English and other languages.",
            "id": "ENGL 315",
            "parent": "ENGL",
            "title": "ENGLISH PHONOLOGY"
        }
    },
    {
        "data": {
            "description": "Chicanxs and Latinxs are frequently imagined in ways that erase the history, presence, and influence of African-descended peoples within these groups. However, this anti-Blackness does not go unanswered in Chicanx and Latinx cultural production. Covers literature, life-writing/autoethnography, visual culture, philosophy/theory, and history that takes up Black Latinx experience and/or that comparatively explores the African American and Latinx convergences, exploring a rich vein of thought and representation in U.S. literatures that is often more transamerican than American and that offers new definitions of both Latinx and Black. Readings on racial paradigms in the Americas, paying attention to the differences between US and Latin American contexts, as well readings on decoloniality, intersectional feminisms, borderlands, and diaspora.",
            "id": "CHICLA/ENGL 460",
            "title": "BLACK AND LATINX IN LITERATURE AND VISUAL CULTURE"
        }
    },
    {
        "data": {
            "description": "Concentrated study of US novelists.",
            "id": "ENGL 459",
            "parent": "ENGL",
            "title": "THREE AMERICAN NOVELISTS"
        }
    },
    {
        "data": {
            "description": "Concepts of physical disability from antiquity to the Renaissance. Literary theory, philosophy, and history will help frame thinking about how disability is produced. Along with considering how canonical texts represent disabled figures, class will investigate the generic, social, and spatial contexts from which these representations arise.",
            "id": "ENGL 543",
            "parent": "ENGL",
            "title": "DISCOURSES OF DISABILITY, ANTIQUITY TO 1800"
        }
    },
    {
        "data": {
            "description": "Considers a period of unparalleled tumult: a time of vast world empires and startling new technologies, revolutions that radically redefined self and community, two cataclysmic world wars, the emergence of ideas of human rights, and the first truly global feelings of interconnectedness. How has literature captured and contributed to these dramatic upheavals? Some writers worldwide have struggled to invent new forms, new words, and new genres to do justice to a world in crisis, while others have reached back in time, seeking continuity with the past. Explore enduring traditions of poetry and drama and think about experiments in the new, globally popular genre of the novel. Develops skills of critical reading and writing that are essential to majors and non-majors alike.",
            "id": "ENGL 242",
            "parent": "ENGL",
            "title": "LITERATURE AND CULTURE II: FROM THE 18TH CENTURY TO THE PRESENT"
        }
    },
    {
        "data": {
            "description": "Creative writing pedagogy for MFA in creative writing students.",
            "id": "ENGL 783",
            "parent": "ENGL",
            "title": "CREATIVE WRITING PEDAGOGY SEMINAR"
        }
    },
    {
        "data": {
            "description": "Description and analysis of geographical and social variation in English in the United States.",
            "id": "ENGL 316",
            "parent": "ENGL",
            "title": "ENGLISH LANGUAGE VARIATION IN THE U.S."
        }
    },
    {
        "data": {
            "description": "Development, range of ideas, and poetic theory of Freneau, Bryant, Whittier, Emerson, Poe, Longfellow, Lowell, Holmes, Dickinson, Lanier, Whitman, Lindsay, and Robinson.",
            "id": "ENGL 357",
            "parent": "ENGL",
            "title": "MAJOR AMERICAN POETS"
        }
    },
    {
        "data": {
            "description": "Digital technologies such as blogs, wikis, videogames, and social media sites present new sites for understanding how we consume and produce information. Approaches these technologies by asking students to study how they fit within the long history of advances in writing technology. Analyze and create digital objects and arguments. Prepares students to meaningfully engage with digital technologies by demonstrating how long-standing theories of reading and writing can be augmented to address emerging technological environments.",
            "id": "ENGL 271",
            "parent": "ENGL",
            "title": "WRITING WITH NEW MEDIA"
        }
    },
    {
        "data": {
            "description": "Dramatic traditions of medieval England, from early church rituals performed inside quiet monasteries in the tenth century to the elaborate and often raucous urban guild cycles and morality plays of the fifteenth, and with special attention to the significance of spirituality, work, and play in medieval culture.",
            "id": "ENGL/MEDIEVAL 424",
            "title": "MEDIEVAL DRAMA"
        }
    },
    {
        "data": {
            "description": "Eighteenth-century literature and culture, including such writers as Dryden, Defoe, Swift, and Pope.",
            "id": "ENGL 334",
            "parent": "ENGL",
            "title": "EIGHTEENTH CENTURY LITERATURE AND CULTURE"
        }
    },
    {
        "data": {
            "description": "Emerging technologies, from the Internet to computational machines, reshape how we read, write, and think. Explores the significance of these new media technologies, how scholars have theorized digital writing, and how writing can be \"remixed\" with the use of digital technologies. Produce essays and then remix those essays using various digital technologies, transforming their writing into various forms, including graphic essays, video compositions, audio compositions, and computational media such as video games.",
            "id": "ENGL 571",
            "parent": "ENGL",
            "title": "REMIX, MASHUP, AND DIGITAL DESIGN"
        }
    },
    {
        "data": {
            "description": "English language literatures of former colonies, primarily in Africa and South Asia. While scrutinizing the concept of the \"postcolonial\" and evaluating its many meanings, class will read some of the significant writers of the postcolonial world and attend to the literary traditions that produced them.",
            "id": "ENGL 379",
            "parent": "ENGL",
            "title": "POSTCOLONIAL AND WORLD LITERATURE"
        }
    },
    {
        "data": {
            "description": "Examination of aspects of travel literature before 1800. It will pay attention to texts written by travelers of many stripes - pilgrims, missionaries, crusaders, counselors, merchants, and dreamers. It will explore how writers narrate relations between the familiar and the strange, the near and far. And it will ask students to consider the relationship of geography to conceptions of personal and collective identity. How do travel writers represent \"us\" and \"them,\" \"self\" and \"other\"? Who claims space, who characterizes it, and on what grounds?",
            "id": "ENGL 546",
            "parent": "ENGL",
            "title": "TOPIC IN TRAVEL WRITING BEFORE 1800"
        }
    },
    {
        "data": {
            "description": "Examination of the linguistic, social, and political impact of the spread of English around the world. Analysis of geographical, social, and stylistic variation in English in diverse world contexts.",
            "id": "ENGL 414",
            "parent": "ENGL",
            "title": "GLOBAL SPREAD OF ENGLISH"
        }
    },
    {
        "data": {
            "description": "Examines the development, scope, and effects of the \"True Crime\" genre in the United States. Using literary analysis and legal studies methods, explore various areas of the genre (written, podcasts, documentaries, etc.) and try to find answer as to why we are so compelled by true crime narratives and what true crime's \"truth\" is. Untangle the complex relationship between law and narrative (background on each will be provided) and the various epistemological systems it combines, including the role of science and technology. Gain a detailed understanding of what our culture's relationship to \"real life\" crime narratives tells us about the fundamental and complex role criminality plays in defining us as a society.",
            "id": "ENGL/LEGALST 160",
            "title": "TRUTH AND CRIME"
        }
    },
    {
        "data": {
            "description": "Exploration of British, Irish, and Anglophone poets working in the early twentieth century, such as W. B. Yeats, T. S. Eliot, Gertrude Stein, and Ezra Pound.",
            "id": "ENGL 352",
            "parent": "ENGL",
            "title": "MODERNIST POETRY"
        }
    },
    {
        "data": {
            "description": "Exploration of literature as both a source of knowledge about medicine and as a catalyst for reflection about medical concepts and practices, including health, illness, dying, and disability. Students will consider ways that literature can serve as a resource for patients and healthcare practitioners.",
            "id": "ENGL 156",
            "parent": "ENGL",
            "title": "LITERATURE AND MEDICINE"
        }
    },
    {
        "data": {
            "description": "Explore classic literary and cultural texts from three regions: Africa, the Caribbean, and African America. Consider the origins and evolution of the African diaspora, and the many forms of its expression. Consider how the African diaspora has shaped US society today, exploring significant themes such as slavery and colonialism, race and cultural identity; intra-racial/cultural and cross-continental alliances and antagonisms; gender and genre; and the paradoxical fate so far-cultural visibility but peripheral political and economic power- of global Afro-cultures. Think about how African-American writers have been influenced by the experience of the African diaspora, and also about the ways that cultural expression from around the world has shaped US culture.",
            "id": "ENGL 374",
            "parent": "ENGL",
            "title": "AFRICAN AND AFRICAN DIASPORA LITERATURE AND CULTURE"
        }
    },
    {
        "data": {
            "description": "Explores current theory and research on the writing process and analyzes disciplinary genres and conventions. Teaches strategies for helping writers revise their work. As Undergraduate Writing Fellows, students will help their peers improve their writing in courses across the curriculum. For students accepted into the Writing Fellows Program. For students accepted into the Writing Fellows program",
            "id": "ENGL 403",
            "parent": "ENGL",
            "title": "SEMINAR ON TUTORING WRITING ACROSS THE CURRICULUM"
        }
    },
    {
        "data": {
            "description": "Explores how a humanistic perspective can broaden our understanding of health and medicine. Specifically, we will examine the role of language and culture in the creation and circulation of biomedical knowledge; our lived experiences with illness (physical and mental); the intricate intersections of race, gender, sexuality, disability and medicine; the political dimensions of diagnosis, disease, and epidemics, and the role that fiction, creative non-fiction, comics, and film play in shaping our experiences with health and medicine as health care providers and as patients. The course does not assume any background in science or medicine. One of our recurrent topics, in fact, will be to consider how non-experts interact with medicine and its technical vocabularies. Although the primary objective of the course is to understand the cultural, social, and political dimensions of health and medicine, a secondary objective is for students to become more savvy patients and, for the few students who might emerge on the other side of the stethoscope one day, more well rounded health care professionals.",
            "id": "ENGL/HISTSCI/MEDHIST 525",
            "title": "HEALTH AND THE HUMANITIES"
        }
    },
    {
        "data": {
            "description": "Explores the art and craft of writing for the stage. Examines strategies that writers can use to tell stories and communicate ideas both theatrically and dramatically. Covers theory and technique, reading the work of established writers and some short writing exercises. Focuses  on student writing, both in the classroom and in individual conferences.",
            "id": "ENGL 410",
            "parent": "ENGL",
            "title": "CREATIVE WRITING: PLAYWRITING WORKSHOP"
        }
    },
    {
        "data": {
            "description": "Explores the genre of visionary fiction - speculative fiction written for social justice purposes - as a means to create, build and maintain new worlds. Examines the political potential of literature and multiple examples of visionary fiction.",
            "id": "ENGL/GEN&WS 359",
            "title": "VISIONARY AND SPECULATIVE FICTION: SOCIAL JUSTICE APPROACHES"
        }
    },
    {
        "data": {
            "description": "Explores the intersection between race and sexuality in American literature with an emphasis on sex/gender difference, feminism, transgenderism, and nationalism. Focuses on the nature of literature as advocacy, with an emphasis on Asian-American issues.",
            "id": "ASIANAM/ENGL/GEN&WS 463",
            "title": "RACE AND SEXUALITY IN AMERICAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Explores the ways that literary texts represent, imagine, and re-imagine the environment.",
            "id": "ENGL/ENVIRST 533",
            "title": "TOPIC IN LITERATURE AND THE ENVIRONMENT"
        }
    },
    {
        "data": {
            "description": "Feminist theory, with an emphasis on literary and cultural theory and criticism in English.",
            "id": "ENGL/GEN&WS 737",
            "title": "FEMINIST THEORY AND CRITICISM"
        }
    },
    {
        "data": {
            "description": "Fiction writing and poetry writing, with readings of writers as models.",
            "id": "ENGL 207",
            "parent": "ENGL",
            "title": "INTRODUCTION TO CREATIVE WRITING: FICTION AND POETRY WORKSHOP"
        }
    },
    {
        "data": {
            "description": "Fiction writing.",
            "id": "ENGL 508",
            "parent": "ENGL",
            "title": "CREATIVE WRITING: ADVANCED FICTION WORKSHOP"
        }
    },
    {
        "data": {
            "description": "Focuses on developing complex understandings of rhetorical, ethical, and literary strategies for writing. Practice in writing a range of nonfiction genres with attention to varieties of style, context, critical standards, and conventions. Designed for students with a strong interest in writing. May include multi-modal assignments.",
            "id": "ENGL 400",
            "parent": "ENGL",
            "title": "ADVANCED COMPOSITION"
        }
    },
    {
        "data": {
            "description": "Focuses on development of rhetorical reading, listening, and writing abilities; provides practice in written and spoken communication (emphasis on writing); develops information literacy; provides a foundation for a variety of college course work and post-college careers.",
            "id": "ENGL 100",
            "parent": "ENGL",
            "title": "INTRODUCTION TO COLLEGE COMPOSITION"
        }
    },
    {
        "data": {
            "description": "Focuses on theoretical and practical aspects of public engagement with scientific research, policy, and management, with an emphasis on writing, rhetoric, and scientific discourse.",
            "id": "ENGL/ENVIRST 305",
            "title": "RHETORIC, SCIENCE, AND PUBLIC ENGAGEMENT"
        }
    },
    {
        "data": {
            "description": "Functions of English grammar, covering use in a variety of contexts and text types. Involves analysis of spoken and written English across genres and settings.",
            "id": "ENGL 516",
            "parent": "ENGL",
            "title": "ENGLISH GRAMMAR IN USE"
        }
    },
    {
        "data": {
            "description": "Guest artists will offer interdisciplinary courses on topics appropriate to their specializations. Students may not be concurrently enrolled withENGL 307,407,409,408,410,411,508,509, or695",
            "id": "ENGL 469",
            "parent": "ENGL",
            "title": "INTERDISCIPLINARY STUDIES IN THE ARTS"
        }
    },
    {
        "data": {
            "description": "Historical, critical and philosophical perspectives on the relationship between writing and learning. In addition to reviewing current research, students will have the opportunity to carry out their own investigation designed to study possible relationships between writing and learning.",
            "id": "ENGL 701",
            "parent": "ENGL",
            "title": "WRITING AND LEARNING"
        }
    },
    {
        "data": {
            "description": "Historical, critical, and philosophical perspectives on the development of composition studies during the modern era, with special emphasis on the 20th Century.",
            "id": "ENGL 705",
            "parent": "ENGL",
            "title": "INTELLECTUAL SOURCES OF CONTEMPORARY COMPOSITION THEORY II-MODERN"
        }
    },
    {
        "data": {
            "description": "Historical, political, and aesthetic roots and directions of Latin@ and Chican@ short stories, novels, poetry, music, plays, films, and essays.",
            "id": "CHICLA/ENGL 368",
            "title": "CHICANA/O AND LATINA/O LITERATURES"
        }
    },
    {
        "data": {
            "description": "Honors literature seminar for first year students. Topic and materials will vary.",
            "id": "ENGL 181",
            "parent": "ENGL",
            "title": "FIRST-YEAR HONORS SEMINAR"
        }
    },
    {
        "data": {
            "description": "How does literature help us understand animals and our relation to them? We address this question by exploring two types of representation: representation as depiction (the attempt to describe animals in literature) and representation as a legal or political act (the attempt to speak or act on behalf of animals). Organized around familiar animal categories - dogs, cats, horses, apes, birds, insects - we examine the representation of animals in modern literature as a way to give an account of the cultural history of human-animal relations and, in doing so, to make us reflect upon the social, political, and environmental consequences of this history at a time when animal species are disappearing at an alarming rate.",
            "id": "ENGL 376",
            "parent": "ENGL",
            "title": "LITERATURE AND ANIMAL STUDIES"
        }
    },
    {
        "data": {
            "description": "Important early form of narrative fiction, covering tales of adventure, magic, courtly love, and King Arthur from the twelfth through the fifteenth century.",
            "id": "ENGL/MEDIEVAL 425",
            "title": "MEDIEVAL ROMANCE"
        }
    },
    {
        "data": {
            "description": "In connection with the doctoral thesis. Consult graduate advisor.",
            "id": "ENGL 990",
            "parent": "ENGL",
            "title": "DISSERTATION RESEARCH IN ENGLISH"
        }
    },
    {
        "data": {
            "description": "In-depth intellectual engagement with the perspectives, concerns, and methods of Composition  Rhetoric. Topics vary in relation to writing, rhetoric, literacy, and multimodal or digital approaches to any of these.",
            "id": "ENGL 505",
            "parent": "ENGL",
            "title": "TOPICS IN COMPOSITION AND RHETORIC"
        }
    },
    {
        "data": {
            "description": "In-depth treatment of specific problems, questions, themes, authors, texts, or historical periods in composition and rhetoric. Subject will differ each year.",
            "id": "ENGL 706",
            "parent": "ENGL",
            "title": "SPECIAL TOPICS IN COMPOSITION THEORY"
        }
    },
    {
        "data": {
            "description": "Individually directed writing of a poetry or fiction manuscript.",
            "id": "ENGL 695",
            "parent": "ENGL",
            "title": "DIRECTED CREATIVE WRITING"
        }
    },
    {
        "data": {
            "description": "Intensive poetry workshop. Write original poetry and see it through drafting and revision, to final form; read and give detailed feedback on the work of peers; study published poetry to analyze craft elements for use in original work.",
            "id": "ENGL 509",
            "parent": "ENGL",
            "title": "CREATIVE WRITING: ADVANCED POETRY WORKSHOP"
        }
    },
    {
        "data": {
            "description": "Introduction to concepts of myth and mythology, myth-making and the modern study of myth in relation to myths and legends common in English and American literature.",
            "id": "ENGL 155",
            "parent": "ENGL",
            "title": "MYTH AND LITERATURE"
        }
    },
    {
        "data": {
            "description": "Introduction to literature that reflects the writing and experience of minority and ethnic groups. Texts will focus on a theme or problem.",
            "id": "ENGL 173",
            "parent": "ENGL",
            "title": "ETHNIC AND MULTICULTURAL LITERATURE"
        }
    },
    {
        "data": {
            "description": "Introduction to quantitative and qualitative research methods in composition studies.",
            "id": "ENGL 703",
            "parent": "ENGL",
            "title": "RESEARCH METHODS IN COMPOSITION STUDIES"
        }
    },
    {
        "data": {
            "description": "Introduction to the oral and written literatures of the peoples of native North America. An engagement with texts across historical periods, tribal groups, and regions to examine forms such as oratory, sermon, testimony, autobiography, and contemporary poetry and novels.",
            "id": "AMERIND/ENGL 172",
            "title": "LITERATURES OF NATIVE AMERICA"
        }
    },
    {
        "data": {
            "description": "Introduction to the teaching of writing; guides first-time and prospective teachers in teaching and evaluating a first-year writing class.",
            "id": "ENGL 790",
            "parent": "ENGL",
            "title": "PROSEMINAR IN THE TEACHING OF WRITING"
        }
    },
    {
        "data": {
            "description": "Introductory honors course in discussion format. Topic and materials will vary.",
            "id": "ENGL 182",
            "parent": "ENGL",
            "title": "INTRODUCTION TO LITERATURE FOR HONORS"
        }
    },
    {
        "data": {
            "description": "Is America a new world, a city on a hill, an imperial power? Are American literatures revolutionary, nationalist, countercultural?  Explores how writers have wrestled with such questions for several hundred years. We will encounter literary figures from white whales to red wheelbarrows, focusing on the diverse geographies, cultural practices, and political mythologies that compose the Americas, and interrogating what is meant by American literature and what it means to be American. We will consider the ways that genres from Native stories to slave narratives to postmodern novels have contributed to social, intellectual, and political currents of American cultures. Develops skills of critical reading and writing that are essential to majors and non-majors alike.",
            "id": "ENGL 243",
            "parent": "ENGL",
            "title": "AMERICAN LITERARY CULTURES"
        }
    },
    {
        "data": {
            "description": "Life and literature during the Old English period (c450-c1100). Primary emphasis on the vernacular and Latin writings of the Anglo-Saxons themselves. Extensive historical and archaeological background; attention to the development and character of monasticism, to the production of manuscripts, etc. All reading in translation.",
            "id": "ENGL/HISTORY/RELIGST 360",
            "title": "THE ANGLO-SAXONS"
        }
    },
    {
        "data": {
            "description": "Linguistic and sociolinguistic change in English from its beginnings to the present.",
            "id": "ENGL 417",
            "parent": "ENGL",
            "title": "HISTORY OF THE ENGLISH LANGUAGE"
        }
    },
    {
        "data": {
            "description": "Linguistic methods of analysis and description of English syntax and morphology.",
            "id": "ENGL 314",
            "parent": "ENGL",
            "title": "STRUCTURE OF ENGLISH"
        }
    },
    {
        "data": {
            "description": "Literature and culture of Britain in the sixteenth century.",
            "id": "ENGL 328",
            "parent": "ENGL",
            "title": "THE SIXTEENTH CENTURY"
        }
    },
    {
        "data": {
            "description": "Literature by or about people who leave homes and homelands by choice or compulsion.",
            "id": "ENGL 375",
            "parent": "ENGL",
            "title": "LITERATURES OF MIGRATION AND DIASPORA"
        }
    },
    {
        "data": {
            "description": "Literature in English by authors whose work reflects the experience of ethnic and minority groups.",
            "id": "ENGL 461",
            "parent": "ENGL",
            "title": "TOPICS IN ETHNIC AND MULTICULTURAL LITERATURE"
        }
    },
    {
        "data": {
            "description": "Literature of the Romantic age in relation to philosophical, cultural, historical, artistic or scientific backgrounds and contexts.",
            "id": "ENGL 340",
            "parent": "ENGL",
            "title": "ROMANTIC LITERATURE AND CULTURE"
        }
    },
    {
        "data": {
            "description": "Literatures in English with origins outside Britain and the United States; theories and/or histories in postcolonial, Anglophone, and/or world literatures in English. Topics will vary.",
            "id": "ENGL 813",
            "parent": "ENGL",
            "title": "WORLD AND/OR POSTCOLONIAL LITERATURE IN ENGLISH"
        }
    },
    {
        "data": {
            "description": "Major texts by Asian American women writers.",
            "id": "ASIANAM/ENGL/GEN&WS 464",
            "title": "ASIAN AMERICAN WOMEN WRITERS"
        }
    },
    {
        "data": {
            "description": "Mentored individual study for students completing honors theses.",
            "id": "ENGL 681",
            "parent": "ENGL",
            "title": "SENIOR HONORS THESIS IN THE MAJOR"
        }
    },
    {
        "data": {
            "description": "Mentored individual study for students completing honors theses.",
            "id": "ENGL 682",
            "parent": "ENGL",
            "title": "SENIOR HONORS THESIS IN THE MAJOR"
        }
    },
    {
        "data": {
            "description": "Mentored individual study for students completing theses.",
            "id": "ENGL 691",
            "parent": "ENGL",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Mentored individual study for students completing theses.",
            "id": "ENGL 692",
            "parent": "ENGL",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Mentored reading and research for pre-dissertator students.",
            "id": "ENGL 890",
            "parent": "ENGL",
            "title": "PRE-DISSERTATOR PRELIMINARY EXAM RESEARCH"
        }
    },
    {
        "data": {
            "description": "Modern syntactic theory applied to selected areas of English grammar, including the interface between syntax and the lexicon, and morphology.",
            "id": "ENGL 708",
            "parent": "ENGL",
            "title": "ADVANCED ENGLISH SYNTAX"
        }
    },
    {
        "data": {
            "description": "Modernist novelists such as Virginia Woolf, James Joyce, and E. M. Forster.",
            "id": "ENGL 351",
            "parent": "ENGL",
            "title": "MODERNIST NOVEL"
        }
    },
    {
        "data": {
            "description": "Nineteenth-century novel. The century begins with Jane Austen, includes some of the great realist novelists, such as George Eliot and Charles Dickens, and ends with experiments in novel-writing by Oscar Wilde and Joseph Conrad.",
            "id": "ENGL 345",
            "parent": "ENGL",
            "title": "NINETEENTH-CENTURY NOVEL"
        }
    },
    {
        "data": {
            "description": "Offers students enrolled in the Health and the Humanities certificate an opportunity to conduct independent research under the guidance of a faculty member. It allows students who have enrolled in or completed  a Health and the Humanities Capstone an opportunity to go into greater depth on a topic covered in the capstone course. In consultation with a faculty member, students will design a project that builds on lessons learned or work completed as part of their capstone experience.",
            "id": "ENGL/HISTSCI/MEDHIST 599",
            "title": "DIRECTED STUDY IN HEALTH AND THE HUMANITIES"
        }
    },
    {
        "data": {
            "description": "Plays and playwrights from the first World War to the present, including movements leading to the \"revolt\" of 1956 and subsequent proletarian and absurdist drama. Plays by Shaw, O'Casey, Maugham, Coward, Eliot, Osborne, Beckett, Pinter, Stoppard, Arden, Wesker, Bond, Churchill and others.",
            "id": "ENGL/THEATRE 575",
            "title": "BRITISH DRAMA, 1914 TO PRESENT"
        }
    },
    {
        "data": {
            "description": "Poetry of the most famous and influential medieval English poet, from his short lyrics on love through his dream visions of talking birds and castles built on ice to the historical romance Troilus and Criseyde. Readings will be in the original Middle English; no prior experience with the language is required.",
            "id": "ENGL/MEDIEVAL 426",
            "title": "CHAUCERS COURTLY POETRY"
        }
    },
    {
        "data": {
            "description": "Practical modular workshop on key aspects of language teaching, stressing the application of techniques and theory to classroom needs.",
            "id": "ENGL 617",
            "parent": "ENGL",
            "title": "TESOL: TEACHING OF WRITING"
        }
    },
    {
        "data": {
            "description": "Presents a broad range of literatures from diverse Native traditions and eras, to provide students with a basic knowledge of major issues affecting and best-known texts by American Indian women authors.",
            "id": "AMERIND/ENGL 246",
            "title": "LITERATURE BY AMERICAN INDIAN WOMEN"
        }
    },
    {
        "data": {
            "description": "Problems of English segmental and suprasegmental phonology, including morphophonemic alterations and stress assignment.",
            "id": "ENGL 709",
            "parent": "ENGL",
            "title": "ADVANCED ENGLISH PHONOLOGY"
        }
    },
    {
        "data": {
            "description": "Problems of scholarship in the dramatic, performance and staging practices of major traditions of world theatre history between 500 BCE and 1700 including the theatres of ancient Greece and Rome; medieval, Renaissance and early modern Europe; and the Muromachi and Tokugawa eras in Japan.",
            "id": "ENGL/THEATRE 731",
            "title": "ADVANCED THEATRE HISTORY 500 BC TO 1700"
        }
    },
    {
        "data": {
            "description": "Problems of scholarship in the dramatic, performance and staging practices of major traditions of world theatre history since 1700, including melodrama, naturalism, the avant-garde, and other movements that helped shaped contemporary theatre.",
            "id": "ENGL/THEATRE 732",
            "title": "ADVANCED THEATRE HISTORY 1700 TO PRESENT"
        }
    },
    {
        "data": {
            "description": "Professional training in the writing of fiction, poetry, or creative non-fiction. The topic will vary from semester to semester.",
            "id": "ENGL 780",
            "parent": "ENGL",
            "title": "CREATIVE WRITING: GRADUATE WORKSHOP"
        }
    },
    {
        "data": {
            "description": "Provides a foundation for postgraduate theatre and performance research by examining the methods used in the study of theatre and performance. Consider how criticism, theory, historiography and other methods have been employed in analysis of performance. Discuss professional issues around working in theatre and performance studies as a teacher, scholar, dramaturge or applied theatre practitioner.",
            "id": "ENGL 850",
            "parent": "ENGL",
            "title": "PROSEMINAR IN THEATRE RESEARCH"
        }
    },
    {
        "data": {
            "description": "Provides an equivalency for intermediate-level English literature courses taken on a UW-Madison study abroad program.",
            "id": "ENGL 279",
            "parent": "ENGL",
            "title": "TOPICS IN ENGLISH, STUDY ABROAD - LITERATURE"
        }
    },
    {
        "data": {
            "description": "Provides an overview of recent scholarly debates in the study of early modernity. Considers two key challenges involved in the study of early modernity: first, what (and when) constitutes early modernity; second, the study of early modernity is necessarily cross-disciplinary. Beginning with the question of what constitutes the \"early modern,\" approach the topic of early modernity from a variety of disciplinary and thematic lenses. The themes include periodization, early modern legal and state formation, women in early modernity, race and early modernity, religion in early modernity, and global early modernities.",
            "id": "ENGL 720",
            "parent": "ENGL",
            "title": "SEMINAR IN EARLY MODERN STUDIES"
        }
    },
    {
        "data": {
            "description": "Provides practice in persuasive writing in various modes, styles, and genres; develops an understanding of the different contexts of writing, both scholarly and public; provides opportunities for exploring the relation between writing and speaking; and provides critical tools for the rhetorical analysis of expository prose. Not open to auditors",
            "id": "ENGL 201",
            "parent": "ENGL",
            "title": "INTERMEDIATE COMPOSITION"
        }
    },
    {
        "data": {
            "description": "Reading important plays, attending stage productions, writing and thinking critically about theatre and drama. Emphasis on developing analytic skills in dramatic literature and theatre production.",
            "id": "ENGL/THEATRE 120",
            "title": "INTRODUCTION TO THEATRE AND DRAMATIC LITERATURE"
        }
    },
    {
        "data": {
            "description": "Reading strategies for academic work; reading with increased comprehension and speed, vocabulary expansion, and summary writing. Not open to auditors.",
            "id": "ESL 116",
            "parent": "ESL",
            "title": "ACADEMIC READING AND VOCABULARY SKILLS"
        }
    },
    {
        "data": {
            "description": "Relation of culture and genetics to formal properties of human language; consideration of American English dialects and language disorders. Topics include: biological basis of language disorders; racial affiliation and social identity; maintenance of social boundaries; politics of education, speech therapy.",
            "id": "ENGL 319",
            "parent": "ENGL",
            "title": "LANGUAGE, RACE, AND IDENTITY"
        }
    },
    {
        "data": {
            "description": "Rhetorical, linguistic, psychological, and social foundations of writing; implications for instruction.",
            "id": "ENGL 700",
            "parent": "ENGL",
            "title": "INTRODUCTION TO COMPOSITION STUDIES"
        }
    },
    {
        "data": {
            "description": "Selected issues in the history of rhetoric, concentrating on classical theories of invention, and their importance for contemporary issues in composition theory.",
            "id": "COMARTS/ENGL 704",
            "title": "INTELLECTUAL SOURCES OF CONTEMPORARY COMPOSITION THEORY I-CLASSICAL"
        }
    },
    {
        "data": {
            "description": "Selected major critical and theoretical sources, from Aristotle to the present day; the influences of theories upon playwriting and modes of theatrical production.",
            "id": "ENGL/THEATRE 576",
            "title": "SURVEY: THEORIES OF DRAMA"
        }
    },
    {
        "data": {
            "description": "Selected works, with an emphasis on literary and cultural background.",
            "id": "ENGL 805",
            "parent": "ENGL",
            "title": "TOPICS IN EIGHTEENTH-CENTURY LITERATURE"
        }
    },
    {
        "data": {
            "description": "Semi-intensive course in intermediate English language skills. A multi-skills focus on reading, writing, and communication skills essential in an academic setting. Not open to auditors",
            "id": "ESL 114",
            "parent": "ESL",
            "title": "INTERMEDIATE ENGLISH LANGUAGE SKILLS"
        }
    },
    {
        "data": {
            "description": "Since the 19th century, \"America\" has often been defined by its relationship with \"Asia,\" through cultural influence, immigration, imperialism, and war. Traces the role of Asia and Asians in American literature and culture, from the Chinese and Japanese cultural influences that helped shape literary modernism to the rise of a distinctive culture produced by Asian immigrants to America and their descendants.",
            "id": "ASIANAM/ENGL 150",
            "title": "LITERATURE & CULTURE OF ASIAN AMERICA"
        }
    },
    {
        "data": {
            "description": "Social and public uses of English; relationships of English structure, lexicon, and discourse to race, gender, class, education, ethnicity, age, and identity; the role of English in public policy.",
            "id": "ENGL 416",
            "parent": "ENGL",
            "title": "ENGLISH IN SOCIETY"
        }
    },
    {
        "data": {
            "description": "Social, historical, and educational perspectives on literacy and literacy learning.",
            "id": "ENGL 702",
            "parent": "ENGL",
            "title": "PERSPECTIVES ON LITERACY"
        }
    },
    {
        "data": {
            "description": "Specialized subjects relevant to the graduate-level study of the theory, history, criticism and literature of theatre and performance studies.",
            "id": "ENGL 851",
            "parent": "ENGL",
            "title": "ADVANCED STUDIES IN THEATRE AND PERFORMANCE STUDIES RESEARCH"
        }
    },
    {
        "data": {
            "description": "Specialized subjects relevant to the study of the theory, history and criticism of theatre and performance studies.",
            "id": "ENGL 651",
            "parent": "ENGL",
            "title": "SPECIAL TOPICS IN THEATRE AND PERFORMANCE STUDIES RESEARCH"
        }
    },
    {
        "data": {
            "description": "Students write poems, critique the work of fellow students and read contemporary poetry.",
            "id": "ENGL 782",
            "parent": "ENGL",
            "title": "GRADUATE POETRY WORKSHOP"
        }
    },
    {
        "data": {
            "description": "Students write short stories and novel chapters, critique the work of fellow students and read contemporary fiction.",
            "id": "ENGL 781",
            "parent": "ENGL",
            "title": "GRADUATE FICTION WORKSHOP"
        }
    },
    {
        "data": {
            "description": "Study of 18th-Century English novel.",
            "id": "ENGL 336",
            "parent": "ENGL",
            "title": "EIGHTEENTH-CENTURY NOVEL"
        }
    },
    {
        "data": {
            "description": "Study of a figure in American literature.",
            "id": "ENGL 455",
            "parent": "ENGL",
            "title": "A STUDY OF AN OUTSTANDING FIGURE OR FIGURES IN AMERICAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Study of a theme in American literature.",
            "id": "ENGL 817",
            "parent": "ENGL",
            "title": "SEMINAR-AMERICAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Study of a theme in the English language.",
            "id": "ENGL 906",
            "parent": "ENGL",
            "title": "SEMINAR-THE ENGLISH LANGUAGE"
        }
    },
    {
        "data": {
            "description": "Study of a theme or question in literature that crosses national boundaries, inviting students to think about forces of imperialism and globalization. Specific focus will vary.",
            "id": "ENGL 473",
            "parent": "ENGL",
            "title": "TOPIC IN POSTCOLONIAL OR WORLD LITERATURE"
        }
    },
    {
        "data": {
            "description": "Study of a topic in 18th-Century literature.",
            "id": "ENGL 438",
            "parent": "ENGL",
            "title": "TOPIC IN EIGHTEENTH-CENTURY LITERATURE AND CULTURE"
        }
    },
    {
        "data": {
            "description": "Study of a topic in 19th-Century American literature.",
            "id": "ENGL 456",
            "parent": "ENGL",
            "title": "TOPIC IN NINETEENTH-CENTURY AMERICAN LITERATURE AND CULTURE"
        }
    },
    {
        "data": {
            "description": "Study of a topic in 19th-Century American literature.",
            "id": "ENGL 811",
            "parent": "ENGL",
            "title": "TOPICS IN NINETEENTH-CENTURY AMERICAN LITERATURE AND CULTURE"
        }
    },
    {
        "data": {
            "description": "Study of a topic in 19th-Century British literature.",
            "id": "ENGL 444",
            "parent": "ENGL",
            "title": "TOPIC IN ROMANTIC OR VICTORIAN LITERATURE AND CULTURE"
        }
    },
    {
        "data": {
            "description": "Study of a topic in American literature since 1900.",
            "id": "ENGL 812",
            "parent": "ENGL",
            "title": "TOPICS IN AMERICAN LITERATURE SINCE 1900"
        }
    },
    {
        "data": {
            "description": "Study of a topic in American literature.",
            "id": "ENGL 457",
            "parent": "ENGL",
            "title": "TOPIC IN AMERICAN LITERATURE AND CULTURE SINCE 1900"
        }
    },
    {
        "data": {
            "description": "Study of a topic in British literature since 1900.",
            "id": "ENGL 453",
            "parent": "ENGL",
            "title": "TOPIC IN BRITISH LITERATURE AND CULTURE SINCE 1900"
        }
    },
    {
        "data": {
            "description": "Study of a topic in Early American literature.",
            "id": "ENGL 810",
            "parent": "ENGL",
            "title": "TOPICS IN EARLY AMERICAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Study of a topic in Early Modern literature.",
            "id": "ENGL 430",
            "parent": "ENGL",
            "title": "TOPIC IN EARLY MODERN LITERATURE AND CULTURE"
        }
    },
    {
        "data": {
            "description": "Study of a topic in Early modern literature.",
            "id": "ENGL 804",
            "parent": "ENGL",
            "title": "TOPICS IN EARLY MODERN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Study of a topic in English language and linguistics.",
            "id": "ENGL 420",
            "parent": "ENGL",
            "title": "TOPICS IN ENGLISH LANGUAGE AND LINGUISTICS"
        }
    },
    {
        "data": {
            "description": "Study of a topic in English language and literature.",
            "id": "ENGL 795",
            "parent": "ENGL",
            "title": "ONE-CREDIT SEMINAR"
        }
    },
    {
        "data": {
            "description": "Study of a topic in Medieval literature.",
            "id": "ENGL/MEDIEVAL 803",
            "title": "TOPICS IN MEDIEVAL LITERATURE"
        }
    },
    {
        "data": {
            "description": "Study of a topic in Modernism.",
            "id": "ENGL 808",
            "parent": "ENGL",
            "title": "TOPICS IN MODERNISM"
        }
    },
    {
        "data": {
            "description": "Study of a topic in Romanticism.",
            "id": "ENGL 806",
            "parent": "ENGL",
            "title": "TOPICS IN ROMANTICISM"
        }
    },
    {
        "data": {
            "description": "Study of a topic in Victorian literature.",
            "id": "ENGL 807",
            "parent": "ENGL",
            "title": "TOPICS IN VICTORIAN LITERATURE AND CULTURE"
        }
    },
    {
        "data": {
            "description": "Study of a topic in applied English linguistics.",
            "id": "ENGL 905",
            "parent": "ENGL",
            "title": "SEMINAR-TOPICS IN APPLIED ENGLISH LINGUISTICS"
        }
    },
    {
        "data": {
            "description": "Study of a topic in composition studies.",
            "id": "ENGL 900",
            "parent": "ENGL",
            "title": "TOPICS IN COMPOSITION STUDY"
        }
    },
    {
        "data": {
            "description": "Study of a topic in contemporary English linguistics.",
            "id": "ENGL 713",
            "parent": "ENGL",
            "title": "TOPICS IN CONTEMPORARY ENGLISH LINGUISTICS"
        }
    },
    {
        "data": {
            "description": "Study of a topic in contemporary literature.",
            "id": "ENGL 814",
            "parent": "ENGL",
            "title": "TOPICS IN CONTEMPORARY LITERATURE"
        }
    },
    {
        "data": {
            "description": "Study of a topic in digital studies.",
            "id": "ENGL 826",
            "parent": "ENGL",
            "title": "TOPICS IN DIGITAL STUDIES"
        }
    },
    {
        "data": {
            "description": "Study of a topic in ethnic and multicultural literature.",
            "id": "ENGL 816",
            "parent": "ENGL",
            "title": "TOPICS IN ETHNIC AND MULTICULTURAL LITERATURE"
        }
    },
    {
        "data": {
            "description": "Study of a topic in literary theory.",
            "id": "ENGL 822",
            "parent": "ENGL",
            "title": "TOPICS IN LITERARY AND CULTURAL THEORY"
        }
    },
    {
        "data": {
            "description": "Study of a topic in literature and politics.",
            "id": "ENGL 548",
            "parent": "ENGL",
            "title": "TOPIC IN LITERATURE AND POLITICS"
        }
    },
    {
        "data": {
            "description": "Study of a topic in literature and the environment.",
            "id": "ENGL 825",
            "parent": "ENGL",
            "title": "TOPICS IN LITERATURE AND THE ENVIRONMENT"
        }
    },
    {
        "data": {
            "description": "Study of a topic in material cultures.",
            "id": "ENGL 828",
            "parent": "ENGL",
            "title": "TOPICS IN MATERIAL CULTURE"
        }
    },
    {
        "data": {
            "description": "Study of a topic in medieval literature.",
            "id": "ENGL/MEDIEVAL 423",
            "title": "TOPIC IN MEDIEVAL LITERATURE AND CULTURE"
        }
    },
    {
        "data": {
            "description": "Study of a topic in migration diaspora as they relate to literature.",
            "id": "ENGL 829",
            "parent": "ENGL",
            "title": "TOPICS IN MIGRATION AND DIASPORA"
        }
    },
    {
        "data": {
            "description": "Study of a topic in poetry.",
            "id": "ENGL 820",
            "parent": "ENGL",
            "title": "TOPICS IN POETRY"
        }
    },
    {
        "data": {
            "description": "Study of a topic or theme in literature.",
            "id": "ENGL 879",
            "parent": "ENGL",
            "title": "ADVANCED SEMINAR IN LITERARY STUDIES"
        }
    },
    {
        "data": {
            "description": "Study of drama, dramatic theory and theatrical practices in postcolonial cultures, primarily in Asia, Africa and the Caribbean. Considers status of drama/theatre in postcolonial studies and focuses on issues of form, language, intertextuality, trans-culturation, material organization and reception.",
            "id": "ENGL/THEATRE 577",
            "title": "POSTCOLONIAL THEATRE: DRAMA, THEORY AND PERFORMANCE IN THE GLOBAL SOUTH"
        }
    },
    {
        "data": {
            "description": "Study of four Shakespeare plays after 1600 with the reading of several others.",
            "id": "ENGL 432",
            "parent": "ENGL",
            "title": "LATER WORKS OF SHAKESPEARE"
        }
    },
    {
        "data": {
            "description": "Study of four Shakespeare plays through 1600, with the reading of several others.",
            "id": "ENGL 431",
            "parent": "ENGL",
            "title": "EARLY WORKS OF SHAKESPEARE"
        }
    },
    {
        "data": {
            "description": "Study of literature, drama, and film produced by authors of South Asian origin in Europe, North America, and the Caribbean. Course considers theories of diaspora, changing patterns of subcontinental migration, and relation of diasporic forms to the cultures of origin and adoption. Not open to students with credit for LCA 478 prior to Fall 2019.",
            "id": "ASIAN/ENGL 478",
            "title": "INDIAN WRITERS ABROAD: LITERATURE, DIASPORA AND GLOBALIZATION"
        }
    },
    {
        "data": {
            "description": "Study of major American writer(s).",
            "id": "ENGL 458",
            "parent": "ENGL",
            "title": "MAJOR AMERICAN WRITER OR WRITERS"
        }
    },
    {
        "data": {
            "description": "Study of major figure or figures in literature written before 1800.",
            "id": "ENGL 422",
            "parent": "ENGL",
            "title": "OUTSTANDING FIGURE(S) IN LITERATURE BEFORE 1800"
        }
    },
    {
        "data": {
            "description": "Study of outstanding figure(s) in literature.",
            "id": "ENGL 443",
            "parent": "ENGL",
            "title": "OUTSTANDING FIGURE(S) IN LITERATURE SINCE 1800"
        }
    },
    {
        "data": {
            "description": "Study of recent literature written in English. Specific topic will vary.",
            "id": "ENGL 474",
            "parent": "ENGL",
            "title": "TOPIC IN CONTEMPORARY LITERATURE"
        }
    },
    {
        "data": {
            "description": "Study of significant recent poetry written in English.",
            "id": "ENGL 373",
            "parent": "ENGL",
            "title": "CONTEMPORARY POETRY"
        }
    },
    {
        "data": {
            "description": "Study of the drama and theatre of a variety of immigrant communities in three Western locations: Britain, the United States, and Canada. Focuses on current theories of diaspora and transnationalism, the place of theatre in diasporic writing, and the literary, performative, and material dimensions of the genre.",
            "id": "ENGL/THEATRE 477",
            "title": "DIASPORA AND THEATRE"
        }
    },
    {
        "data": {
            "description": "Study of the historical, theoretical and practical approaches to theatre and performance dramaturgy. Read and discuss scholarship about the field, and produce dramaturgical research education, production and outreach tasks through diverse written assignments and practical exercises.",
            "id": "ENGL 654",
            "parent": "ENGL",
            "title": "DRAMATURGY IN THEORY AND PRACTICE"
        }
    },
    {
        "data": {
            "description": "Study of the most famous and influential medieval English poet through his best-known work and its playful and profound responses to some of the most pressing literary, social, political, and spiritual issues of his time. Readings will be in the original Middle English; no prior experience with the language is required.",
            "id": "ENGL/MEDIEVAL 427",
            "title": "CHAUCER'S CANTERBURY TALES"
        }
    },
    {
        "data": {
            "description": "Study of the relationship between composition and critical theories.",
            "id": "ENGL 722",
            "parent": "ENGL",
            "title": "COMPOSITION AND CRITICAL THEORIES"
        }
    },
    {
        "data": {
            "description": "Study of the works of James Joyce.",
            "id": "ENGL 454",
            "parent": "ENGL",
            "title": "JAMES JOYCE"
        }
    },
    {
        "data": {
            "description": "Supervised practice in the use of current techniques and materials in the teaching of English to speakers of other languages, including peer and community teaching with videotaped sessions.",
            "id": "ENGL 515",
            "parent": "ENGL",
            "title": "TECHNIQUES AND MATERIALS FOR TESOL"
        }
    },
    {
        "data": {
            "description": "Survey of Asian American literature from 1880 to present.",
            "id": "ASIANAM/ENGL 270",
            "title": "A SURVEY OF ASIAN AMERICAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Survey of modern and contemporary American literature including fiction, poetry, drama, and criticism.",
            "id": "ENGL 361",
            "parent": "ENGL",
            "title": "MODERN AND CONTEMPORARY AMERICAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Survey of the genre of comedy from antiquity to the present.",
            "id": "ENGL 475",
            "parent": "ENGL",
            "title": "COMEDY AS GENRE"
        }
    },
    {
        "data": {
            "description": "Survey of twentieth-century British literature including fiction, poetry, and drama.",
            "id": "ENGL 353",
            "parent": "ENGL",
            "title": "BRITISH LITERATURE SINCE 1900"
        }
    },
    {
        "data": {
            "description": "Surveys the study of writing and rhetoric, and covers major theories, practices, and research areas in the field of Rhetoric and Composition, with attention to their importance both inside and outside the University.",
            "id": "ENGL 304",
            "parent": "ENGL",
            "title": "HISTORY AND THEORY OF RHETORIC AND WRITING STUDIES"
        }
    },
    {
        "data": {
            "description": "Syntactic theory as applied to the analysis of English sentences.",
            "id": "ENGL 514",
            "parent": "ENGL",
            "title": "ENGLISH SYNTAX"
        }
    },
    {
        "data": {
            "description": "Systematic study of how people learn ESL and other second languages. An interdisciplinary survey emphasizing research in linguistics, psychology, education, and sociology into the phenomenon of second language acquisition.",
            "id": "ENGL 318",
            "parent": "ENGL",
            "title": "SECOND LANGUAGE ACQUISITION"
        }
    },
    {
        "data": {
            "description": "Teaching of English to speakers of other languages. Exploration of the contexts in which English is taught, and methods and materials used to teach it.",
            "id": "ENGL 415",
            "parent": "ENGL",
            "title": "INTRODUCTION TO TESOL METHODS"
        }
    },
    {
        "data": {
            "description": "The construction of Jewish American identity within American life.",
            "id": "ENGL/JEWISH 593",
            "title": "LITERATURE OF JEWISH IDENTITY IN AMERICA"
        }
    },
    {
        "data": {
            "description": "The depiction and valuation of other academic disciplines and intellectual work in selected works of British and American literature and the intellectual influences of other disciplines on selected works and movements of British and American literature.",
            "id": "ENGL 175",
            "parent": "ENGL",
            "title": "LITERATURE AND THE OTHER DISCIPLINES"
        }
    },
    {
        "data": {
            "description": "The development of realistic and post realistic forms in modern and postmodern drama, from Zola, Ibsen, Strindberg and Chekhov through futurism, expressionism, Dada, surrealism, epic theatre, there of the absurd, and contemporary theatre and performance avant-garde works.",
            "id": "ENGL 656",
            "parent": "ENGL",
            "title": "THEATRE OF THE AVANT-GARDE, 1850-1950"
        }
    },
    {
        "data": {
            "description": "The elements of Old English grammar with selected readings.",
            "id": "ENGL/MEDIEVAL 520",
            "title": "OLD ENGLISH"
        }
    },
    {
        "data": {
            "description": "The major novels of Vladimir Nabokov studied in the context of Russian and American literatures. Nabokov as a quintessential artist in exile, whose work explores loss of language, country and home.",
            "id": "ENGL/LITTRANS 223",
            "title": "VLADIMIR NABOKOV: RUSSIAN AND AMERICAN WRITINGS"
        }
    },
    {
        "data": {
            "description": "The study spoken English as a site for social organization. Theoretical foundations and methodological practices for conversation analysis will be explored using videotaped data from English. Content includes current critical trends in analyzing interaction as well as cross-cultural and cross-linguistic perspectives.",
            "id": "ENGL/SOC 710",
            "title": "INTERACTION ANALYSIS: TALK AS SOCIAL ORGANIZATION"
        }
    },
    {
        "data": {
            "description": "Theory and practice of using applied theatre in educational settings to engage audiences (usually students) in important social or cultural issues. Includes readings, research, discussion and the devising, production and performance of a play by the students in the course for community audiences.",
            "id": "ENGL 653",
            "parent": "ENGL",
            "title": "APPLIED THEATRE"
        }
    },
    {
        "data": {
            "description": "Thesis hours for MFA creative writing students. Students work to complete a book of short stories, poems or a novel.",
            "id": "ENGL 785",
            "parent": "ENGL",
            "title": "MFA THESIS"
        }
    },
    {
        "data": {
            "description": "Throughout the history of Asian America, poetry has been a vehicle for the creation and exploration of an Asian American voice; in poetry we can see the continuing struggle over what form Asian American expression will take. Will it follow Asian or European models? Will it employ traditional forms, or experiment in search of new styles? Will it be individual or collective, introspective or political? We will explore these questions through a study of a wide range of Asian American poets from a variety of historical periods and ethnicities, including Janice Mirikitani, Lawson Fusao Inada, Li-Young Lee, John Yau, Myung Mi Kim, and Linh Dinh.",
            "id": "ASIANAM/ENGL 465",
            "title": "ASIAN AMERICAN POETRY"
        }
    },
    {
        "data": {
            "description": "Topics related to advanced research in theatre and performance studies. Topics vary by semester.",
            "id": "ENGL 859",
            "parent": "ENGL",
            "title": "SEMINAR-INTERDISCIPLINARY THEATRE STUDIES"
        }
    },
    {
        "data": {
            "description": "Variable topics including: the informal essay, the long poem, the novel, the novella, genre fiction (detective, juvenile, humor, science fiction, etc.), experimental prose and poetry, etc. Students will read models and write their own exercise and full-length pieces.",
            "id": "ENGL 411",
            "parent": "ENGL",
            "title": "CREATIVE WRITING: SPECIAL TOPICS WORKSHOP"
        }
    },
    {
        "data": {
            "description": "Variety and complexity of twentieth century critical thought. Intensive investigation of the works of selected theorists.",
            "id": "ENGL 561",
            "parent": "ENGL",
            "title": "MODERN CRITICAL THEORIES"
        }
    },
    {
        "data": {
            "description": "What is a person, a home, a nation, a world? What we now call \"English literature\" begins with these questions, imagining a cosmos filled with gods and heroes, liars and thieves, angels and demons, dragons and dungeons, whores and witches, drunken stupor and religious ecstasy. Authors crafted answers to these questions using technologies of writing from parchment to the printing press, and genres old and new, from epic and romance to drama and the sonnet. Develops skills of critical reading and writing that are essential to majors and non-majors alike.",
            "id": "ENGL 241",
            "parent": "ENGL",
            "title": "LITERATURE AND CULTURE I: TO THE 18TH CENTURY"
        }
    },
    {
        "data": {
            "description": "What is humor? Why and when do people tell jokes? And what do we make of the fact that a certain form of humor has come to be labeled \"Jewish\"? Examine the notion of \"Jewish humor\" by reading a variety of texts (jokes, short stories, films, websites, conceptual art, and cultural kitsch). Begin by considering theoretical explorations of humor and \"Jewish humor.\" Then trace techniques of Jewish humor from eastern Europe to central Europe to North America, paying specific attention to Jewish American humor. Themes to be examined include: in-group vs. out-group humor; humor and ethnicity; performance and \"Jewface\"; Jewish-Christian difference; humor and the Holocaust; gender and ethnicity; the notion of self-hatred; American popular culture; and the relationship between humor, repetition, and innovation. The general goal is to answer the question: Is there such a thing as \"Jewish humor\"? (Hint: The answer may be \"no.\")",
            "id": "ENGL/JEWISH 370",
            "title": "JEWISH HUMOR"
        }
    },
    {
        "data": {
            "description": "Words and rules of combination (grammar) are the two basic building blocks of language. Looks at English words from different linguistic perspectives: As objects of grammar, words follow certain rules of combination (you wouldn't say \"these dog ), but they also have internal structure. For example, a word like \"hopefulness is fine, while \"hopenessful\" does not exist. From a psycholinguistic perspective examine how children learn these formal properties as well as the meaning of words. Study how words are stored in the mind and what one can learn from situations in which one cannot access the mental dictionary properly (for example, when one feels a word is on \"the tip of one's tongue ). From a sociolinguistic perspective,  look at historical and current influences on English vocabulary, including the role of dictionaries and spelling as a source of standardization. Does not require previous knowledge of linguistics.",
            "id": "ENGL 413",
            "parent": "ENGL",
            "title": "ENGLISH WORDS: GRAMMAR, CULTURE, MIND"
        }
    },
    {
        "data": {
            "description": "Works by British and American writers, with emphasis on women writers of the twentieth century; close reading of texts and discussion of trends, themes, and special characteristics of the role of women in literature.",
            "id": "ENGL/GEN&WS 250",
            "title": "WOMEN IN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Writing literary fiction.",
            "id": "ENGL 408",
            "parent": "ENGL",
            "title": "CREATIVE WRITING: FICTION WORKSHOP"
        }
    },
    {
        "data": {
            "description": "Writing literary poetry.",
            "id": "ENGL 409",
            "parent": "ENGL",
            "title": "CREATIVE WRITING: POETRY WORKSHOP"
        }
    },
    {
        "data": {
            "description": "Writing of literary fiction and poetry, reading  selected contemporary writers as models.",
            "id": "ENGL 307",
            "parent": "ENGL",
            "title": "CREATIVE WRITING: FICTION AND POETRY WORKSHOP"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ENGL",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ESL",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "GEN&WS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ENGL 207",
            "target": "ENGL 307"
        }
    },
    {
        "data": {
            "source": "ENGL 314",
            "target": "ENGL 514"
        }
    },
    {
        "data": {
            "source": "ENGL 314",
            "target": "ENGL 516"
        }
    },
    {
        "data": {
            "source": "ENGL 315",
            "target": "ENGL 709"
        }
    },
    {
        "data": {
            "source": "ENGL 318",
            "target": "ENGL 715"
        }
    },
    {
        "data": {
            "source": "ENGL 407",
            "target": "ENGL 410"
        }
    },
    {
        "data": {
            "source": "ENGL 407",
            "target": "ENGL 411"
        }
    },
    {
        "data": {
            "source": "ENGL 408",
            "target": "ENGL 307"
        }
    },
    {
        "data": {
            "source": "ENGL 408",
            "target": "ENGL 407"
        }
    },
    {
        "data": {
            "source": "ENGL 408",
            "target": "ENGL 409"
        }
    },
    {
        "data": {
            "source": "ENGL 408",
            "target": "ENGL 508"
        }
    },
    {
        "data": {
            "source": "ENGL 409",
            "target": "ENGL 408"
        }
    },
    {
        "data": {
            "source": "ENGL 409",
            "target": "ENGL 509"
        }
    },
    {
        "data": {
            "source": "ENGL 409",
            "target": "ENGL 695"
        }
    },
    {
        "data": {
            "source": "ENGL 411",
            "target": "ENGL 407"
        }
    },
    {
        "data": {
            "source": "ENGL 415",
            "target": "ENGL 515"
        }
    },
    {
        "data": {
            "source": "ENGL 415",
            "target": "ENGL 613"
        }
    },
    {
        "data": {
            "source": "ENGL 415",
            "target": "ENGL 614"
        }
    },
    {
        "data": {
            "source": "ENGL 415",
            "target": "ENGL 615"
        }
    },
    {
        "data": {
            "source": "ENGL 415",
            "target": "ENGL 616"
        }
    },
    {
        "data": {
            "source": "ENGL 415",
            "target": "ENGL 617"
        }
    },
    {
        "data": {
            "source": "ENGL 415",
            "target": "ENGL 618"
        }
    },
    {
        "data": {
            "source": "ENGL 508",
            "target": "ENGL 408"
        }
    },
    {
        "data": {
            "source": "ENGL 509",
            "target": "ENGL 409"
        }
    },
    {
        "data": {
            "source": "ENGL 509",
            "target": "ENGL 410"
        }
    },
    {
        "data": {
            "source": "ENGL 514",
            "target": "ENGL 708"
        }
    },
    {
        "data": {
            "source": "ENGL/MEDIEVAL 520",
            "target": "ENGL/MEDIEVAL 521"
        }
    },
    {
        "data": {
            "source": "ESL 114",
            "target": "ESL 115"
        }
    },
    {
        "data": {
            "source": "ESL 115",
            "target": "ESL 116"
        }
    },
    {
        "data": {
            "source": "ESL 116",
            "target": "ESL 117"
        }
    },
    {
        "data": {
            "source": "ESL 117",
            "target": "ESL 118"
        }
    },
    {
        "data": {
            "source": "ESL 118",
            "target": "ENGL 100"
        }
    },
    {
        "data": {
            "source": "GEN&WS 101",
            "target": "ENGL/GEN&WS 350"
        }
    }
]