[
    {
        "data": {
            "description": "An introduction to the multiple determinants of health, global disease burden and disparities, foundational global health principles, and the overlap between ecosystem stability, planetary boundaries, and human health. Explore the core fundamentals of global health scholarship, including but not limited to infectious disease, sanitation, and mental health, and also consider ecological perspectives on these issues through the lens of planetary boundaries. Attention is placed on how human-mediated global change (e.g. climate change, biodiversity loss, land-use patterns, geochemical cycling, agricultural practice) impacts human health and the ecosystem services we depend on.  An overview of pertinent issues in sustainability science and planetary health discourse, including the 'Anthropocene' and resilience to understand and critically assess global trends.",
            "id": "ENTOM/ENVIRST 205",
            "title": "OUR PLANET, OUR HEALTH"
        }
    },
    {
        "data": {
            "description": "Introduction to how the Earth system works and what makes Earth livable. Gain appreciation for how the atmosphere, oceans, life, and earth's surface interact to shape our local, regional and global landscapes.",
            "id": "ENVIRST/GEOG 120",
            "title": "INTRODUCTION TO THE EARTH SYSTEM"
        }
    },
    {
        "data": {
            "description": "",
            "id": "ENTOM 701",
            "parent": "ENTOM",
            "title": "ADVANCED TAXONOMY"
        }
    },
    {
        "data": {
            "description": "A systems approach to examination of the multiple determinants of health and well-being.  Case studies and group projects explore complex issues including, but not limited to, the root causes of infectious and noncommunicable disease, health inequities in the context of global change, and trade-offs in addressing global and planetary health problems, particularly where information is incomplete, projections about future states are uncertain, or social equity concerns must be taken into account as scientific knowledge is applied.  Group projects emphasize systems thinking to critically assess global issues. Teamwork and communication skills are required for case study analysis and project management.",
            "id": "ENTOM 570",
            "parent": "ENTOM",
            "title": "SYSTEMS THINKING IN GLOBAL HEALTH"
        }
    },
    {
        "data": {
            "description": "Agroecology has blossomed across the world in recent decades as not only a science, but also a practice, and a movement. Employ the multiple disciplines and perspectives that Agroecology affords to analyze our agricultural and food systems wihin a broader context of dynamic social and ecological relationships.",
            "id": "AGROECOL/AGRONOMY/C&ESOC/ENTOM/ENVIRST 103",
            "title": "AGROECOLOGY: AN INTRODUCTION TO THE ECOLOGY OF FOOD AND AGRICULTURE"
        }
    },
    {
        "data": {
            "description": "An internship under guidance of a faculty or instructional academic staff member in Entomology and internship site supervisor. Students are responsible for arranging the work and credits with the faculty or instructional academic staff member and the internship site supervisor.",
            "id": "ENTOM 399",
            "parent": "ENTOM",
            "title": "COORDINATIVE INTERNSHIP/COOPERATIVE EDUCATION"
        }
    },
    {
        "data": {
            "description": "An introduction to natural environmental systems, emphasizing the interconnections between the systems of the solid earth (minerals, rocks, soils), the hydrosphere (water in all its forms), the biosphere, and the atmosphere. Emphasizes connections between basic concepts and specific environmental issues through hands-on case studies, lab projects, and field trips to collect samples and observations for lab projects.",
            "id": "ENVIRST/GEOG 127",
            "title": "PHYSICAL SYSTEMS OF THE ENVIRONMENT"
        }
    },
    {
        "data": {
            "description": "Anatomy, histology and basic physiology of organ systems in insects.",
            "id": "ENTOM 321",
            "parent": "ENTOM",
            "title": "PHYSIOLOGY OF INSECTS"
        }
    },
    {
        "data": {
            "description": "Basic biology of microorganisms, including structure, function, physiology, genetics, ecology, diversity, and evolution.",
            "id": "MICROBIO 303",
            "parent": "MICROBIO",
            "title": "BIOLOGY OF MICROORGANISMS"
        }
    },
    {
        "data": {
            "description": "Basic principles of ecology and interrelations between individuals, populations, communities, ecosystems and their environment; transmission genetics and introduction to population genetics; origin of life, evolutionary mechanisms, ancestral relationships among species, and the diversity of life.",
            "id": "BIOCORE 381",
            "parent": "BIOCORE",
            "title": "EVOLUTION, ECOLOGY, AND GENETICS"
        }
    },
    {
        "data": {
            "description": "Basic principles of molecular ecology. Lecture topics include population genetics, molecular phylogenetics, rates and patterns of evolution, genome evolution, and molecular ecology.",
            "id": "ENTOM/GENETICS/ZOOLOGY 624",
            "title": "MOLECULAR ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Cellular and molecular basis of life. The main themes are the structure and function of cells and organelles, the flow of energy in cells, and the storage, expression, and regulation of genetic information.",
            "id": "BIOCORE 383",
            "parent": "BIOCORE",
            "title": "CELLULAR BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Concentration on structural, behavioral adaptations of insects to diverse habitats; dynamic relations between insects and plants, other animals and other insects.",
            "id": "ENTOM 468",
            "parent": "ENTOM",
            "title": "STUDIES IN FIELD ENTOMOLOGY"
        }
    },
    {
        "data": {
            "description": "Covers anatomy/morphology, taxonomy, and bionomics of immature insects (ordinal and familial levels). Identification of insects (order and family) using taxonomic keys.",
            "id": "ENTOM 432",
            "parent": "ENTOM",
            "title": "TAXONOMY AND BIONOMICS OF IMMATURE INSECTS"
        }
    },
    {
        "data": {
            "description": "Covers population and community ecology, plant-insect interactions, insect biodiversity and biogeography, and applied ecology. Weaves basic ecological theory and principles with their application to entomological problems such as conservation, biological control, agriculture, and insect-vectored diseases of plants and humans. Uses current entomological and ecological scientific literature and draws on examples from a broad range of natural and managed ecosystems. Broadens from pairwise species interactions (e.g., a predator and its prey) to the entire community of organisms and their physical environment. Emphasizes the theoretical principles and historical background underlying the various topics with a link to potential applications in agriculture, conservation, pest management, and/or invasion biology.",
            "id": "ENTOM 450",
            "parent": "ENTOM",
            "title": "BASIC AND APPLIED INSECT ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Current topics in molecular and environmental toxicology and problems related to biologically active substances in the environment. Topics vary each semester. Lectures are by resident and visiting professors and other researchers.",
            "id": "ENTOM/F&WECOL/PLPATH/SOILSCI 606",
            "title": "COLLOQUIUM IN ENVIRONMENTAL TOXICOLOGY"
        }
    },
    {
        "data": {
            "description": "Descriptive statistics, distributions, one- and two-sample normal inference, power, one-way ANOVA, simple linear regression, categorical data, non-parametric methods; underlying assumptions and diagnostic work.",
            "id": "F&WECOL/STAT 571",
            "title": "STATISTICAL METHODS FOR BIOSCIENCE I"
        }
    },
    {
        "data": {
            "description": "Ecology of individual organisms, populations, communities, ecosystems, landscapes, and the biosphere. The interaction of organisms with each other and their physical environment. These relationships are studied, often in quantitative terms, in both field and laboratory settings.",
            "id": "BOTANY/F&WECOL/ZOOLOGY 460",
            "title": "GENERAL ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Examines common methods of multivariate data analysis in ecology and environmental science. Covers methods for the analysis of complex, multidimensional datasets that are collected in the study of plant, invertebrate, fish, and bird communities. Addresses the concurrent analysis of the environmental factors that may drive community distributions. Provides the basis for predictive modeling of distributions across landscapes. General methods covered include ordination (PCA, DCA, NMDS, CCA), clustering (or classification), and other comparative analyses of data matrices (ANOSIM, Mantel tests).  Includes an applied, \"hands-on\" approach on how to use these tools, and the circumstances under which their uses are either appropriate or inappropriate.",
            "id": "ENTOM/F&WECOL 711",
            "title": "MULTIVARIATE ANALYSIS OF ECOLOGICAL AND COMMUNITY DATA"
        }
    },
    {
        "data": {
            "description": "Explore some of the most important themes and debates that have permeated evolutionary biology over the last 50 years. Read key papers related to each controversial topic, debate the pros and cons of competing viewpoints, and reflect on the relevance of the issue to contemporary evolutionary biology.",
            "id": "BOTANY/ENTOM/GENETICS/ZOOLOGY 820",
            "title": "FOUNDATIONS OF EVOLUTION"
        }
    },
    {
        "data": {
            "description": "Explore the biological and molecular adaptations of parasitic arthropods that allow them to feed on vertebrate host and facilitate the transmission of vector-borne pathogens. Examines how anthropogenic activities, behaviors, and effects on climate affect the biology of vectors, the pathogens they transmit, and the emergence of vector-borne epidemics in the world. Emphasis on the molecular and physiological interaction between pathogens, their vector, and the vertebrate host and the fundamentals on how vectors and vector-borne pathogens cause disease in humans. Evaluate real control programs deployed globally for the control of vector-borne diseases.",
            "id": "ENTOM/ZOOLOGY 371",
            "title": "MEDICAL ENTOMOLOGY: BIOLOGY OF VECTOR AND VECTOR-BORNE DISEASES"
        }
    },
    {
        "data": {
            "description": "Explores the global and local nature of environmental problems, including issues of climate change, food, energy, globalization, deforestation, biodiversity loss, resource access, environmental justice, and population. Considers how we should analyze and act on environmental problems as we confront the apparently daunting scale of such issues. What appear to be single global environmental issues are actually composed of many smaller, context-specific, and place-dependent problems or conflicts. Through an interdisciplinary and geographic perspective, these issues can be understood and addressed at the scale of our lived lives.",
            "id": "ENVIRST/GEOG 139",
            "title": "GLOBAL ENVIRONMENTAL ISSUES"
        }
    },
    {
        "data": {
            "description": "Explores the impact of global environmental change on biodiversity and the subsequent consequences for ecosystem function and human well-being. Examines species response to these environmental changes, such as migration, adaptation, and extinction, and the implications for the delivery of ecosystem services and planetary health. Applies ecological principles to identify and evaluate practical solutions to pressing environmental challenges.",
            "id": "ENTOM 490",
            "parent": "ENTOM",
            "title": "BIODIVERSITY AND GLOBAL CHANGE"
        }
    },
    {
        "data": {
            "description": "Foundational ideas in the field of ecology. Discussion topics trace the development of ecology as a discipline, and the roots of modern ecological thought, as well as the research approaches in ecology.",
            "id": "BOTANY/ENTOM/F&WECOL/ZOOLOGY 821",
            "title": "FOUNDATIONS OF ECOLOGY"
        }
    },
    {
        "data": {
            "description": "General biological principles. Topics include: evolution, ecology, animal behavior, cell structure and function, genetics and molecular genetics and the physiology of a variety of organ systems emphasizing function in humans.",
            "id": "BIOLOGY/ZOOLOGY 101",
            "title": "ANIMAL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "General concepts of animal biology at an introductory level emphasizing the evolutionary relationships between animals. Learn about general body plans and strategies used to accomplish the basic tasks of staying alive in major animal groups using preserved and live animals. Study the diversity within each group of animals by integrating the body plans with the lifestyle and ecology of animals. Dissections of earthworm, freshwater mussel, squid, sea star, and rat aid the study of these general principles.",
            "id": "BIOLOGY/ZOOLOGY 102",
            "title": "ANIMAL BIOLOGY LABORATORY"
        }
    },
    {
        "data": {
            "description": "Genetic analysis, population genetics, evolution and quantitative genetics. Includes mutant screens, pathway analysis, mosaic analysis, reverse genetics, genomics, Hardy-Weinberg  linkage equilibrium, inbreeding, genetic drift, natural selection, population structure, inheritance of complex traits, domestication and human evolution.",
            "id": "GENETICS 468",
            "parent": "GENETICS",
            "title": "GENERAL GENETICS 2"
        }
    },
    {
        "data": {
            "description": "Genetics in eukaryotes and prokaryotes.  Includes transmission genetics, molecular genetics, evolutionary genetics, genetic engineering, and societal issues associated with genetics.  Illustrative material includes bacteria, plants, insects, and vertebrates.",
            "id": "GENETICS 466",
            "parent": "GENETICS",
            "title": "PRINCIPLES OF GENETICS"
        }
    },
    {
        "data": {
            "description": "Genetics of eukaryotes and prokaryotes. Includes transmission genetics, probability and hypothesis testing, genetic mapping, molecular genetics, gene expression, and genetic engineering. Illustrative material includes viruses, bacteria, plants, fungi, insects, and humans.",
            "id": "GENETICS 467",
            "parent": "GENETICS",
            "title": "GENERAL GENETICS 1"
        }
    },
    {
        "data": {
            "description": "Importance of insects in the environment, emphasizing beneficial insects, disease carriers, and agricultural pests that interfere with the food supply. Environmental problems due to insect control agents.",
            "id": "ENTOM/ENVIRST 201",
            "title": "INSECTS AND HUMAN CULTURE-A SURVEY COURSE IN ENTOMOLOGY"
        }
    },
    {
        "data": {
            "description": "Independent laboratory research in preparation of a graduate thesis under supervision of a faculty member.",
            "id": "ENTOM 990",
            "parent": "ENTOM",
            "title": "GRADUATE RESEARCH AND THESIS"
        }
    },
    {
        "data": {
            "description": "Individual advanced work in an area of Entomology under the direct guidance of a faculty member.",
            "id": "ENTOM 699",
            "parent": "ENTOM",
            "title": "SPECIAL PROBLEMS"
        }
    },
    {
        "data": {
            "description": "Individual study for undergraduate students completing a thesis in the area of Entomology, as arranged with a faculty member.",
            "id": "ENTOM 691",
            "parent": "ENTOM",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Individual study for undergraduate students completing a thesis in the area of Entomology, as arranged with a faculty member.",
            "id": "ENTOM 692",
            "parent": "ENTOM",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Individual study for undergraduate students in an Honors program completing a thesis in the area of Entomology, as arranged with a faculty member.",
            "id": "ENTOM 681",
            "parent": "ENTOM",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Instructional orientation to teaching at the higher education level in the agricultural life sciences, direct teaching experience under faculty supervision, experience in testing and evaluation of students, and the analysis of teaching performance.",
            "id": "ENTOM 799",
            "parent": "ENTOM",
            "title": "PRACTICUM IN ENTOMOLOGY TEACHING"
        }
    },
    {
        "data": {
            "description": "Introduces new graduate students to the diversity of ecologists across the UW-Madison campus. Includes discussions of key topics in professional development, research presentations by faculty members, and discussions of assigned papers with senior graduate students.",
            "id": "AGRONOMY/ATMOCN/BOTANY/ENTOM/ENVIRST/F&WECOL/GEOG/ZOOLOGY 953",
            "title": "INTRODUCTION TO ECOLOGY RESEARCH AT UW-MADISON"
        }
    },
    {
        "data": {
            "description": "Introduces students to global health concepts through multidisciplinary speakers dedicated to improving health through their unique training.  It targets students with an interest in public health and those who wish to learn how their field impacts their global issues.",
            "id": "ENTOM/NUTRSCI 203",
            "title": "INTRODUCTION TO GLOBAL HEALTH"
        }
    },
    {
        "data": {
            "description": "Introduction to the basic principles and concepts of the biology of plants. an integrative approach stressing evolutionary sequences and the relationship between structure and function at succeeding levels of organization: molecule, cell, organism, population, community. Correlated lectures, laboratories, and discussions.",
            "id": "BIOLOGY/BOTANY 130",
            "title": "GENERAL BOTANY"
        }
    },
    {
        "data": {
            "description": "Introduction to theoretical ecology, including hands-on experience in computer modeling.",
            "id": "ENTOM/ZOOLOGY 540",
            "title": "THEORETICAL ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Major economic insects: identification, life histories, bionomics, distribution, control; procedures in fundamental and practical inquiry.",
            "id": "ENTOM 351",
            "parent": "ENTOM",
            "title": "PRINCIPLES OF ECONOMIC ENTOMOLOGY"
        }
    },
    {
        "data": {
            "description": "Molecular and ecological aspects of the interactions between plants and microorganisms. Explores many of the themes, from genetic to integrative, of modern biology, and illustrates how study of plant-microbe interactions contributes to understanding of fundamental plant science.",
            "id": "BOTANY/ENTOM/PLPATH 505",
            "title": "PLANT-MICROBE INTERACTIONS: MOLECULAR AND ECOLOGICAL ASPECTS"
        }
    },
    {
        "data": {
            "description": "Multiple ways in which arthropods exploit plants, plant traits that deter or augment insects, environmental mediation of these interactions, effects on population dynamics, community ecology and co-evolution, and implications to natural resource management, environmental quality, and sustainable development.",
            "id": "BOTANY/ENTOM/ZOOLOGY 473",
            "title": "PLANT-INSECT INTERACTIONS"
        }
    },
    {
        "data": {
            "description": "Presentations from the original literature on developments in natural products chemistry, biochemistry, physiology, developmental biology and/or ultrastructure of insects.",
            "id": "ENTOM 901",
            "parent": "ENTOM",
            "title": "SEMINAR IN ORGANISMAL ENTOMOLOGY"
        }
    },
    {
        "data": {
            "description": "Principles including morphology and classification.",
            "id": "ENTOM/ZOOLOGY 302",
            "title": "INTRODUCTION TO ENTOMOLOGY"
        }
    },
    {
        "data": {
            "description": "Principles of taxonomy, identification and taxonomic morphology of adult insects.",
            "id": "ENTOM 331",
            "parent": "ENTOM",
            "title": "TAXONOMY OF MATURE INSECTS"
        }
    },
    {
        "data": {
            "description": "Provides an area equivalency for courses taken on Madison Study Abroad Programs that do not equate to existing UW courses. Current enrollment in a UW-Madison study abroad program",
            "id": "ENTOM 400",
            "parent": "ENTOM",
            "title": "STUDY ABROAD IN ENTOMOLOGY"
        }
    },
    {
        "data": {
            "description": "Provides exposure to current research in Entomology. Weekly speakers represent diverse career backgrounds.",
            "id": "ENTOM 801",
            "parent": "ENTOM",
            "title": "COLLOQUIUM"
        }
    },
    {
        "data": {
            "description": "Research work for Honors students under direct guidance of a faculty member in an area of Entomology.  Students are responsible for arranging the work and credits with the supervising instructor.",
            "id": "ENTOM 289",
            "parent": "ENTOM",
            "title": "HONORS INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Research work for students under direct guidance of a faculty member in an area of Entomology.  Students are responsible for arranging the work and credits with the supervising instructor.",
            "id": "ENTOM 299",
            "parent": "ENTOM",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Second semester of individual study for undergraduate students in an Honors program completing a thesis in the area of Entomology, as arranged with a faculty member.ENTOM 681",
            "id": "ENTOM 682",
            "parent": "ENTOM",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Specialized subject matter of current interest to graduate students.",
            "id": "ENTOM 875",
            "parent": "ENTOM",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "Specialized subject matter of current interest to undergraduate students.",
            "id": "ENTOM 375",
            "parent": "ENTOM",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "The biology of water-borne, food-borne, soil-borne and vector-borne parasites of animals including humans. Parasites are explored in the context of transmission, associated disease, diagnosis and treatment options, and environmental, cultural and socioeconomic drivers of disease epidemiology.",
            "id": "ENTOM/MM&I/PATH-BIO/ZOOLOGY 350",
            "title": "PARASITOLOGY"
        }
    },
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics and selected topics in Animal Physiology.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics, and selected topics in Animal Physiology. Designed for engineering majors that do not need a lab component.",
            "id": "ZOOLOGY 153",
            "parent": "ZOOLOGY",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Topics include: selected topics in plant physiology, a survey of the five major kingdoms of organisms, speciation and evolutionary theory, and ecology at multiple levels of the biological hierarchy.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "id": "BIOCORE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ENTOM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "GENETICS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MICROBIO",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ZOOLOGY",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "BIOCORE 383"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "BOTANY/F&WECOL/ZOOLOGY 460"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "ENTOM 351"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "ENTOM 450"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "GENETICS 466"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "GENETICS 467"
        }
    },
    {
        "data": {
            "source": "BIOCORE 383",
            "target": "MICROBIO 303"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "BOTANY/F&WECOL/ZOOLOGY 460"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "ENTOM/F&WECOL/PLPATH/SOILSCI 606"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "MICROBIO 303"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 152"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 101"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "ENTOM/F&WECOL/PLPATH/SOILSCI 606"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "GENETICS 467"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "MICROBIO 303"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "target": "BIOLOGY/ZOOLOGY 102"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "target": "BOTANY/F&WECOL/ZOOLOGY 460"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "target": "ENTOM 450"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 151"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ENTOM 351"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ENTOM/MM&I/PATH-BIO/ZOOLOGY 350"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ENTOM/ZOOLOGY 302"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ENTOM/ZOOLOGY 371"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ZOOLOGY 153"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 102",
            "target": "BOTANY/F&WECOL/ZOOLOGY 460"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 102",
            "target": "ENTOM/MM&I/PATH-BIO/ZOOLOGY 350"
        }
    },
    {
        "data": {
            "source": "BOTANY/ENTOM/PLPATH 505",
            "target": "BOTANY/ENTOM/ZOOLOGY 473"
        }
    },
    {
        "data": {
            "source": "BOTANY/F&WECOL/ZOOLOGY 460",
            "target": "BOTANY/ENTOM/ZOOLOGY 473"
        }
    },
    {
        "data": {
            "source": "ENTOM/ENVIRST 205",
            "target": "ENTOM 570"
        }
    },
    {
        "data": {
            "source": "ENTOM/ZOOLOGY 302",
            "target": "ENTOM 321"
        }
    },
    {
        "data": {
            "source": "ENTOM/ZOOLOGY 302",
            "target": "ENTOM 331"
        }
    },
    {
        "data": {
            "source": "ENTOM/ZOOLOGY 302",
            "target": "ENTOM 432"
        }
    },
    {
        "data": {
            "source": "ENTOM/ZOOLOGY 302",
            "target": "ENTOM 468"
        }
    },
    {
        "data": {
            "source": "ENVIRST/GEOG 120",
            "target": "ENTOM 490"
        }
    },
    {
        "data": {
            "source": "ENVIRST/GEOG 120",
            "target": "ENVIRST/GEOG 127"
        }
    },
    {
        "data": {
            "source": "ENVIRST/GEOG 127",
            "target": "ENTOM 490"
        }
    },
    {
        "data": {
            "source": "ENVIRST/GEOG 127",
            "target": "ENVIRST/GEOG 120"
        }
    },
    {
        "data": {
            "source": "ENVIRST/GEOG 139",
            "target": "ENTOM 490"
        }
    },
    {
        "data": {
            "source": "F&WECOL/STAT 571",
            "target": "ENTOM/ZOOLOGY 540"
        }
    },
    {
        "data": {
            "source": "GENETICS 466",
            "target": "BOTANY/ENTOM/PLPATH 505"
        }
    },
    {
        "data": {
            "source": "GENETICS 466",
            "target": "ENTOM/GENETICS/ZOOLOGY 624"
        }
    },
    {
        "data": {
            "source": "GENETICS 466",
            "target": "GENETICS 467"
        }
    },
    {
        "data": {
            "source": "GENETICS 467",
            "target": "ENTOM/GENETICS/ZOOLOGY 624"
        }
    },
    {
        "data": {
            "source": "GENETICS 467",
            "target": "GENETICS 466"
        }
    },
    {
        "data": {
            "source": "GENETICS 467",
            "target": "GENETICS 468"
        }
    },
    {
        "data": {
            "source": "GENETICS 468",
            "target": "GENETICS 466"
        }
    },
    {
        "data": {
            "source": "MICROBIO 303",
            "target": "BOTANY/ENTOM/PLPATH 505"
        }
    },
    {
        "data": {
            "source": "ZOOLOGY 153",
            "target": "ENTOM/ZOOLOGY 371"
        }
    }
]