[
    {
        "data": {
            "description": "A preparation and introductory math course for students enrolled in the Summer Collegiate Experience program. Includes material from precalculus and calculus and related topics depending on students' results on the math placement exam.",
            "id": "MATH 118",
            "parent": "MATH",
            "title": "SUMMER COLLEGIATE EXPERIENCE MATHEMATICS COURSE"
        }
    },
    {
        "data": {
            "description": "An introduction to literature in English about the natural world and humankind's relationship with it; specific topics will vary.",
            "id": "ENGL/ENVIRST 153",
            "title": "LITERATURE AND THE ENVIRONMENT"
        }
    },
    {
        "data": {
            "description": "An introduction to the multiple determinants of health, global disease burden and disparities, foundational global health principles, and the overlap between ecosystem stability, planetary boundaries, and human health. Explore the core fundamentals of global health scholarship, including but not limited to infectious disease, sanitation, and mental health, and also consider ecological perspectives on these issues through the lens of planetary boundaries. Attention is placed on how human-mediated global change (e.g. climate change, biodiversity loss, land-use patterns, geochemical cycling, agricultural practice) impacts human health and the ecosystem services we depend on.  An overview of pertinent issues in sustainability science and planetary health discourse, including the 'Anthropocene' and resilience to understand and critically assess global trends.",
            "id": "ENTOM/ENVIRST 205",
            "title": "OUR PLANET, OUR HEALTH"
        }
    },
    {
        "data": {
            "description": "Covers the graphs, properties and geometric significance of trigonometric functions of a real variable. Other topics include trigonometric equations and identities, application, trigonometric form of complex numbers, DeMoivre's theorem, and polar and parametric equations. The course also has a significant number of applications, especially related to other disciplines.",
            "id": "MATH 113",
            "parent": "MATH",
            "title": "TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "Ecology is the study of relationships in the natural world, many of which are increasingly being altered by human activities. These disruptions modify the environment on a global scale, affecting populations and communities of plants, animals, and other organisms, and making Earth increasingly inhospitable for life, including for humans. Explore the natural world and humans' role within it, as both instigators and managers of global environmental change.",
            "id": "ENVIRST 251",
            "parent": "ENVIRST",
            "title": "ECOLOGY AND THE GLOBAL ENVIRONMENT"
        }
    },
    {
        "data": {
            "description": "Energy resources are an essential element of the world's business, political, technical and environmental landscape. Analytic tools provided by the discipline of economics expands our understanding of this critical issue. Energy supply markets reviewed include both fossil fuels and renewable resources. Energy demand sectors include residential, commercial, industrial and transportation. Electricity represents an intermediate energy market. The interactions among these markets participants indicate how scarce resources are allocated among competing needs in the world economy.",
            "id": "AAE/CIVENGR/ENVIRST/URBRPL 561",
            "title": "ENERGY MARKETS"
        }
    },
    {
        "data": {
            "description": "Explores a new approach to a part of the world with a very old history, but one that is now as 'modern' as any. The changing, complex relations between Europeans and their environments from antiquity to the twenty-first century offer instructive comparison with American and current global environmental concerns. Approaching Mediterranean and Western civilizations from an environmental viewpoint also offers fresh perspective on these enduring cultures.",
            "id": "ENVIRST/HISTORY 328",
            "title": "ENVIRONMENTAL HISTORY OF EUROPE"
        }
    },
    {
        "data": {
            "description": "Explores the links between nature, power and society in today's world. Considers the complex relationships between humans and the earth's resources, including food, energy, physical materials, water, biota, and landscapes. Examines issues linked to population and scarcity, resource tenure, green consumerism, political economy, environmental ethics, risks and hazards, political ecology, and environmental justice.",
            "id": "ENVIRST/GEOG 337",
            "title": "NATURE, POWER AND SOCIETY"
        }
    },
    {
        "data": {
            "description": "From Teddy Roosevelt's 1909 African safari to the Hollywood blockbuster King Kong, from the world of Walt Disney to The March of the Penguins, cinema has been a powerful force in shaping public and scientific understanding of nature throughout the twentieth and twenty-first century. How can film shed light on changing environmental ideas and beliefs in American thought, politics, and culture? And how can we come to see and appreciate contested issues of race, class, and gender in nature on screen? Explore such questions and come to understand the role of film in helping to define the contours of past, present, and future environmental visions in the United States, and their impact on the real world struggles of people and wildlife throughout the world.",
            "id": "ENVIRST/HISTORY/HISTSCI 125",
            "title": "GREEN SCREEN: ENVIRONMENTAL PERSPECTIVES THROUGH FILM"
        }
    },
    {
        "data": {
            "description": "Interdisciplinary investigation with an emphasis on real world challenges. Examine environmental issues and apply, often in a team context, a variety of academic perspectives and methodologies, and cultivate academic and professional abilities such as establishing connections within the larger community, developing strategies for analyzing and addressing problems, developing field skills in ecosystems, and working with others trained in fields different from one's own.",
            "id": "ENVIRST 600",
            "parent": "ENVIRST",
            "title": "ENVIRONMENTAL STUDIES CAPSTONE"
        }
    },
    {
        "data": {
            "description": "Interdisciplinary team of students and staff working with agency personnel, citizen groups, and/or private sector representatives on the analysis of a contemporary, problem-oriented water resource issue. Physical, biological, economic and social aspects of the issue analyzed. Comprehensive written report results, practicum's findings and management recommendations.",
            "id": "CIVENGR/ENVIRST/URBRPL 719",
            "title": "WATER RESOURCES MANAGEMENT SUMMER PRACTICUM"
        }
    },
    {
        "data": {
            "description": "Introduction to how the Earth system works and what makes Earth livable. Gain appreciation for how the atmosphere, oceans, life, and earth's surface interact to shape our local, regional and global landscapes.",
            "id": "ENVIRST/GEOG 120",
            "title": "INTRODUCTION TO THE EARTH SYSTEM"
        }
    },
    {
        "data": {
            "description": "National parks, wilderness, and monuments that are set aside for recreational enjoyment are disproportionately underutilized by African Americans, Hispanics, Asians and Native Americans for reasons that are inextricably linked to past and present racial discrimination. Broadening access and participation in outdoor recreation requires a clear understanding of this history, as well as an appreciation of the continuing efforts by people of color to reassert their right to the outdoors. Gain a clear understanding of the sociocultural circumstances that have created disparities among the U.S. population in citizens' ability to access and enjoy public land and the efforts that aim to address them.",
            "id": "ENVIRST 308",
            "parent": "ENVIRST",
            "title": "OUTDOORS FOR ALL: INEQUITIES IN ENVIRONMENTALISM"
        }
    },
    {
        "data": {
            "description": "Reviews the past, present, and future of the Arctic and Antarctic regions. Covers the history, geography, atmospheric and ocean circulations, permafrost, ice sheets, glaciers, and future state of the Arctic and Antarctica as projected by earth system models. Also explores the role of the polar regions in the earth's system and associated global climatic feedbacks.",
            "id": "ATMOCN/ENVIRST/GEOG 322",
            "title": "POLAR REGIONS AND THEIR IMPORTANCE IN THE GLOBAL ENVIRONMENT"
        }
    },
    {
        "data": {
            "description": "Survey of Muslim religious understandings of science, technology, nature and environment. Gain a global perspective through case studies, covering sources such as the Qur'an, theology and law, and traditions of esoteric piety (mysticism), and historical and contemporary issues like medical ethics, virtual realities, and environmental change, challenge and crisis.",
            "id": "ENVIRST/HISTSCI/RELIGST 356",
            "title": "ISLAM, SCIENCE & TECHNOLOGY, AND THE ENVIRONMENT"
        }
    },
    {
        "data": {
            "description": "19th and 20th century British and American literature.",
            "id": "ENVIRST 307",
            "parent": "ENVIRST",
            "title": "LITERATURE OF THE ENVIRONMENT: SPEAKING FOR NATURE"
        }
    },
    {
        "data": {
            "description": "A comprehensive treatment of the ecology, causes, and consequences of species extinction. Ecology and problems of individual species, habitat alteration and degradation, socio-economic pressures and conservation techniques and strategies.",
            "id": "ENVIRST/F&WECOL/ZOOLOGY 360",
            "title": "EXTINCTION OF SPECIES"
        }
    },
    {
        "data": {
            "description": "A critical examination of the full spectrum of renewable and nonrenewable energy options, from the unifying perspective of the Earth systems that govern their use.  Energy conversion and efficiency, consumption patterns and trends, and environmental consequences of energy production and use.",
            "id": "ENVIRST/GEOSCI 411",
            "title": "ENERGY RESOURCES"
        }
    },
    {
        "data": {
            "description": "A discussion and exploration of the social, economic and legal interactions of geospatial and environmental information technologies with society.",
            "id": "ENVIRST 950",
            "parent": "ENVIRST",
            "title": "ENVIRONMENTAL MONITORING SEMINAR"
        }
    },
    {
        "data": {
            "description": "A weekly series of presentations by persons who have direct experience in the practice of conservation biology and sustainable development. Presenters may be students, faculty staff or agency persons.",
            "id": "ENVIRST 976",
            "parent": "ENVIRST",
            "title": "THE PRACTICE OF CONSERVATION BIOLOGY AND SUSTAINABLE DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Accelerated coverage of topics in general chemistry, including introduction to laboratory techniques. Topics include atomic and molecular structure, chemical equilibrium, acid-base chemistry, thermodynamics, kinetics, and electrochemistry.",
            "id": "CHEM 109",
            "parent": "CHEM",
            "title": "ADVANCED GENERAL CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Adequacy of ethical theories in handling such wrongs as harm to the land, to posterity, to endangered species, and to the ecosystem itself. Exploration of the view that not all moral wrongs involve harm to humans. Inquiry into the notion of the quality of life and the ethics of the \"lifeboat\" situation.",
            "id": "ENVIRST/PHILOS 441",
            "title": "ENVIRONMENTAL ETHICS"
        }
    },
    {
        "data": {
            "description": "Advanced language practice, including intensive writing and work in pertinent areas of grammar and stylistics.",
            "id": "SPANISH 311",
            "parent": "SPANISH",
            "title": "ADVANCED LANGUAGE PRACTICE"
        }
    },
    {
        "data": {
            "description": "Agroecology has blossomed across the world in recent decades as not only a science, but also a practice, and a movement. Employ the multiple disciplines and perspectives that Agroecology affords to analyze our agricultural and food systems wihin a broader context of dynamic social and ecological relationships.",
            "id": "AGROECOL/AGRONOMY/C&ESOC/ENTOM/ENVIRST 103",
            "title": "AGROECOLOGY: AN INTRODUCTION TO THE ECOLOGY OF FOOD AND AGRICULTURE"
        }
    },
    {
        "data": {
            "description": "An examination of the writings and activities of green parties and movements around the globe in order to assess the potential of an explicit, radical environmental politics for the United States.",
            "id": "ENVIRST/URBRPL 668",
            "title": "GREEN POLITICS: GLOBAL EXPERIENCE, AMERICAN PROSPECTS"
        }
    },
    {
        "data": {
            "description": "An introduction to natural environmental systems, emphasizing the interconnections between the systems of the solid earth (minerals, rocks, soils), the hydrosphere (water in all its forms), the biosphere, and the atmosphere. Emphasizes connections between basic concepts and specific environmental issues through hands-on case studies, lab projects, and field trips to collect samples and observations for lab projects.",
            "id": "ENVIRST/GEOG 127",
            "title": "PHYSICAL SYSTEMS OF THE ENVIRONMENT"
        }
    },
    {
        "data": {
            "description": "An introduction to reading and analyzing literary works, with special emphasis on development of oral and written skills for the discussion of literature. Concentration on methods of analyzing basic literary forms, conventions, genres, and representative short texts in Spanish.",
            "id": "SPANISH 224",
            "parent": "SPANISH",
            "title": "INTRODUCTION TO HISPANIC LITERATURES"
        }
    },
    {
        "data": {
            "description": "An introduction to the dynamic and emerging transdisciplinary field of sustainability. A broad survey of the global sustainability science challenges and their potential solutions using an integrated social-environmental systems approach. Applies a sustainability and systems thinking lens to various topics, such as complexity, resilience, ecological literacy, global climate change, economics, food systems, energy, sustainable development, and social equity. Facilitates the exploration of complex interrelationships among contemporary environmental, social, and economic problems and the solutions to support more sustainable systems. Focuses on the skills, knowledge, and attitudes to implement sustainable practices and to enact sustainable development through sustainability science and education.",
            "id": "ENVIRST 215",
            "parent": "ENVIRST",
            "title": "SUSTAINABILITY"
        }
    },
    {
        "data": {
            "description": "An introduction to the statistical methods used in public policy. Covers the basics of probability, statistics, and quantitative methods in public policy analysis. Stresses interpretation and presentation of data as well as theory.",
            "id": "PUBAFFR 818",
            "parent": "PUBAFFR",
            "title": "INTRODUCTION TO STATISTICAL METHODS FOR PUBLIC POLICY ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Analyze the concept of sustainability through current trends, including energy, air and water resources, agriculture, environmental measurement and analysis, modeling, remote sensing, Geographic Information Systems, the built environment, transportation, ecology, conservation and global climate change.",
            "id": "ENVIRST 417",
            "parent": "ENVIRST",
            "title": "SUSTAINABILITY SCIENCE, TECHNOLOGY AND POLICY"
        }
    },
    {
        "data": {
            "description": "Anatomy and taxonomy of Wisconsin fishes and projects in fish ecology.",
            "id": "ENVIRST/ZOOLOGY 511",
            "title": "ECOLOGY OF FISHES LAB"
        }
    },
    {
        "data": {
            "description": "Application of ecological principles and human dimensions to the conservation of biological diversity. Topics: biodiversity science; conservation planning; population ecology; habitat loss, species exploitation, invasive species, pollution; human attitudes and activities as they affect the biosphere; approaches to monitoring interventions.",
            "id": "BOTANY/ENVIRST/F&WECOL/ZOOLOGY 651",
            "title": "CONSERVATION BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Application of geology to problems resulting from the ever more intense use of the earth and its resources.",
            "id": "ENVIRST/GEOSCI 106",
            "title": "ENVIRONMENTAL GEOLOGY"
        }
    },
    {
        "data": {
            "description": "Atmospheric problems of global significance. Greenhouse warming, ozone layer, acid rain, climate change. Study based on elementary principles of atmospheric science. Systems approach applied to changing atmospheric composition. Interactions among geochemical cycles, anthropogenic inputs and other parts of the environment.",
            "id": "ATMOCN/ENVIRST 171",
            "title": "GLOBAL CHANGE: ATMOSPHERIC ISSUES AND PROBLEMS"
        }
    },
    {
        "data": {
            "description": "Basic principles of ecology and interrelations between individuals, populations, communities, ecosystems and their environment; transmission genetics and introduction to population genetics; origin of life, evolutionary mechanisms, ancestral relationships among species, and the diversity of life.",
            "id": "BIOCORE 381",
            "parent": "BIOCORE",
            "title": "EVOLUTION, ECOLOGY, AND GENETICS"
        }
    },
    {
        "data": {
            "description": "Climate change at timescales from the last several million years to the last 100 years, with emphasis on more recent timescales. Examines how climate variability arises from interplay between external forcings, feedbacks within the earth system, and (more recently) human activity.",
            "id": "ATMOCN/ENVIRST/GEOG/GEOSCI 335",
            "title": "CLIMATIC ENVIRONMENTS OF THE PAST"
        }
    },
    {
        "data": {
            "description": "Climate change is being felt, and addressed, at every level of society, from the individual to the global scale. Examine efforts to mitigate climate change. Learn about initiatives that are being implemented through international treaties; national, state, and municipal government policies; corporate programs; and individual behavior. Examine the advantages and disadvantages of each approach, their successes, and the obstacles they have faced. Evaluate various forms of climate activism as a means of pushing for meaningful action on climate change.",
            "id": "ENVIRST 349",
            "parent": "ENVIRST",
            "title": "CLIMATE CHANGE GOVERNANCE"
        }
    },
    {
        "data": {
            "description": "Covers a broad cross-section of American environmental policy by focusing on specific statutes and policy arenas. Surveys the basic elements of American environmental policy and regulation with a particular focus on the specific people, sites and scales at which environmental decision-making happens through primary-source case material. Maintains a dual focus on (a) the legal and regulatory aspects of environmental regulation and (b) the specific geographic and social features of actual cases in which regulations and policy are used. Understanding environmental outcomes in a complex society depends on observing both the structure of regulations and the geographic and social context in which such regulations emerge.",
            "id": "ENVIRST/GEOG 439",
            "title": "US ENVIRONMENTAL POLICY AND REGULATION"
        }
    },
    {
        "data": {
            "description": "Covers real-world questions of how the environment is managed and governed through state policy, economics, and social institutions. Includes strategies within and outside of the formal institutions of government, and extends the discussion to the commodification of nature and the use of science to understand and govern the environment. Also includes case studies of environmental governance in water, carbon, species, and urban sustainability.",
            "id": "ENVIRST/GEOG 534",
            "title": "ENVIRONMENTAL GOVERNANCE: MARKETS, STATES AND NATURE"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Covers the use of live fire in land management and provides a background in fire ecology, fire behavior, fire effects, and the prediction of fire behavior for wetland, prairie and savanna fuels. Instruction includes field training with live fire exercises and the use of fire management equipment. Participate in prescribed burns outside of scheduled class times. Confers certificates of completion that qualify an individual to participate on prescribed fire crews with public and private sector organizations.",
            "id": "ENVIRST/LANDARC 581",
            "title": "PRESCRIBED FIRE: ECOLOGY AND IMPLEMENTATION"
        }
    },
    {
        "data": {
            "description": "Critical evaluation and analysis of land use policies and programs in relation to comprehensive planning and growth management issues in the U.S. The role of legislative and judicial processes and emerging public land use social values and philosophies in the development, regulation, and effectuation of innovative land use policies. Alternative land policy and growth guidance systems of select European countries.",
            "id": "ENVIRST/URBRPL 843",
            "title": "LAND USE POLICY AND PLANNING"
        }
    },
    {
        "data": {
            "description": "Describes the basic climate principles governing the climate system. It describes the climate and climate variability at present, climate evolution in the past, and the projected climate change into the future. The scientific principles underlying the natural and anthropogenic greenhouse effect and climate model forecasts are elucidated.",
            "id": "ATMOCN/ENVIRST/GEOSCI 102",
            "title": "CLIMATE AND CLIMATE CHANGE"
        }
    },
    {
        "data": {
            "description": "Design, implementation and use of automated procedures for storage, analysis and display of spatial information. Covers data bases, information manipulation and display techniques, software systems and management issues. Case studies.",
            "id": "CIVENGR/ENVIRST/GEOG 377",
            "title": "AN INTRODUCTION TO GEOGRAPHIC INFORMATION SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Discussion of professional skills important to interdisciplinary professionals in energy analysis and policy. Exploration of diverse career pathways and personal career development goals. Includes presentations from practitioners in public, private, and non-profit sectors.",
            "id": "ENVIRST 909",
            "parent": "ENVIRST",
            "title": "PROFESSIONAL SKILLS IN ENERGY ANALYSIS AND POLICY"
        }
    },
    {
        "data": {
            "description": "Ecology and conservation of a wide range of forests, from tropical rain and dry forests, boreal forests, to temperate forests, outside of the USA. The main threats to forests, and different strategies to solve conservation and sustainable management issues in international forestry. Trade-offs in forest conservation and management, resulting from different values that people place on forests, issues in equity and equality in access to forest resources. The role of forests in climate change and extinction of species.",
            "id": "ENVIRST/F&WECOL 100",
            "title": "FORESTS OF THE WORLD"
        }
    },
    {
        "data": {
            "description": "Ecology of individual organisms, populations, communities, ecosystems, landscapes, and the biosphere. The interaction of organisms with each other and their physical environment. These relationships are studied, often in quantitative terms, in both field and laboratory settings.",
            "id": "BOTANY/F&WECOL/ZOOLOGY 460",
            "title": "GENERAL ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Education is often portrayed as a critical part of the solution to the intertwined problems of environment and society. Examines environmental education and related traditions such as nature study, conservation education, and outdoor education, as well as more recent movements such as place-based education and education for sustainability. Grounds discussions in concrete examples of educational practice, considers historical and contemporary critiques of environmental education.",
            "id": "CURRIC/ENVIRST 932",
            "title": "FOUNDATIONS OF ENVIRONMENTAL AND SUSTAINABILITY EDUCATION"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "Examine natural resources policy and law in the United States relating to forests, wildlife, and other natural resources. Investigates the policy-making process and the role of science, values, property, economics, and justice in the development of federal and state resources policy. Practice professional written and oral communication and ethical engagement in resources policy and administration.",
            "id": "ENVIRST/F&WECOL 515",
            "title": "NATURAL RESOURCES POLICY"
        }
    },
    {
        "data": {
            "description": "Examine ways in which the ancient Greeks and Romans interacted with their Mediterranean environments and the various conceptions of the natural world that they developed in poetry, prose and visual art. Explore a number of general topics that will underpin the course as a whole: the characteristics of the Mediterranean environment, the effect of nature on humankind, and the impact of humankind on nature. Study aspects of Greek and Roman engagements with nature, such as agriculture, hunting, sacrifice, the contested relationship between the natural and the civilized, and representations of human beings using terms drawn from the natural world (\"bears\" of Artemis, cannibalistic \"wolves\"). Consider how these aspects of the ancient world relate to modern treatments of such themes. (NB: All Greek and Latin texts will be read in English translation.)",
            "id": "CLASSICS/ENVIRST 488",
            "title": "GREEKS, ROMANS AND THE NATURAL ENVIRONMENT"
        }
    },
    {
        "data": {
            "description": "Examines major environmental conservation approaches in the U.S. and developing countries and how they are influenced by sociopolitical factors, cultural values and scientific understandings of nature. Historical and contemporary cases are explored with emphasis on biodiversity and climate change issues.",
            "id": "ENVIRST/GEOG 339",
            "title": "ENVIRONMENTAL CONSERVATION"
        }
    },
    {
        "data": {
            "description": "Examines public participation for planning and policymaking in both urban and natural environments; considers different types of participation from agency consultation to negotiation; designing, conducting, and evaluating citizen participation are major features.",
            "id": "ENVIRST/URBRPL 917",
            "title": "PUBLIC PARTICIPATION FOR PLANNING AND POLICY MAKING"
        }
    },
    {
        "data": {
            "description": "Examines the political, socio-cultural, economic and ecological aspects of contemporary development and human-environment relations in mainland Southeast Asia, applying a critical and theoretically informed perspective, and focusing largely on rural issues.",
            "id": "ENVIRST/GEOG 557",
            "title": "DEVELOPMENT AND ENVIRONMENT IN SOUTHEAST ASIA"
        }
    },
    {
        "data": {
            "description": "Exploration of the ideals and realities of sustainability in Central, Northern and East European contexts. Cultural, historical, environmental and other perspectives on sustainability on a local and global scale.",
            "id": "ENVIRST/GNS 210",
            "title": "CULTURES OF SUSTAINABILITY: CENTRAL, EASTERN, AND NORTHERN EUROPE"
        }
    },
    {
        "data": {
            "description": "Explore the foundations of sustainability using the UW-Madison campus as a living laboratory.  Ground your feet on the UW-Madison campus and ask questions about the energy we use, the food we eat, the air we breathe, the land we occupy, the goods we purchase, and the waste we create. A blend of environmental sciences and studies. Use principles of chemistry, physics, and biology to understand the dynamics of our human and earth systems, but also explore societal issues like public health and social justice, all through the context of sustainability and the UW-Madison campus community.",
            "id": "ENVIRST/ILS 255",
            "title": "INTRODUCTION TO SUSTAINABILITY SCIENCE"
        }
    },
    {
        "data": {
            "description": "Explore the ways remote sensing data are being used within an international development context, broadly defined. Provides a unique focus on understanding how projects were completed with satellite data, what data sources were necessary, how expert local knowledge was incorporated, and how various challenges were faced and overcome. Discover how the application of remote sensing data helped change policy in different countries across the globe.",
            "id": "ENVIRST 931",
            "parent": "ENVIRST",
            "title": "REMOTE SENSING FOR INTERNATIONAL DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Explores different social science approaches to interpreting the relationship between environment and society at various scales, from the local to the global. Traces the social origins of environmental concerns, their social impacts, and the different responses they engender.",
            "id": "ENVIRST 112",
            "parent": "ENVIRST",
            "title": "ENVIRONMENTAL STUDIES: SOCIAL SCIENCE PERSPECTIVES"
        }
    },
    {
        "data": {
            "description": "Explores environmental studies through a focus on law and legal history. Although its main concentration is on U.S. environmental law, the course will begin and end with broader historical and global perspectives. Topics include a survey of English, European, and early American legal approaches to land use, natural resources, and pollution through World War II as well as an examination of the development and practice of contemporary U.S. environmental law and consideration of the recent emergence of international environmental law.",
            "id": "ENVIRST/HISTORY/LEGALST 430",
            "title": "LAW AND ENVIRONMENT: HISTORICAL AND CONTEMPORARY PERSPECTIVES"
        }
    },
    {
        "data": {
            "description": "Explores fundamentals of systems thinking and how to apply a systems-based approach to understanding and addressing sustainability issues ranging from climate change to environmental racism. Systems content is complemented with foundational skills in life cycle assessment (LCA), an inherently systems-based application of sustainability science that considers the full measure of resources used and waste created throughout the cradle-to-grave supply chain of a product or process. Life cycle and systems-based approaches are used to characterize both human and natural systems in local and global contexts. These approaches also will be integrated with sustainability concepts including the triple bottom line, industrial ecology, and the circular economy. Concepts include: life cycle stages, supply chains, stocks, flows, feedback loops, and unintended consequences.",
            "id": "ENVIRST 326",
            "parent": "ENVIRST",
            "title": "SUSTAINABILITY TOOLS: SYSTEMS THINKING & LIFE CYCLE ASSESSMENT"
        }
    },
    {
        "data": {
            "description": "Explores planning-related Geographic Information System (GIS) data, applications, analytical tools, and implementation issues.",
            "id": "ENVIRST/GEOG/LANDARC/URBRPL 532",
            "title": "APPLICATIONS OF GEOGRAPHIC INFORMATION SYSTEMS IN PLANNING"
        }
    },
    {
        "data": {
            "description": "Explores the global and local nature of environmental problems, including issues of climate change, food, energy, globalization, deforestation, biodiversity loss, resource access, environmental justice, and population. Considers how we should analyze and act on environmental problems as we confront the apparently daunting scale of such issues. What appear to be single global environmental issues are actually composed of many smaller, context-specific, and place-dependent problems or conflicts. Through an interdisciplinary and geographic perspective, these issues can be understood and addressed at the scale of our lived lives.",
            "id": "ENVIRST/GEOG 139",
            "title": "GLOBAL ENVIRONMENTAL ISSUES"
        }
    },
    {
        "data": {
            "description": "Explores the history of human relationships with animals around the world with focus on agriculture and hunting, political economic development, human identity, and biological science and conservation.",
            "id": "ENVIRST/HISTORY 369",
            "title": "THINKING THROUGH HISTORY WITH ANIMALS"
        }
    },
    {
        "data": {
            "description": "Explores the history of human relationships with the environment on a global scale through analysis of long-term changes, from early civilizations, to the beginnings of global trade, the Industrial Revolution, urbanization, and 20th century technological developments. Offers first-hand historiographical research experience and training in writing for public web audiences.",
            "id": "ENVIRST/HISTORY 465",
            "title": "GLOBAL ENVIRONMENTAL HISTORY"
        }
    },
    {
        "data": {
            "description": "Explores the relationship between humans and wildlife amid diverse landscapes, both historic and contemporary, tropical and temperate. Investigates how humans shape wild animal populations by modifying physical environments, and by hunting, domesticating and introducing species.",
            "id": "C&ESOC/ENVIRST/GEOG 434",
            "title": "PEOPLE, WILDLIFE AND LANDSCAPES"
        }
    },
    {
        "data": {
            "description": "Explores the varied career opportunities for environmental professionals. Features discussions with environmental professionals, supplemented with in-class training on job hunting and professional preparation.",
            "id": "ENVIRST 202",
            "parent": "ENVIRST",
            "title": "CAREERS IN THE ENVIRONMENT"
        }
    },
    {
        "data": {
            "description": "Explores the ways that literary texts represent, imagine, and re-imagine the environment.",
            "id": "ENGL/ENVIRST 533",
            "title": "TOPIC IN LITERATURE AND THE ENVIRONMENT"
        }
    },
    {
        "data": {
            "description": "Focuses on the concepts and practices used to define systems while providing opportunities to build competencies with systems thinking to describe, assess, understand, and manage complexity from local to global scales. Considers a range of topics, including systems science, complexity, behavior of adaptive systems, networks, emergence, and patterns of organization. Develops skills to analyze how the design and implementation of integrated systems can contribute to solutions for pressing societal challenges. Examines social, physical, and natural systems, the rise of complexity, and achieving resilience in social-ecological systems. Examines the components of systems and analyzes how different ecological and social contexts influence system behavior. Explores and analyzes how decisions ramify to influence processes and outcomes at different levels of complexity.",
            "id": "ENVIRST 365",
            "parent": "ENVIRST",
            "title": "SYSTEMS THINKING"
        }
    },
    {
        "data": {
            "description": "Focuses on the fundamental physical principles of terrestrial remote sensing, followed by an examination of advanced topics in earth observation and digital image processing. Topics include radiation interaction with the atmosphere and the surface; radiative transfer theory; land surface characteristics including energy balance; thermal sensing; atmospheric and radiometric correction of image data; automated cloud detection and removal. Applications of remote sensing data for environmental problems will be explored in depth, including biophysical remote sensing with 3D modeling of vegetation canopies, dense time series analysis, data mining techniques, data fusion, as well as object vs. per-pixel approaches to pattern recognition. Explores all major data types, including optical, RADAR, LiDAR, and hyperspectral data, and provide instruction in hands-on image processing using open source software.",
            "id": "ENVIRST 956",
            "parent": "ENVIRST",
            "title": "ADVANCED ENVIRONMENTAL REMOTE SENSING"
        }
    },
    {
        "data": {
            "description": "Focuses on theoretical and practical aspects of public engagement with scientific research, policy, and management, with an emphasis on writing, rhetoric, and scientific discourse.",
            "id": "ENGL/ENVIRST 305",
            "title": "RHETORIC, SCIENCE, AND PUBLIC ENGAGEMENT"
        }
    },
    {
        "data": {
            "description": "General biological principles. Topics include: evolution, ecology, animal behavior, cell structure and function, genetics and molecular genetics and the physiology of a variety of organ systems emphasizing function in humans.",
            "id": "BIOLOGY/ZOOLOGY 101",
            "title": "ANIMAL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "General limnology. Physical, chemical and biological characteristics and processes of lakes. Environmental problems and rehabilitation of lakes.",
            "id": "ENVIRST/ZOOLOGY 315",
            "title": "LIMNOLOGY-CONSERVATION OF AQUATIC RESOURCES"
        }
    },
    {
        "data": {
            "description": "Geographic approaches to culture-nature relationships, including human perception of, use of, and adaptation to the physical environment, with emphasis on traditional subsistence systems; selected topics from contemporary and historical sources.",
            "id": "ENVIRST/GEOG 537",
            "title": "CULTURE AND ENVIRONMENT"
        }
    },
    {
        "data": {
            "description": "Geologic processes; structure and history of the earth; earthquakes, volcanos, glaciers, groundwater, minerals, rocks, deserts, fossils; topographic and geologic maps; climate change on geologic and human time scales.",
            "id": "GEOSCI 100",
            "parent": "GEOSCI",
            "title": "INTRODUCTORY GEOLOGY: HOW THE EARTH WORKS"
        }
    },
    {
        "data": {
            "description": "Global positioning system surveying for field applications. Signals. Coordinate systems. Datums. Cartographic projections. Satellite orbits. Choosing hardware. Strategies for data collection and analysis. Assessing uncertainty. Geocoding satellite images. Integrating data with Geographic Information Systems. Emerging technologies.",
            "id": "CIVENGR/ENVIRST/GEOSCI/GLE 444",
            "title": "PRACTICAL APPLICATIONS OF GPS SURVEYING"
        }
    },
    {
        "data": {
            "description": "Governmental processes and policies for water resources management: major substantive problems and issues; political processes of decision making; problems of governmental organization and intergovernmental arrangements.",
            "id": "ENVIRST/URBRPL 865",
            "title": "WATER RESOURCES INSTITUTIONS AND POLICIES"
        }
    },
    {
        "data": {
            "description": "Hands-on field study for intensive study of behavior of plants and animals and their relationship to environments and human impacts. Individual and group observations, measurements, interpretation, reports, typing personal experience with specifics to basic principles.",
            "id": "ENVIRST 375",
            "parent": "ENVIRST",
            "title": "FIELD ECOLOGY WORKSHOP"
        }
    },
    {
        "data": {
            "description": "Historical climatology with emphasis on the last few centuries.",
            "id": "ATMOCN/ENVIRST 925",
            "title": "SEMINAR-CLIMATOLOGY"
        }
    },
    {
        "data": {
            "description": "How can education - for children and adults, in school and out - help to address crucial environmental and social sustainability challenges? What ideas and strategies have guided environmental and sustainability education over the years? What can individual people do to address environmental challenges, and what can only be accomplished by people working together? What does sustainability have to do with justice - and vice versa? Examine the principles behind behavior change and empowerment, community action and whole-scale social reform. Drawing on research and theory from across the social sciences, we will explore the uncertain relationship between education and advocacy, seeking the means by which education can have the greatest impact without compromising the core ideals of a democratic society.",
            "id": "C&ESOC/CURRIC/ENVIRST 405",
            "title": "EDUCATION FOR SUSTAINABLE COMMUNITIES"
        }
    },
    {
        "data": {
            "description": "How climate systems and biological organisms operate and interact at the global scale and the implications of this for climate change, ecosystem ecology and human land use.",
            "id": "ATMOCN/ENVIRST 520",
            "title": "BIOCLIMATOLOGY"
        }
    },
    {
        "data": {
            "description": "Impact of environmental problems on human health; biological hazards to human health from air and water pollution; radiation; pesticides; noise; problems related to food, occupation and environment of the work place; accidents. Physical and chemical factors involved.",
            "id": "ENVIRST/POPHLTH 471",
            "title": "INTRODUCTION TO ENVIRONMENTAL HEALTH"
        }
    },
    {
        "data": {
            "description": "Impacts of global change drivers (climate change, atmospheric chemistry, bioenergy, urbanization, policy) on agroecosystems and their associated goods and services; environmental impacts of agricultural land use and feedbacks to climate; modeling approaches; critical review of current scientific literature.",
            "id": "AGROECOL/AGRONOMY/ENVIRST 724",
            "title": "AGROECOSYSTEMS AND GLOBAL CHANGE"
        }
    },
    {
        "data": {
            "description": "Importance of insects in the environment, emphasizing beneficial insects, disease carriers, and agricultural pests that interfere with the food supply. Environmental problems due to insect control agents.",
            "id": "ENTOM/ENVIRST 201",
            "title": "INSECTS AND HUMAN CULTURE-A SURVEY COURSE IN ENTOMOLOGY"
        }
    },
    {
        "data": {
            "description": "In-depth examination of the political and policy challenges posed by global environmental degradation. Analysis of international institutions for managing the global environment.",
            "id": "ENVIRST/POLISCI/PUBAFFR 866",
            "title": "GLOBAL ENVIRONMENTAL GOVERNANCE"
        }
    },
    {
        "data": {
            "description": "Independent research and writing towards thesis or dissertation requirement.",
            "id": "ENVIRST 990",
            "parent": "ENVIRST",
            "title": "RESEARCH"
        }
    },
    {
        "data": {
            "description": "Independent study for undergraduate students completing a thesis in Environmental Studies.",
            "id": "ENVIRST 691",
            "parent": "ENVIRST",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Independent study for undergraduate students completing a thesis in Environmental Studies.",
            "id": "ENVIRST 692",
            "parent": "ENVIRST",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Independent study for undergraduate students completing an Honors thesis in Environmental Studies.",
            "id": "ENVIRST 681",
            "parent": "ENVIRST",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Independent study for undergraduate students completing an Honors thesis in Environmental Studies.",
            "id": "ENVIRST 682",
            "parent": "ENVIRST",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Independent work in environmental studies overseen by a qualified instructor.",
            "id": "ENVIRST 199",
            "parent": "ENVIRST",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Independent work in environmental studies overseen by a qualified instructor.",
            "id": "ENVIRST 399",
            "parent": "ENVIRST",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Independent work in environmental studies overseen by a qualified instructor.",
            "id": "ENVIRST 699",
            "parent": "ENVIRST",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Independent work in environmental studies overseen by a qualified instructor.",
            "id": "ENVIRST 999",
            "parent": "ENVIRST",
            "title": "ADVANCED INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Indigenous peoples often have very close relationships to ancestral homelands, species and natural resources. However, definitions of \"indigenous\" can be controversial and highly politicized. Diverse outlooks on identities, worldviews and environmental governance clarify the complex meanings of indigeneity in the US. Highlights American Indian perspectives, conservation practices, and policy environments through consideration of US and international case studies. American Indian experiences shed light on pressing issues of resource sustainability and sovereignty, and demonstrate linkages to global Indigenous environmental issues and strategies.",
            "id": "AMERIND/ENVIRST 306",
            "title": "INDIGENOUS PEOPLES AND THE ENVIRONMENT"
        }
    },
    {
        "data": {
            "description": "Intensive practice in reading, writing, and grammar.",
            "id": "SPANISH 226",
            "parent": "SPANISH",
            "title": "INTERMEDIATE LANGUAGE PRACTICE WITH EMPHASIS ON WRITING AND GRAMMAR"
        }
    },
    {
        "data": {
            "description": "Interaction of soils with environmental contaminants and the role of soils in pollution control.",
            "id": "ENVIRST/SOILSCI 324",
            "title": "SOILS AND ENVIRONMENTAL QUALITY"
        }
    },
    {
        "data": {
            "description": "Interactions of fishes with their physical, chemical, and biotic environment; physiological ecology, community ecology and fisheries sciences. Lake Mendota perch fishery and Shedd Aquarium field trips.",
            "id": "ENVIRST/ZOOLOGY 510",
            "title": "ECOLOGY OF FISHES"
        }
    },
    {
        "data": {
            "description": "Interdisciplinary application of energy knowledge to an analysis project for a real-world client. Integrate and apply technical, economic, political, and social factors in energy decision-making.",
            "id": "ENVIRST/PUBAFFR/URBRPL 810",
            "title": "ENERGY ANALYSIS AND POLICY CAPSTONE"
        }
    },
    {
        "data": {
            "description": "Introduces new graduate students to the diversity of ecologists across the UW-Madison campus. Includes discussions of key topics in professional development, research presentations by faculty members, and discussions of assigned papers with senior graduate students.",
            "id": "AGRONOMY/ATMOCN/BOTANY/ENTOM/ENVIRST/F&WECOL/GEOG/ZOOLOGY 953",
            "title": "INTRODUCTION TO ECOLOGY RESEARCH AT UW-MADISON"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Introduction to economic ways of thinking about a wide range of problems and issues. Topics include consumption, production, prices, markets, finance, trade, pollution, growth, farms, taxes, and development.",
            "id": "AAE 101",
            "parent": "AAE",
            "title": "INTRODUCTION TO AGRICULTURAL AND APPLIED ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Introduction to how and why humans have transformed natural landscapes around the world, including tropical deforestation. Exploration of different agricultural systems, and topics such as food security, land scarcity, bioenergy and the impacts of food production on the environment.",
            "id": "ENVIRST/GEOG 309",
            "title": "PEOPLE, LAND AND FOOD: COMPARATIVE STUDY OF AGRICULTURE SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Introduction to important aspects of communication, negotiation, and cross-cultural professional practice as they relate to Environmental Conservation.",
            "id": "ENVIRST 975",
            "parent": "ENVIRST",
            "title": "ENVIRONMENTAL CONSERVATION LEADERSHIP SEMINAR"
        }
    },
    {
        "data": {
            "description": "Introduction to other disciplinary and interdisciplinary methods studying past environmental change and the human cultural contexts within which such change occurs. Explore the disparate forms of evidence that can be used to reconstruct past environmental changes and their human meanings. Build a strong sense of community among graduate students and faculty members at UW-Madison who share an interest in past environmental change by creating a context within which students from different programs can work together.",
            "id": "ENVIRST 922",
            "parent": "ENVIRST",
            "title": "HISTORICAL AND CULTURAL METHODS IN ENVIRONMENTAL RESEARCH"
        }
    },
    {
        "data": {
            "description": "Introduction to professional development and important aspects of communication, collaboration, and professional practice as they relate to Environmental Conservation.",
            "id": "ENVIRST 974",
            "parent": "ENVIRST",
            "title": "ENVIRONMENTAL CONSERVATION COHORT SEMINAR"
        }
    },
    {
        "data": {
            "description": "Introduction to techniques used in the study of the biology, chemistry, geology, and physics of the marine environment.",
            "id": "ATMOCN/ENVIRST/GEOSCI/ZOOLOGY 750",
            "title": "PROBLEMS IN OCEANOGRAPHY"
        }
    },
    {
        "data": {
            "description": "Introduction to the Earth as viewed from above, focusing on use of aerial photography and satellite imagery to study the environment. Includes physical processes of electromagnetic radiation, data types and sensing capabilities, methods for interpretation, analysis and mapping, and applications.",
            "id": "ENVIRST/F&WECOL/GEOG/GEOSCI/GLE/LANDARC 371",
            "title": "INTRODUCTION TO ENVIRONMENTAL REMOTE SENSING"
        }
    },
    {
        "data": {
            "description": "Introduction to the issues which shape the national cultures and the cultural practices of the Hispanic world. Emphasis on diversity, emergence of new imagined communities, cultural hybridity, and social movements within a historical framework.",
            "id": "SPANISH 223",
            "parent": "SPANISH",
            "title": "INTRODUCTION TO HISPANIC CULTURES"
        }
    },
    {
        "data": {
            "description": "Introduction to the organizational structure, policies and practices of the Nelson Institute, with an emphasis on the opportunities and challenges of being a student in a cross-campus interdisciplinary program.",
            "id": "ENVIRST 901",
            "parent": "ENVIRST",
            "title": "GRADUATE ORIENTATION SEMINAR"
        }
    },
    {
        "data": {
            "description": "Investigates how economy and culture work together, consuming and/or restoring their environments in divergent scenarios of the Hispanic World.",
            "id": "ENVIRST/SPANISH 445",
            "title": "CULTURE AND THE ENVIRONMENT IN THE LUSO-HISPANIC WORLD"
        }
    },
    {
        "data": {
            "description": "Land tenure and utilization research and policy problems.",
            "id": "ENVIRST/URBRPL 923",
            "title": "SEMINAR-LAND PROBLEMS: INSTITUTIONAL DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Learn about the state-of-the-art in renewable energy applications including biomass for heat, electric power and liquid fuels as well as geo-energy sources such as wind, solar, and hydro power. Practice engineering calculations of power and energy availability of renewable energy sources and learn about requirements for integrating renewable energy sources into production, distribution and end-use systems.",
            "id": "BSE/ENVIRST 367",
            "title": "RENEWABLE ENERGY SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Lectures and discussions about environmental issues. Historical and contemporary environmental impacts of humans on the biosphere. Global futures: population, technology, societal values, resources and prospects for sustainable management.",
            "id": "ENVIRST/SOILSCI 101",
            "title": "FORUM ON THE ENVIRONMENT"
        }
    },
    {
        "data": {
            "description": "Links chemistry and meteorology to engineering, law, policy, and public health. Presents key ideas in air quality, with focus on reactive pollutants in the outdoor environment, especially gas and particle phase chemicals that react with human tissue to cause sickness and death. Discusses environmental impacts of these pollutants and regulatory approaches for their control in the U.S. and around the world. Indoor air quality will be included. Non-reactive pollutants, especially carbon dioxide, will be compared and contrasted with reactive air pollutants.",
            "id": "ATMOCN/ENVIRST 355",
            "title": "INTRODUCTION TO AIR QUALITY"
        }
    },
    {
        "data": {
            "description": "Many diverse technologies for monitoring the environment have become available in recent years, including traditional remote sensing data sources: aerial photography and satellite imagery, hyper-spectral data, imagery on demand, RADAR and LiDAR.  Other new data sources are quite unconventional, with many emerging relatively recently: unmanned aerial vehicles (UAVs or drones), social media, smartphones as sources of crowd-sourced data, and more.  Sophisticated data management, analytics, and presentation technology are required to effectively leverage both the spatial (including 3D) and temporal dimensions of these often untapped data sources. Intended to survey and explore these newly developing technologies, and provide direct experience to the student to understand and interact with the data and methods (geocomputing, coding, cloud-based platforms), and to learn to plan, manage, and utilize them effectively.",
            "id": "ENVIRST 971",
            "parent": "ENVIRST",
            "title": "ENVIRONMENTAL SENSING TECHNOLOGIES"
        }
    },
    {
        "data": {
            "description": "Microeconomic principles underlying the use of natural resources such as air, water, forests, fisheries, minerals and energy. These principles are applied in the examination of pollution control, preservation vs. development, deforestation, and other environmental issues.",
            "id": "AAE/ECON/ENVIRST 343",
            "title": "ENVIRONMENTAL ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Modern GIS desktop and web-based workflows, analyses, and visualizations related to natural resource and environmental planning issues and communication. Guest lectures from agency and industry professionals.",
            "id": "ENVIRST/LANDARC/SOILSCI 695",
            "title": "APPLICATIONS OF GEOGRAPHIC INFORMATION SYSTEMS IN NATURAL RESOURCES"
        }
    },
    {
        "data": {
            "description": "Modules provide training in specific tools and methods related to environmental conservation. Topics may include GIS, conservation finance, conservation governance  institutions, biodiversity monitoring, and science communication  environmental mediating.",
            "id": "ENVIRST 978",
            "parent": "ENVIRST",
            "title": "ENVIRONMENTAL CONSERVATION TOOLS MODULES"
        }
    },
    {
        "data": {
            "description": "Native Nations show leadership globally in addressing major environmental issues. Indigenous languages describe deep relationships with the natural world, including information on environmental stewardship - harvesting, caretaking and reciprocity. Indigenous scholars contribute crucial perspectives to conversations about human relationships to the Earth - cultural relationships to wildlife and plants, and the ethical and practical roles of humans in socio-ecological systems. Focuses on indigenous environmental scholarship, including the ongoing legacy of oral traditions, developing research, writing, and public speaking skills.",
            "id": "AMERIND/ENVIRST 341",
            "title": "INDIGENOUS ENVIRONMENTAL COMMUNICATORS"
        }
    },
    {
        "data": {
            "description": "Nature and variability of wind, temperature, clouds and precipitation. Storm systems, fronts, thunderstorms, tornadoes and their prediction. Air composition and pollution. Global winds, seasonal changes, climate and climatic change. Includes map analyses and basic quantitative lab exercises.",
            "id": "ATMOCN 101",
            "parent": "ATMOCN",
            "title": "WEATHER AND CLIMATE"
        }
    },
    {
        "data": {
            "description": "Nature and variability of wind, temperature, clouds and precipitation. Storm systems, fronts, thunderstorms, tornadoes and their prediction. Air composition and pollution. Global winds, seasonal changes, climate and climatic change.",
            "id": "ATMOCN 100",
            "parent": "ATMOCN",
            "title": "WEATHER AND CLIMATE"
        }
    },
    {
        "data": {
            "description": "Offers a fundamental understanding of how and why global warming is happening and what to expect in the future. Investigate and discuss the evidence for change, the science that explains these observations, predicted impacts on humans and ecosystems, and the societal debate over  proposed solutions.",
            "id": "ATMOCN/ENVIRST/GEOG 332",
            "title": "GLOBAL WARMING: SCIENCE AND IMPACTS"
        }
    },
    {
        "data": {
            "description": "Over half of the world's population now lives in urban areas, with an expected increase of 2.5 billion people in the next 30 years. As urbanization (broadly defined as the conversion of previously undeveloped lands into urbanized uses) continues and intensifies, we are faced with a number of environmental issues, for instance, fragmentation and destruction of habitats, and decreased air and water quality.  Explore how urbanization impacts ecological processes and resulting environmental outcomes, strategies for \"designing with nature,\" and behavioral, planning, and policy responses to urban environmental problems.",
            "id": "ENVIRST/GEOG 333",
            "title": "GREEN URBANISM"
        }
    },
    {
        "data": {
            "description": "Overview of methods for collecting and analyzing information about environmental impacts on agricultural and natural resources, including monitoring the physical environment and relating impacts to people and society.",
            "id": "ENVIRST/SOILSCI 575",
            "title": "ASSESSMENT OF ENVIRONMENTAL IMPACT"
        }
    },
    {
        "data": {
            "description": "Physical chemical and biological properties of soils as they affect soil-plant-water relations, soil classification and suitability for agricultural and other uses.",
            "id": "SOILSCI 301",
            "parent": "SOILSCI",
            "title": "GENERAL SOIL SCIENCE"
        }
    },
    {
        "data": {
            "description": "Prepare to plan, monitor and evaluate the effectiveness of conservation projects and programs. Learn systematic and adaptive processes of conservation planning.",
            "id": "ENVIRST 972",
            "parent": "ENVIRST",
            "title": "CONSERVATION PLANNING"
        }
    },
    {
        "data": {
            "description": "Presents the welfare economics underpinnings for evaluating the social benefits and costs of government activities. Issues such as uncertainty, the social discount rate, and welfare weights will be discussed; case studies from the environmental, social policy, and agricultural areas will be studied.",
            "id": "AAE/ENVIRST/POPHLTH/PUBAFFR 881",
            "title": "BENEFIT-COST ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Principles and application of chemical equilibrium, coordination chemistry, oxidation-reduction and electrochemistry, kinetics, nuclear chemistry, introduction to organic chemistry, and chemistry laboratory skills.",
            "id": "CHEM 104",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Problems of public policy and administration for development and use of natural resources.",
            "id": "ECON/ENVIRST/POLISCI/URBRPL 449",
            "title": "GOVERNMENT AND NATURAL RESOURCES"
        }
    },
    {
        "data": {
            "description": "Problems raised by genetics, evolutionary theory, and taxonomy: patterns of explanatory force and dispensability of teleology; objectivity of taxonomy.",
            "id": "ENVIRST/PHILOS 523",
            "title": "PHILOSOPHICAL PROBLEMS OF THE BIOLOGICAL SCIENCES"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Provide tools to identify and address real-world global environmental health issues, stemming from climate change, habitat destruction leading to disease spillover events, food insecurity, and urban design.",
            "id": "ENVIRST/POPHLTH 739",
            "title": "CLIMATE CHANGE, HUMAN AND PLANETARY HEALTH"
        }
    },
    {
        "data": {
            "description": "Provides an introduction to the intersections of health and environment on a global scale.  Exposes students to a range of problems in global environmental health, including climate change, disease ecology, and the globalization of disease.",
            "id": "ENVIRST/HISTSCI 213",
            "title": "GLOBAL ENVIRONMENTAL HEALTH: AN INTERDISCIPLINARY INTRODUCTION"
        }
    },
    {
        "data": {
            "description": "Provides an online environment for the development and practice of the skills needed to be an environmental conservation professional and leader. Analyze options and make good professional conservation judgments in complex and uncertain environmental, political, and economic settings. Provides the tools needed to assess and revise those judgments. Includes exercises on the politics of environmental decisions, internal and external communication strategies, and program development and assessment strategies.",
            "id": "ENVIRST 979",
            "parent": "ENVIRST",
            "title": "ENVIRONMENTAL CONSERVATION PROFESSIONAL PRACTICE"
        }
    },
    {
        "data": {
            "description": "Provides an opportunity to learn about community engagement and link sustainability concepts to working with a community organization. Declared in the Sustainability Certificate or Environmental Studies Major.",
            "id": "ENVIRST 398",
            "parent": "ENVIRST",
            "title": "INDEPENDENT STUDY: SUSTAINABILITY COMMUNITY ENGAGEMENT"
        }
    },
    {
        "data": {
            "description": "Provides opportunities for students in the Community Environmental Scholars Program to analyze the connections among environmental issues and community engagement. Requires work with community-based environmental and/or sustainability-related organizations. Student cohorts design and lead classes and projects and have opportunities to host guest speakers and environmental leaders. Emphasizes the professional skills needed to work effectively individually, in teams, in internships, and in professional positions.",
            "id": "ENVIRST 317",
            "parent": "ENVIRST",
            "title": "COMMUNITY ENVIRONMENTAL SCHOLARS PROGRAM SEMINAR"
        }
    },
    {
        "data": {
            "description": "Relates principles of environmental science to our daily activities, with an eye to sustainability, conservation, and systems thinking. Introduces science as a process of inquiry and discovery rather than just a pre-established set of facts. Topics relate to energy, water, and land use, and include food, electric power, materials, buildings, transportation, and waste.",
            "id": "ENVIRST/ILS 126",
            "title": "PRINCIPLES OF ENVIRONMENTAL SCIENCE"
        }
    },
    {
        "data": {
            "description": "Resource policy issues frequently faced by local and state governments and the federal government. Emphasis: (1) techniques for analysis of resource issues; (2) methods of collating knowledge from natural and social science disciplines which can make meaningful contributions to resolution of resource issues; (3) identification and analysis of strategic points of decision making in the legislative and executive branches of government; and (4) the application of planning techniques for accomplishing resource goals.",
            "id": "ENVIRST/URBRPL 821",
            "title": "RESOURCES POLICY ISSUES: REGIONAL AND NATIONAL"
        }
    },
    {
        "data": {
            "description": "Review core concepts and history of sustainable development. Introduction to innovative frameworks to sustainable development, including integral framework, institutional analysis, and the often overlooked cultural, philosophical and psychological underpinnings of environmental decision-making. Analyze case studies and examples through the lens of the frameworks presented. Serves as a forum to present your research interests and examples regarding sustainable development.",
            "id": "ENVIRST 977",
            "parent": "ENVIRST",
            "title": "SUSTAINABLE DEVELOPMENT - INTEGRAL PERSPECTIVE"
        }
    },
    {
        "data": {
            "description": "Sections in various fields of zoological research.",
            "id": "ATMOCN/BOTANY/CIVENGR/ENVIRST/GEOSCI/ZOOLOGY 911",
            "title": "LIMNOLOGY AND MARINE SCIENCE SEMINAR"
        }
    },
    {
        "data": {
            "description": "Sociological analysis of relationships among economic growth, environmental sustainability and social justice in the developing world. Considers frameworks for understanding poverty, hunger, educational and technological inequality, and the impact of globalization on prospects for socially and ecologically sustainable development.",
            "id": "C&ESOC/ENVIRST/SOC 540",
            "title": "SOCIOLOGY OF INTERNATIONAL DEVELOPMENT, ENVIRONMENT, AND SUSTAINABILITY"
        }
    },
    {
        "data": {
            "description": "Sociological examination of the linkages between the social and biophysical dimensions of the environment. Key topics include community organizing, local food systems, energy transitions, environmental justice, resource dependence, and sustainable development.",
            "id": "C&ESOC/SOC 140",
            "title": "INTRODUCTION TO COMMUNITY AND ENVIRONMENTAL SOCIOLOGY"
        }
    },
    {
        "data": {
            "description": "Soils are fundamental to ecosystem science. A systems approach is used to investigate how soils look and function. Topics investigated include soil structure, biology, water, fertility, and taxonomy as well as the human impact on the soil environment.",
            "id": "ENVIRST/GEOG/SOILSCI 230",
            "title": "SOIL: ECOSYSTEM AND RESOURCE"
        }
    },
    {
        "data": {
            "description": "Special topics selected with each offering.",
            "id": "ENVIRST 900",
            "parent": "ENVIRST",
            "title": "SEMINAR"
        }
    },
    {
        "data": {
            "description": "Specific topics will vary, within the scope of environmental studies.",
            "id": "ENVIRST 203",
            "parent": "ENVIRST",
            "title": "SPECIAL TOPICS IN ENVIRONMENTAL STUDIES"
        }
    },
    {
        "data": {
            "description": "Specific topics will vary, within the scope of environmental studies.",
            "id": "ENVIRST 403",
            "parent": "ENVIRST",
            "title": "SPECIAL TOPICS IN ENVIRONMENTAL STUDIES"
        }
    },
    {
        "data": {
            "description": "Stoichiometry and the mole concept, the behavior of gases, liquids and solids, thermochemistry, electronic structure of atoms and chemical bonding, descriptive chemistry of selected elements and compounds, intermolecular forces, and chemistry laboratory skills.",
            "id": "CHEM 103",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Strategy and policy problems in energy policy, both national and international.",
            "id": "ENVIRST/PUBAFFR/URBRPL 809",
            "title": "INTRODUCTION TO ENERGY ANALYSIS AND POLICY"
        }
    },
    {
        "data": {
            "description": "Survey of interactions among people and natural environments from before European colonization to present. Equal attention to problems of ecological change, human ideas, and uses of nature and history of conservation and environmental public policy.",
            "id": "ENVIRST/GEOG/HISTORY 460",
            "title": "AMERICAN ENVIRONMENTAL HISTORY"
        }
    },
    {
        "data": {
            "description": "Surveys the concepts, practices, and issues associated with caring for nature in American Indian communities.",
            "id": "AMERIND/ENVIRST/GEOG 345",
            "title": "CARING FOR NATURE IN NATIVE NORTH AMERICA"
        }
    },
    {
        "data": {
            "description": "Surveys the scientific knowledge, concepts, and models that are the basis for the applied practice for the conservation of biodiversity. Study interactions of humans with nature, and how conservation science is used to formulate policy and guide conservation actions.",
            "id": "ENVIRST 951",
            "parent": "ENVIRST",
            "title": "CONSERVATION OF BIODIVERSITY"
        }
    },
    {
        "data": {
            "description": "Systems modeling; applications to environmental problems; systems methods.",
            "id": "ENVIRST 506",
            "parent": "ENVIRST",
            "title": "MODELING AND ANALYSIS OF ENVIRONMENTAL SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Techniques of enhancement and quantification of remote sensing imagery. Emphasis on processing and analyzing data gathered by airborne and satellite sensors. Techniques to quantitatively analyze data from photography, electro-optical scanners, satellite systems, and radar and passive microwave systems. Applications to: agriculture and forestry, geology and soils, water quality, and urban and regional planning.",
            "id": "CIVENGR/ENVIRST/LANDARC 556",
            "title": "REMOTE SENSING DIGITAL IMAGE PROCESSING"
        }
    },
    {
        "data": {
            "description": "The \"economic way of thinking\" about global and regional environmental issues. Topics include climate change, biodiversity preservation, ocean fisheries, environmental impacts of international trade, poverty and the environment, and sustainability.",
            "id": "AAE/ENVIRST 244",
            "title": "THE ENVIRONMENT AND THE GLOBAL ECONOMY"
        }
    },
    {
        "data": {
            "description": "The first of two seminars for planning the activities of the practicum.",
            "id": "CIVENGR/ENVIRST/URBRPL 717",
            "title": "WATER RESOURCES MANAGEMENT PRACTICUM PLANNING SEMINAR I"
        }
    },
    {
        "data": {
            "description": "The method, application, and limitations of traditional economic approaches to the study of energy problems. Topics include microeconomic foundations of energy demand and supply; optimal pricing and allocation of energy resources; energy market structure, conduct, and performance; macro linkages of energy and the economy; and the economics of regulatory and other public policy approaches to the social control of energy.",
            "id": "AAE/ECON/ENVIRST/URBRPL 671",
            "title": "ENERGY ECONOMICS"
        }
    },
    {
        "data": {
            "description": "The relationships of organisms and the environment. Population dynamics and community organization, human-environment relationships, action programs.",
            "id": "BOTANY/ENVIRST/ZOOLOGY 260",
            "title": "INTRODUCTORY ECOLOGY"
        }
    },
    {
        "data": {
            "description": "The second of two seminars for planning the field work, analysis, and reporting of the practicum.",
            "id": "CIVENGR/ENVIRST/URBRPL 718",
            "title": "WATER RESOURCES MANAGEMENT PRACTICUM PLANNING SEMINAR II"
        }
    },
    {
        "data": {
            "description": "The tools and techniques used in the economic approach to policy analysis. Emphasis is on applying these methodological tools to evaluating existing public policies and policy alternatives, as well as providing a deeper understanding of how the economy operates.",
            "id": "PUBAFFR 880",
            "parent": "PUBAFFR",
            "title": "MICROECONOMIC POLICY ANALYSIS"
        }
    },
    {
        "data": {
            "description": "The two semester sequenceMATH 112-MATH 113covers similar material asMATH 114, but in a slower pace. Not recommended for students with less than an AB inMATH 96.",
            "id": "MATH 114",
            "parent": "MATH",
            "title": "ALGEBRA AND TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "Topics covered within the scope of environmental humanities, such as themes in environmental ethics, literature, art, film, aesthetics and design, history, and indigenous knowledge.",
            "id": "ENVIRST 404",
            "parent": "ENVIRST",
            "title": "SPECIAL TOPICS IN ENVIRONMENTAL HUMANITIES"
        }
    },
    {
        "data": {
            "description": "Topics covered within the scope of environmental social sciences, such as issues in environmental policy, law, economics, land use, sustainability, food systems, energy policy, conflict resolution, environmental justice, and international development.",
            "id": "ENVIRST 402",
            "parent": "ENVIRST",
            "title": "SPECIAL TOPICS: SOCIAL PERSPECTIVES IN ENVIRONMENTAL STUDIES"
        }
    },
    {
        "data": {
            "description": "Topics covered within the scope of the environmental biological sciences, such as conservation biology, environmental ecology, issues in ethnobotany and tropical ecology, environmental health, ecotoxicology, biodiversity, endangered resources, biological systems analysis, and field studies.",
            "id": "ENVIRST 400",
            "parent": "ENVIRST",
            "title": "SPECIAL TOPICS IN THE ENVIRONMENT: BIOLOGICAL ASPECTS OF ENVIR ST"
        }
    },
    {
        "data": {
            "description": "Topics covered within the scope of the physical environmental sciences, such as issues in energy resources, environmental measurement and analysis, modeling, remote sensing and GIS, environmental engineering and transportation, air and water resources, and global climate change.",
            "id": "ENVIRST 401",
            "parent": "ENVIRST",
            "title": "SPECIAL TOPICS: ENVIRONMENTAL PERSPECTIVES IN THE PHYSICAL SCIENCES"
        }
    },
    {
        "data": {
            "description": "Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Part of a 2-semester sequence withMATH 217; these two courses together are equivalent toMATH 114and221.",
            "id": "MATH 171",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY I"
        }
    },
    {
        "data": {
            "description": "Topics in earth system science. Emphasis on the coupling between atmospheric, oceanic and land surface systems, involving physical geochemical and biological processes, and including interactions with human systems.",
            "id": "ATMOCN/BOTANY/ENVIRST/F&WECOL/GEOG/GEOSCI/ZOOLOGY 980",
            "title": "EARTH SYSTEM SCIENCE SEMINAR"
        }
    },
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics and selected topics in Animal Physiology.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Topics include: selected topics in plant physiology, a survey of the five major kingdoms of organisms, speciation and evolutionary theory, and ecology at multiple levels of the biological hierarchy.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Toxicologic, controlled and epidemiologic studies on major air pollutants. Overview of study methods, lung physiology and pathology; air pollution sources, types, meteorology, sampling methods, controls and regulations.",
            "id": "ENVIRST/POPHLTH 502",
            "title": "AIR POLLUTION AND HUMAN HEALTH"
        }
    },
    {
        "data": {
            "description": "Traces the history and evolution of the American cultural landscape from precolonial times to present. Explores how class, ethnic, and racial inequality have shaped the appearance of the American landscape over time, and how that landscape in turn has affected relationships between people and groups through the present day. Examines extraordinary things (civic structures (like our State Capitol), National Parks, War Memorials) and more ordinary kinds of places (mining towns, cotton plantations, sites of recreation and leisure, and suburban tract housing) to stimulate critical thinking about how these places have served people and groups unequally and disproportionately over time and across space. Considers complex meanings of American spaces and places to different people and groups, stimulating empathy and encouraging participation in a multicultural society.",
            "id": "ARTHIST/ENVIRST/GEOG/HISTORY/LANDARC 239",
            "title": "MAKING THE AMERICAN LANDSCAPE"
        }
    },
    {
        "data": {
            "description": "Tracks the evolution of mass media coverage of science and the environment. Emphasis on how journalists utilize evidence, the influence of scientific and journalistic norms on stories, and the effects of mass media on science and environment messages to the public.",
            "id": "ENVIRST/JOURN/LSC 823",
            "title": "SCIENCE AND ENVIRONMENT COMMUNICATION"
        }
    },
    {
        "data": {
            "description": "Types, origins, settings, and structure of wetlands. Physical, biological, and cultural values, uses and assessments. Physical and biological characteristics and dynamics. Protection, management and restoration.",
            "id": "ENVIRST/LANDARC 361",
            "title": "WETLANDS ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Understand the theory and practice the skills of effective, scientific, ethical, and legitimate preservation of nature (biodiversity, the atmosphere, water, etc.). Learn from global lessons in how to intervene against threats to nature, and the roles of ethics, law, and research in preserving nature. Gain mastery of terminology and usage so as to communicate professionally about nature preservation.",
            "id": "ENVIRST 413",
            "parent": "ENVIRST",
            "title": "PRESERVING NATURE"
        }
    },
    {
        "data": {
            "description": "Use of satellite imagery and measurements in meteorological research and operations; orbital characteristics; navigation; instrumentation.",
            "id": "ATMOCN/ENVIRST 745",
            "title": "METEOROLOGICAL SATELLITE APPLICATIONS"
        }
    },
    {
        "data": {
            "description": "What are sources on which members of religious communities draw in order to understand and address environmental change? Explores how religious persons and communities confront global environmental questions and challenges today, with case studies drawn from culturally and religiously plural societies such as India and Indonesia. Introducing diverse varieties of Christianity, Islam, and Hindu and Buddhist systems, gives overview of some approaches in the environmental humanities related to philosophy, history, sociology and anthropology, and ethics.",
            "id": "ENVIRST/RELIGST 270",
            "title": "THE ENVIRONMENT: RELIGION & ETHICS"
        }
    },
    {
        "data": {
            "description": "What do we really mean when we use the word, environment, in interdisciplinary Environmental Studies, and how important is it to have our environment be meaningful? Considers five popular understandings, while also offering a global perspective on environmental humanities. Introduction to key American texts (Carson, Kimmerer, Leopold, etc.) and key concepts (like sustainability and the Anthropocene), along with core skills from fields like philosophy, ethics, literature, fine arts, history, politics and anthropology. Cases in environmental experience and expression range from Wisconsin to Asia, and across biotic and abiotic environments. Through discussions and assignments, answer fundamental questions about science, nature, environmental problems and crisis, and how to relate to others in our world as human beings.",
            "id": "ENVIRST 113",
            "parent": "ENVIRST",
            "title": "ENVIRONMENTAL STUDIES: ENVIRONMENTAL HUMANITIES"
        }
    },
    {
        "data": {
            "description": "Why trust science? Examine critically the strengths and weaknesses of Western science in light of new efforts at overcoming the reproducibility crisis. Examine successes and failures in fostering open science focusing on ecological research in its broadest sense, although relevant to many fields of inquiry. In line with the mission of the Nelson Institute for Environmental Studies, take an interdisciplinary look at reproducibility and scientific integrity. Find out why and why not to rely on the scientific communications of individual researchers and interest groups that showcase their preferred evidence.",
            "id": "ENVIRST 613",
            "parent": "ENVIRST",
            "title": "REPRODUCIBILITY CRISES AND OPEN SCIENCE IN ENVIRONMENTAL STUDIES"
        }
    },
    {
        "data": {
            "description": "Writing-intensive with opportunities to make observations and generate and test questions. Includes ecology field trips and research projects that focus on genetics and evolution.",
            "id": "BIOCORE 382",
            "parent": "BIOCORE",
            "title": "EVOLUTION, ECOLOGY, AND GENETICS LABORATORY"
        }
    },
    {
        "data": {
            "id": "AAE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ATMOCN",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "BIOCORE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ENVIRST",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "GEOSCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "PUBAFFR",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "SOILSCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "SPANISH",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "AAE 101",
            "target": "AAE/CIVENGR/ENVIRST/URBRPL 561"
        }
    },
    {
        "data": {
            "source": "AAE 101",
            "target": "AAE/ECON/ENVIRST 343"
        }
    },
    {
        "data": {
            "source": "AAE 101",
            "target": "AAE/ECON/ENVIRST/URBRPL 671"
        }
    },
    {
        "data": {
            "source": "ATMOCN 100",
            "target": "ATMOCN 101"
        }
    },
    {
        "data": {
            "source": "ATMOCN 101",
            "target": "ATMOCN 100"
        }
    },
    {
        "data": {
            "source": "ATMOCN 101",
            "target": "ATMOCN/ENVIRST 520"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "BIOCORE 382"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "ENVIRST/F&WECOL/ZOOLOGY 360"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "ENVIRST/ZOOLOGY 510"
        }
    },
    {
        "data": {
            "source": "BIOCORE 382",
            "target": "ENVIRST/F&WECOL/ZOOLOGY 360"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 152"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 101"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "target": "ATMOCN/ENVIRST 520"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "target": "BOTANY/F&WECOL/ZOOLOGY 460"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "target": "ENVIRST/LANDARC 361"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "target": "ENVIRST/ZOOLOGY 315"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 151"
        }
    },
    {
        "data": {
            "source": "BOTANY/ENVIRST/ZOOLOGY 260",
            "target": "ENVIRST 413"
        }
    },
    {
        "data": {
            "source": "BOTANY/F&WECOL/ZOOLOGY 460",
            "target": "BOTANY/ENVIRST/F&WECOL/ZOOLOGY 651"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 140",
            "target": "C&ESOC/ENVIRST/SOC 540"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "SOILSCI 301"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 109"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "ENVIRST/SOILSCI 324"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CIVENGR/ENVIRST/GEOG 377",
            "target": "ENVIRST/GEOG/LANDARC/URBRPL 532"
        }
    },
    {
        "data": {
            "source": "CIVENGR/ENVIRST/GEOG 377",
            "target": "ENVIRST/LANDARC/SOILSCI 695"
        }
    },
    {
        "data": {
            "source": "CIVENGR/ENVIRST/URBRPL 718",
            "target": "CIVENGR/ENVIRST/URBRPL 719"
        }
    },
    {
        "data": {
            "source": "ENVIRST 112",
            "target": "ENVIRST/GEOG 337"
        }
    },
    {
        "data": {
            "source": "ENVIRST/F&WECOL/GEOG/GEOSCI/GLE/LANDARC 371",
            "target": "CIVENGR/ENVIRST/LANDARC 556"
        }
    },
    {
        "data": {
            "source": "ENVIRST/F&WECOL/GEOG/GEOSCI/GLE/LANDARC 371",
            "target": "ENVIRST 931"
        }
    },
    {
        "data": {
            "source": "ENVIRST/F&WECOL/GEOG/GEOSCI/GLE/LANDARC 371",
            "target": "ENVIRST 956"
        }
    },
    {
        "data": {
            "source": "ENVIRST/F&WECOL/GEOG/GEOSCI/GLE/LANDARC 371",
            "target": "ENVIRST 971"
        }
    },
    {
        "data": {
            "source": "ENVIRST/GEOG 120",
            "target": "ENVIRST/GEOG 127"
        }
    },
    {
        "data": {
            "source": "ENVIRST/GEOG 127",
            "target": "ENVIRST/GEOG 120"
        }
    },
    {
        "data": {
            "source": "ENVIRST/GEOG 337",
            "target": "ENVIRST 112"
        }
    },
    {
        "data": {
            "source": "ENVIRST/GEOG 339",
            "target": "ENVIRST/GEOG 537"
        }
    },
    {
        "data": {
            "source": "ENVIRST/GEOSCI 106",
            "target": "GEOSCI 100"
        }
    },
    {
        "data": {
            "source": "ENVIRST/ZOOLOGY 510",
            "target": "ENVIRST/ZOOLOGY 511"
        }
    },
    {
        "data": {
            "source": "GEOSCI 100",
            "target": "ENVIRST/GEOSCI 106"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "BSE/ENVIRST 367"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 113"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "SOILSCI 301"
        }
    },
    {
        "data": {
            "source": "MATH 113",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 114",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 114"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "ENVIRST/F&WECOL/GEOG/GEOSCI/GLE/LANDARC 371"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "CIVENGR/ENVIRST/GEOSCI/GLE 444"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "CHEM 109"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 114"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "PUBAFFR 818",
            "target": "AAE/ENVIRST/POPHLTH/PUBAFFR 881"
        }
    },
    {
        "data": {
            "source": "PUBAFFR 880",
            "target": "AAE/ENVIRST/POPHLTH/PUBAFFR 881"
        }
    },
    {
        "data": {
            "source": "SOILSCI 301",
            "target": "ENVIRST/GEOG/SOILSCI 230"
        }
    },
    {
        "data": {
            "source": "SPANISH 223",
            "target": "ENVIRST/SPANISH 445"
        }
    },
    {
        "data": {
            "source": "SPANISH 224",
            "target": "ENVIRST/SPANISH 445"
        }
    },
    {
        "data": {
            "source": "SPANISH 226",
            "target": "SPANISH 223"
        }
    },
    {
        "data": {
            "source": "SPANISH 226",
            "target": "SPANISH 224"
        }
    },
    {
        "data": {
            "source": "SPANISH 226",
            "target": "SPANISH 311"
        }
    },
    {
        "data": {
            "source": "SPANISH 311",
            "target": "SPANISH 226"
        }
    }
]