[
    {
        "data": {
            "description": "Methods of higher mathematics; stress on problem solving rather than rigorous proofs; linear algebra, calculus of variations, Green's function.",
            "id": "EMA/EP 547",
            "title": "ENGINEERING ANALYSIS I"
        }
    },
    {
        "data": {
            "description": "Accelerated coverage of topics in general chemistry, including introduction to laboratory techniques. Topics include atomic and molecular structure, chemical equilibrium, acid-base chemistry, thermodynamics, kinetics, and electrochemistry.",
            "id": "CHEM 109",
            "parent": "CHEM",
            "title": "ADVANCED GENERAL CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "An introduction to current research topics in engineering physics. Development of an undergraduate research proposal supervised by faculty members.",
            "id": "EP 469",
            "parent": "EP",
            "title": "RESEARCH PROPOSAL IN ENGINEERING PHYSICS"
        }
    },
    {
        "data": {
            "description": "An introduction to linear algebra and differential equations with emphasis on the relationship between the theory of linear algebra and analytical and numerical techniques for solving differential equations. Linear algebra topics include linear systems, matrices and their algebra, vector spaces and linear transformations, eigenvalues and eigenvectors. Topics from differential equations include first order ODE, homogeneous and nonhomogeneous linear systems, and numerical methods.",
            "id": "MATH 320",
            "parent": "MATH",
            "title": "LINEAR ALGEBRA AND DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "description": "An introduction to linear algebra. Topics include matrix algebra, linear systems of equations, vector spaces, sub-spaces, linear dependence, span, basis, rank of matrices, determinants, linear transformations, coordinate representations, kernel, range, eigenvalues and eigenvectors, diagonalization, inner products and orthogonal vectors, symmetric matrices. Covers linear algebra topics in greater depth and detail thanMATH 320. Formal techniques in mathematical argument [MATH 341] not covered.",
            "id": "MATH 340",
            "parent": "MATH",
            "title": "ELEMENTARY MATRIX AND LINEAR ALGEBRA"
        }
    },
    {
        "data": {
            "description": "An introduction to micro- and nanoscale science and engineering with a focus on the role of mechanics. A variety of micro- and nanoscale phenomena and applications covered, drawing connections to both established and new mechanics approaches.",
            "id": "EMA/EP 615",
            "title": "MICRO- AND NANOSCALE MECHANICS"
        }
    },
    {
        "data": {
            "description": "An introduction to the conduct of engineering research: the scientific method, ethics in research, documentation and treatment of research data, publication practices, and the structure of the broader research community are covered.",
            "id": "EP 468",
            "parent": "EP",
            "title": "INTRODUCTION TO ENGINEERING RESEARCH"
        }
    },
    {
        "data": {
            "description": "An overview of hardware and software solutions that enable the use of advanced computing in tackling computationally intensive Engineering problems. Hands-on learning promoted through programming assignments that leverage emerging hardware architectures and use parallel computing programming languages. Students are strongly encourage to have completed COMP SCI 367 orCOMP SCI 400or to have equivalent experience.",
            "id": "COMPSCI/ECE/EMA/EP/ME 759",
            "title": "HIGH PERFORMANCE COMPUTING FOR APPLICATIONS IN ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Applications of cryogenics, material properties at low temperatures, refrigeration and liquefaction systems, measurement techniques, insulation, storage and transfer of cryogenics, safety and handling.",
            "id": "EP/ME 566",
            "title": "CRYOGENICS"
        }
    },
    {
        "data": {
            "description": "Background for professional numerical computation in Linux environments begins with shell scripting and software archiving. Programming skills in a compiled language are then developed through scientific and engineering examples. Engineering problem-solving skills are reinforced through applications that require numerical solutions to systems of differential and/or integral equations, while motivating progressively more advanced computational methods.",
            "id": "EMA/EP 476",
            "title": "INTRODUCTION TO SCIENTIFIC COMPUTING FOR ENGINEERING PHYSICS"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for Physics, AMEP, and Astronomy-Physics majors. Mechanics, waves, thermodynamics and statistical mechanics, topics in modern physics; with computation.  A more mathematically rigorous and in-depth introduction to physics than the other introductory physics sequences.",
            "id": "PHYSICS 247",
            "parent": "PHYSICS",
            "title": "A MODERN INTRODUCTION TO PHYSICS"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for engineering students. Mechanics: kinematics, statics, dynamics; energy and momentum.",
            "id": "PHYSICS 201",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for students majoring in biological sciences. Mechanics: kinematics, statics, dynamics; energy and momentum. Heat and sound.",
            "id": "PHYSICS 207",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "First and second laws of thermodynamics; thermodynamic properties of gases, vapors, and gas-vapor mixtures; energy-systems analysis including power cycles, refrigeration cycles and air-conditioning processes. Introduction to thermodynamics of reacting mixtures.",
            "id": "ME 361",
            "parent": "ME",
            "title": "THERMODYNAMICS"
        }
    },
    {
        "data": {
            "description": "First order differential equations, introduction to multivariable calculus and constrained optimization, infinite sequences and series, methods of approximation, and a brief introduction to probability. Models and applications from business and the social sciences.",
            "id": "MATH 213",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 2"
        }
    },
    {
        "data": {
            "description": "Function of complex variable, series solution of differential equations, partial differential equations. A year of math beyond calculus",
            "id": "EMA/EP 548",
            "title": "ENGINEERING ANALYSIS II"
        }
    },
    {
        "data": {
            "description": "Fundamental concepts of conduction, convection, radiation. Heat-exchanger principles.",
            "id": "ME 364",
            "parent": "ME",
            "title": "ELEMENTARY HEAT TRANSFER"
        }
    },
    {
        "data": {
            "description": "Gives students an introduction to computer and analytical skills to use in their subsequent course work and professional development. Discusses several methods of using computers to solve problems, including elementary programming techniques, symbolic manipulation languages, and software packages. Techniques will be illustrated using sample problems drawn from elementary engineering. Emphasis is on introduction of algorithms with the use of specific tools to illustrate the methods.",
            "id": "COMPSCI 310",
            "parent": "COMPSCI",
            "title": "PROBLEM SOLVING USING COMPUTERS"
        }
    },
    {
        "data": {
            "description": "Interdisciplinary survey of energy research topics. Understand how sustainable energy challenges are being studied and solved by different disciplines, from science and engineering to social sciences and humanities. Analyze energy sustainability using a multi-disciplinary, systems-based approach.",
            "id": "EP 418",
            "parent": "EP",
            "title": "SUSTAINABLE ENERGY CHALLENGES AND SOLUTIONS"
        }
    },
    {
        "data": {
            "description": "Introduction to calculus of functions of several variables; calculus on parameterized curves, derivatives of functions of several variables, multiple integrals, vector calculus.",
            "id": "MATH 234",
            "parent": "MATH",
            "title": "CALCULUS--FUNCTIONS OF SEVERAL VARIABLES"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Laws of mechanics and thermodynamics applied to fluids at rest and in motion; potential flow; dimensional analysis; viscous flow; pipe flow; boundary-layer theory; compressible flow.",
            "id": "ME 363",
            "parent": "ME",
            "title": "FLUID DYNAMICS"
        }
    },
    {
        "data": {
            "description": "Mass, momentum, and energy transport; calculation of transport coefficients; solution to problems in viscous flow, heat conduction, and diffusion; dimensional analysis; mass, momentum, and heat transfer coefficients; over-all balances; elementary applications.",
            "id": "CBE 320",
            "parent": "CBE",
            "title": "INTRODUCTORY TRANSPORT PHENOMENA"
        }
    },
    {
        "data": {
            "description": "Principles and application of chemical equilibrium, coordination chemistry, oxidation-reduction and electrochemistry, kinetics, nuclear chemistry, introduction to organic chemistry, and chemistry laboratory skills.",
            "id": "CHEM 104",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Principles of mechanics, force systems, equilibrium, structures, distributed forces, moments of inertia of areas, and friction.",
            "id": "EMA 201",
            "parent": "EMA",
            "title": "STATICS"
        }
    },
    {
        "data": {
            "description": "Review of linear differential equations; series solution of linear differential equations; boundary value problems; Laplace transforms; possibly numerical methods and two dimensional autonomous systems.",
            "id": "MATH 319",
            "parent": "MATH",
            "title": "TECHNIQUES IN ORDINARY DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "description": "Solution of engineering problems using commercially-available software tools (spreadsheets, symbolic manipulators, and equation solvers). The emphasis will be on nuclear engineering problems, including radioactive decay, nuclear cross sections, scattering, and criticality.",
            "id": "EP 271",
            "parent": "EP",
            "title": "ENGINEERING PROBLEM SOLVING I"
        }
    },
    {
        "data": {
            "description": "Stoichiometry and the mole concept, the behavior of gases, liquids and solids, thermochemistry, electronic structure of atoms and chemical bonding, descriptive chemistry of selected elements and compounds, intermolecular forces, and chemistry laboratory skills.",
            "id": "CHEM 103",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Stress and strain, torsion, bending of beams, shearing stresses in beams, compound stresses, principal stresses, deflections of beams, statically indeterminate members, columns. For civil engineers.",
            "id": "EMA 303",
            "parent": "EMA",
            "title": "MECHANICS OF MATERIALS"
        }
    },
    {
        "data": {
            "description": "Stress and strain, torsion, bending of beams, shearing stresses in beams, compound stresses, principal stresses, deflections of beams, statically indeterminate members, columns.",
            "id": "ME 306",
            "parent": "ME",
            "title": "MECHANICS OF MATERIALS"
        }
    },
    {
        "data": {
            "description": "Students will be able to enroll for credit more than once because the topics of the course will differ substantially from semester to semester. Our MS requirements permit up to 3 credits within the 30-credit minimum for the degree.",
            "id": "EP 920",
            "parent": "EP",
            "title": "ENGINEERING PHYSICS GRADUATE SEMINAR"
        }
    },
    {
        "data": {
            "description": "Sturm-Liouville theory; Fourier series, including mean convergence; boundary value problems for linear second order partial differential equations, including separation of variables and eigenfunction expansions.",
            "id": "MATH 322",
            "parent": "MATH",
            "title": "APPLIED MATHEMATICAL ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Subject matter, credits and prerequisites vary.",
            "id": "EP 602",
            "parent": "EP",
            "title": "SPECIAL TOPICS IN ENGINEERING PHYSICS"
        }
    },
    {
        "data": {
            "description": "Techniques of integration, improper integrals, first order ordinary differential equations, sequences and series, Taylor series, vector geometry in two and three dimensions.",
            "id": "MATH 222",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 2"
        }
    },
    {
        "data": {
            "description": "The theory of linear algebra with an introduction to proofs and proof writing. Topics include vector spaces, linear dependence, span, basis, linear transformations, kernel, image, inner products and inner product spaces, geometry, eigenvalues, eigenvectors, standard matrix factorizations. Other content includes basic set theory, logical operations, quantifiers, direct and indirect arguments, and induction. Differential equations [MATH 320] not covered.",
            "id": "MATH 341",
            "parent": "MATH",
            "title": "LINEAR ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Topics defining modern vacuum technology, including the kinetic theory of gases, conductance, pumping systems, pump technologies, pressure measurement, gas-surface interactions, sealing technologies, leak detection, and residual gas analysis will be addressed through a combination of lectures, laboratory activities, problem solving, and group discussions. Knowledge of fluid mechanics [such asM E 363or B M E 320] strongly encouraged.",
            "id": "EP/ME 777",
            "title": "VACUUM TECHNOLOGY"
        }
    },
    {
        "data": {
            "description": "Topics in multi-variable calculus and introduction to differential equations.",
            "id": "MATH 376",
            "parent": "MATH",
            "title": "TOPICS IN MULTI-VARIABLE CALCULUS AND DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "description": "Undergraduate research projects supervised by faculty members. Senior thesis.",
            "id": "EP 569",
            "parent": "EP",
            "title": "RESEARCH PRACTICUM IN ENGINEERING PHYSICS II"
        }
    },
    {
        "data": {
            "description": "Undergraduate research projects supervised by faculty members.",
            "id": "EP 568",
            "parent": "EP",
            "title": "RESEARCH PRACTICUM IN ENGINEERING PHYSICS I"
        }
    },
    {
        "data": {
            "description": "Use of computational tools for the solution of problems encountered in engineering physics applications. Topics covered include orbital mechanics, structural vibrations, beam and plate deformations, heat transfer, neutron diffusion, and criticality. Emphasis will be on modeling, choice of appropriate algorithms, and model validation.",
            "id": "EMA/EP 471",
            "title": "INTERMEDIATE PROBLEM SOLVING FOR ENGINEERS"
        }
    },
    {
        "data": {
            "description": "Vector analysis: algebra and geometry of vectors, vector differential and integral calculus, theorems of Green, Gauss, and Stokes; complex analysis: analytic functions, complex integrals and residues, Taylor and Laurent series.",
            "id": "MATH 321",
            "parent": "MATH",
            "title": "APPLIED MATHEMATICAL ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Vector spaces and linear transformations, differential calculus of scalar and vector fields, determinants, eigenvalues and eigenvectors, multiple integrals, line integrals, and surface integrals. Freshmen students are invited to enroll by the Department of Mathematics.",
            "id": "MATH 375",
            "parent": "MATH",
            "title": "TOPICS IN MULTI-VARIABLE CALCULUS AND LINEAR ALGEBRA"
        }
    },
    {
        "data": {
            "id": "CBE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "COMPSCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "EMA",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "EP",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ME",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "PHYSICS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "CBE 320",
            "target": "EP/ME 566"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "ME 361"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 109"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "ME 361"
        }
    },
    {
        "data": {
            "source": "COMPSCI 310",
            "target": "EMA/EP 476"
        }
    },
    {
        "data": {
            "source": "EMA 201",
            "target": "EMA 303"
        }
    },
    {
        "data": {
            "source": "EMA 201",
            "target": "ME 306"
        }
    },
    {
        "data": {
            "source": "EMA 303",
            "target": "EMA/EP 615"
        }
    },
    {
        "data": {
            "source": "EMA/EP 547",
            "target": "EMA/EP 548"
        }
    },
    {
        "data": {
            "source": "EP 271",
            "target": "EMA/EP 471"
        }
    },
    {
        "data": {
            "source": "EP 271",
            "target": "EMA/EP 476"
        }
    },
    {
        "data": {
            "source": "EP 468",
            "target": "EP 469"
        }
    },
    {
        "data": {
            "source": "EP 469",
            "target": "EP 568"
        }
    },
    {
        "data": {
            "source": "EP 568",
            "target": "EP 569"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 213"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 213",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 222"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "COMPSCI 310"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "EMA 201"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "EMA 303"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 234"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 319"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 320"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 340"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "ME 306"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "PHYSICS 247"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "MATH 321"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "MATH 341"
        }
    },
    {
        "data": {
            "source": "MATH 319",
            "target": "EMA/EP 471"
        }
    },
    {
        "data": {
            "source": "MATH 319",
            "target": "EMA/EP 476"
        }
    },
    {
        "data": {
            "source": "MATH 319",
            "target": "EMA/EP 548"
        }
    },
    {
        "data": {
            "source": "MATH 319",
            "target": "MATH 321"
        }
    },
    {
        "data": {
            "source": "MATH 319",
            "target": "ME 363"
        }
    },
    {
        "data": {
            "source": "MATH 320",
            "target": "EMA/EP 471"
        }
    },
    {
        "data": {
            "source": "MATH 320",
            "target": "EMA/EP 548"
        }
    },
    {
        "data": {
            "source": "MATH 320",
            "target": "MATH 321"
        }
    },
    {
        "data": {
            "source": "MATH 321",
            "target": "EMA/EP 547"
        }
    },
    {
        "data": {
            "source": "MATH 321",
            "target": "MATH 322"
        }
    },
    {
        "data": {
            "source": "MATH 322",
            "target": "EMA/EP 548"
        }
    },
    {
        "data": {
            "source": "MATH 340",
            "target": "EMA/EP 548"
        }
    },
    {
        "data": {
            "source": "MATH 340",
            "target": "MATH 321"
        }
    },
    {
        "data": {
            "source": "MATH 341",
            "target": "MATH 321"
        }
    },
    {
        "data": {
            "source": "MATH 375",
            "target": "MATH 321"
        }
    },
    {
        "data": {
            "source": "MATH 375",
            "target": "MATH 376"
        }
    },
    {
        "data": {
            "source": "MATH 376",
            "target": "MATH 321"
        }
    },
    {
        "data": {
            "source": "MATH 376",
            "target": "MATH 322"
        }
    },
    {
        "data": {
            "source": "ME 306",
            "target": "EMA/EP 615"
        }
    },
    {
        "data": {
            "source": "ME 361",
            "target": "EP/ME 566"
        }
    },
    {
        "data": {
            "source": "ME 361",
            "target": "ME 363"
        }
    },
    {
        "data": {
            "source": "ME 361",
            "target": "ME 364"
        }
    },
    {
        "data": {
            "source": "ME 363",
            "target": "ME 364"
        }
    },
    {
        "data": {
            "source": "ME 364",
            "target": "EP/ME 566"
        }
    },
    {
        "data": {
            "source": "PHYSICS 201",
            "target": "CBE 320"
        }
    },
    {
        "data": {
            "source": "PHYSICS 201",
            "target": "EP 271"
        }
    },
    {
        "data": {
            "source": "PHYSICS 201",
            "target": "PHYSICS 207"
        }
    },
    {
        "data": {
            "source": "PHYSICS 207",
            "target": "CBE 320"
        }
    },
    {
        "data": {
            "source": "PHYSICS 207",
            "target": "PHYSICS 201"
        }
    },
    {
        "data": {
            "source": "PHYSICS 247",
            "target": "EP 271"
        }
    }
]