[
    {
        "data": {
            "description": "Addresses strategies, models, and practices for leading and managing engineering organizations in a context directly relevant to practicing engineers.  Engage in self-reflection about styles, beliefs, and past experiences with leadership and management.  Course project of direct relevance to student's organization will integrate theory, models, case studies, and real-time experiences from student's workplace.  Gain broad exposure to diverse approaches to leadership and management, and a deeper understanding of how to put what is being learned into effective action.",
            "id": "EPD 618",
            "parent": "EPD",
            "title": "APPLIED LEADERSHIP AND MANAGEMENT OF ENGINEERING ORGANIZATIONS"
        }
    },
    {
        "data": {
            "description": "An overview of marketing's role within an organization, the key elements of a marketing plan, and how the plan is implemented. Students will learn about buyer demographic, psychographic and purchasing decision behavior. A thorough understanding of the customer enables students to develop a coordinated marketing mix (product, price promotion and place) that will satisfy the customer better than the competition and at the required margin. Students will leave the course understanding the degree to which all company functions must be coordinated and focused on the customer. This course will not apply toward fulfilling the MBA degree requirements.",
            "id": "EPD/GENBUS/MARKETNG 782",
            "title": "MARKETING FOR NON-MARKETING PROFESSIONALS"
        }
    },
    {
        "data": {
            "description": "Build the foundations for developing, refining, and strengthening your effectiveness as a leader of engineering teams, projects, and organizations. Enhance your understanding of how to match your leadership style to a team's focus, organization, and culture. Grow your understanding of your strengths and weaknesses as a leader using proven assessment tools. Develop a plan for growing your leadership competency.",
            "id": "EPD 710",
            "parent": "EPD",
            "title": "FOUNDATIONS OF ENGINEERING LEADERSHIP"
        }
    },
    {
        "data": {
            "description": "Enhances the learners' basic business and decision-making skills related to quality systems and process improvement.",
            "id": "EPD 518",
            "parent": "EPD",
            "title": "QUALITY ENGINEERING AND QUALITY MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Explore the environmental impacts of commercial and residential buildings, including energy, water, materials, transportation, waste, human health, and land use. All phases of a building's life cycle will be considered, along with relevant case studies, benchmarking tools, public policies and emerging concepts.",
            "id": "EPD 730",
            "parent": "EPD",
            "title": "SUSTAINABLE FACILITIES"
        }
    },
    {
        "data": {
            "description": "Improves students' negotiating skills, doing so by providing a theoretical underpinning that will help them to understand the sources of effective and ineffective approaches to negotiations.",
            "id": "EPD/GENBUS/MHR 785",
            "title": "EFFECTIVE NEGOTIATION STRATEGIES"
        }
    },
    {
        "data": {
            "description": "Introduction to Python's concepts of objects and reference; classes and nested objects. Elements of object-oriented programming in Python. Container types: lists, dictionaries, and tuples. Installing Python packages and managing environments. Scientific computing with Numpy and SciPy. Applications of Python to Data Analysis. Applications of Python to Machine Learning. Applications of Python to embedded systems/robotics.",
            "id": "EPD 455",
            "parent": "EPD",
            "title": "PYTHON FOR APPLICATIONS IN ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Addresses important legal issues especially relevant to the practice of engineering. Gain awareness and ability to properly address patents, trade secrets, contracts, employment and non-disclosure agreements, as well as product and professional liability. Learn to avoid legal problems that often affect engineering projects and organizations.",
            "id": "EPD 616",
            "parent": "EPD",
            "title": "ENGINEERING LAW"
        }
    },
    {
        "data": {
            "description": "Addresses principles and practices of interpreting financial information and performing engineering-related economic analyses. Focuses on the practical use of economic information for decision-making.",
            "id": "EPD 611",
            "parent": "EPD",
            "title": "ENGINEERING ECONOMICS AND MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Application of fundamental fluid dynamics and thermodynamics principles to intake air boosting for internal combustion engines. Turbocharger and Supercharger design and operating principles, applications to engine system design. Includes both simple, single-stage systems, and multi-stage systems (series, series-sequential, parallel-sequential). Pulse conservation and exhaust gas recirculation will be addressed. Includes advanced considerations including the Miller Cycle, turbocompounding, and e-boosting.",
            "id": "EPD 633",
            "parent": "EPD",
            "title": "ENGINE BOOSTING"
        }
    },
    {
        "data": {
            "description": "Basic principles used for both quantitative and qualitative characterization of polymeric materials, including both assessment of their synthesis and of their structural features at different length scales. Discussion of techniques such as NMR (Nuclear Magnetic Resonance) and GPC (Gel Permeation Chromatography), thermal characterization, rheological characterization, as well as scattering of various types of electromagnetic radiation. Introduction to characterization methods used in industry and polymer crystallography.",
            "id": "EPD 637",
            "parent": "EPD",
            "title": "POLYMER CHARACTERIZATION"
        }
    },
    {
        "data": {
            "description": "Builds further experience in engine development project organization; materials and processes; and engine validation. Project organization lessons emphasizing the phases of engine development and the importance of a design freeze with increased scrutiny of design modifications as the engine progresses toward production. Additional engine system components and processes such as forging, plastic molding, and billet machining. Reliability validation expanded to component and system-level validation through rig and engine testing. Test plans calibrated to engine volumes and cost in order to develop an appropriate mechanical development and reliability plan.",
            "id": "EPD 630",
            "parent": "EPD",
            "title": "ENGINE DESIGN III"
        }
    },
    {
        "data": {
            "description": "Communication for engineering, science, and technology; theory and practice in planning, preparing, and critiquing reports, proposals, and workplace correspondence; persuasive argumentation, ethical decision-making strategies, multidisciplinary communication skills, research strategies, collaborative work; oral presentations.",
            "id": "INTEREGR 397",
            "parent": "INTEREGR",
            "title": "ENGINEERING COMMUNICATION"
        }
    },
    {
        "data": {
            "description": "Concepts of vehicle hybridization levels; battery accessories, components, and materials; battery life and management; as well as various failure modes of batteries. Development of equivalent circuit models (ECM) for cells that can be used for real time control and diagnostics.",
            "id": "EPD 621",
            "parent": "EPD",
            "title": "BATTERIES FOR XELECTRIFIED VEHICLES"
        }
    },
    {
        "data": {
            "description": "Core principles of energy use and efficiency in the building sector (residential, commercial, institutional buildings.) Factors that influence energy demand (design, equipment, controls, operation, maintenance). Review of engineering fundamentals of heat transfer, heating and cooling loads, psychrometrics. Topics include building envelope principles (climate, orientation, materials, massing), heating and cooling systems, ventilation  indoor air quality, plumbing  water heating, lighting  daylighting, and internal energy uses (plug loads, equipment). Zero energy building concepts, energy modeling, and energy benchmarking are also covered. Applications include existing building operation and improvement, and new building design and planning.",
            "id": "EPD 731",
            "parent": "EPD",
            "title": "ENERGY EFFICIENCY IN BUILDINGS"
        }
    },
    {
        "data": {
            "description": "Development of hybrid and electric vehicle powertrain and sub-system mathematical models. Simulations of drive cycles for evaluating component, sub-system, or package performance in the vehicle for fuel economy and emissions.",
            "id": "EPD 631",
            "parent": "EPD",
            "title": "ELECTRIFIED VEHICLE-LEVEL MODELING"
        }
    },
    {
        "data": {
            "description": "Develops skills necessary for engineering professionals to communicate technical and managerial information. Covers approaches for communicating to diverse audiences and for action-oriented purposes. Emphasizes communication problem solving and communication efficiency. Includes individual and collaborative projects using oral, written, and electronic media.",
            "id": "EPD 617",
            "parent": "EPD",
            "title": "COMMUNICATING TECHNICAL INFORMATION"
        }
    },
    {
        "data": {
            "description": "Discussion of major trends in the automotive and transportation industry, focused on electrification for hybrids, fuel cells, and fully electric vehicles.",
            "id": "EPD 647",
            "parent": "EPD",
            "title": "TRENDS IN ELECTRIFICATION SEMINAR"
        }
    },
    {
        "data": {
            "description": "Electric drives operation used both in motoring and generating modes necessary in traction applications.  The fundamental drives of brush DC, PM synchronous, reluctance, and induction machines are explored.  Begins with the basics of drives and extends to the device physics of power electronics used in drives.",
            "id": "EPD 646",
            "parent": "EPD",
            "title": "ELECTRIC DRIVES FOR TRACTION APPLICATIONS"
        }
    },
    {
        "data": {
            "description": "Equips practicing engineers and related technical professionals to develop an in-depth understanding of marketing. Learn to partner more effectively with marketing specialists, better market own ideas and projects, gain buy-in from upper management, and better serve internal and external clients.",
            "id": "EPD 614",
            "parent": "EPD",
            "title": "MARKETING FOR TECHNICAL PROFESSIONALS"
        }
    },
    {
        "data": {
            "description": "Examines concepts, management techniques, and current trends in the field of supply chain management with emphasis on topics relevant to engineers. Topics include global logistics, logistics engineering techniques, new product introduction process, purchasing strategy, managing transportation providers, distribution center technology and operations, outsourcing supply chain functions, and an introduction to supply chain information systems.",
            "id": "EPD 678",
            "parent": "EPD",
            "title": "SUPPLY CHAIN MANAGEMENT FOR ENGINEERS"
        }
    },
    {
        "data": {
            "description": "Explore fundamental control concepts for development and analysis, modeling requirements and considerations related to control and diagnostics, and the application of these tools to powertrain systems.",
            "id": "EPD 629",
            "parent": "EPD",
            "title": "POWERTRAIN SYSTEMS AND CONTROLS"
        }
    },
    {
        "data": {
            "description": "Explore innovation and how design thinking is a driver of innovation. Learn to use various design thinking methods and tools for analysis and decision-making.",
            "id": "EPD 708",
            "parent": "EPD",
            "title": "CREATING BREAKTHROUGH INNOVATIONS"
        }
    },
    {
        "data": {
            "description": "Explores how our actions affect others and influence the choices we make within the workplace. Enhance ethical competencies by providing opportunities to discuss challenges to behavior and decision-making in different professional contexts.",
            "id": "EPD 712",
            "parent": "EPD",
            "title": "ETHICS FOR PROFESSIONALS"
        }
    },
    {
        "data": {
            "description": "Fundamental development of the science and engineering underlying the design of exhaust aftertreatment (catalyst) systems for automotive (internal combustion engine containing) systems. Emphasis is on gasoline and diesel, spark-ignition and compression-ignition combustion engines, though the same fundamentals may be applied to other fuels or combustion types. Introductory material is included on aspects that are related to emissions, including regulatory standards, gasoline and diesel engine basics, fuels, lubricants, combustion, instrumentation, and formation of pollutants. Several causes of emissions and pollutants are intertwined throughout the various topics and the control and treatment of specific emissions species are discussed by device type.",
            "id": "EPD 635",
            "parent": "EPD",
            "title": "EXHAUST AFTERTREATMENT SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Improve your problem solving within complex organizations, with a special emphasis on case studies and improving communication, using cross-disciplinary sources.",
            "id": "EPD 704",
            "parent": "EPD",
            "title": "ORGANIZATIONAL COMMUNICATION AND PROBLEM SOLVING"
        }
    },
    {
        "data": {
            "description": "Internship with local corporation, industry, government agency, or educational unit. Includes classroom components: use and misuse of social media; managing workplace-related conflicts; communicating technical information to colleagues; identifying and resolving engineering ethics challenges; practicing group discussion and presentation skills.",
            "id": "EPD 398",
            "parent": "EPD",
            "title": "TECHNICAL COMMUNICATIONS INTERNSHIP"
        }
    },
    {
        "data": {
            "description": "Introduces real-world pragmatic skills and applications in sustainability competencies.  Content reaches across engineering expertise, from chemical engineering to buildings to product design and energy.  Modules cover ecological footprinting, lifecycle assessment, resource use and integrated engineering practice.",
            "id": "EPD 660",
            "parent": "EPD",
            "title": "CORE COMPETENCIES OF SUSTAINABILITY"
        }
    },
    {
        "data": {
            "description": "Introduces the engineer to fundamental NVH (Noise, Vibration, and Harshness) concepts with an emphasis on how NVH can be integrated throughout the engine development process from initial concept inception through to validation testing for production.",
            "id": "EPD 720",
            "parent": "EPD",
            "title": "ENGINE NOISE AND VIBRATION"
        }
    },
    {
        "data": {
            "description": "Introduction to coatings, especially focusing on the polymer science and chemistry in these coatings. Chemistry behind these coatings, physical science such as film formation, and the role of various additives used in common formulations.",
            "id": "EPD 638",
            "parent": "EPD",
            "title": "POLYMER COATINGS"
        }
    },
    {
        "data": {
            "description": "Introduction to polymer rheology. Concepts of continuum mechanics are introduced, specifically the fluid dynamics of non-Newtonian and linear viscoelastic fluids. Material functions, constitutive equations and rheometry and experimental methods for measuring material functions (rheometry) are discussed. Knowledge of linear differential equations [such asMATH 319or320] and fluid mechanics [such asM E 363] or momentum transfer [such asCBE 320] required.",
            "id": "EPD 640",
            "parent": "EPD",
            "title": "INTRODUCTORY POLYMER RHEOLOGY"
        }
    },
    {
        "data": {
            "description": "Introduction to teaching and learning in science and engineering at the college level. Includes exploration of the learning process, teaching methodology, assessment strategies, course design, teaching philosophies, and careers in education, science, and engineering.",
            "id": "EPD 654",
            "parent": "EPD",
            "title": "TEACHING IN SCIENCE AND ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Introduction to the chemistry and physics of polymeric materials. Concepts of polymer synthesis as well as physical properties are introduced, including molecular weight, chain conformation, step growth and chain growth kinetics, basic rheology and viscoelasticity as well as glass transition and crystallinity.",
            "id": "EPD 636",
            "parent": "EPD",
            "title": "INTRODUCTION TO POLYMERS"
        }
    },
    {
        "data": {
            "description": "Introduction to the principles of polymer processing. Review of the basic techniques primarily in use by industry as well as foundational principles of polymer physics, viscoelasticity and rheology. Focus on understanding how design of process is used to achieve desired structure and properties. Includes introduction to topics such as 3-d printing and recycling of polymer waste in the context of reprocessing such materials.",
            "id": "EPD 650",
            "parent": "EPD",
            "title": "INTRODUCTION TO POLYMERS PROCESSING"
        }
    },
    {
        "data": {
            "description": "Key team management concepts, principles, and practices. Team dynamics, team roles, leading and facilitating teamwork, and managing team conflict in the context of STEM (science, technology, engineering, and mathematics)-related work.",
            "id": "EPD 606",
            "parent": "EPD",
            "title": "LEADING AND MANAGING TECHNICAL TEAMS"
        }
    },
    {
        "data": {
            "description": "Learn key principles and tools of project management applicable to a broad range of engineering projects. Covers techniques for project planning, scheduling, resource allocation, and project tracking, as well as the interface between projects and the organizations within which they are executed.",
            "id": "EPD 612",
            "parent": "EPD",
            "title": "TECHNICAL PROJECT MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Learn techniques to plan, execute, and deliver projects with desired scope on time and on budget. Document clear project objectives and goals, accurately estimate project time and costs, schedule and allocate time-critical resources, and establish feedback systems for optimal project control. Best paired with a work experience, such as an internship or co-op, where you can apply these project management skills.",
            "id": "EPD 605",
            "parent": "EPD",
            "title": "FUNDAMENTALS OF TECHNICAL PROJECT MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Learn to develop vision, culture, and practices that value and drive innovation within engineering and technical organizations. Grow your ability to build an enterprise that values, pursues, and delivers innovative technical services and products.",
            "id": "EPD 619",
            "parent": "EPD",
            "title": "FOSTERING AND LEADING INNOVATION"
        }
    },
    {
        "data": {
            "description": "Micro, mild, full, and plug-in electrical powertrain systems, their components and the interactions between them, with special attention paid to generators, motors, and inverters. Learn about key metrics for sizing and matching components based on performance.",
            "id": "EPD 620",
            "parent": "EPD",
            "title": "ELECTRIFIED POWERTRAIN SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Preparation to produce effective written communication that is suitable for inter-professional and inter-disciplinary audiences in a variety of workplaces. Apply these strategies and tools.",
            "id": "EPD 701",
            "parent": "EPD",
            "title": "WRITING FOR PROFESSIONALS"
        }
    },
    {
        "data": {
            "description": "Principles and theory of effective oral technical presentations. Provides a framework for applying the principles in professional settings common to the engineering profession. Preparation, delivery, and evaluation of oral presentation on technical subjects, analysis of professional \"real-world\" technical presentations, survey of presentation technology, self-analysis including listening and non-verbal skills, and practice of group discussion and interview skills.",
            "id": "EPD 275",
            "parent": "EPD",
            "title": "TECHNICAL PRESENTATIONS"
        }
    },
    {
        "data": {
            "description": "Problem definition and planning, tool selection, model construction, calibration, application and data presentation in order to integrate the most appropriate modeling tools into an engine design and development project.",
            "id": "EPD 627",
            "parent": "EPD",
            "title": "PERSPECTIVES ON ENGINE MODELING SEMINAR"
        }
    },
    {
        "data": {
            "description": "Provides a deeper understanding of various elements of culture related to business, avoiding the pitfalls, and finding the complementary strengths that will benefit the business. International strategy and the managerial implications such as product, country, location, and organization choices for a multinational engineering operation will be assessed, analyzed and applied. Further discussion will be focused on multi-cultural organization issues and exploring best practices.",
            "id": "EPD 613",
            "parent": "EPD",
            "title": "INTERNATIONAL ENGINEERING STRATEGIES AND PRACTICES"
        }
    },
    {
        "data": {
            "description": "Provides a physically based understanding of combustion, efficiency, and exhaust emission formation and control in internal combustion engines.",
            "id": "EPD 624",
            "parent": "EPD",
            "title": "ENGINE PERFORMANCE AND COMBUSTION"
        }
    },
    {
        "data": {
            "description": "Provides a physically based understanding of gas dynamics with applications to internal combustion engines.",
            "id": "EPD 625",
            "parent": "EPD",
            "title": "ENGINE GAS DYNAMICS"
        }
    },
    {
        "data": {
            "description": "Provides an advanced understanding of internal combustion engine design.",
            "id": "EPD 623",
            "parent": "EPD",
            "title": "ENGINE DESIGN II"
        }
    },
    {
        "data": {
            "description": "Provides an understanding of engine applications, customer need assessment, and engineering product planning.",
            "id": "EPD 622",
            "parent": "EPD",
            "title": "ENGINE DESIGN I"
        }
    },
    {
        "data": {
            "description": "Provides emerging and practicing professionals foundational knowledge to develop a change management strategy and implement it using proven processes and tools. Become better prepared to deliver effective organizational performance. Applies contemporary concepts and methods in change management through student-selected projects.",
            "id": "EPD 706",
            "parent": "EPD",
            "title": "CHANGE MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Provides knowledge and skills to apply statistics to many types of engineering problems. Focuses on developing statistically-based experimental techniques and tests for measures of validity, application of computer-based statistical tools, and approaches to distillation of data.",
            "id": "EPD 416",
            "parent": "EPD",
            "title": "ENGINEERING APPLICATIONS OF STATISTICS"
        }
    },
    {
        "data": {
            "description": "Provides the opportunity to demonstrate ability to think globally, sustainably, and creatively. Gain real-world experience by applying theory, tools, and research to conceptualize, analyze, and design a solution to a real-world problem within a social and environmental context. Showcase the knowledge and analytical skills acquired, and integrate tools, science, and communication to address a community or industry need. Work with an industry mentor and customer throughout your project.",
            "id": "EPD 669",
            "parent": "EPD",
            "title": "SUSTAINABLE SYSTEMS ENGINEERING CAPSTONE"
        }
    },
    {
        "data": {
            "description": "Quantitative and qualitative analysis and visualization tools. Structured decision-making methodology for engineering applications such as variations in materials and production, process control, forecasting and executive decision making. Facilitate persuasive problem-solving and decision making in engineering applications. Builds on foundational knowledge of statistics.",
            "id": "EPD 610",
            "parent": "EPD",
            "title": "ENGINEERING ANALYSIS FOR DECISION MAKING"
        }
    },
    {
        "data": {
            "description": "Reviews the physics of electric machines.  Covers electric machine operation used both in motoring and generating modes necessary in traction applications.  The fundamentals of brush DC, PM synchronous, reluctance, and induction machines are explored.  Begins with the basics of DC machines and extends to the concept of field orientation in AC machines.",
            "id": "EPD 645",
            "parent": "EPD",
            "title": "ELECTRIC MACHINES FOR TRACTION APPLICATIONS"
        }
    },
    {
        "data": {
            "description": "Scientifically-based look at trends in energy availability, emission control and regulation, and technological advances to make an assessment of the future of engines and powertrain systems for vehicles throughout the world. Emphasis on trends for sustainable mobility solutions.",
            "id": "EPD 628",
            "parent": "EPD",
            "title": "ANALYSIS OF TRENDS IN ENGINES"
        }
    },
    {
        "data": {
            "description": "Sharpen your ability to create, edit, review, and present information in an efficient, clear, and effective way for your audiences. Develop your presentation skills through a series of presentations related to your professional interests and work.",
            "id": "EPD 702",
            "parent": "EPD",
            "title": "PROFESSIONAL PRESENTATIONS"
        }
    },
    {
        "data": {
            "description": "Students will gain the knowledge and skills to continuously enhance their own team performance and productivity as well as the teams they are involved with. They will also be in a much better position to lead teams effectively.",
            "id": "EPD/GENBUS/MHR 783",
            "title": "LEADING TEAMS"
        }
    },
    {
        "data": {
            "description": "Sustainability and recycling aspects in the life cycles of plastics and polymeric materials. Chemistries that can be used to make polymers from sustainable or renewable sources and biodegradable polymers. Current recycling practices and their limitations including polymer-based materials such as composites and layered packaging. Textile recycling and plastic pollution including microplastics are covered.",
            "id": "EPD 639",
            "parent": "EPD",
            "title": "PLASTICS RECYCLING AND SUSTAINABILITY"
        }
    },
    {
        "data": {
            "description": "Techniques that will help to plan, execute, and deliver projects with desired scope on time and on budget. Learn to document clear project objectives and goals, accurately estimate project time and costs, schedule and allocate time-critical resources, and establish feedback systems for optimal project control.",
            "id": "EPD/GENBUS/OTM 784",
            "title": "PROJECT MANAGEMENT ESSENTIALS"
        }
    },
    {
        "data": {
            "description": "Theory and application of energy methods in engineering; conservation of mass and energy; energy transfer by heat, work and mass; thermodynamic properties; analysis of open and closed systems; the second law of thermodynamics and entropy; vapor and gas power cycles.",
            "id": "EPD 361",
            "parent": "EPD",
            "title": "FUNDAMENTALS OF ENGINE THERMODYNAMICS"
        }
    },
    {
        "data": {
            "description": "This course is designed with a keen awareness for the needs of the non-financial student or professional. For this class, no previous financial training is required. The intent is to equip you with the essential concepts used to develop financial literacy. Content will cover basic financial terms and reports, analytical tools to help interpret financial data and using financial data in budgets and forecasts.",
            "id": "ACCTIS/EPD/GENBUS 781",
            "title": "FINANCIAL AND BUSINESS ACUMEN"
        }
    },
    {
        "data": {
            "description": "Topics vary.",
            "id": "EPD 690",
            "parent": "EPD",
            "title": "SPECIAL TOPICS IN ENGINEERING PROFESSIONAL DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Under faculty supervision.",
            "id": "EPD 499",
            "parent": "EPD",
            "title": "SENIOR INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Under faculty supervision.",
            "id": "EPD 699",
            "parent": "EPD",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Use the 1st and 2nd laws of thermodynamics in the analysis of engines. Use ideal gas mixtures, thermodynamics and combustion principles to determine adiabatic flame temperature and chemical equilibrium - with focus on Engine Systems",
            "id": "EPD 642",
            "parent": "EPD",
            "title": "THERMODYNAMICS OF ENGINE SYSTEMS"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "EPD",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "INTEREGR",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "EPD 622",
            "target": "EPD 623"
        }
    },
    {
        "data": {
            "source": "EPD 623",
            "target": "EPD 630"
        }
    },
    {
        "data": {
            "source": "EPD 625",
            "target": "EPD 633"
        }
    },
    {
        "data": {
            "source": "EPD 636",
            "target": "EPD 650"
        }
    },
    {
        "data": {
            "source": "EPD 640",
            "target": "EPD 650"
        }
    },
    {
        "data": {
            "source": "EPD 645",
            "target": "EPD 646"
        }
    },
    {
        "data": {
            "source": "INTEREGR 397",
            "target": "EPD 398"
        }
    }
]