[
    {
        "data": {
            "description": "Workshop approached to writing students' fields, including dissertations, articles and research reports. Also covers general writing skills, documentation and genre-specific styles. Not open to auditors",
            "id": "ESL 350",
            "parent": "ESL",
            "title": "PROFESSIONAL AND ACADEMIC WRITING SKILLS"
        }
    },
    {
        "data": {
            "description": "A review of English grammar through intensive written and oral practice to promote accurate and appropriate language use for students who have already studied grammar extensively and need to refine the ability to produce acceptable academic English. Not open to auditors",
            "id": "ESL 115",
            "parent": "ESL",
            "title": "GRAMMAR FOR ACADEMIC USE"
        }
    },
    {
        "data": {
            "description": "Academic skills for ESL students; workshops on skills required for effective academic communication; topics vary, but include general and discipline-specific academic skills. Intended for graduate students. Not open to auditors",
            "id": "ESL 328",
            "parent": "ESL",
            "title": "ACADEMIC SKILLS WORKSHOPS"
        }
    },
    {
        "data": {
            "description": "Academic writing, critical reading and argumentation, documentation, and style and organization of research papers; oral communication skills for effective class participation and presentations. Not open to auditors.",
            "id": "ESL 118",
            "parent": "ESL",
            "title": "ACADEMIC WRITING II"
        }
    },
    {
        "data": {
            "description": "Aspects of research writing, including data presentation, literature review, summarizing, critical summarizing, and discussion. Grammar and editing skills are also emphasized. Not open to auditors",
            "id": "ESL 349",
            "parent": "ESL",
            "title": "ACADEMIC WRITING FOR GRADUATE STUDENTS"
        }
    },
    {
        "data": {
            "description": "Basic elements of academic writing, emphasizing improved fluency and accuracy, paragraph structure, summarizing and paraphrasing, short essays, and a final research project. Not open to auditors.",
            "id": "ESL 117",
            "parent": "ESL",
            "title": "ACADEMIC WRITING I"
        }
    },
    {
        "data": {
            "description": "Focuses on the communication skills, classroom culture, and teaching strategies essential for effective classroom teaching at an American university. Not open to auditors",
            "id": "ESL 370",
            "parent": "ESL",
            "title": "INTERNATIONAL TA TRAINING"
        }
    },
    {
        "data": {
            "description": "Improvement of listening, speaking, reading, writing and grammar skills that are essential in an academic setting. Introduction to the expectations for an undergraduate at a U.S. university.",
            "id": "ESL 113",
            "parent": "ESL",
            "title": "ESSENTIALS OF ACADEMIC READING AND WRITING"
        }
    },
    {
        "data": {
            "description": "Listening, speaking, reading, and writing skills for nonnative speakers of English; academically oriented. Not open to auditors",
            "id": "ESL 110",
            "parent": "ESL",
            "title": "INTENSIVE ENGLISH AS A SECOND LANGUAGE"
        }
    },
    {
        "data": {
            "description": "Opportunities to express ideas through oral presentations and formal written work. Focus on specific topics in law. Not open to auditors",
            "id": "ESL 352",
            "parent": "ESL",
            "title": "ENGLISH FOR LAWYERS"
        }
    },
    {
        "data": {
            "description": "Oral communication and presentation skills essential for participation in seminars, conferences, and other academic and professional settings. Not open to auditors",
            "id": "ESL 344",
            "parent": "ESL",
            "title": "ACADEMIC PRESENTATIONS AND DISCUSSION"
        }
    },
    {
        "data": {
            "description": "Practice in formal and informal communication skills, including listening comprehension, pronunciation, and conversational and presentation skills useful in an academic setting. Not open to auditors",
            "id": "ESL 343",
            "parent": "ESL",
            "title": "ORAL COMMUNICATION SKILLS"
        }
    },
    {
        "data": {
            "description": "Practice in informal and formal English communication skills essential in academic and professional settings, including formal presentations, discussions, and interviews.",
            "id": "ESL 200",
            "parent": "ESL",
            "title": "ACADEMIC AND PROFESSIONAL SPEAKING SKILLS FOR ENGLISH LANGUAGE LEARNERS"
        }
    },
    {
        "data": {
            "description": "Reading strategies for academic work; reading with increased comprehension and speed, vocabulary expansion, and summary writing. Not open to auditors.",
            "id": "ESL 116",
            "parent": "ESL",
            "title": "ACADEMIC READING AND VOCABULARY SKILLS"
        }
    },
    {
        "data": {
            "description": "Semi-intensive course in intermediate English language skills. A multi-skills focus on reading, writing, and communication skills essential in an academic setting. Not open to auditors",
            "id": "ESL 114",
            "parent": "ESL",
            "title": "INTERMEDIATE ENGLISH LANGUAGE SKILLS"
        }
    },
    {
        "data": {
            "description": "Techniques for improvement of the pronunciation of American English for non-native speakers of English. Not open to auditors",
            "id": "ESL 345",
            "parent": "ESL",
            "title": "AMERICAN ENGLISH PRONUNCIATION"
        }
    },
    {
        "data": {
            "id": "ESL",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ESL 114",
            "target": "ESL 115"
        }
    },
    {
        "data": {
            "source": "ESL 115",
            "target": "ESL 116"
        }
    },
    {
        "data": {
            "source": "ESL 116",
            "target": "ESL 117"
        }
    },
    {
        "data": {
            "source": "ESL 117",
            "target": "ESL 118"
        }
    },
    {
        "data": {
            "source": "ESL 118",
            "target": "ESL 200"
        }
    }
]