[
    {
        "data": {
            "description": "Covers the graphs, properties and geometric significance of trigonometric functions of a real variable. Other topics include trigonometric equations and identities, application, trigonometric form of complex numbers, DeMoivre's theorem, and polar and parametric equations. The course also has a significant number of applications, especially related to other disciplines.",
            "id": "MATH 113",
            "parent": "MATH",
            "title": "TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "The evidence that the Earth's climate is changing at unprecedented rates is now overwhelming. Environmental tipping points are being crossed and many species are adapting or failing to adapt. Climate change poses a significant problem for conserving and managing wildlife and their habitats. Climate change, its ecological impacts, and the principle of climate change adaptation in natural resources conservation will be discussed.",
            "id": "F&WECOL/ZOOLOGY 660",
            "title": "CLIMATE CHANGE ECOLOGY"
        }
    },
    {
        "data": {
            "description": "A comprehensive treatment of the ecology, causes, and consequences of species extinction. Ecology and problems of individual species, habitat alteration and degradation, socio-economic pressures and conservation techniques and strategies.",
            "id": "ENVIRST/F&WECOL/ZOOLOGY 360",
            "title": "EXTINCTION OF SPECIES"
        }
    },
    {
        "data": {
            "description": "A general survey of wildlife and wildlife conservation. Basic characteristics and management of wildlife populations and habitats. Human perceptions and interactions with wildlife. Current issues in wildlife management and conservation.",
            "id": "F&WECOL 110",
            "parent": "F&WECOL",
            "title": "LIVING WITH WILDLIFE - ANIMALS, HABITATS, AND HUMAN INTERACTIONS"
        }
    },
    {
        "data": {
            "description": "An interdisciplinary approach to our complex and often contradictory relationships with non-human animals, including information about the nature, needs and behavior of human and non-human animals in relation to our personal and professional interactions with them.",
            "id": "F&WECOL/ZOOLOGY 335",
            "title": "HUMAN/ANIMAL RELATIONSHIPS: BIOLOGICAL AND PHILOSOPHICAL ISSUES"
        }
    },
    {
        "data": {
            "description": "An internship under guidance of a faculty or instructional academic staff member in Forest and Wildlife Ecology and an internship site supervisor. Students are responsible for arranging the work and credits with the faculty or instructional academic staff member and the internship site supervisor.",
            "id": "F&WECOL 399",
            "parent": "F&WECOL",
            "title": "COORDINATIVE INTERNSHIP/COOPERATIVE EDUCATION"
        }
    },
    {
        "data": {
            "description": "An introduction to fire, wind, flooding, disease, insects and other disturbance regimes that serve as primary drivers of the structure and function of terrestrial ecosystems. Discusses how these disturbances interact, using case studies and data that highlight the role of disturbance in different ecosystems (e.g. grasslands, forests, tundra) with a focus on the ecosystem services they provide. Discusses and critiques management strategies used to mitigate biotic and abiotic disturbances, gaining critical insights from the literature as well as personal perspectives and experiences.",
            "id": "F&WECOL 448",
            "parent": "F&WECOL",
            "title": "DISTURBANCE ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Application of ecological principles and human dimensions to the conservation of biological diversity. Topics: biodiversity science; conservation planning; population ecology; habitat loss, species exploitation, invasive species, pollution; human attitudes and activities as they affect the biosphere; approaches to monitoring interventions.",
            "id": "BOTANY/ENVIRST/F&WECOL/ZOOLOGY 651",
            "title": "CONSERVATION BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Applications of quantitative methods, including optimization and simulation, to the management of natural resources, especially forests.",
            "id": "AAE/F&WECOL 652",
            "title": "DECISION METHODS FOR NATURAL RESOURCE MANAGERS"
        }
    },
    {
        "data": {
            "description": "Basic principles of ecology and interrelations between individuals, populations, communities, ecosystems and their environment; transmission genetics and introduction to population genetics; origin of life, evolutionary mechanisms, ancestral relationships among species, and the diversity of life.",
            "id": "BIOCORE 381",
            "parent": "BIOCORE",
            "title": "EVOLUTION, ECOLOGY, AND GENETICS"
        }
    },
    {
        "data": {
            "description": "Contemporary theory of consumption, production, pricing and resource allocation.",
            "id": "ECON 301",
            "parent": "ECON",
            "title": "INTERMEDIATE MICROECONOMIC THEORY"
        }
    },
    {
        "data": {
            "description": "Continuation ofMATH 171. Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Completion ofMATH 217implies completion ofMATH 221and114.",
            "id": "MATH 217",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY II"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Current topics in molecular and environmental toxicology and problems related to biologically active substances in the environment. Topics vary each semester. Lectures are by resident and visiting professors and other researchers.",
            "id": "ENTOM/F&WECOL/PLPATH/SOILSCI 606",
            "title": "COLLOQUIUM IN ENVIRONMENTAL TOXICOLOGY"
        }
    },
    {
        "data": {
            "description": "Descriptive statistics, distributions, one- and two-sample normal inference, power, one-way ANOVA, simple linear regression, categorical data, non-parametric methods; underlying assumptions and diagnostic work.",
            "id": "F&WECOL/STAT 571",
            "title": "STATISTICAL METHODS FOR BIOSCIENCE I"
        }
    },
    {
        "data": {
            "description": "Ecologically-based forest management principles for sustainable timber production, maintenance or restoration of biological diversity, and maintenance of aesthetic quality and site productivity. Includes coverage of even-aged and uneven-aged management, reforestation principles, and ecological restoration techniques.",
            "id": "F&WECOL 410",
            "parent": "F&WECOL",
            "title": "PRINCIPLES OF SILVICULTURE"
        }
    },
    {
        "data": {
            "description": "Ecology and conservation of a wide range of forests, from tropical rain and dry forests, boreal forests, to temperate forests, outside of the USA. The main threats to forests, and different strategies to solve conservation and sustainable management issues in international forestry. Trade-offs in forest conservation and management, resulting from different values that people place on forests, issues in equity and equality in access to forest resources. The role of forests in climate change and extinction of species.",
            "id": "ENVIRST/F&WECOL 100",
            "title": "FORESTS OF THE WORLD"
        }
    },
    {
        "data": {
            "description": "Ecology of Wisconsin plant communities: floristic composition, community structure; relationship to history, climate, soil, and geology; response to human perturbation.",
            "id": "BOTANY/F&WECOL 455",
            "title": "THE VEGETATION OF WISCONSIN"
        }
    },
    {
        "data": {
            "description": "Ecology of individual organisms, populations, communities, ecosystems, landscapes, and the biosphere. The interaction of organisms with each other and their physical environment. These relationships are studied, often in quantitative terms, in both field and laboratory settings.",
            "id": "BOTANY/F&WECOL/ZOOLOGY 460",
            "title": "GENERAL ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Economic concepts and tools relating to management and use of natural resources, including pricing principles, cost-benefit analysis, equity, externalities, economic rent, renewable and nonrenewable resources, and resource policy issues.",
            "id": "AAE/ECON/F&WECOL 531",
            "title": "NATURAL RESOURCE ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Economic problems of individuals, firms and industries with emphasis on value, price, and distribution of income.",
            "id": "ECON 101",
            "parent": "ECON",
            "title": "PRINCIPLES OF MICROECONOMICS"
        }
    },
    {
        "data": {
            "description": "Emphasizes spatial patterning (its development and importance for ecological processes) and often focuses on large regions. Learn concepts, methods, and applications of landscape ecology.",
            "id": "BOTANY/F&WECOL/ZOOLOGY 879",
            "title": "ADVANCED LANDSCAPE ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Emphasizes the importance of spatial patterns at broad scales. Concepts and applications are covered.",
            "id": "F&WECOL/LANDARC/ZOOLOGY 565",
            "title": "PRINCIPLES OF LANDSCAPE ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "Examine natural resources policy and law in the United States relating to forests, wildlife, and other natural resources. Investigates the policy-making process and the role of science, values, property, economics, and justice in the development of federal and state resources policy. Practice professional written and oral communication and ethical engagement in resources policy and administration.",
            "id": "ENVIRST/F&WECOL 515",
            "title": "NATURAL RESOURCES POLICY"
        }
    },
    {
        "data": {
            "description": "Examines common methods of multivariate data analysis in ecology and environmental science. Covers methods for the analysis of complex, multidimensional datasets that are collected in the study of plant, invertebrate, fish, and bird communities. Addresses the concurrent analysis of the environmental factors that may drive community distributions. Provides the basis for predictive modeling of distributions across landscapes. General methods covered include ordination (PCA, DCA, NMDS, CCA), clustering (or classification), and other comparative analyses of data matrices (ANOSIM, Mantel tests).  Includes an applied, \"hands-on\" approach on how to use these tools, and the circumstances under which their uses are either appropriate or inappropriate.",
            "id": "ENTOM/F&WECOL 711",
            "title": "MULTIVARIATE ANALYSIS OF ECOLOGICAL AND COMMUNITY DATA"
        }
    },
    {
        "data": {
            "description": "Explores long and short-term cycles of carbon, nitrogen, phosphorus, sulfur, and metals as well as water and energy cycles between water, the atmosphere, terrestrial vegetation, and soils. Emphasizes the linkage between terrestrial vegetation and soils across global biomes for managed and unmanaged ecosystems. Investigates biogeochemical processes through their biochemical constituents, conceptual models and exploration of isotopic and chemical data. Provides a practical understanding of the interactions between components and fluxes of terrestrial ecosystems and how data is developed and employed.",
            "id": "F&WECOL/SOILSCI 451",
            "title": "ENVIRONMENTAL BIOGEOCHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Explores natural and anthropogenic disturbances occurring in forest ecosystems through hands on learning experiences. Emphasis on the role of herbivores and fire with examination of management strategies. Applies basic ecological laboratory and field techniques to understanding disturbances that change the physical environment and disrupt ecosystem structure.",
            "id": "F&WECOL 449",
            "parent": "F&WECOL",
            "title": "DISTURBANCE ECOLOGY LAB (I): HERBIVORES AND FIRE"
        }
    },
    {
        "data": {
            "description": "Explores natural and anthropogenic disturbances occurring in forest ecosystems through hands on learning experiences. Focuses on the causes of impoverished forests and the role and management of pathogens. Applies basic ecological laboratory and field techniques to understanding disturbances that change the physical environment and disrupt ecosystem structure.",
            "id": "F&WECOL 450",
            "parent": "F&WECOL",
            "title": "DISTURBANCE ECOLOGY LAB (II): FOREST PATHOGENS"
        }
    },
    {
        "data": {
            "description": "Explores the application of demographic methods in the conservation and management of animal populations. Techniques explored include maximum likelihood and Bayesian estimation, count-based models, mark-recapture models, occupancy models, matrix models, and sensitivity analyses. Emphasizes application of these models in conservation decision making.",
            "id": "F&WECOL 850",
            "parent": "F&WECOL",
            "title": "DEMOGRAPHIC METHODS IN WILDLIFE CONSERVATION"
        }
    },
    {
        "data": {
            "description": "Field measurements of trees and forests. Basic concepts of statistics and sampling as applied to forestry. Use of aerial photographs, GIS, and satellite imagery.",
            "id": "F&WECOL 300",
            "parent": "F&WECOL",
            "title": "FOREST MEASUREMENTS"
        }
    },
    {
        "data": {
            "description": "Field training and experience; exposure to forestry operations, equipment, procedures, and management problems.",
            "id": "F&WECOL 658",
            "parent": "F&WECOL",
            "title": "FOREST RESOURCES PRACTICUM"
        }
    },
    {
        "data": {
            "description": "Fluctuations of animal populations: techniques of study, documentation, controls.",
            "id": "F&WECOL 655",
            "parent": "F&WECOL",
            "title": "ANIMAL POPULATION DYNAMICS"
        }
    },
    {
        "data": {
            "description": "Foundational ideas in the field of ecology. Discussion topics trace the development of ecology as a discipline, and the roots of modern ecological thought, as well as the research approaches in ecology.",
            "id": "BOTANY/ENTOM/F&WECOL/ZOOLOGY 821",
            "title": "FOUNDATIONS OF ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Full-time off-campus work experience which combines classroom theory with practical knowledge of operations to provide students with a background upon which to base a professional career. Students receive credit only for the term in which they are actively enrolled and working. The same work experience may not count towards credit inF&W ECOL 399.",
            "id": "F&WECOL 1",
            "parent": "F&WECOL",
            "title": "COOPERATIVE EDUCATION/CO-OP IN FOREST & WILDLIFE ECOLOGY"
        }
    },
    {
        "data": {
            "description": "General biological principles. Topics include: evolution, ecology, animal behavior, cell structure and function, genetics and molecular genetics and the physiology of a variety of organ systems emphasizing function in humans.",
            "id": "BIOLOGY/ZOOLOGY 101",
            "title": "ANIMAL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "General concepts of animal biology at an introductory level emphasizing the evolutionary relationships between animals. Learn about general body plans and strategies used to accomplish the basic tasks of staying alive in major animal groups using preserved and live animals. Study the diversity within each group of animals by integrating the body plans with the lifestyle and ecology of animals. Dissections of earthworm, freshwater mussel, squid, sea star, and rat aid the study of these general principles.",
            "id": "BIOLOGY/ZOOLOGY 102",
            "title": "ANIMAL BIOLOGY LABORATORY"
        }
    },
    {
        "data": {
            "description": "Identification, ecological characteristics, ranges, adaptations to environment, and uses of evergreen and deciduous woody plants, with emphasis on species native to Wisconsin; lab and field work.",
            "id": "BOTANY/F&WECOL 402",
            "title": "DENDROLOGY: WOODY PLANT IDENTIFICATION AND ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Independent graduate study under supervision of a faculty member.",
            "id": "F&WECOL 999",
            "parent": "F&WECOL",
            "title": "ADVANCED INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Independent research for Honors students completing a thesis in the areas of Forest Science or Wildlife Ecology, under the guidance of a faculty member.",
            "id": "F&WECOL 691",
            "parent": "F&WECOL",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Independent research for Honors students completing a thesis in the areas of Forest Science or Wildlife Ecology, under the guidance of a faculty member.",
            "id": "F&WECOL 692",
            "parent": "F&WECOL",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Independent research in preparation of a graduate thesis under supervision of a faculty member.",
            "id": "F&WECOL 990",
            "parent": "F&WECOL",
            "title": "RESEARCH AND THESIS"
        }
    },
    {
        "data": {
            "description": "Individual advanced work in an area of Forest and Wildlife Ecology under the direct guidance of a faculty member.",
            "id": "F&WECOL 699",
            "parent": "F&WECOL",
            "title": "SPECIAL PROBLEMS"
        }
    },
    {
        "data": {
            "description": "Individual study for undergraduate students in an Honors program completing a thesis in the area of Forest and Wildlife Ecology, as arranged with a faculty member.",
            "id": "F&WECOL 681",
            "parent": "F&WECOL",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Instructional orientation to teaching at the higher education level in the agricultural and life sciences, direct teaching experience under faculty supervision, experience in testing and evaluation of students, and the analysis of teaching performance.",
            "id": "F&WECOL 799",
            "parent": "F&WECOL",
            "title": "PRACTICUM IN FORESTRY AND WILDLIFE ECOLOGYTEACHING"
        }
    },
    {
        "data": {
            "description": "Integrated treatment of macroeconomics and microeconomics (seeECON 101andECON 102). Accelerated approach to economics training, especially for Economics: Math Emphasis majors.",
            "id": "ECON 111",
            "parent": "ECON",
            "title": "PRINCIPLES OF ECONOMICS-ACCELERATED TREATMENT"
        }
    },
    {
        "data": {
            "description": "Introduces fundamental machine learning techniques for numerical modeling and data analysis and modern computer programming tools used to analyze, prepare, and visualize data from common formats of datasets in the field of Earth and environmental sciences. Emphasizes opportunities to consider real-world applications for concepts in environmental data science.",
            "id": "F&WECOL 458",
            "parent": "F&WECOL",
            "title": "ENVIRONMENTAL DATA SCIENCE"
        }
    },
    {
        "data": {
            "description": "Introduces new graduate students to the diversity of ecologists across the UW-Madison campus. Includes discussions of key topics in professional development, research presentations by faculty members, and discussions of assigned papers with senior graduate students.",
            "id": "AGRONOMY/ATMOCN/BOTANY/ENTOM/ENVIRST/F&WECOL/GEOG/ZOOLOGY 953",
            "title": "INTRODUCTION TO ECOLOGY RESEARCH AT UW-MADISON"
        }
    },
    {
        "data": {
            "description": "Introduces reproducible data management, modeling, analysis, and statistical inference through a practical, hands-on case studies approach. Topics include the use of an integrated statistical computing environment, data wrangling, the R programming language, data graphics and visualization, random variables and concepts of probability including the binomial and normal distributions, data modeling, statistical inference in one- and two- sample settings for proportions and means, simple linear regression, and report generation using R Markdown with applications to a wide variety of data to address open-ended questions.",
            "id": "STAT 240",
            "parent": "STAT",
            "title": "DATA SCIENCE MODELING I"
        }
    },
    {
        "data": {
            "description": "Introduces the concerns and principles of sociology  through examination of human interaction with the natural environment. Places environmental issues such as resource depletion, population growth, food production, environmental regulation, and sustainability in national and global perspectives.",
            "id": "C&ESOC/F&WECOL/SOC 248",
            "title": "ENVIRONMENT, NATURAL RESOURCES, AND SOCIETY"
        }
    },
    {
        "data": {
            "description": "Introduction to Wildlife Ecology and the profession of wildlife management/conservation. Emphasis on preparing for a successful career.",
            "id": "F&WECOL 101",
            "parent": "F&WECOL",
            "title": "ORIENTATION TO WILDLIFE ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Introduction to bird biology, ecology, and behavior. Topics include the evolutionary origin of birds and flight, anatomy and physiology, functional morphology, migration, communication, reproductive strategies, ecological adaptations and roles, and biogeographical patterns.",
            "id": "ANSCI/F&WECOL/ZOOLOGY 520",
            "title": "ORNITHOLOGY"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Introduction to forestry operations in the implementation of forest plans, including site preparation, stand establishment, and harvesting systems. Analysis of costs and productivity, including system balance, marketing, timber procurement, and contractual services.",
            "id": "F&WECOL 305",
            "parent": "F&WECOL",
            "title": "FOREST OPERATIONS"
        }
    },
    {
        "data": {
            "description": "Introduction to major abiotic and biotic factors that influence forest ecosystem composition, structure, and function. Reviews important processes that influence structure and function of forest ecosystems. Uses basic ecosystem concepts to elucidate influence of anthropogenic (including forest management) and natural disturbances on forest ecosystem structure and function.",
            "id": "F&WECOL 550",
            "parent": "F&WECOL",
            "title": "FOREST ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Introduction to modern statistical practice in the life sciences, using the R programming language. Topics include: exploratory data analysis, probability and random variables; one-sample testing and confidence intervals, role of assumptions, sample size determination, two-sample inference; basic ideas in experimental design, analysis of variance, linear regression, goodness-of fit; biological applications.",
            "id": "STAT 371",
            "parent": "STAT",
            "title": "INTRODUCTORY APPLIED STATISTICS FOR THE LIFE SCIENCES"
        }
    },
    {
        "data": {
            "description": "Introduction to the Earth as viewed from above, focusing on use of aerial photography and satellite imagery to study the environment. Includes physical processes of electromagnetic radiation, data types and sensing capabilities, methods for interpretation, analysis and mapping, and applications.",
            "id": "ENVIRST/F&WECOL/GEOG/GEOSCI/GLE/LANDARC 371",
            "title": "INTRODUCTION TO ENVIRONMENTAL REMOTE SENSING"
        }
    },
    {
        "data": {
            "description": "Introduction to the basic principles and concepts of the biology of plants. an integrative approach stressing evolutionary sequences and the relationship between structure and function at succeeding levels of organization: molecule, cell, organism, population, community. Correlated lectures, laboratories, and discussions.",
            "id": "BIOLOGY/BOTANY 130",
            "title": "GENERAL BOTANY"
        }
    },
    {
        "data": {
            "description": "Life history, ecology, distribution, and taxonomy of reptiles, amphibians, birds, and mammals. Birds will receive less emphasis. Primary focus is on Wisconsin species, including conservation threats, but covers all major North American families, and surveys major groups of the world. Designed as a foundation for detailed study of vertebrates or to satisfy the need for a scientific introduction to Wisconsin vertebrates.",
            "id": "F&WECOL 306",
            "parent": "F&WECOL",
            "title": "TERRESTRIAL VERTEBRATES: LIFE HISTORY AND ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Macroeconomic measurement and models of aggregate demand and supply; fiscal and monetary policy for unemployment, inflation, and growth.",
            "id": "ECON 102",
            "parent": "ECON",
            "title": "PRINCIPLES OF MACROECONOMICS"
        }
    },
    {
        "data": {
            "description": "Major environmental factors affecting wildlife; structure and behavior of wildlife populations; regional wildlife communities and their conservation.",
            "id": "F&WECOL 318",
            "parent": "F&WECOL",
            "title": "PRINCIPLES OF WILDLIFE ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Outdoor and indoor labs/lectures emphasizing identification of southern Wisconsin birds by sight and vocalization. Two required Saturday field trips in Southern Wisconsin.",
            "id": "ANSCI/F&WECOL/ZOOLOGY 521",
            "title": "BIRDS OF SOUTHERN WISCONSIN"
        }
    },
    {
        "data": {
            "description": "Physiological adaptation and function in wild animals, primarily birds, mammals, reptiles, amphibians. Focus on interactions between animals and their environment, and relationships between animal physiology and the ecology and dynamics of populations.",
            "id": "F&WECOL 401",
            "parent": "F&WECOL",
            "title": "PHYSIOLOGICAL ANIMAL ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Polynomial regression, multiple regression, two-way ANOVA with and without interaction, split-plot design, subsampling, analysis of covariance, elementary sampling, introduction to bioassay.",
            "id": "F&WECOL/STAT 572",
            "title": "STATISTICAL METHODS FOR BIOSCIENCE II"
        }
    },
    {
        "data": {
            "description": "Practicum emphasizing research and habitat management techniques through individual and group field work, tours, demonstrations and lectures.",
            "id": "F&WECOL 424",
            "parent": "F&WECOL",
            "title": "WILDLIFE ECOLOGY SUMMER FIELD PRACTICUM"
        }
    },
    {
        "data": {
            "description": "Preparation for natural resources professions and the job market after graduation. Development of professional skills including communication, ethical decision-making, and conflict resolution. Experience in job searching, editing resumes, and interviewing for jobs.",
            "id": "F&WECOL 390",
            "parent": "F&WECOL",
            "title": "LEARNING TO ACTION: PROFESSIONAL DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Preparation of collections, analyses of food habits, sex and age determinations, censuses, trapping and banding, planting food and cover, research techniques.",
            "id": "F&WECOL 561",
            "parent": "F&WECOL",
            "title": "WILDLIFE MANAGEMENT TECHNIQUES"
        }
    },
    {
        "data": {
            "description": "Principles and application of chemical equilibrium, coordination chemistry, oxidation-reduction and electrochemistry, kinetics, nuclear chemistry, introduction to organic chemistry, and chemistry laboratory skills.",
            "id": "CHEM 104",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Provides a practical introduction to basic concepts of research question formulation, research designs and alternative methods of inquiry, implications for internal validity of the research and generalizability of the findings, operational definitions and measurement validity, reliability, utility and precision.",
            "id": "DS/F&WECOL/URBRPL 955",
            "title": "PRACTICAL RESEARCH DESIGN AND METHODS OF EMPIRICAL INQUIRY"
        }
    },
    {
        "data": {
            "description": "Provides an area equivalency for courses taken on Madison Study Abroad Programs that do not equate to existing UW courses. Current enrollment in a UW-Madison study abroad program",
            "id": "F&WECOL 400",
            "parent": "F&WECOL",
            "title": "STUDY ABROAD IN FOREST AND WILDLIFE ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Provides an overview of the geography, ecology, and economic importance of the world's forest biomes. Learn how climate influences vegetation and, in-turn, how forests impact global climate. Meet scientists working to understand the astounding biodiversity and ecological complexity of forest ecosystems, and how these ecosystems support human life. Discuss the threats to forest ecosystems around the world, and hear from the people trying to protect them. Emphasizes the forest resources and services upon which humans depend, and how we can maintain these resources into the future. Analyze the idea of \"sustainability\" when it comes to forest management, hear alternative viewpoints about what this word means, and discuss potential trade-offs and conflicts. Look at the many real-world programs in place at the global, national, and local level to sustainably manage forests.",
            "id": "BOTANY/F&WECOL 250",
            "title": "FORESTS AND HUMANS: FROM THE MIDWEST TO MADAGASCAR"
        }
    },
    {
        "data": {
            "description": "Provides an overview of the issues involved across a wide range of wildlife diseases, presented within the context of ecosystem health or \"one health\". Content will be on the biological, epidemiological, clinical, public health and, in some cases, sociopolitical ramifications of wildlife diseases. Covers a wide variety of wildlife diseases caused by bacteria, viruses, parasites, prions, and environmental contaminants. Consequences associated with environmental changes on the manifestation of wildlife diseases will also be discussed. This range of diseases will be presented in order to familiarize the many facets involved in disease management, from animal and human health issues, to ecological and environmental considerations, to the role of society in contributing to, and managing, these diseases.",
            "id": "F&WECOL/SURGSCI 548",
            "title": "DISEASES OF WILDLIFE"
        }
    },
    {
        "data": {
            "description": "Provides opportunities for additional training in professional development skills relevant to careers in natural resources.",
            "id": "F&WECOL 675",
            "parent": "F&WECOL",
            "title": "PROFESSIONAL DEVELOPMENT IN FOREST & WILDLIFE ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Quantitative tools applicable to the investigation of ecological problems, including but not limited to, statistics, Geographic Information Systems (GIS), Remote Sensing, and spatial analysis. Overview of commonly used quantitative techniques in ecological sciences with an emphasis on GIS and spatial analysis. Introduces spatial tools and practical applications using ecological/environmental data sets.",
            "id": "F&WECOL 395",
            "parent": "F&WECOL",
            "title": "DATA AND GIS TOOLS FOR ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Research work for Honors students under direct guidance of a faculty member in an area of Forest and Wildlife Ecology.  Students are responsible for arranging the work and credits with the supervising instructor.",
            "id": "F&WECOL 289",
            "parent": "F&WECOL",
            "title": "HONORS INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Research work for students under direct guidance of a faculty member in an area of Forest and Wildlife Ecology.  Students are responsible for arranging the work and credits with the supervising instructor.",
            "id": "F&WECOL 299",
            "parent": "F&WECOL",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Resource management planning in state and federal land management agencies. Apply principles by working in teams to develop a management plan for a real property by inventorying resources; developing management objectives and alternatives; and analyzing their ecological, social and institutional implications.",
            "id": "F&WECOL 590",
            "parent": "F&WECOL",
            "title": "INTEGRATED RESOURCE MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Review concepts presented inF&W ECOL 550by exposing the key concepts and processes discussed that can best be seen in the field or illustrated with the use of ecosystem models.",
            "id": "F&WECOL 551",
            "parent": "F&WECOL",
            "title": "FOREST ECOLOGY LAB"
        }
    },
    {
        "data": {
            "description": "Second semester of individual study for undergraduate students in an Honors program completing a thesis in the area of Forest and Wildlife Ecology, as arranged with a faculty member.",
            "id": "F&WECOL 682",
            "parent": "F&WECOL",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Solve problems that arise in the conservation and management of wildlife populations requires that managers understand and evaluate human cultural, economic, and political issues in addition to ecological issues. Use case studies to understand the interdisciplinary nature of wildlife management while gaining practical hands-on experiences.",
            "id": "F&WECOL 577",
            "parent": "F&WECOL",
            "title": "COMPLEXITY AND CONSERVATION OF WHITE-TAILED DEER"
        }
    },
    {
        "data": {
            "description": "Specialized subject matter of current interest to graduate students.",
            "id": "F&WECOL 875",
            "parent": "F&WECOL",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "Specialized subject matter of current interest to undergraduate students.",
            "id": "F&WECOL 375",
            "parent": "F&WECOL",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "Stoichiometry and the mole concept, the behavior of gases, liquids and solids, thermochemistry, electronic structure of atoms and chemical bonding, descriptive chemistry of selected elements and compounds, intermolecular forces, and chemistry laboratory skills.",
            "id": "CHEM 103",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Study the importance of past events for current ecosystems. Emphasizes concepts and applications.",
            "id": "BOTANY/F&WECOL/ZOOLOGY 672",
            "title": "HISTORICAL ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Synthesize concepts in wildlife ecology and prepare for a wildlife research career.  Develop a professional-quality research proposal for an extended project, carry out a pilot ecological field study, and design and implement a social survey questionnaire.",
            "id": "F&WECOL 599",
            "parent": "F&WECOL",
            "title": "WILDLIFE RESEARCH CAPSTONE"
        }
    },
    {
        "data": {
            "description": "The objective of this course is to refine the quantitative skills necessary to succeed in intermediate- and advanced-level economics courses. The principle focus will be on applying the skills acquired in your math courses to the questions, models, and optimization problems that are common in economics. Topics include specific economic applications of algebra, financial mathematics, and calculus.",
            "id": "ECON 205",
            "parent": "ECON",
            "title": "QUANTITATIVE TOOLS FOR ECONOMICS"
        }
    },
    {
        "data": {
            "description": "The two semester sequenceMATH 112-MATH 113covers similar material asMATH 114, but in a slower pace. Not recommended for students with less than an AB inMATH 96.",
            "id": "MATH 114",
            "parent": "MATH",
            "title": "ALGEBRA AND TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Part of a 2-semester sequence withMATH 217; these two courses together are equivalent toMATH 114and221.",
            "id": "MATH 171",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY I"
        }
    },
    {
        "data": {
            "description": "Topics in earth system science. Emphasis on the coupling between atmospheric, oceanic and land surface systems, involving physical geochemical and biological processes, and including interactions with human systems.",
            "id": "ATMOCN/BOTANY/ENVIRST/F&WECOL/GEOG/GEOSCI/ZOOLOGY 980",
            "title": "EARTH SYSTEM SCIENCE SEMINAR"
        }
    },
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics and selected topics in Animal Physiology.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Topics include: selected topics in plant physiology, a survey of the five major kingdoms of organisms, speciation and evolutionary theory, and ecology at multiple levels of the biological hierarchy.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Training and professional skill development for future natural resources professionals. Introduction to the importance of regulated trapping as a technique used in research, wildlife damage management, wildlife reintroduction, disease management, fur/food acquisition, etc.",
            "id": "F&WECOL 420",
            "parent": "F&WECOL",
            "title": "REGULATED TRAPPING IN WILDLIFE MANAGEMENT AND CONSERVATION"
        }
    },
    {
        "data": {
            "description": "Utilization of ecologically-based forest management practices for sustainable timber production, maintenance or restoration of biological diversity, and maintenance of aesthetic quality and site productivity. Includes coverage of even-aged and uneven-aged management, reforestation principles, and ecological restoration techniques.",
            "id": "F&WECOL 411",
            "parent": "F&WECOL",
            "title": "PRACTICES OF SILVICULTURE"
        }
    },
    {
        "data": {
            "description": "Ways of conserving desired numbers of animals for the overall best interests of society, be they aesthetic, ecological, economic, commercial or recreational; includes management of endangered species, exploited species, wildlife communities in nature reserves, and wildlife pests.",
            "id": "F&WECOL 379",
            "parent": "F&WECOL",
            "title": "PRINCIPLES OF WILDLIFE MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Writing-intensive with opportunities to make observations and generate and test questions. Includes ecology field trips and research projects that focus on genetics and evolution.",
            "id": "BIOCORE 382",
            "parent": "BIOCORE",
            "title": "EVOLUTION, ECOLOGY, AND GENETICS LABORATORY"
        }
    },
    {
        "data": {
            "id": "BIOCORE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ECON",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "F&WECOL",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "STAT",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "BIOCORE 382"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "ENVIRST/F&WECOL/ZOOLOGY 360"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "F&WECOL 448"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "F&WECOL 449"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "F&WECOL 450"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "F&WECOL/ZOOLOGY 660"
        }
    },
    {
        "data": {
            "source": "BIOCORE 382",
            "target": "ENVIRST/F&WECOL/ZOOLOGY 360"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "BOTANY/F&WECOL 455"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 152"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 101"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "ENTOM/F&WECOL/PLPATH/SOILSCI 606"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "target": "BIOLOGY/ZOOLOGY 102"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "target": "BOTANY/F&WECOL/ZOOLOGY 460"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "target": "F&WECOL 550"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ANSCI/F&WECOL/ZOOLOGY 520"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ANSCI/F&WECOL/ZOOLOGY 521"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 151"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "F&WECOL 306"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "F&WECOL 401"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "F&WECOL/SURGSCI 548"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 102",
            "target": "ANSCI/F&WECOL/ZOOLOGY 520"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 102",
            "target": "ANSCI/F&WECOL/ZOOLOGY 521"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 102",
            "target": "F&WECOL 306"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 102",
            "target": "F&WECOL 401"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 102",
            "target": "F&WECOL/SURGSCI 548"
        }
    },
    {
        "data": {
            "source": "BOTANY/F&WECOL/ZOOLOGY 460",
            "target": "BOTANY/ENVIRST/F&WECOL/ZOOLOGY 651"
        }
    },
    {
        "data": {
            "source": "BOTANY/F&WECOL/ZOOLOGY 460",
            "target": "F&WECOL/LANDARC/ZOOLOGY 565"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "F&WECOL/SOILSCI 451"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON 102"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON 301"
        }
    },
    {
        "data": {
            "source": "ECON 102",
            "target": "ECON 205"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON 101"
        }
    },
    {
        "data": {
            "source": "ECON 205",
            "target": "ECON 301"
        }
    },
    {
        "data": {
            "source": "ECON 301",
            "target": "AAE/ECON/F&WECOL 531"
        }
    },
    {
        "data": {
            "source": "F&WECOL 318",
            "target": "F&WECOL 379"
        }
    },
    {
        "data": {
            "source": "F&WECOL 318",
            "target": "F&WECOL 655"
        }
    },
    {
        "data": {
            "source": "F&WECOL 410",
            "target": "F&WECOL 305"
        }
    },
    {
        "data": {
            "source": "F&WECOL 410",
            "target": "F&WECOL 411"
        }
    },
    {
        "data": {
            "source": "F&WECOL 550",
            "target": "F&WECOL 410"
        }
    },
    {
        "data": {
            "source": "F&WECOL 550",
            "target": "F&WECOL 551"
        }
    },
    {
        "data": {
            "source": "F&WECOL 561",
            "target": "F&WECOL 599"
        }
    },
    {
        "data": {
            "source": "F&WECOL 658",
            "target": "F&WECOL 590"
        }
    },
    {
        "data": {
            "source": "F&WECOL/STAT 571",
            "target": "F&WECOL/STAT 572"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 113"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 113",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 114",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "ENVIRST/F&WECOL/GEOG/GEOSCI/GLE/LANDARC 371"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "MATH 217"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "AAE/F&WECOL 652"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "source": "MATH 217",
            "target": "ECON 205"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "ECON 111"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "F&WECOL 395"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "F&WECOL 655"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 114"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "STAT 240",
            "target": "F&WECOL 458"
        }
    },
    {
        "data": {
            "source": "STAT 371",
            "target": "F&WECOL/LANDARC/ZOOLOGY 565"
        }
    }
]