[
    {
        "data": {
            "description": "A preparation and introductory math course for students enrolled in the Summer Collegiate Experience program. Includes material from precalculus and calculus and related topics depending on students' results on the math placement exam.",
            "id": "MATH 118",
            "parent": "MATH",
            "title": "SUMMER COLLEGIATE EXPERIENCE MATHEMATICS COURSE"
        }
    },
    {
        "data": {
            "description": "Covers advanced asset-liability, hedging, tax minimization, merger/acquisitions and economic value added strategies for depository financial institutions. Students practice these strategies by managing their own bank in a computer simulation model, merging with or acquiring other student's banks using MA software, and by playing a foreign exchange trading simulation.",
            "id": "FINANCE 610",
            "parent": "FINANCE",
            "title": "BANK SIMULATION AND STRATEGY"
        }
    },
    {
        "data": {
            "description": "Covers the graphs, properties and geometric significance of trigonometric functions of a real variable. Other topics include trigonometric equations and identities, application, trigonometric form of complex numbers, DeMoivre's theorem, and polar and parametric equations. The course also has a significant number of applications, especially related to other disciplines.",
            "id": "MATH 113",
            "parent": "MATH",
            "title": "TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "A capstone experience focused on investments, research, sales and trading which is designed to provide  the opportunity to learn and perform many of the practical skills necessary to research, analyze and pitch equity securities as long investments and/or short sales.  Application required.",
            "id": "FINANCE 535",
            "parent": "FINANCE",
            "title": "APPLIED EQUITY MARKETS RESEARCH 1"
        }
    },
    {
        "data": {
            "description": "A second capstone experience involving self-directed research and analysis in the areas of investments, research, sales and trading designed to provide the opportunity to apply concepts learned inFINANCE 535.FINANCE 535",
            "id": "FINANCE 536",
            "parent": "FINANCE",
            "title": "APPLIED EQUITY MARKETS RESEARCH 2"
        }
    },
    {
        "data": {
            "description": "A technical skills course in which you will learn how to construct an error-free, well-structured and user-friendly integrated three-statement company model. Constructing a financial model in Excel is a key skill for success as a financial analyst.",
            "id": "FINANCE 205",
            "parent": "FINANCE",
            "title": "FINANCIAL MODELING IN EXCEL"
        }
    },
    {
        "data": {
            "description": "About a half of all new businesses fail in the first five years. Learn about the tools, state-of-the-art valuation methods, and practical knowledge that are needed to make appropriate financing decisions in such highly uncertain environments.",
            "id": "FINANCE 757",
            "parent": "FINANCE",
            "title": "ENTREPRENEURIAL FINANCE"
        }
    },
    {
        "data": {
            "description": "Advanced corporate finance course that provides graduate students practical experience by working on consulting projects. Students work on applied projects in the areas of capital budgeting, capital structure and cash distribution policies. Emphasis on application of theoretical corporate finance concepts.",
            "id": "FINANCE 850",
            "parent": "FINANCE",
            "title": "APPLIED CORPORATE FINANCE I"
        }
    },
    {
        "data": {
            "description": "An analysis of the U.S. financial system, its responsiveness to and impact on economic activity and policy, its procedures for assessing and pricing risks on various financial instruments, and its role in the allocation of funds to different sectors in the economy.",
            "id": "FINANCE 305",
            "parent": "FINANCE",
            "title": "FINANCIAL MARKETS, INSTITUTIONS AND ECONOMIC ACTIVITY"
        }
    },
    {
        "data": {
            "description": "An introduction to applied econometrics - the statistical methods economists use to evaluate empirical relationships and test economic theory. Emphasis on application of econometrics to real world data using modern statistical software and developing skills needed to understand empirical work in economics.",
            "id": "ECON 400",
            "parent": "ECON",
            "title": "INTRODUCTION TO APPLIED ECONOMETRICS"
        }
    },
    {
        "data": {
            "description": "Analysis of fixed income, bond markets. The objective of the class is to introduce tools for evaluating bonds and making decisions about trading and hedging portfolios of fixed income securities. The main focus is on government bonds and derivative securities associated with them. Consider basic ways to price these bonds using techniques that are well established on Wall St. Introduces basic trading strategies based on exploiting mis-priced securities. Such strategies are profitable when risks are minimized, and so we will discuss several ways to measure and minimize risk. Also discusses the pricing of derivative securities such as bond options and swaps. Other topics include repo financing, mortgage markets, and basic issues involving default risk of corporate bonds.",
            "id": "FINANCE 340",
            "parent": "FINANCE",
            "title": "FIXED INCOME SECURITIES"
        }
    },
    {
        "data": {
            "description": "Application of financial theory to the operations of multinational firms; survey of the international financial environment; determinants of international portfolio and direct investment capital flows; management of foreign exchange position and hedging strategies; evaluation of foreign investment projects (multinational capital budgeting); international financial structure decisions; multinational credit institutions and capital markets; taxation of international business.",
            "id": "FINANCE/INTLBUS 445",
            "title": "MULTINATIONAL BUSINESS FINANCE"
        }
    },
    {
        "data": {
            "description": "As a capstone, it bridges prior academic coursework with professional practice and standards. Employ skills and tools needed to acquire the relevant information and develop a comprehensive financial plan for a client. Provides a complete review of the financial planning CFP Board topics, including ethics and principles of communication and counseling.",
            "id": "FINANCE 602",
            "parent": "FINANCE",
            "title": "WEALTH MANAGEMENT & FINANCIAL PLANNING"
        }
    },
    {
        "data": {
            "description": "Comprehensive introduction to the finance industry ecosystem, examining a variety of industry sectors, or \"Pathways,\" within the finance world, providing a nuanced exploration of both macro and micro-level dynamics. Explores the inner workings of firms in each sector, topical events, and latest developments. Deep dive into roles and responsibilities, in preparation for diverse career opportunities.",
            "id": "FINANCE 200",
            "parent": "FINANCE",
            "title": "FINANCE INDUSTRY FUNDAMENTALS"
        }
    },
    {
        "data": {
            "description": "Concepts and techniques in corporate finance and investments. Topics include the financial environment, securities markets, financial markets, financial statements and analysis, working capital management, capital budgeting, cost of capital, dividend policy, asset valuation, investments, decision-making under uncertainty, mergers, options, and futures.",
            "id": "ECON/FINANCE 300",
            "title": "INTRODUCTION TO FINANCE"
        }
    },
    {
        "data": {
            "description": "Continuation of Finance 835.",
            "id": "FINANCE 836",
            "parent": "FINANCE",
            "title": "APPLIED SECURITY ANALYSIS AND INVESTMENT MANAGEMENT II"
        }
    },
    {
        "data": {
            "description": "Continuation ofMATH 171. Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Completion ofMATH 217implies completion ofMATH 221and114.",
            "id": "MATH 217",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY II"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Covers the pricing and uses of the most common derivative contracts including options, forward contracts, futures contracts, and exchange-traded funds (ETFs).  Also emphasizes a practical understanding of trading and management of portfolios of these contracts, and makes use of an online trading platform. Mathematical and statistical analyses are used throughout.",
            "id": "FINANCE 730",
            "parent": "FINANCE",
            "title": "DERIVATIVE SECURITIES - THEORY AND PRACTICE"
        }
    },
    {
        "data": {
            "description": "Detailed coverage of fixed income securities and their derivatives; asset backed/mortgage backed securities; pricing and portfolio strategies; term structures models and other analytical tools.",
            "id": "FINANCE 740",
            "parent": "FINANCE",
            "title": "ANALYSIS OF FIXED INCOME SECURITIES"
        }
    },
    {
        "data": {
            "description": "Development of the theory, instruments, techniques and practice of modern investment management. Topics include asset pricing and valuation under certainty and uncertainty, portfolio management, determination of interest rates, immunization strategies and derivative securities.",
            "id": "FINANCE 720",
            "parent": "FINANCE",
            "title": "INVESTMENT THEORY AND PRACTICE"
        }
    },
    {
        "data": {
            "description": "Development of the theory, method and analytical techniques of financial management. Techniques of capital budgeting; valuation of projects and firms; theory of capital structure; dividend policy; cost of capital; mergers and acquisitions.",
            "id": "FINANCE 325",
            "parent": "FINANCE",
            "title": "CORPORATION FINANCE"
        }
    },
    {
        "data": {
            "description": "Discuss topics of current and emerging interests in financial economics; analyze open questions and new methodologies that are being applied to address these questions. Build on knowledge in financial economics and further previous exposure to both continuous-time and discrete-time dynamic models. Topics will evolve over time as new papers will be added and addressed.",
            "id": "FINANCE 974",
            "parent": "FINANCE",
            "title": "ADVANCED TOPICS SEMINAR-FINANCE PHD"
        }
    },
    {
        "data": {
            "description": "Discusses the tools helpful for financing new ventures, with emphasis on their applications. The course also helps students understand the institutional setting that has an impact on the financing conditions of new ventures.",
            "id": "FINANCE 457",
            "parent": "FINANCE",
            "title": "ENTREPRENEURIAL FINANCE"
        }
    },
    {
        "data": {
            "description": "Economic problems of individuals, firms and industries with emphasis on value, price, and distribution of income.",
            "id": "ECON 101",
            "parent": "ECON",
            "title": "PRINCIPLES OF MICROECONOMICS"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "Examination and reflection of finance career pathways and current finance skills, applications and practices. Career development techniques and tools, communication and professional skills.",
            "id": "FINANCE 760",
            "parent": "FINANCE",
            "title": "CURRENT TOPICS AND APPLIED LEARNING IN FINANCE"
        }
    },
    {
        "data": {
            "description": "Examines both financial and managerial accounting for business decisions. Emphasizes preparation and interpretation of financial statements, analysis of financial information, determination of costs for products and services, and use of accounting information for planning and control of business operations.",
            "id": "ACCTIS 300",
            "parent": "ACCTIS",
            "title": "ACCOUNTING PRINCIPLES"
        }
    },
    {
        "data": {
            "description": "Examines current and emerging financial accounting theory and techniques used to measure and report financial information to investors, creditors, and other external users. Emphasizes asset and income determination, preparation and interpretation of financial statements, and related disclosure requirements.",
            "id": "ACCTIS 301",
            "parent": "ACCTIS",
            "title": "FINANCIAL REPORTING I"
        }
    },
    {
        "data": {
            "description": "Examines generally accepted accounting principles for measurement and reporting of financial information in a balance sheet, income statement, and statement of cash flows; introduction to analysis and interpretation of financial accounting data for decision-making purposes.",
            "id": "ACCTIS 100",
            "parent": "ACCTIS",
            "title": "INTRODUCTORY FINANCIAL ACCOUNTING"
        }
    },
    {
        "data": {
            "description": "Exploration of advanced subject areas possibly to be introduced into the business curriculum.",
            "id": "FINANCE 765",
            "parent": "FINANCE",
            "title": "CONTEMPORARY TOPICS"
        }
    },
    {
        "data": {
            "description": "Exploration of statistical inference and data analytics tools. Review of relevant foundations of statistics, machine learning and probability theory. Emphasis on applying the resulting concepts to canonical business examples, using both Excel and R.",
            "id": "GENBUS 704",
            "parent": "GENBUS",
            "title": "DATA TO DECISIONS"
        }
    },
    {
        "data": {
            "description": "Exploration of subject areas possibly to be introduced into the business curriculum.",
            "id": "FINANCE 365",
            "parent": "FINANCE",
            "title": "CONTEMPORARY TOPICS"
        }
    },
    {
        "data": {
            "description": "First order differential equations, introduction to multivariable calculus and constrained optimization, infinite sequences and series, methods of approximation, and a brief introduction to probability. Models and applications from business and the social sciences.",
            "id": "MATH 213",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 2"
        }
    },
    {
        "data": {
            "description": "Focuses on industry analysis and security selection, with particular emphasis on identification of value drivers and on communicating the idea to a portfolio manager.",
            "id": "FINANCE 645",
            "parent": "FINANCE",
            "title": "INTRODUCTION TO APPLIED SECURITY ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Focuses on portfolio management, including development and implementation of the decision making process.",
            "id": "FINANCE 646",
            "parent": "FINANCE",
            "title": "INTRODUCTION TO APPLIED PORTFOLIO MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Individual work suited to the needs of Ph.D. students may be arranged both during regular sessions and during the intersession periods.",
            "id": "FINANCE 999",
            "parent": "FINANCE",
            "title": "READING AND RESEARCH-FINANCE PHD"
        }
    },
    {
        "data": {
            "description": "Individual work suited to the needs of graduate students may be arranged both during regular sessions and the intersession periods.",
            "id": "FINANCE 799",
            "parent": "FINANCE",
            "title": "READING AND RESEARCH-FINANCE"
        }
    },
    {
        "data": {
            "description": "Individual work suited to the needs of undergraduate students may be arranged with faculty member.",
            "id": "FINANCE 399",
            "parent": "FINANCE",
            "title": "READING AND RESEARCH-FINANCE"
        }
    },
    {
        "data": {
            "description": "Individual work to complete dissertation requirement of Ph.D. program.",
            "id": "FINANCE 990",
            "parent": "FINANCE",
            "title": "FINANCE INDEPENDENT RESEARCH PHD THESIS"
        }
    },
    {
        "data": {
            "description": "Integrated treatment of macroeconomics and microeconomics (seeECON 101andECON 102). Accelerated approach to economics training, especially for Economics: Math Emphasis majors.",
            "id": "ECON 111",
            "parent": "ECON",
            "title": "PRINCIPLES OF ECONOMICS-ACCELERATED TREATMENT"
        }
    },
    {
        "data": {
            "description": "Intensive review of modern theories of corporate finance and investments.",
            "id": "FINANCE 920",
            "parent": "FINANCE",
            "title": "THEORY OF FINANCE"
        }
    },
    {
        "data": {
            "description": "Intensive study and critical examination of recent empirical and theoretical literature in corporate finance.",
            "id": "FINANCE 971",
            "parent": "FINANCE",
            "title": "SEMINAR-CORPORATE FINANCE (PH.D.)"
        }
    },
    {
        "data": {
            "description": "Intensive study and critical examination of recent empirical and theoretical literature investments.",
            "id": "FINANCE 970",
            "parent": "FINANCE",
            "title": "SEMINAR- INVESTMENTS (PH.D.)"
        }
    },
    {
        "data": {
            "description": "Introduces and broadens understanding of the intricacies surrounding wealth preservation, intergenerational wealth transfer, and trust financial services. Delves into the legal, tax, and financial aspects of estate planning, business succession strategies, and efficient wealth transfer techniques. Explore cutting-edge approaches for mitigating tax liabilities, navigating complex family dynamics, and structuring customized solutions for diverse client needs while highlighting career opportunities within the trust financial services industry and preparing students for a range of professional paths. Gain the expertise needed to effectively advise clients and guide them through the process of safeguarding and transferring their wealth, ensuring a lasting financial legacy.",
            "id": "FINANCE 601",
            "parent": "FINANCE",
            "title": "STRATEGIC PLANNING FOR ESTATES AND BUSINESS TRANSITIONS"
        }
    },
    {
        "data": {
            "description": "Introduces continuous-time financial models essential for the advanced analysis of derivative securities. Discuss the fundamental mathematical concepts and tools from continuous-time stochastic processes including Brownian motion, Poisson processes, stochastic calculus, and change of measure. This provides a framework for analyzing derivative securities including their pricing, hedging, and risk management. In particular, covers the Black-Scholes and stochastic volatility models for equity options; basic term-structure modeling for interest rate derivatives; and reduced-form credit-risk models. Emphasis is put on applications and economic interpretation rather than mathematical rigor.",
            "id": "FINANCE 830",
            "parent": "FINANCE",
            "title": "ADVANCED DERIVATIVE SECURITIES"
        }
    },
    {
        "data": {
            "description": "Introduction to analysis of economic data. The techniques of descriptive statistics and statistical inference (hypothesis testing and estimation) as directed toward application in economic research.",
            "id": "ECON 310",
            "parent": "ECON",
            "title": "STATISTICS: MEASUREMENT IN ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Introduction to financial management of firms and investment decision making; both theory and practice are emphasized. Topics covered include the financial environment and securities markets, financial statements and analysis, working capital management and capital budgeting, cost of capital, dividend policy, asset valuation, investments, decision making under uncertainty and selected topics such as mergers, options, futures.",
            "id": "FINANCE 700",
            "parent": "FINANCE",
            "title": "INTRODUCTION TO FINANCIAL MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Macroeconomic measurement and models of aggregate demand and supply; fiscal and monetary policy for unemployment, inflation, and growth.",
            "id": "ECON 102",
            "parent": "ECON",
            "title": "PRINCIPLES OF MACROECONOMICS"
        }
    },
    {
        "data": {
            "description": "Management of depository financial intermediaries with primary emphasis on commercial banks. Topics include bank regulation, liquidity and reserve position management, loan pricing and analysis, investment portfolio problems and overall asset liability management.",
            "id": "FINANCE 410",
            "parent": "FINANCE",
            "title": "BANK MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Pricing and uses of the most common derivatives including options, forward contracts, futures contracts, and swaps.",
            "id": "FINANCE 330",
            "parent": "FINANCE",
            "title": "DERIVATIVE SECURITIES"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Provides a broad overview of investment banking.  Topics covered include valuation, cash flow, initial public offerings, leveraged buyouts, merger and acquisitions and related corporate governance issues.",
            "id": "FINANCE 420",
            "parent": "FINANCE",
            "title": "INVESTMENT BANKING AND CAPITAL MARKETS"
        }
    },
    {
        "data": {
            "description": "Search theory provides framework for understanding markets; is used to study questions in monetary, public, financial economics.  This course will develop theoretical tools used to introduce frictions in formal models; will address the role of frictions in several applied scenarios.",
            "id": "ECON/FINANCE 503",
            "title": "MARKETS WITH FRICTIONS"
        }
    },
    {
        "data": {
            "description": "Seminar primarily devoted to the generation of original research in the field of finance for the Ph.D. dissertation and subsequent publication in the academic literature.",
            "id": "FINANCE 973",
            "parent": "FINANCE",
            "title": "SEMINAR-WORKSHOP IN FINANCE"
        }
    },
    {
        "data": {
            "description": "Special topics of current or emerging interest in financial economics.",
            "id": "FINANCE 972",
            "parent": "FINANCE",
            "title": "TOPICS SEMINAR-FINANCE PHD"
        }
    },
    {
        "data": {
            "description": "Statistical methods used in applied economic research. Topics include: survey methods and data sources; multiple regression and analysis of variance; econometric estimation; forecasting and policy applications.",
            "id": "ECON 410",
            "parent": "ECON",
            "title": "INTRODUCTORY ECONOMETRICS"
        }
    },
    {
        "data": {
            "description": "Structure and functioning of securities markets; principles of portfolio construction; models of the tradeoff between risk and expected return.",
            "id": "ECON/FINANCE 320",
            "title": "INVESTMENT THEORY"
        }
    },
    {
        "data": {
            "description": "Study of the market for corporate control including mergers and tender offers. Motives for business combinations; impacts on security holders, managers, labor, economic efficiency; federal and state laws; offensive and defensive strategies. Term paper involving comprehensive analysis of issues.",
            "id": "FINANCE 650",
            "parent": "FINANCE",
            "title": "MERGERS AND ACQUISITIONS"
        }
    },
    {
        "data": {
            "description": "The management of an actual portfolio of investments. Engage in security analysis, develop a portfolio policy, and participate in field research such as trips to interview the management of potential portfolio acquisitions.",
            "id": "FINANCE 835",
            "parent": "FINANCE",
            "title": "APPLIED SECURITY ANALYSIS AND INVESTMENT MANAGEMENT I"
        }
    },
    {
        "data": {
            "description": "Theory and practice of business valuation: using financial statements, modeling cash flows, present value, using multiples.",
            "id": "FINANCE 635",
            "parent": "FINANCE",
            "title": "BUSINESS VALUATION"
        }
    },
    {
        "data": {
            "description": "Theory and practice of financial management of firms. Techniques of capital budgeting under certainty and uncertainty; valuation of projects and firms; theory of capital structure; dividend policy; cost of capital; mergers and acquisitions.",
            "id": "FINANCE 725",
            "parent": "FINANCE",
            "title": "CORPORATION FINANCE THEORY AND PRACTICE"
        }
    },
    {
        "data": {
            "description": "Theory of business finance as applied to the operations of multinational firms; financial analysis and control of foreign investment decisions; working capital management; multinational credit institutions and capital markets; special accounting problems and trends in international monetary affairs.",
            "id": "FINANCE/INTLBUS 745",
            "title": "MULTINATIONAL BUSINESS FINANCE"
        }
    },
    {
        "data": {
            "description": "Thorough grounding in credit instruments. Topics include loans, bonds, credit default swaps, and trading strategies.",
            "id": "FINANCE 640",
            "parent": "FINANCE",
            "title": "INTRODUCTION TO CREDIT ANALYSIS & TRADING"
        }
    },
    {
        "data": {
            "description": "Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Part of a 2-semester sequence withMATH 217; these two courses together are equivalent toMATH 114and221.",
            "id": "MATH 171",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY I"
        }
    },
    {
        "data": {
            "description": "With a hands-on approach, covers advanced analytics methods for forecasting, predicting, reporting, and analyzing. Relies on Python as its primary coding language. Begins with a review of coding fundamentals and progressively delves into increasingly realistic and complex finance applications.",
            "id": "FINANCE 310",
            "parent": "FINANCE",
            "title": "DATA ANALYTICS FOR FINANCE"
        }
    },
    {
        "data": {
            "id": "ACCTIS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ECON",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "FINANCE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "GENBUS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ACCTIS 100",
            "target": "ACCTIS 300"
        }
    },
    {
        "data": {
            "source": "ACCTIS 100",
            "target": "ACCTIS 301"
        }
    },
    {
        "data": {
            "source": "ACCTIS 100",
            "target": "FINANCE 205"
        }
    },
    {
        "data": {
            "source": "ACCTIS 300",
            "target": "ACCTIS 100"
        }
    },
    {
        "data": {
            "source": "ACCTIS 300",
            "target": "ECON/FINANCE 300"
        }
    },
    {
        "data": {
            "source": "ACCTIS 301",
            "target": "FINANCE 325"
        }
    },
    {
        "data": {
            "source": "ACCTIS 301",
            "target": "FINANCE 457"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON 102"
        }
    },
    {
        "data": {
            "source": "ECON 102",
            "target": "ECON 111"
        }
    },
    {
        "data": {
            "source": "ECON 102",
            "target": "ECON 310"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON 101"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON 102"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON/FINANCE 300"
        }
    },
    {
        "data": {
            "source": "ECON 310",
            "target": "ECON 410"
        }
    },
    {
        "data": {
            "source": "ECON 310",
            "target": "ECON/FINANCE 300"
        }
    },
    {
        "data": {
            "source": "ECON 400",
            "target": "ECON 410"
        }
    },
    {
        "data": {
            "source": "ECON 400",
            "target": "ECON/FINANCE 320"
        }
    },
    {
        "data": {
            "source": "ECON 410",
            "target": "ECON 400"
        }
    },
    {
        "data": {
            "source": "ECON/FINANCE 300",
            "target": "ECON/FINANCE 320"
        }
    },
    {
        "data": {
            "source": "ECON/FINANCE 300",
            "target": "FINANCE 305"
        }
    },
    {
        "data": {
            "source": "ECON/FINANCE 300",
            "target": "FINANCE 310"
        }
    },
    {
        "data": {
            "source": "ECON/FINANCE 300",
            "target": "FINANCE 325"
        }
    },
    {
        "data": {
            "source": "ECON/FINANCE 300",
            "target": "FINANCE 330"
        }
    },
    {
        "data": {
            "source": "ECON/FINANCE 300",
            "target": "FINANCE 410"
        }
    },
    {
        "data": {
            "source": "ECON/FINANCE 300",
            "target": "FINANCE 420"
        }
    },
    {
        "data": {
            "source": "ECON/FINANCE 300",
            "target": "FINANCE 457"
        }
    },
    {
        "data": {
            "source": "ECON/FINANCE 300",
            "target": "FINANCE 601"
        }
    },
    {
        "data": {
            "source": "ECON/FINANCE 300",
            "target": "FINANCE 635"
        }
    },
    {
        "data": {
            "source": "ECON/FINANCE 300",
            "target": "FINANCE 650"
        }
    },
    {
        "data": {
            "source": "ECON/FINANCE 300",
            "target": "FINANCE/INTLBUS 445"
        }
    },
    {
        "data": {
            "source": "FINANCE 305",
            "target": "ECON/FINANCE 503"
        }
    },
    {
        "data": {
            "source": "FINANCE 325",
            "target": "FINANCE 640"
        }
    },
    {
        "data": {
            "source": "FINANCE 330",
            "target": "FINANCE 340"
        }
    },
    {
        "data": {
            "source": "FINANCE 330",
            "target": "FINANCE 640"
        }
    },
    {
        "data": {
            "source": "FINANCE 410",
            "target": "FINANCE 610"
        }
    },
    {
        "data": {
            "source": "FINANCE 645",
            "target": "FINANCE 646"
        }
    },
    {
        "data": {
            "source": "FINANCE 700",
            "target": "FINANCE 720"
        }
    },
    {
        "data": {
            "source": "FINANCE 700",
            "target": "FINANCE 725"
        }
    },
    {
        "data": {
            "source": "FINANCE 700",
            "target": "FINANCE 740"
        }
    },
    {
        "data": {
            "source": "FINANCE 700",
            "target": "FINANCE 757"
        }
    },
    {
        "data": {
            "source": "FINANCE 700",
            "target": "FINANCE/INTLBUS 745"
        }
    },
    {
        "data": {
            "source": "FINANCE 725",
            "target": "FINANCE 650"
        }
    },
    {
        "data": {
            "source": "FINANCE 835",
            "target": "FINANCE 836"
        }
    },
    {
        "data": {
            "source": "GENBUS 704",
            "target": "FINANCE 720"
        }
    },
    {
        "data": {
            "source": "GENBUS 704",
            "target": "FINANCE 740"
        }
    },
    {
        "data": {
            "source": "GENBUS 704",
            "target": "FINANCE 757"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 113"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 113",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "MATH 217"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "ECON 310"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 213"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 213",
            "target": "ECON/FINANCE 320"
        }
    },
    {
        "data": {
            "source": "MATH 213",
            "target": "ECON/FINANCE 503"
        }
    },
    {
        "data": {
            "source": "MATH 213",
            "target": "FINANCE 325"
        }
    },
    {
        "data": {
            "source": "MATH 213",
            "target": "FINANCE 330"
        }
    },
    {
        "data": {
            "source": "MATH 213",
            "target": "FINANCE 457"
        }
    },
    {
        "data": {
            "source": "MATH 213",
            "target": "FINANCE/INTLBUS 445"
        }
    },
    {
        "data": {
            "source": "MATH 217",
            "target": "ECON 410"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "ECON 111"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 171"
        }
    }
]