[
    {
        "data": {
            "description": "Interdisciplinary study of Sami (Lapp) people of Scandinavia past and present. Indigenous modes of expression and worldview, contemporary cultural and political activism. Extensive discussion of connections to Native American and Inuit experiences; rise of U.S. and other indigenous peoples' movements.",
            "id": "FOLKLORE/SCANDST 443",
            "title": "SAMI CULTURE, YESTERDAY AND TODAY"
        }
    },
    {
        "data": {
            "description": "A look at the Kalevala, the Finnish creation myth and national epic of Finland, and how it affected Finnish national identity and the eventual Finnish independence from Russia.",
            "id": "FOLKLORE/LITTRANS 347",
            "title": "IN TRANSLATION: KALEVALA AND FINNISH FOLK-LORE"
        }
    },
    {
        "data": {
            "description": "Addresses different aspects of community life and culture in the Upper Midwest; topics include ethnic groups, religious life, cultural landscapes, oral narrative, music, and material culture.",
            "id": "FOLKLORE 540",
            "parent": "FOLKLORE",
            "title": "LOCAL CULTURE AND IDENTITY IN THE UPPER MIDWEST"
        }
    },
    {
        "data": {
            "description": "Advanced directed study projects as arranged with a faculty member.",
            "id": "FOLKLORE 699",
            "parent": "FOLKLORE",
            "title": "INDEPENDENT STUDY IN FOLKLORE (GRADUATE)"
        }
    },
    {
        "data": {
            "description": "An Afro Asian perspective provides a lens through which intersections between Asian American and African American dance and martial arts are studied and practiced. Asian American and African American movement genres provide tools to explore dance fusion, choreography, and improvisation, to create dances informed by African American and Asian American legacies of struggle, innovation and transformation, while cognizant of historical forces of oppression and racism. Building connections through respectful communication with others are learned through dance practice, discussion and writing about concepts learned through readings, videos, and guest artist visits. Engagement with dance as a cultural vehicle for creative problem-solving and risk-taking occurs through guided class or smaller group activities.",
            "id": "AFROAMER/ASIANAM/DANCE/FOLKLORE 319",
            "title": "AFRO ASIAN IMPROV: FROM HIP HOP TO MARTIAL ARTS FUSION"
        }
    },
    {
        "data": {
            "description": "An introduction to the genres of American Indian Folklore. Special attention is given to creation stories, trickster tales, and the relationship between folklore and historical memory.",
            "id": "AMERIND/ANTHRO/FOLKLORE 431",
            "title": "AMERICAN INDIAN FOLKLORE"
        }
    },
    {
        "data": {
            "description": "An introduction to the study of religion through the lens of sacred places and journeys, including pilgrimage.",
            "id": "FOLKLORE/RELIGST 104",
            "title": "SACRED PLACES AND JOURNEYS"
        }
    },
    {
        "data": {
            "description": "An introductory ethnomusicology course providing a variety of ways to approach musics typically not covered in music history courses. Active engagement with these musics within their larger world contexts.",
            "id": "FOLKLORE/MUSIC 103",
            "title": "INTRODUCTION TO MUSIC CULTURES OF THE WORLD"
        }
    },
    {
        "data": {
            "description": "Combines a fieldwork practicum with scrutiny of the cultural, political, and ethical dimensions underlying the documentation and public presentation of folklore through festivals, exhibitions, publications, audio-visual productions, and digital archival collections.",
            "id": "FOLKLORE/LIS 490",
            "title": "FIELD METHODS AND THE PUBLIC PRESENTATION OF FOLKLORE"
        }
    },
    {
        "data": {
            "description": "Continuation of introductory instruction in aural skills.",
            "id": "MUSIC 172",
            "parent": "MUSIC",
            "title": "MUSICA PRACTICA: AURAL SKILLS 2"
        }
    },
    {
        "data": {
            "description": "Continuation of strategies for composing, understanding, and writing about music.",
            "id": "MUSIC 122",
            "parent": "MUSIC",
            "title": "MUSICA PRACTICA 2"
        }
    },
    {
        "data": {
            "description": "Description and analysis of native cultures, and the role of environmental and historical factors in North America.",
            "id": "AMERIND/ANTHRO 314",
            "title": "INDIANS OF NORTH AMERICA"
        }
    },
    {
        "data": {
            "description": "Directed study as arranged with a faculty member.",
            "id": "FOLKLORE 399",
            "parent": "FOLKLORE",
            "title": "DIRECTED STUDY IN FOLKLORE FOR UNDERGRADUATES"
        }
    },
    {
        "data": {
            "description": "Examination of shared traditions and historical connections between the North and Northwest of Europe. Readings of medieval and pre-modern Scandinavian, Scottish, Welsh and Irish sagas, histories, talkes. Discussion of the role of folklore in modern Celtic and Scandinavian societies.",
            "id": "FOLKLORE/MEDIEVAL/SCANDST 446",
            "title": "CELTIC-SCANDINAVIAN CULTURAL INTERRELATIONS"
        }
    },
    {
        "data": {
            "description": "Examines and interprets the roles of American Indian women in traditional societies, and in contemporary North America.",
            "id": "AMERIND/ANTHRO/FOLKLORE/GEN&WS 437",
            "title": "AMERICAN INDIAN WOMEN"
        }
    },
    {
        "data": {
            "description": "Examines the relationship between dominant images of gender representation as they emerge in expressive culture in various societies.",
            "id": "FOLKLORE/GEN&WS 428",
            "title": "GENDER AND EXPRESSIVE CULTURE"
        }
    },
    {
        "data": {
            "description": "Examines the verbal, musical, customary, and material folklore of Scandinavian Americans, with emphasis on the upper Midwest.",
            "id": "FOLKLORE/SCANDST 440",
            "title": "SCANDINAVIAN AMERICAN FOLKLORE"
        }
    },
    {
        "data": {
            "description": "Exploration of various topics in the study of folklore, folklife, myth, foodways, or music.",
            "id": "FOLKLORE 215",
            "parent": "FOLKLORE",
            "title": "ELEMENTARY TOPICS IN FOLKLORE"
        }
    },
    {
        "data": {
            "description": "Exploration of various topics in the study of folklore, folklife, myth, foodways, or music.",
            "id": "FOLKLORE 315",
            "parent": "FOLKLORE",
            "title": "INTERMEDIATE TOPICS IN FOLKLORE"
        }
    },
    {
        "data": {
            "description": "Exploration of various topics in the study of folklore, folklife, myth, foodways, or music.",
            "id": "FOLKLORE 415",
            "parent": "FOLKLORE",
            "title": "ADVANCED TOPICS IN FOLKLORE"
        }
    },
    {
        "data": {
            "description": "Explore everyday communication in social media. Learn digital recording technologies for documenting everyday communication and the use of digital content in social media.",
            "id": "COMARTS/FOLKLORE 522",
            "title": "DIGITAL STORYTELLING FOR SOCIAL MEDIA"
        }
    },
    {
        "data": {
            "description": "Explore horror as cultural phenomenon and how it represents various forms of cultural/national angst.",
            "id": "FOLKLORE 225",
            "parent": "FOLKLORE",
            "title": "HORROR AS EXPRESSIONS OF NATIONAL ANGST"
        }
    },
    {
        "data": {
            "description": "Explores artistic, social, sensory, and spiritual expressions through food that convey personal, group, and place-based identities, ethnicity, gender, and class in work and play. Reviews range of food writing and scholarly perspectives including culinary historical, structural-functional, and performance.",
            "id": "FOLKLORE 439",
            "parent": "FOLKLORE",
            "title": "FOODWAYS"
        }
    },
    {
        "data": {
            "description": "Explores evidence of belief in the supernatural in the modern world as it appears in the context of folk religion, folk medicine, legends, folk drama, ritual and custom, and media accounts and presentations. Surveys scholarly approaches to the topic. Course not available to students with credits for Folklore 415 before Fall 2023.",
            "id": "FOLKLORE/RELIGST 326",
            "title": "THE SUPERNATURAL IN THE MODERN WORLD"
        }
    },
    {
        "data": {
            "description": "Explores the development of the vampire legend in folklore, rumor, literature, cinema, television, and popular culture and in relation to topics such as colonization, race, gender, sexuality, and class.",
            "id": "FOLKLORE/LITTRANS 327",
            "title": "VAMPIRES"
        }
    },
    {
        "data": {
            "description": "Explores the performance, transmission, and consumption of traditional and popular musics outside of the standard Euro-American context. Employs musical-analytic and critical approaches to trace transnational musical circulation.",
            "id": "FOLKLORE/MUSIC 402",
            "title": "MUSICAL CULTURES OF THE WORLD"
        }
    },
    {
        "data": {
            "description": "Exploring the oral nature and performance traditions of folklore, ethnography, tales and ballads, literature and culture from Nordic areas and Scandinavia.",
            "id": "FOLKLORE/LITTRANS/MEDIEVAL/SCANDST 345",
            "title": "THE NORDIC STORYTELLER"
        }
    },
    {
        "data": {
            "description": "Focuses on language and its culture, example topics include: extinction and revival, language and nationhood, how widely and deeply languages differ, language and worldview, writing systems and literacy, language discrimination and inequality.",
            "id": "ANTHRO/FOLKLORE/INTLST/LINGUIS 211",
            "title": "GLOBAL LANGUAGE ISSUES"
        }
    },
    {
        "data": {
            "description": "Focuses on the tools (material, methodological, and ethical) for doing ethnographic fieldwork in musical contexts.",
            "id": "FOLKLORE/MUSIC 516",
            "title": "ETHNOGRAPHIC METHODS FOR MUSIC AND SOUND"
        }
    },
    {
        "data": {
            "description": "Folklore of Central, Eastern and Northern Europe and among emigrants from these regions in North America. A survey of genres of folklore, history of research, and modes of interpretation, past and present.",
            "id": "FOLKLORE/GNS 200",
            "title": "FOLKLORE OF CENTRAL, EASTERN AND NORTHERN EUROPE"
        }
    },
    {
        "data": {
            "description": "Folklore of ethnic, regional, religious, and occupational cultures, emphasizing how diverse peoples (African Americans, American Indians, Appalachians, Chicanos, Germans, Irish, Jews, Mormons, miners, service workers, etc.) use traditional festivals, artifacts, songs and stories to express their experiences within American life.",
            "id": "FOLKLORE 230",
            "parent": "FOLKLORE",
            "title": "INTRODUCTION TO AMERICAN FOLKLORE"
        }
    },
    {
        "data": {
            "description": "Intoductory istruction in aural skills.",
            "id": "MUSIC 171",
            "parent": "MUSIC",
            "title": "MUSICA PRACTICA: AURAL SKILLS 1"
        }
    },
    {
        "data": {
            "description": "Introduction to Javanese theatre performance in a Javanese epic tradition. Includes use of Javanese gamelan music as accompaniment for dance drama.",
            "id": "DANCE/FOLKLORE/THEATRE 421",
            "title": "JAVANESE PERFORMANCE REPERTORY"
        }
    },
    {
        "data": {
            "description": "Introduction to comparative ethnic studies, examining race, ethnicity, and indigeneity within the United States. Includes perspectives from African American, American Indian, Asian American, and Chican@ and Latin@ studies.",
            "id": "AFROAMER/AMERIND/ASIANAM/CHICLA/FOLKLORE 102",
            "title": "INTRODUCTION TO COMPARATIVE US ETHNIC AND AMERICAN INDIAN STUDIES"
        }
    },
    {
        "data": {
            "description": "Introduction to development of music in the European tradition, 1750 to the present.",
            "id": "MUSIC 212",
            "parent": "MUSIC",
            "title": "SURVEY OF THE HISTORY OF WESTERN MUSIC"
        }
    },
    {
        "data": {
            "description": "Introduction to ethnomusicology, including historical survey of major works in the field, classification of musical instruments, measurement of tuning systems and concepts of scale, mode and rhythm in non-Western music.",
            "id": "FOLKLORE/MUSIC 515",
            "title": "PROSEMINAR IN ETHNOMUSICOLOGY"
        }
    },
    {
        "data": {
            "description": "Introduction to folk cultural groups and folklore forms of Wisconsin.",
            "id": "FOLKLORE 320",
            "parent": "FOLKLORE",
            "title": "FOLKLORE OF WISCONSIN"
        }
    },
    {
        "data": {
            "description": "Mythology, literature, ritual, traditions, medieval folklore, and religion from Nordic areas and Scandinavia.",
            "id": "FOLKLORE/MEDIEVAL/RELIGST/SCANDST 342",
            "title": "NORDIC MYTHOLOGY"
        }
    },
    {
        "data": {
            "description": "Oral nature, structure, performance traditions, and epic ideology, from various world areas.",
            "id": "FOLKLORE 460",
            "parent": "FOLKLORE",
            "title": "FOLK EPICS"
        }
    },
    {
        "data": {
            "description": "Oral traditional literature of Eastern Europe: ritual and lyric poetry, epic, and folktale.",
            "id": "FOLKLORE/SLAVIC 444",
            "title": "SLAVIC AND EAST EUROPEAN FOLKLORE"
        }
    },
    {
        "data": {
            "description": "Representation and self-representation of ethnic cultures in Wisconsin. For example: museums, mass media, ethnic theater.",
            "id": "ANTHRO/FOLKLORE 520",
            "title": "ETHNIC REPRESENTATIONS IN WISCONSIN"
        }
    },
    {
        "data": {
            "description": "Strategies for composing, understanding, and writing about music.",
            "id": "MUSIC 121",
            "parent": "MUSIC",
            "title": "MUSICA PRACTICA 1"
        }
    },
    {
        "data": {
            "description": "Survey of Irish folklore and folklife, including narrative, music, dance, customs, material culture, and foodways, in both Ireland and beyond.",
            "id": "FOLKLORE 317",
            "parent": "FOLKLORE",
            "title": "THE IRISH TRADITION"
        }
    },
    {
        "data": {
            "description": "Survey of shamanism as a religious tradition and sociocultural force in Siberian, Asian, and Native American societies. Exploration of shamanic rituals, roles, cosmology. Cultural and political uses of shamanism in traditional and modern contexts.",
            "id": "FOLKLORE/RELIGST 352",
            "title": "SHAMANISM"
        }
    },
    {
        "data": {
            "description": "Surveys folklore in the United States and around the world, with a comparative emphasis on ways in which individuals and groups use beliefs, songs, stories, sayings, dances, festivals, and artifacts to address issues of identity, authenticity, and authority, in complex societies.",
            "id": "FOLKLORE 100",
            "parent": "FOLKLORE",
            "title": "INTRODUCTION TO FOLKLORE"
        }
    },
    {
        "data": {
            "description": "Technique and practice of classical Javanese dance in its musical, historical and cultural contexts.",
            "id": "DANCE/FOLKLORE/THEATRE 321",
            "title": "JAVANESE PERFORMANCE"
        }
    },
    {
        "data": {
            "description": "The Icelandic sagas viewed in their social, cultural, and literary contexts. An introduction to one of the greatest bodies of vernacular literature of the early Middle Ages.",
            "id": "FOLKLORE/MEDIEVAL/SCANDST 235",
            "title": "THE WORLD OF SAGAS"
        }
    },
    {
        "data": {
            "description": "The oral tradition and the written word; the composition of stories, relationship between performer and audience, and transmission of tradition in various African societies.",
            "id": "AFRICAN/FOLKLORE 210",
            "title": "THE AFRICAN STORYTELLER"
        }
    },
    {
        "data": {
            "description": "The relationship between myth and tale, history, culture. Myth research; methodological approaches; world mythologies; myth and modern times.",
            "id": "FOLKLORE/RELIGST 359",
            "title": "MYTH"
        }
    },
    {
        "data": {
            "description": "Topics in Folklore in various cultures and time periods.",
            "id": "FOLKLORE 530",
            "parent": "FOLKLORE",
            "title": "TOPICS IN FOLKLORE"
        }
    },
    {
        "data": {
            "description": "Topics in ethnomusicology within a cross-cultural framework; melodic typology, scale and tuning systems, mode, rhythm, ornamentation, improvisation techniques, oral and written traditions of composition, notation systems, and function of music society.",
            "id": "FOLKLORE/MUSIC 915",
            "title": "SEMINAR IN ETHNOMUSICOLOGY"
        }
    },
    {
        "data": {
            "description": "Topics in historical or contemporary folklore and folklife pertaining to persistently marginalized racial or ethnic groups in the United States.",
            "id": "FOLKLORE 430",
            "parent": "FOLKLORE",
            "title": "TOPICS IN AMERICAN FOLKLORE: ETHNIC STUDIES"
        }
    },
    {
        "data": {
            "description": "Types of heroes, social functions, and tellers; tales from four cultures.",
            "id": "FOLKLORE 220",
            "parent": "FOLKLORE",
            "title": "THE FOLK TALE"
        }
    },
    {
        "data": {
            "description": "Work as an intern with a public agency or a private non-profit organization involved in public folklore projects.",
            "id": "FOLKLORE 491",
            "parent": "FOLKLORE",
            "title": "PRACTICUM IN PUBLIC FOLKLORE"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "FOLKLORE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MUSIC",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "AMERIND/ANTHRO 314",
            "target": "AMERIND/ANTHRO/FOLKLORE 431"
        }
    },
    {
        "data": {
            "source": "FOLKLORE 100",
            "target": "AMERIND/ANTHRO/FOLKLORE 431"
        }
    },
    {
        "data": {
            "source": "FOLKLORE 100",
            "target": "ANTHRO/FOLKLORE 520"
        }
    },
    {
        "data": {
            "source": "FOLKLORE 230",
            "target": "AMERIND/ANTHRO/FOLKLORE 431"
        }
    },
    {
        "data": {
            "source": "FOLKLORE 320",
            "target": "AMERIND/ANTHRO/FOLKLORE 431"
        }
    },
    {
        "data": {
            "source": "FOLKLORE/GNS 200",
            "target": "ANTHRO/FOLKLORE 520"
        }
    },
    {
        "data": {
            "source": "MUSIC 121",
            "target": "MUSIC 122"
        }
    },
    {
        "data": {
            "source": "MUSIC 121",
            "target": "MUSIC 171"
        }
    },
    {
        "data": {
            "source": "MUSIC 122",
            "target": "MUSIC 172"
        }
    },
    {
        "data": {
            "source": "MUSIC 122",
            "target": "MUSIC 212"
        }
    },
    {
        "data": {
            "source": "MUSIC 171",
            "target": "MUSIC 122"
        }
    },
    {
        "data": {
            "source": "MUSIC 171",
            "target": "MUSIC 172"
        }
    },
    {
        "data": {
            "source": "MUSIC 172",
            "target": "MUSIC 122"
        }
    },
    {
        "data": {
            "source": "MUSIC 172",
            "target": "MUSIC 212"
        }
    },
    {
        "data": {
            "source": "MUSIC 212",
            "target": "FOLKLORE/MUSIC 402"
        }
    }
]