[
    {
        "data": {
            "description": "Investigates discourses of social responsibility in the French-speaking professional world and across sectors, in the fields of international development, marketing, management, and administration. By studying how concepts of socially responsible practice are represented in business and professional writing in France, Quebec and Francophone Africa, consider how trends in one's own concentration areas relate to those of classmates and future colleagues. Taught in French.",
            "id": "FRENCH 616",
            "parent": "FRENCH",
            "title": "SOCIAL RESPONSIBILITY IN CONTEMPORARY FRENCH-LANGUAGE PROFESSIONAL WRITING"
        }
    },
    {
        "data": {
            "description": "Professional internship abroad, in a French-speaking business or organization, in the student's professional field.",
            "id": "FRENCH 793",
            "parent": "FRENCH",
            "title": "PROFESSIONAL FRENCH MASTERS PROGRAM INTERNSHIP"
        }
    },
    {
        "data": {
            "description": "Study and analysis of the culture and sociology of professional environments in the French and Francophone worlds, including government, international organizations, NGO's and business. Students develop communication skills through interactive teaching methods in multimedia labs.",
            "id": "FRENCH/INTLBUS 313",
            "title": "PROFESSIONAL COMMUNICATION AND CULTURE IN THE FRANCOPHONE WORLD"
        }
    },
    {
        "data": {
            "description": "",
            "id": "FRENCH/GERMAN/HISTORY/POLISCI/SOC 804",
            "title": "INTERDISCIPLINARY WESTERN EUROPEAN AREA STUDIES SEMINAR"
        }
    },
    {
        "data": {
            "description": "A study of how culture has evolved over the course of French history, in relation to a chosen topic. Taught in French.",
            "id": "FRENCH 462",
            "parent": "FRENCH",
            "title": "FRENCH/FRANCOPHONE CULTURAL STUDIES ACROSS THE CENTURIES"
        }
    },
    {
        "data": {
            "description": "A study of how literature has evolved over the course of French history, in relation to a chosen topic. Taught in French.",
            "id": "FRENCH 461",
            "parent": "FRENCH",
            "title": "FRENCH/FRANCOPHONE LITERARY STUDIES ACROSS THE CENTURIES"
        }
    },
    {
        "data": {
            "description": "A study of the latest developments in contemporary French Literature. Taught in French.",
            "id": "FRENCH 467",
            "parent": "FRENCH",
            "title": "ASPECTS OF CONTEMPORARY FRENCH LITERATURE"
        }
    },
    {
        "data": {
            "description": "Accelerated development of Italian oral, reading and writing skills, equivalent to the completion of bothITALIAN 203andITALIAN 204.",
            "id": "ITALIAN 205",
            "parent": "ITALIAN",
            "title": "ACCELERATED INTERMEDIATE ITALIAN"
        }
    },
    {
        "data": {
            "description": "Accelerated development of communicative literacy skills in French and exploration of the contemporary French-speaking world, equivalent to the completion of bothFRENCH 101andFRENCH 102.",
            "id": "FRENCH 105",
            "parent": "FRENCH",
            "title": "ACCELERATED INTRODUCTORY FRENCH"
        }
    },
    {
        "data": {
            "description": "Advanced independent study as arranged with a faculty member.",
            "id": "FRENCH 698",
            "parent": "FRENCH",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Advanced independent study as arranged with a faculty member.",
            "id": "FRENCH 699",
            "parent": "FRENCH",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Advanced oral practice and conversation, grammar review, reading, vocabulary expansion, creative writing and study of French and Francophone cultures.",
            "id": "FRENCH 204",
            "parent": "FRENCH",
            "title": "FOURTH SEMESTER FRENCH"
        }
    },
    {
        "data": {
            "description": "Advanced study of 18th-century French literature and culture, in relation to a chosen topic. Taught in French.",
            "id": "FRENCH 630",
            "parent": "FRENCH",
            "title": "THE AGE OF REASON"
        }
    },
    {
        "data": {
            "description": "Advanced study of important literary works of the 17th century. Taught in French.",
            "id": "FRENCH 639",
            "parent": "FRENCH",
            "title": "17TH-CENTURY LITERATURE"
        }
    },
    {
        "data": {
            "description": "Advanced study of important literary works of the 20th century. Taught in French.",
            "id": "FRENCH 647",
            "parent": "FRENCH",
            "title": "THE 20TH-CENTURY FRENCH NOVEL"
        }
    },
    {
        "data": {
            "description": "An introduction to French colonialism in the New World and its effects on African-American, Afro-Creole, Native American, Franco-American, Cajun, and Caribbean diasporan communities in the U.S. through literature, history, and culture.",
            "id": "FRENCH 248",
            "parent": "FRENCH",
            "title": "ETHNIC STUDIES IN THE FRENCH/FRANCOPHONE WORLD(S)"
        }
    },
    {
        "data": {
            "description": "An introduction to graduate studies in French that provides the necessary skills for success. Includes exploration of structure and expectations of graduate programs, the basics of scholarly research, reflection upon research interests and possible individual scholarly identities, and academic conferences. Taught in French.",
            "id": "FRENCH 750",
            "parent": "FRENCH",
            "title": "RESEARCH LABORATORY I: INTRODUCTION TO GRADUATE RESEARCH"
        }
    },
    {
        "data": {
            "description": "An introduction to political, social, intellectual, artistic and literary developments in French and Francophone culture, within the time period from the French Revolution to the current era. Taught in French.",
            "id": "FRENCH 348",
            "parent": "FRENCH",
            "title": "MODERNITY STUDIES"
        }
    },
    {
        "data": {
            "description": "An introduction to reading and analyzing literary works, comics, and film, with special emphasis on the development of writing skills in French.",
            "id": "FRENCH 271",
            "parent": "FRENCH",
            "title": "LITERATURE, COMICS, AND FILM IN FRENCH"
        }
    },
    {
        "data": {
            "description": "An introduction to the political, social, intellectual, artistic and literary development of French culture, from its origins to the French Revolution (1789). Taught in French.",
            "id": "FRENCH 347",
            "parent": "FRENCH",
            "title": "MEDIEVAL AND EARLY MODERN CULTURE"
        }
    },
    {
        "data": {
            "description": "An introduction to theoretical and critical thinking about literary and visual texts, meant to accompany and supplement interpretative skills. Fundamental notions of rhetoric (principles of versification) and principles of narratology designed to improve the practice of close reading in poetry, drama, prose, and cinema across time periods. Taught in French.",
            "id": "FRENCH 569",
            "parent": "FRENCH",
            "title": "CRITICAL APPROACHES TO LITERATURE AND CULTURE: FRENCH AND FRANCOPHONE PERSPECTIVES"
        }
    },
    {
        "data": {
            "description": "An introductory, interdisciplinary area of French studies with a focus on French literary texts in English translation.",
            "id": "FRENCH 211",
            "parent": "FRENCH",
            "title": "FRENCH LITERARY AND INTERDISCIPLINARY STUDIES"
        }
    },
    {
        "data": {
            "description": "An overview of the global humanitarian NGO, Doctors without Borders (or Médecins sans Frontières MSF) including its history, mission, organization, and the cultural, political, and ethical challenges it faces. Explores issues of global health, social justice, and humanitarian action. Features distinguished global practitioners with first-hand experience in health crisis situations.",
            "id": "FRENCH 288",
            "parent": "FRENCH",
            "title": "DOCTORS WITHOUT BORDERS (MÉDECINS SANS FRONTIÈRES)"
        }
    },
    {
        "data": {
            "description": "Aspects of French culture as manifested in painting, photography, film or other visual media in relation to literature. Taught in French.",
            "id": "FRENCH 325",
            "parent": "FRENCH",
            "title": "VISUAL CULTURE IN FRENCH/FRANCOPHONE STUDIES"
        }
    },
    {
        "data": {
            "description": "Choice of themes and periods studied will vary, and may range from historical surveys of the meanings of health and illness across the spectrum of French and Francophone cultures, to a close examination of texts or literary genres from a particular time that incorporate or respond to biomedical knowledge. Genre studied could include prose fiction, theater, creative non-fiction, film, comics, and works of medical popularization. Taught in French.",
            "id": "FRENCH 464",
            "parent": "FRENCH",
            "title": "LITERATURE AND MEDICINE IN FRENCH-SPEAKING CULTURES"
        }
    },
    {
        "data": {
            "description": "Cultural study of contemporary Francophone Africa, focusing on issues in government, organizations and enterprise. Exploration of cultural and professional relations between Francophone Africa and France, the European Union, and the United States.",
            "id": "FRENCH/INTLBUS 314",
            "title": "CONTEMPORARY ISSUES IN BUSINESS, GOVERNMENT AND NGOS"
        }
    },
    {
        "data": {
            "description": "Develop writing and oral expression at an advanced level through writing and discussion of internet journalism, translation, or creative genres. Taught in French.",
            "id": "FRENCH 312",
            "parent": "FRENCH",
            "title": "ADVANCED WRITING WORKSHOP"
        }
    },
    {
        "data": {
            "description": "Development of accurate and nuanced capacity for expression in Italian and for understanding the spoken and written language. Also addresses Italian phonetics and phonology to develop accurate pronunciation.",
            "id": "ITALIAN 311",
            "parent": "ITALIAN",
            "title": "ADVANCED ITALIAN LANGUAGE"
        }
    },
    {
        "data": {
            "description": "Dissertation writing practicum.",
            "id": "FRENCH 901",
            "parent": "FRENCH",
            "title": "SEMINAR-MATERIALS AND METHODS OF RESEARCH"
        }
    },
    {
        "data": {
            "description": "Enhance writing and speaking proficiency through cultural readings on France and  the francophone world. Review of grammar and focus on more complex grammatical structures.",
            "id": "FRENCH 228",
            "parent": "FRENCH",
            "title": "INTERMEDIATE LANGUAGE AND CULTURE"
        }
    },
    {
        "data": {
            "description": "Enhances speaking in an informal, conversational atmosphere at the French House. Taught in French.",
            "id": "FRENCH 301",
            "parent": "FRENCH",
            "title": "PRACTICAL FRENCH CONVERSATION"
        }
    },
    {
        "data": {
            "description": "Examines how contemporary business and professional writing in French portrays professional skill sets for readers in Francophone Europe and North America, and to a lesser extent in Francophone Africa, particularly in the fields of international education, international development, marketing, management, and administration. Taught in French.",
            "id": "FRENCH 617",
            "parent": "FRENCH",
            "title": "CONTEMPORARY SKILL SET LITERATURE IN FRENCH"
        }
    },
    {
        "data": {
            "description": "Exploration of a thematic selection of texts from the Early Modern period. Taught in French.",
            "id": "FRENCH 431",
            "parent": "FRENCH",
            "title": "READINGS IN EARLY MODERN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Exploration of a thematic selection of texts from the Middle Ages and the Renaissance. Taught in French.",
            "id": "FRENCH 430",
            "parent": "FRENCH",
            "title": "READINGS IN MEDIEVAL AND RENAISSANCE LITERATURE"
        }
    },
    {
        "data": {
            "description": "Explores a specific topic in the history of French and/or Francophone literature and culture; includes analysis and interpretation of texts and/or film in their historical contexts. May be focused on one, or cut across different literary periods. Applies diverse interpretative methodologies to a coherent body of material. Taught in French.",
            "id": "FRENCH 672",
            "parent": "FRENCH",
            "title": "TOPICS IN LITERATURE AND CULTURE"
        }
    },
    {
        "data": {
            "description": "Explores how women from different francophone regions (North and Sub-Saharan Africa and the Middle East) gain agency through literature, movies, comics, and songs, contesting different forms of domination, exclusion, and injustice, based on gender, race, class, and religion.",
            "id": "FRENCH 285",
            "parent": "FRENCH",
            "title": "REBELLIOUS WOMEN"
        }
    },
    {
        "data": {
            "description": "French grammar and style, with a special focus on various critical and professional applications. Taught in French.",
            "id": "FRENCH 615",
            "parent": "FRENCH",
            "title": "ADVANCED GRAMMAR"
        }
    },
    {
        "data": {
            "description": "Further enhances speaking in an informal, conversational atmosphere at the French House. Taught in French.",
            "id": "FRENCH 302",
            "parent": "FRENCH",
            "title": "PRACTICAL FRENCH CONVERSATION"
        }
    },
    {
        "data": {
            "description": "Grammatical review and stylistic practice. Taught in French.",
            "id": "FRENCH 825",
            "parent": "FRENCH",
            "title": "GRAMMAR AND STYLE"
        }
    },
    {
        "data": {
            "description": "Independent study as arranged with a faculty member.",
            "id": "FRENCH 298",
            "parent": "FRENCH",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Independent study as arranged with a faculty member.",
            "id": "FRENCH 299",
            "parent": "FRENCH",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Independent study as arranged with a faculty member.",
            "id": "FRENCH 799",
            "parent": "FRENCH",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Individual mentored study for seniors completing theses for Honors in the Major as arranged with a faculty member.",
            "id": "FRENCH 681",
            "parent": "FRENCH",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Individual mentored study for seniors completing theses for Honors in the Major as arranged with a faculty member.",
            "id": "FRENCH 682",
            "parent": "FRENCH",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Individual mentored study for seniors completing theses, as arranged with a faculty member.",
            "id": "FRENCH 691",
            "parent": "FRENCH",
            "title": "THESIS"
        }
    },
    {
        "data": {
            "description": "Individual mentored study for seniors completing theses, as arranged with a faculty member.",
            "id": "FRENCH 692",
            "parent": "FRENCH",
            "title": "THESIS"
        }
    },
    {
        "data": {
            "description": "Intended for instructors of elementary- and intermediate-level collegiate instructors of Italian; key concepts of communicative, literacy-oriented language teaching and related techniques for classroom instruction of Italian.",
            "id": "FRENCH/ITALIAN 821",
            "title": "ISSUES IN METHODS OF TEACHING FRENCH AND ITALIAN"
        }
    },
    {
        "data": {
            "description": "Intensive grammar and reading for those with little or no experience in French. Readings from appropriate texts in the humanities, sciences, social sciences.",
            "id": "FRENCH 391",
            "parent": "FRENCH",
            "title": "FRENCH FOR READING KNOWLEDGE"
        }
    },
    {
        "data": {
            "description": "Introduction to important literary works from the medieval era to the French Revolution. Taught in French.",
            "id": "FRENCH 321",
            "parent": "FRENCH",
            "title": "MEDIEVAL AND EARLY MODERN FRENCH LITERATURE"
        }
    },
    {
        "data": {
            "description": "Introduction to important literary works of modernity (from the French Revolution to the twenty-first century). Taught in French.",
            "id": "FRENCH 322",
            "parent": "FRENCH",
            "title": "MODERN FRENCH AND FRANCOPHONE LITERATURE"
        }
    },
    {
        "data": {
            "description": "Introduction to structural similarities and differences apparent in major Romance languages (French, Italian, Portuguese, Spanish) and to their historical developments, with reference to basic linguistic features of each language: phonology, morphology, syntax, and lexicon.",
            "id": "FRENCH/ITALIAN/PORTUG/SPANISH 429",
            "title": "INTRODUCTION TO THE ROMANCE LANGUAGES"
        }
    },
    {
        "data": {
            "description": "Introduction to teaching collegiate world languages with an emphasis on communicative and literacy-based pedagogical strategies.",
            "id": "FRENCH 820",
            "parent": "FRENCH",
            "title": "COLLEGE TEACHING OF FRENCH"
        }
    },
    {
        "data": {
            "description": "Learn to write essays on a variety of topics, using different registers of French, and work to correct pronunciation and improve conversation skills. Taught in French.",
            "id": "FRENCH 311",
            "parent": "FRENCH",
            "title": "ADVANCED COMPOSITION AND SPEAKING"
        }
    },
    {
        "data": {
            "description": "Literary and philosophical trends of the Age of Enlightenment with special emphasis on Montesquieu, Voltaire, Diderot, and Rousseau. Taught in French.",
            "id": "FRENCH 631",
            "parent": "FRENCH",
            "title": "17TH-CENTURY FRENCH LITERATURE"
        }
    },
    {
        "data": {
            "description": "Mentored reading and research for students with dissertator status.",
            "id": "FRENCH 990",
            "parent": "FRENCH",
            "title": "INDIVIDUAL RESEARCH"
        }
    },
    {
        "data": {
            "description": "Modern and contemporary topics in the African francophone world, which includes both the African continent and the African diaspora. Taught in English.",
            "id": "AFRICAN/FRENCH 216",
            "title": "MODERN AND CONTEMPORARY FRANCOPHONE TOPICS"
        }
    },
    {
        "data": {
            "description": "Oral practice and conversation, grammar review, reading, vocabulary expansion, creative writing and study of French and Francophone cultures.",
            "id": "FRENCH 203",
            "parent": "FRENCH",
            "title": "THIRD SEMESTER FRENCH"
        }
    },
    {
        "data": {
            "description": "Oral practice and conversation, grammar, reading, vocabulary building, and study of French and Francophone cultures.",
            "id": "FRENCH 101",
            "parent": "FRENCH",
            "title": "FIRST SEMESTER FRENCH"
        }
    },
    {
        "data": {
            "description": "Oral practice and conversation, grammar, reading, vocabulary building, and study of French and Francophone cultures.",
            "id": "FRENCH 102",
            "parent": "FRENCH",
            "title": "SECOND SEMESTER FRENCH"
        }
    },
    {
        "data": {
            "description": "Oral practice and conversation, grammar, reading, vocabulary building, and study of Italian cultures.",
            "id": "ITALIAN 101",
            "parent": "ITALIAN",
            "title": "FIRST SEMESTER ITALIAN"
        }
    },
    {
        "data": {
            "description": "Oral practice and conversation, grammar, reading, vocabulary building, and study of Italian cultures.",
            "id": "ITALIAN 102",
            "parent": "ITALIAN",
            "title": "SECOND SEMESTER ITALIAN"
        }
    },
    {
        "data": {
            "description": "Overview of cinematic works from francophone Africa and/or other areas of Africa. Teaches analysis and writing about cinema. Explores links between cinema and national or regional politics and ideology. Examines spectatorship in relation to questions of identity formation.",
            "id": "AFRICAN/FRENCH 440",
            "title": "AFRICAN/FRANCOPHONE FILM"
        }
    },
    {
        "data": {
            "description": "Particular emphasis on discussion, research, and collective preparation of readings, on a topic within French and/or Francophone cultural studies. Taught in French.",
            "id": "FRENCH 568",
            "parent": "FRENCH",
            "title": "UNDERGRADUATE SEMINAR IN FRENCH/FRANCOPHONE CULTURAL STUDIES"
        }
    },
    {
        "data": {
            "description": "Particular emphasis on discussion, research, and collective preparation of readings, on a topic within French and/or Francophone literary studies. Taught in French.",
            "id": "FRENCH 567",
            "parent": "FRENCH",
            "title": "UNDERGRADUATE SEMINAR IN FRENCH/FRANCOPHONE LITERARY STUDIES"
        }
    },
    {
        "data": {
            "description": "Professional communication for advanced speakers of French, with a particular focus on intercultural analysis, nonverbal communication, and public speaking. Taught in French.",
            "id": "FRENCH 623",
            "parent": "FRENCH",
            "title": "ORAL COMMUNICATION"
        }
    },
    {
        "data": {
            "description": "Provides the necessary skills for success in the PhD program. Includes exploration of structure and expectations, as well as of the professional skills needed to succeed in the profession after graduation. Taught in French.",
            "id": "FRENCH 752",
            "parent": "FRENCH",
            "title": "RESEARCH LABORATORY II: PRODUCING PROFESSIONAL RESEARCH"
        }
    },
    {
        "data": {
            "description": "Representative French-language films will be studied from an esthetic and a cultural perspective. Choice of themes and periods studied will vary, and may range from historical surveys to a close examination of films from a particular time or place. Taught in French.",
            "id": "FRENCH 465",
            "parent": "FRENCH",
            "title": "FRENCH/FRANCOPHONE FILM"
        }
    },
    {
        "data": {
            "description": "Selected applied language topics pertaining to teaching French as a second language. Taught in French.",
            "id": "FRENCH 350",
            "parent": "FRENCH",
            "title": "APPLIED FRENCH LANGUAGE STUDIES"
        }
    },
    {
        "data": {
            "description": "Study of 19th-century poetry. Taught in French.",
            "id": "FRENCH 951",
            "parent": "FRENCH",
            "title": "SEMINAR ON 19TH CENTURY FRENCH POETRY"
        }
    },
    {
        "data": {
            "description": "Study of French literary texts embedded in their cultural contexts, with a focus on clothing and fashion. Chart the emergence and representation of sartorial taste in France through analysis and discussion of selected texts and other media that feature clothing as a reflection of aesthetic and social values. Rather than evidence for material and economic history, literature and the visual arts will be ways to touch on issues such as the evolution of the notion of human physical beauty, of taste, of gender differences and roles, of social status and stratification in different historical contexts.",
            "id": "FRENCH 345",
            "parent": "FRENCH",
            "title": "FRENCH FASHION AND LITERATURE FROM THE MIDDLE AGES TO TODAY"
        }
    },
    {
        "data": {
            "description": "Study of French sounds, phonetic transcription, practice in pronunciation. Taught in French.",
            "id": "FRENCH 590",
            "parent": "FRENCH",
            "title": "INTRODUCTION TO PHONETICS"
        }
    },
    {
        "data": {
            "description": "Study of important literary works of the 14th and 15th centuries. Taught in French.",
            "id": "FRENCH/MEDIEVAL 704",
            "title": "LA LITTERATURE FRANCAISE DU XIV ET DU XV SIECLE"
        }
    },
    {
        "data": {
            "description": "Study of literary texts from diverse Francophone cultures (Africa, the Caribbean, Quebec) and the cultural and political dynamics between these texts and these cultures. Taught in French.",
            "id": "FRENCH 665",
            "parent": "FRENCH",
            "title": "INTRODUCTION TO FRANCOPHONE STUDIES"
        }
    },
    {
        "data": {
            "description": "Study of literature and culture organized thematically or by time period. Taught in French.",
            "id": "FRENCH 947",
            "parent": "FRENCH",
            "title": "SEMINAR: LITERATURE QUESTIONS"
        }
    },
    {
        "data": {
            "description": "Study of literature and culture organized thematically or by time period. Taught in French.",
            "id": "FRENCH 948",
            "parent": "FRENCH",
            "title": "SEMINAR: LITERATURE QUESTIONS"
        }
    },
    {
        "data": {
            "description": "Study published contemporary French-language writing on career strategies for emerging professionals and professionals in transition in Europe, Africa and North America. Taught in French.",
            "id": "FRENCH 618",
            "parent": "FRENCH",
            "title": "CAREER STRATEGIES FOR THE FRENCH-SPEAKING WORLD"
        }
    },
    {
        "data": {
            "description": "Survey of major socio-political, cultural, and economic developments in the major French-speaking regions of the world, with a focus on Europe, Africa and Canada. Taught in French.",
            "id": "FRENCH 642",
            "parent": "FRENCH",
            "title": "CULTURE AND SOCIETIES"
        }
    },
    {
        "data": {
            "description": "Used as a study abroad equivalent for French/Francophone civilization courses. Enrollment in a UW-Madison study abroad program",
            "id": "FRENCH 362",
            "parent": "FRENCH",
            "title": "STUDY ABROAD: FRENCH/FRANCOPHONE CIVILIZATION"
        }
    },
    {
        "data": {
            "description": "Used as a study abroad equivalent for French/Francophone literature courses. Enrollment in a UW-Madison study abroad program",
            "id": "FRENCH 361",
            "parent": "FRENCH",
            "title": "STUDY ABROAD: FRENCH/FRANCOPHONE LITERATURE"
        }
    },
    {
        "data": {
            "description": "Used as a study abroad equivalent for advanced-level French language courses. Enrollment in a UW-Madison study abroad program",
            "id": "FRENCH 316",
            "parent": "FRENCH",
            "title": "STUDY ABROAD: ADVANCED FRENCH LANGUAGE"
        }
    },
    {
        "data": {
            "description": "Used as a study abroad equivalent. Enrollment in a UW-Madison study abroad program",
            "id": "FRENCH 420",
            "parent": "FRENCH",
            "title": "TOPICS IN FRENCH: STUDY ABROAD"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "FRENCH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ITALIAN",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "FRENCH 101",
            "target": "FRENCH 102"
        }
    },
    {
        "data": {
            "source": "FRENCH 102",
            "target": "FRENCH 105"
        }
    },
    {
        "data": {
            "source": "FRENCH 102",
            "target": "FRENCH 203"
        }
    },
    {
        "data": {
            "source": "FRENCH 203",
            "target": "FRENCH 204"
        }
    },
    {
        "data": {
            "source": "FRENCH 203",
            "target": "FRENCH 301"
        }
    },
    {
        "data": {
            "source": "FRENCH 204",
            "target": "FRENCH 228"
        }
    },
    {
        "data": {
            "source": "FRENCH 204",
            "target": "FRENCH 302"
        }
    },
    {
        "data": {
            "source": "FRENCH 228",
            "target": "FRENCH 271"
        }
    },
    {
        "data": {
            "source": "FRENCH 228",
            "target": "FRENCH 311"
        }
    },
    {
        "data": {
            "source": "FRENCH 228",
            "target": "FRENCH 312"
        }
    },
    {
        "data": {
            "source": "FRENCH 228",
            "target": "FRENCH 590"
        }
    },
    {
        "data": {
            "source": "FRENCH 228",
            "target": "FRENCH/INTLBUS 313"
        }
    },
    {
        "data": {
            "source": "FRENCH 271",
            "target": "FRENCH 321"
        }
    },
    {
        "data": {
            "source": "FRENCH 271",
            "target": "FRENCH 322"
        }
    },
    {
        "data": {
            "source": "FRENCH 271",
            "target": "FRENCH 325"
        }
    },
    {
        "data": {
            "source": "FRENCH 271",
            "target": "FRENCH 348"
        }
    },
    {
        "data": {
            "source": "FRENCH 271",
            "target": "FRENCH 350"
        }
    },
    {
        "data": {
            "source": "FRENCH 321",
            "target": "FRENCH 347"
        }
    },
    {
        "data": {
            "source": "FRENCH 321",
            "target": "FRENCH 430"
        }
    },
    {
        "data": {
            "source": "FRENCH 321",
            "target": "FRENCH 431"
        }
    },
    {
        "data": {
            "source": "FRENCH 321",
            "target": "FRENCH 461"
        }
    },
    {
        "data": {
            "source": "FRENCH 322",
            "target": "FRENCH 462"
        }
    },
    {
        "data": {
            "source": "FRENCH 322",
            "target": "FRENCH 464"
        }
    },
    {
        "data": {
            "source": "FRENCH 322",
            "target": "FRENCH 465"
        }
    },
    {
        "data": {
            "source": "FRENCH 322",
            "target": "FRENCH 467"
        }
    },
    {
        "data": {
            "source": "FRENCH 461",
            "target": "FRENCH 567"
        }
    },
    {
        "data": {
            "source": "FRENCH 461",
            "target": "FRENCH 568"
        }
    },
    {
        "data": {
            "source": "FRENCH 461",
            "target": "FRENCH 569"
        }
    },
    {
        "data": {
            "source": "FRENCH 462",
            "target": "FRENCH 568"
        }
    },
    {
        "data": {
            "source": "FRENCH 467",
            "target": "FRENCH 567"
        }
    },
    {
        "data": {
            "source": "FRENCH 467",
            "target": "FRENCH 569"
        }
    },
    {
        "data": {
            "source": "FRENCH/INTLBUS 313",
            "target": "FRENCH/INTLBUS 314"
        }
    },
    {
        "data": {
            "source": "ITALIAN 101",
            "target": "ITALIAN 102"
        }
    },
    {
        "data": {
            "source": "ITALIAN 102",
            "target": "ITALIAN 205"
        }
    },
    {
        "data": {
            "source": "ITALIAN 205",
            "target": "ITALIAN 311"
        }
    },
    {
        "data": {
            "source": "ITALIAN 311",
            "target": "FRENCH/ITALIAN/PORTUG/SPANISH 429"
        }
    }
]