[
    {
        "data": {
            "description": "A human rights approach to global women's health to provide an overview of health issues within the context of a woman's life cycle. It will pay special attention to the socio-cultural and economic factors that play a role in determining women's access to quality basic health care.",
            "id": "GEN&WS/INTLST 535",
            "title": "WOMEN'S GLOBAL HEALTH AND HUMAN RIGHTS"
        }
    },
    {
        "data": {
            "description": "Advanced level investigation of some specific topic in gender and women's studies.",
            "id": "GEN&WS 720",
            "parent": "GEN&WS",
            "title": "SPECIAL TOPICS IN GENDER AND WOMEN'S STUDIES"
        }
    },
    {
        "data": {
            "description": "An examination of Latinx women's lives, experiences, and activism through the lens of testimonio, life histories, and feminist writings rooted in social justice movements and critical pedagogies.",
            "id": "CHICLA/GEN&WS/GEOG 308",
            "title": "LATINX FEMINISMS: WOMEN'S LIVES, WORK, AND ACTIVISM"
        }
    },
    {
        "data": {
            "description": "An interdisciplinary examination of the position of women in a variety of social contexts; an analysis of the society--specific and universal social forces that determine the position of women; an investigation of the change in women's status and role worldwide and an inquiry into the causes of this change.",
            "id": "GEN&WS 420",
            "parent": "GEN&WS",
            "title": "WOMEN IN CROSS-SOCIETAL PERSPECTIVE"
        }
    },
    {
        "data": {
            "description": "Completion of the senior honors capstone project begun in Gender and Women's Studies 681 carried out under the supervision of an advisor in the women's studies program.",
            "id": "GEN&WS 682",
            "parent": "GEN&WS",
            "title": "SENIOR HONORS THESIS II"
        }
    },
    {
        "data": {
            "description": "Contributions of women anthropologists to feminist and anthropological theories and research methods. Field research and gender. Current debates in women's studies and anthropology in light of recent research on women and gender in cross-cultural perspective.",
            "id": "ANTHRO/GEN&WS 443",
            "title": "ANTHROPOLOGY BY WOMEN"
        }
    },
    {
        "data": {
            "description": "Examines Black women's struggles for racial justices; reconsiders conventional notions of leadership, politics and protest. Topics include abolitionism, anti-lynching campaigns, woman suffrage, labor movement, club movement, cultural expressions, civil rights protest, Black feminism/womanism, poverty and welfare rights, environmental racism, etc.",
            "id": "AFROAMER/GEN&WS 624",
            "title": "AFRICAN AMERICAN WOMEN'S ACTIVISM (19TH & 20TH CENTURIES)"
        }
    },
    {
        "data": {
            "description": "Examines the gendered nature of political institutions around the world, including implications of women's exclusions from public life in a global context; the obstacles to women's greater participation; how women have gained greater voice in political leadership in some countries; and the differences women make in the political arena. Not open to students with credit for POLI SCI 643 prior to fall 2017",
            "id": "GEN&WS/POLISCI 429",
            "title": "GENDER AND POLITICS IN COMPARATIVE PERSPECTIVE"
        }
    },
    {
        "data": {
            "description": "Examines the legal and social development and implications of laws governing sexual behavior, human reproduction, media, privacy, and topics related to sexuality, sex and gender. Includes historical analyses of laws connected to present day regulations of sexuality, demonstrating the origins of many of the world's most frequently debated civil rights issues. Chief focus on the United States legal system, with some content including examinations of institutions around the world. Investigates taken-for-granted knowledge and assumptions about sexuality and look at legal, cultural and social constructions of sex in society. Covers intersectional social implications, including race, (dis)ability, class, etc. Topics include: obscenity, pornography, sex work, sexual surrogacy, birth control, abortion, sex education, sexual violence, sex offenders, sexual citizenship rights, trans and intersex legal topics.",
            "id": "GEN&WS/LEGALST/SOC 406",
            "title": "LAW, SEXUALITY, & SOCIETY"
        }
    },
    {
        "data": {
            "description": "Experience the excitement and rewards of doing research in the field of Gender and Women's Studies via substantial instruction in the four modes of literacy (that is, speaking, reading, writing, and listening). Through engagement with primary sources, you will ask and define research questions, find and analyze evidence, assess and discuss scholarly interpretations of same sources, build a bibliography, and try out making an argument. Upon successful completion of this course, you will be prepared to undertake substantial research and writing in more advanced courses.",
            "id": "GEN&WS 240",
            "parent": "GEN&WS",
            "title": "FEMINIST APPROACH TO RESEARCH AND WRITING"
        }
    },
    {
        "data": {
            "description": "Explore the experiences, needs, and goals of bisexual/biromantic, pansexual/panromantic, and asexual/aromantic (BPA) people, as well as their interactions with the mainstream lesbian  gay community. Consider outcome disparities, community coalition building, and media representation. Explore how multiple marginalization within BPA communities may complicate analysis of members' experiences.",
            "id": "GEN&WS 344",
            "parent": "GEN&WS",
            "title": "BI/PAN/ASEXUALITY: COMMUNITY & REPRESENTATION"
        }
    },
    {
        "data": {
            "description": "Explores African American women's experience from waning days of slavery to present. Topics include slavery, emancipation, reconstruction, segregation, migration, urban and rural poverty, civil rights, nationalism, feminism and sexual politics.",
            "id": "AFROAMER/GEN&WS 324",
            "title": "BLACK WOMEN IN AMERICA: RECONSTRUCTION TO THE PRESENT"
        }
    },
    {
        "data": {
            "description": "Explores central assumptions, questions, and debates regarding the relationship between feminist theory, pro-feminist theory, and the practice and performance of multiple masculinities. Explores feminist-informed definitions of and debates about masculinity including whether masculinity is primarily a gender-role and/or a form of sexual expression. Further, key tensions related to men's status, or their lack thereof, as subjects of feminist theory will be examined. Examine the practice and performance of specific masculinities including but not limited to African American masculinities, trans masculinities, and faith-informed masculinities.",
            "id": "GEN&WS 546",
            "parent": "GEN&WS",
            "title": "FEMINIST THEORIES AND MASCULINITIES"
        }
    },
    {
        "data": {
            "description": "Explores the intertwined relationship between gender and politics in contemporary Middle East and North Africa. Situates the region's historical, socio-political, and cultural context that have particularly contributed to shaping the current discourse on gender in the Arab World. Explores - both theoretically and empirically - the role of Arab women in influencing the political processes across the Middle East. Examines real-world examples of Middle Eastern women from different parts of the region who have succeeded to challenge the status quo and push for genuine change.",
            "id": "GEN&WS/POLISCI 435",
            "title": "POLITICS OF GENDER AND WOMEN'S RIGHTS IN THE MIDDLE EAST"
        }
    },
    {
        "data": {
            "description": "Feminist theory and women's writing in English.",
            "id": "ENGL/GEN&WS 545",
            "title": "FEMINIST THEORY AND WOMEN'S WRITING IN ENGLISH"
        }
    },
    {
        "data": {
            "description": "Focuses on sex/gender crossing and variation in historical contexts including Japan, South Africa, Europe, the African diaspora, and North America. Considers perspectives of people who themselves passed, crossed, transitioned, transed, or otherwise exceeded their culture's definitions of normative sex/gender. Alongside, consider the ways that dominant social institutions reinforced norms, recognized, tolerated, punished and/or celebrated gender variation. Examine popular culture, medical and legal perspectives, memoir, queer and trans theory, and social movement treatises.",
            "id": "GEN&WS/HISTORY 346",
            "title": "TRANS/GENDER IN HISTORICAL PERSPECTIVE"
        }
    },
    {
        "data": {
            "description": "Independent research for master's or professional level graduate students.",
            "id": "GEN&WS 799",
            "parent": "GEN&WS",
            "title": "INDEPENDENT RESEARCH AT THE MASTER'S AND PROFESSIONAL LEVEL"
        }
    },
    {
        "data": {
            "description": "Introduces new graduate students to the breadth of scholarship in Gender and Women's Studies.  It also develops particular skills (critical reading, critical writing and basic research) important to graduate level scholarship.",
            "id": "GEN&WS 880",
            "parent": "GEN&WS",
            "title": "PROSEMINAR: GRADUATE STUDY IN GENDER AND WOMEN'S STUDIES"
        }
    },
    {
        "data": {
            "description": "Investigation of some specific topic in gender and women's studies related to gender and literature. Topic differs each semester.",
            "id": "ENGL/GEN&WS 350",
            "title": "SPECIAL TOPICS IN GENDER & LITERATURE"
        }
    },
    {
        "data": {
            "description": "Investigation of some specific topic in gender and women's studies related to gender, women and society.",
            "id": "GEN&WS 320",
            "parent": "GEN&WS",
            "title": "SPECIAL TOPICS IN GENDER, WOMEN AND SOCIETY"
        }
    },
    {
        "data": {
            "description": "Investigation of some specific topic in gender and women's studies related to gender, women and the humanities.",
            "id": "GEN&WS 310",
            "parent": "GEN&WS",
            "title": "SPECIAL TOPICS IN GENDER, WOMEN AND THE HUMANITIES"
        }
    },
    {
        "data": {
            "description": "Opportunities for learning and working in organizations in ways that connect coursework in gender and women's studies to specific and applied issues in community settings. Permission to enroll is granted from the instructor after an application process is completed the semester before the course is taught.",
            "id": "GEN&WS 660",
            "parent": "GEN&WS",
            "title": "INTERNSHIP IN GENDER AND WOMEN'S STUDIES"
        }
    },
    {
        "data": {
            "description": "Provides a gender and women's studies course equivalency for humanities courses taken in UW-Madison study abroad programs that do not equate exactly to an existing gender and women's studies course.",
            "id": "GEN&WS 319",
            "parent": "GEN&WS",
            "title": "STUDY ABROAD SPECIAL TOPIC: GENDER, WOMEN AND THE HUMANITIES"
        }
    },
    {
        "data": {
            "description": "Provides a gender and women's studies course equivalency for social science courses taken in UW-Madison study abroad programs that do not equate exactly to an existing gender and women's studies course.",
            "id": "GEN&WS 329",
            "parent": "GEN&WS",
            "title": "STUDY ABROAD SPECIAL TOPIC: GENDER, WOMEN IN SOCIETY"
        }
    },
    {
        "data": {
            "description": "Provides an introduction to feminist pedagogy in Gender and Women's Studies, Focuses upon: (1) the historical importance of an explicit feminist pedagogy in the foundation of GWS, (2) the development of feminist pedagogical theory and (3) a hands-on experience with developing feminist pedagogical materials, classroom strategies and a teaching portfolio. Considers the ways that feminist pedagogical approaches reconsider and challenge aspects of traditional pedagogical practices and training. Engages the development of feminist pedagogical thought and interrogates the different intellectual traditions that have shaped debates and issues within feminist politics and practices.",
            "id": "GEN&WS 840",
            "parent": "GEN&WS",
            "title": "PEDAGOGY IN GENDER AND WOMEN'S STUDIES"
        }
    },
    {
        "data": {
            "description": "Provides an orientation to basic features of scholarly life as well as some professional options outside of academia, and become acquainted with our faculty and their research. Explores issues both broad (e.g., professional development) and specific (e.g., obtaining research grants) that are important to those building professional careers with a Gender and Women's Studies Ph.D.",
            "id": "GEN&WS 860",
            "parent": "GEN&WS",
            "title": "PROSEMINAR IN GENDER AND WOMEN'S STUDIES"
        }
    },
    {
        "data": {
            "description": "Provides an overview of the field of gender and women's studies. Surveys the origin of the field and traces its major transformations. Explores and analyzes historical and contemporary debates that have shaped and continue to shape the field. Interrogates the mission of gender and women's studies. Examines the processes and products of academic professionalization. Investigates the value of graduate training in gender and women's studies.",
            "id": "GEN&WS 810",
            "parent": "GEN&WS",
            "title": "GENDER AND WOMEN'S STUDIES: THE EMERGENCE AND TRANSFORMATION OF A FIELD"
        }
    },
    {
        "data": {
            "description": "Queer art and visual culture are defined not only through their subject matter but also by the methods through which they appropriate and subvert conventional visual practices.  Such tactics may include a work's means of production, its formal properties, and the conditions of its reception.  The political imperatives of a queer or queered position, linked to the intersections of race, class, sex and gender will shape thematic investigations of practices related to activism, documentation, abstraction, mining the archive, craft, camp, and drag, among others.  Case studies will be drawn from film, performance, comics, video games, and fine art.  Projects will engage text- and studio-based research in an interdisciplinary push to integrate theory and practice.  No prior art or design experience required.",
            "id": "GEN&WS 412",
            "parent": "GEN&WS",
            "title": "CONTEMPORARY QUEER ART AND VISUAL CULTURE"
        }
    },
    {
        "data": {
            "description": "Research and preparation for completing the senior honors capstone experience carried out under the supervision of an advisor in the women's studies program.",
            "id": "GEN&WS 681",
            "parent": "GEN&WS",
            "title": "SENIOR HONORS THESIS I"
        }
    },
    {
        "data": {
            "description": "Research and thesis writing for students at the Master's and professional level.",
            "id": "GEN&WS 790",
            "parent": "GEN&WS",
            "title": "RESEARCH & THESIS: MASTER'S AND PROFESSIONAL LEVEL"
        }
    },
    {
        "data": {
            "description": "Research seminar on specific topics in gender and women's studies.",
            "id": "GEN&WS 950",
            "parent": "GEN&WS",
            "title": "SEMINAR: TOPICS IN GENDER AND WOMEN'S STUDIES"
        }
    },
    {
        "data": {
            "description": "This capstone synthesizing seminar for Gender and Women's Studies majors focuses on the major contributions of gender and women's studies scholarship, requires students to hone their interdisciplinary skills, and apply their feminist theory knowledge. It is expected that students have completed more than 50% of their GENWS coursework before enrolling. Process for enrollment permission will be shared by GWS advisor.",
            "id": "GEN&WS 640",
            "parent": "GEN&WS",
            "title": "CAPSTONE SEMINAR IN GENDER AND WOMEN'S STUDIES"
        }
    },
    {
        "data": {
            "description": "This course will provide students with an overvview of the field of Black women's studies.",
            "id": "AFROAMER/GEN&WS 221",
            "title": "INTRODUCTION TO BLACK WOMEN'S STUDIES"
        }
    },
    {
        "data": {
            "description": "Uses race and gender theoretical frameworks to understand peoples' experiences with health and medicine. Conceptualizes race and gender as social categories and applies these frameworks to how people experience health, wellness, and disease. Examines how healthcare and medicine are structured according to racialized and gendered frameworks. Surveys a wide range of issues including reproductive health, body size, mental health, COVID, among other topics. Uses an intersectional approach to analyzing key debates in scholarship on health and medicine.",
            "id": "GEN&WS 524",
            "parent": "GEN&WS",
            "title": "RACE, GENDER, HEALTH, AND MEDICINE"
        }
    },
    {
        "data": {
            "description": "Uses writing in many forms and genres to help students explore how race, gender, and sexuality intersect with language and inform textual experiences. From marriage licenses, passports, and don't ask, don't tell policies to literacy requirements and gag rules, written texts have played major roles in enforcing expectations about race and sex in the United States. At the same time, anti-slavery petitions, letters to the editor, wheat-pasted posters, and hashtag activism all also harness the power of writing to challenge and revise those expectations. In light of that active textual production and negotiation, this class traces public debates and daily experiences where people write or talk about race and sex in order to make a difference. Ultimately, the class takes on the power of words to break bones and heal wounds. Through reading and writing informed by scholarship in writing studies and rhetoric, students in this class will examine historical and contemporary interconnections among race, sexuality, gender, and texts in the United States, developing analytical tools for understanding how language works on and in their world.",
            "id": "ENGL/GEN&WS 401",
            "title": "RACE, SEX, AND TEXTS (HOW TO DO THINGS WITH WRITING)"
        }
    },
    {
        "data": {
            "description": "",
            "id": "GEN&WS/LITTRANS 205",
            "title": "WOMEN IN RUSSIAN LITERATURE IN TRANSLATION"
        }
    },
    {
        "data": {
            "description": "",
            "id": "GEN&WS/LITTRANS 270",
            "title": "GERMAN WOMEN WRITERS IN TRANSLATION"
        }
    },
    {
        "data": {
            "description": "A global (comparative and transnational) survey of women and gender from the ancient world to the modern period. Introduces students to key issues in the history of women and gender, including the historical construction of identities, roles, symbols, and power relationships.",
            "id": "GEN&WS/HISTORY 134",
            "title": "WOMEN AND GENDER IN WORLD HISTORY"
        }
    },
    {
        "data": {
            "description": "A history of sexuality approach to a period of major social, economic, and political change in US history, 1880-1930; medical, legal, and popular discourses shaping urbanization, reform, nationalism and colonialism.",
            "id": "GEN&WS/HISTORY 519",
            "title": "SEXUALITY, MODERNITY AND SOCIAL CHANGE"
        }
    },
    {
        "data": {
            "description": "A humanities-oriented analysis of cultural representations of women and men within the social and historical contexts of race, class, gender and sexuality; engages with a range of traditions and modes of representation including literature, mass media and popular culture.",
            "id": "GEN&WS 101",
            "parent": "GEN&WS",
            "title": "GENDER, WOMEN, AND CULTURAL REPRESENTATION"
        }
    },
    {
        "data": {
            "description": "A multidisciplinary introduction to lesbian, gay, bisexual, transgender, and queer+ (LGBTQ+) studies, including theories of identity formation, different societal interaction with LGBTQ+ communities, LGBTQ+ cultures in history, and contemporary legal and political issues. Course materials explore the intersections between LGBTQ+ identities and other socially marginalized identities, including (but not limited to) those based on race, ethnicity, religion and disability.",
            "id": "GEN&WS/SOC 200",
            "title": "INTRODUCTION TO LESBIAN, GAY, BISEXUAL, TRANSGENDER AND QUEER+ STUDIES"
        }
    },
    {
        "data": {
            "description": "A poststructural feminist analysis of educational discourse and practice; examines selected sex/gender issues in curriculum and instruction; explores some implications for classroom teaching of the complex interrelationships between sex/gender, race, social class, sexuality, and ability/disability.",
            "id": "CURRIC/GEN&WS 760",
            "title": "SEX/GENDER-RELATED ISSUES IN CURRICULUM AND INSTRUCTION"
        }
    },
    {
        "data": {
            "description": "A scholarly theory overview on gender and sexuality in communication studies.",
            "id": "GEN&WS/JOURN 828",
            "title": "GENDER AND SEXUALITY IN MASS COMMUNICATION"
        }
    },
    {
        "data": {
            "description": "A survey of representative writing by contemporary Brazillian women writers in relation to representations of nationality, race, class, ethnicity, gender and sexualities.",
            "id": "GEN&WS/PORTUG 450",
            "title": "BRAZILLIAN WOMEN WRITERS"
        }
    },
    {
        "data": {
            "description": "Advanced topics in the analysis of gender relations in society.",
            "id": "C&ESOC/GEN&WS/SOC 904",
            "title": "SOCIOLOGICAL PERSPECTIVES ON GENDER"
        }
    },
    {
        "data": {
            "description": "American literature by and about women, written by authors from ethnic groups.",
            "id": "ENGL/GEN&WS 248",
            "title": "WOMEN IN ETHNIC AMERICAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "An advanced and comparative study of the roles of gender, class, and race in American history and historiography. Themes include women as agents of social change and as builders of community.",
            "id": "GEN&WS/HISTORY 353",
            "title": "WOMEN AND GENDER IN THE U.S. TO 1870"
        }
    },
    {
        "data": {
            "description": "An examination of the cultural role of gender and the social, economic, and political activities of women in modern Europe from the 18th to the late 20th centuries.",
            "id": "GEN&WS/HISTORY 392",
            "title": "WOMEN AND GENDER IN MODERN EUROPE"
        }
    },
    {
        "data": {
            "description": "An examination of the emergent theoretical field of queer of color critique, a mode of analysis grounded in the struggles and world-making of LGBTQ people of color. Activists, artists, and theorists have mobilized queer of color critique to interrogate the intersections of race, gender, sexuality, class, nation, and diaspora as a response to the inherent whiteness of mainstream queer theory and persistent heterosexism in ethnic studies. Examines the development of queer of color critique (primarily in the United States) through both academic and activist domains; consider what queer theory has to say about empire, citizenship, prisons, welfare, neoliberalism, and terrorism; and articulate the role of queer of color analysis in a vision for racial, gender, sexual, and economic justice.",
            "id": "GEN&WS 446",
            "parent": "GEN&WS",
            "title": "QUEER OF COLOR CRITIQUE"
        }
    },
    {
        "data": {
            "description": "An introduction to foundational approaches to feminist qualitative research in human geography. Research is not separate from a social world that historically has been and continues to be shaped by (settler) colonial, racialized, gendered, sexualized, and class-inflected relations of power (among others). Research practices and \"findings\" have been and continue to be used to inform and rationalize relations of oppression, exploitation, and violence. For feminist researchers, then, questions of power, difference, and social change are central to how we design and conduct research. Engages in political-ethical discussions about the positionality and responsibilities of ourselves as researchers, and how our knowledge production can reproduce and challenge prevailing relations of power.",
            "id": "GEN&WS/GEOG 514",
            "title": "FEMINIST GEOGRAPHY: METHODOLOGICAL APPROACHES"
        }
    },
    {
        "data": {
            "description": "An introduction to literature in English written by women in various periods and places; specific topics will vary.",
            "id": "ENGL/GEN&WS 144",
            "title": "WOMEN'S WRITING"
        }
    },
    {
        "data": {
            "description": "An introduction to the writings of Afro-American women from the nineteenth to the twentieth century. Fiction, autobiography, non-fiction prose, and poetry will be read and discussed.",
            "id": "AFROAMER/GEN&WS 222",
            "title": "INTRODUCTION TO BLACK WOMEN WRITERS"
        }
    },
    {
        "data": {
            "description": "Analyses and interpretations of literary works by black women writers through historical, philosophical, political, feminist, and other contemporary critical methods.",
            "id": "AFROAMER/GEN&WS 677",
            "title": "CRITICAL AND THEORETICAL PERSPECTIVES IN BLACK WOMEN'S WRITINGS"
        }
    },
    {
        "data": {
            "description": "Analysis of disability as an identity, culture, community, and political concern. Brief introduction to disability studies and intersectionality. Examines historical, political, artistic and cultural representations of disability as it intersects with gender, sexuality, race, class and other systems of oppression. Engage with a variety of academic, literary, visual and other cultural representations by and about disabled people.",
            "id": "GEN&WS 105",
            "parent": "GEN&WS",
            "title": "INTERSECTIONAL APPROACHES TO DISABILITY STUDIES"
        }
    },
    {
        "data": {
            "description": "Approaches human relationships with food from micro to macro levels. Considers personal and interpersonal relationships with food, examining the social, cultural, and political meanings of food at various intersections of identity (gender, race, class, ability, age, etc.), and within different institutions such as family, education, and religion. Asks questions about personal/individual responsibility in relation to food, and the role of communities, municipalities, governments, and global entities in determining what people eat and how. Explores the gendered, raced, and classed politics of food systems; questions of sovereignty, sustainability, access, regulation, dissemination, and policy making. Examines the cultural, ecological, and economic implications of the ways food is perceived, produced, and consumed across cultures.",
            "id": "GEN&WS 472",
            "parent": "GEN&WS",
            "title": "FOOD FOR THOUGHT: AN INTERSECTIONAL APPROACH"
        }
    },
    {
        "data": {
            "description": "Art and visual culture by/or pertaining to women throughout the African Diaspora and Africa. Though the focus is on 10th century art by black women, it will go into visual culture (art objects, photographs, images, dress, culturally-coded representation) concerning black women historically.",
            "id": "AFROAMER/GEN&WS 367",
            "title": "ART AND VISUAL CULTURE: WOMEN OF THE AFRICAN DIASPORA AND AFRICA"
        }
    },
    {
        "data": {
            "description": "Asks how LGBTI+ identity informs life experiences. Explores how LGBTI+ life experiences differ over time.  Demonstrates the diversity of queer life stories. Examines the intersections of queer identity and other identity categories. Analyzes how religion, disability, race and class influence queer lives. Considers how and why queer memoirs share particular tropes.  Investigates and employs oral history as a tool of preserving LGBTI+ life histories.",
            "id": "GEN&WS 345",
            "parent": "GEN&WS",
            "title": "NARRATING QUEER LIVES"
        }
    },
    {
        "data": {
            "description": "Assesses how race and gender (as well as socio-economic status, age, sexuality, region, etc.) shaped the experiences and options of African Americans, especially women, in U.S. society from WW II to the present.",
            "id": "AFROAMER/GEN&WS 326",
            "title": "RACE AND GENDER IN POST-WORLD WAR II U.S. SOCIETY"
        }
    },
    {
        "data": {
            "description": "Basic principles and definitions of sociology. Readings and discussion of the perspectives of sociology, the individual and society, groups and social process, stratification, organizations and power, demography, and social change.",
            "id": "C&ESOC/SOC 211",
            "title": "THE SOCIOLOGICAL ENTERPRISE"
        }
    },
    {
        "data": {
            "description": "Capstone for LGBTQ+ Studies certificate; culminates certificate work through advanced interdisciplinary readings, analysis and discussion in LGBTQ+ Studies and completion of a research project. It is expected that students have completed more than 50% of their LGBTQ+ Studies coursework before enrolling. Process for enrollment permission will be shared by LGBTQ+ Studies advisor.",
            "id": "GEN&WS 642",
            "parent": "GEN&WS",
            "title": "ADVANCED SEMINAR IN LGBT STUDIES (LGBT STUDIES CAPSTONE)"
        }
    },
    {
        "data": {
            "description": "Centralizes the intersection of LGBTQ identities and dis/ability through various queer bodies which are also inflected by race, class, geographical and national locations. Approaches may include critical theory about queer bodies and personal narratives. Students will learn a variety of ways to think critically and creatively about the politics of bodily experience, including how those politics have shaped their own embodied lives.",
            "id": "GEN&WS 343",
            "parent": "GEN&WS",
            "title": "QUEER BODIES"
        }
    },
    {
        "data": {
            "description": "Changing political roles, status, attitudes, and behaviors of women in contemporary society and of the political implications of changing female/male relationships.",
            "id": "GEN&WS/POLISCI 469",
            "title": "WOMEN AND POLITICS"
        }
    },
    {
        "data": {
            "description": "Classical theory; Marx, Durkheim, Weber, and other important classical theorists and schools of thought.",
            "id": "C&ESOC/SOC 475",
            "title": "CLASSICAL SOCIOLOGICAL THEORY"
        }
    },
    {
        "data": {
            "description": "Concentrating social and ecological environments as well as that of the body, focuses on the toxic effects of late industrialism, epigenetics and maternal/fetal health as well as destabilizing ideas about \"normal\" reproduction. Examine how the possibilities for expanding the scope from maternal/fetal health to \"parent/child\" health - where kinship is not strictly about biologic belonging or coming \"straight from the womb,\" but also about love and a safe home or chosen family. Undergirding our analysis is an \"eco-social\" approach, guided by questions of what constitutes \"health,\" access to living a healthy life - in a body and on a planet that feels safe to inhabit.",
            "id": "GEN&WS 527",
            "parent": "GEN&WS",
            "title": "THE ENVIRONMENT OF THE WOMB: EPIGENETICS AND PARENT/CHILD HEALTH"
        }
    },
    {
        "data": {
            "description": "Constructions of gender and sexuality in the classical world through art, literature and archaeology.",
            "id": "CLASSICS/GEN&WS 351",
            "title": "WOMEN AND GENDER IN THE CLASSICAL WORLD"
        }
    },
    {
        "data": {
            "description": "Contemporary theoretical positions and debates about feminisms in the humanities and social sciences.",
            "id": "GEN&WS 441",
            "parent": "GEN&WS",
            "title": "CONTEMPORARY FEMINIST THEORIES"
        }
    },
    {
        "data": {
            "description": "Critically examines important issues, questions, and debates regarding intersectionality or the notion that race, gender, and sexuality, and other terrains of difference gain meaning from each other. Materials include texts, films, and other multimedia resources drawn from an array of disciplines including sociology, critical race theory, history, political theory, and cultural studies.",
            "id": "GEN&WS 547",
            "parent": "GEN&WS",
            "title": "THEORIZING INTERSECTIONALITY"
        }
    },
    {
        "data": {
            "description": "Cultural images by and about Black women; feminine creativity in the arts within their historical, cultural, social, and political contexts.",
            "id": "AFROAMER/GEN&WS 267",
            "title": "ARTISTIC/CULTURAL IMAGES OF BLACK WOMEN"
        }
    },
    {
        "data": {
            "description": "Directed study projects for graduate students as arranged with a faculty member",
            "id": "GEN&WS 999",
            "parent": "GEN&WS",
            "title": "INDEPENDENT RESEARCH"
        }
    },
    {
        "data": {
            "description": "Effective communication requires awareness of how gender influences communication and our capacity to build lasting and meaningful relationships. Learn about theories and concepts to understand how gender influences our interpersonal, professional, and social lives. Topics include terms and concepts relevant to the study of how we communicate about gender, sex and sexuality, including identity, language and nonverbal behavior, socialization, close personal relationships, education, work, violence, media and social movements.",
            "id": "COMARTS/GEN&WS 316",
            "title": "GENDER AND COMMUNICATION"
        }
    },
    {
        "data": {
            "description": "Examination in depth of specific topics in the area of LGBTQ+ health. Critical reading of evidence-based literature and exploration of relevant health and biomedical LGBTQ+ issues in biological, social, economic and cultural contexts.",
            "id": "GEN&WS 538",
            "parent": "GEN&WS",
            "title": "SPECIAL TOPICS IN LGBTQ+ HEALTH"
        }
    },
    {
        "data": {
            "description": "Examination in depth of specific topics in the area of gender and biology. Critical feminist reading of scientific literature and exploration of relevant biomedical issues in social and cultural contexts.",
            "id": "GEN&WS 533",
            "parent": "GEN&WS",
            "title": "SPECIAL TOPICS IN GENDER AND BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Examination in depth of specific topics in the area of gender and health. Exploration of relevant health issues in social, economic, and cultural contexts, including public health and policy, and how they relate to gender, race, sexuality, disability, and class.",
            "id": "GEN&WS 539",
            "parent": "GEN&WS",
            "title": "SPECIAL TOPICS IN GENDER AND HEALTH"
        }
    },
    {
        "data": {
            "description": "Examination of issues and theories in gender and science. Topics include historical and contemporary studies of technoscientific and medical constructions of sex/gender differences; feminist studies of science, technology, and medicine; proposals of new epistemologies.",
            "id": "GEN&WS/SOC 611",
            "title": "GENDER, SCIENCE AND TECHNOLOGY"
        }
    },
    {
        "data": {
            "description": "Examination of theories and research on the psychology of women and gender. Explores topics such as sex bias in psychological research; psychological aspects of female sexuality and reproduction; gender-based violence; female achievement and power; lifestyle choices of women; women and mental health; and psychological research with transgender individuals.",
            "id": "GEN&WS/PSYCH 522",
            "title": "PSYCHOLOGY OF WOMEN AND GENDER"
        }
    },
    {
        "data": {
            "description": "Examine sexual and relationship violence and how they intersect with various aspects of identity (race, gender, sexual orientation, disability, poverty, etc.) in the general community as well as within particular populations (college, military, incarcerated) with a heavy focus on college populations (some of the applied parts of the course will focus here). Learn about power and oppression, as well as ways that both research and practice in these arenas have been marginalized and underfunded. Additional focus on community and campus responses to sexual and relationship violence through a series of speakers as well as about anti-violence activism through course activities and group projects.",
            "id": "GEN&WS/PSYCH 322",
            "title": "SEXUAL & RELATIONSHIP VIOLENCE RESEARCH & ACTIVISM"
        }
    },
    {
        "data": {
            "description": "Examines and interprets the roles of American Indian women in traditional societies, and in contemporary North America.",
            "id": "AMERIND/ANTHRO/FOLKLORE/GEN&WS 437",
            "title": "AMERICAN INDIAN WOMEN"
        }
    },
    {
        "data": {
            "description": "Examines assumptions and debates in contemporary theorizing about gender and women including what constitutes \"good\" gender and women studies' theorizing, how to recognize gender-based oppression when we see it, how gender, race, sexuality, and other hierarchies of power intersect, as well as the merits of transnational theorizing about gender and women. Explores whether gender and women's studies' theorizing is a form of activism, how to teach theory in gender and women's studies' classrooms, the value of cultivating distinct gender and women studies' methods, and other dimensions of putting gender and women's studies' theorizing into practice.",
            "id": "GEN&WS 830",
            "parent": "GEN&WS",
            "title": "CONTEMPORARY THEORIZING IN GENDER AND WOMEN'S STUDIES"
        }
    },
    {
        "data": {
            "description": "Examines both physiological and social processes relating to gender and health across the lifespan among cisgender, transgender, and non-binary individuals. Examples of topics include hormonal processes, reproductive anatomy  physiology, sexuality, sexual pleasure, chronic illness, depression, and sexual violence. A primary course objective is for students to connect information about their bodies and personal health to larger social and political contexts. In particular, considers how health and health disparities are shaped by multiple kind of social inequalities, particularly inequalities based on gender.",
            "id": "GEN&WS 103",
            "parent": "GEN&WS",
            "title": "GENDER, WOMEN, BODIES, AND HEALTH"
        }
    },
    {
        "data": {
            "description": "Examines images of gender and sexuality in the media, with a focus on contemporary media in the U.S. Using theories from cultural studies, film and media studies, gender studies, and communication explore different processes and practices of gender and sexuality. Look at the way that gender and sexuality are constructed through social, cultural, and economic forces, and the way that these identities intersect with other social identities such as race, ethnicity, and class. Consider the way that media impact our understanding of feminism and post-feminism, violence, celebrity, consumer culture, subcultures and activism.",
            "id": "COMARTS/GEN&WS 418",
            "title": "GENDER, SEXUALITY, AND THE MEDIA"
        }
    },
    {
        "data": {
            "description": "Examines research and theory in psychology of women and gender. Topics include feminist approaches to research methods, psychological gender differences and similarities, women of color, mental health and feminist therapy, rape, sexual harassment, transgender issues and research, and public policy issues.",
            "id": "GEN&WS/PSYCH 932",
            "title": "PSYCHOLOGY OF WOMEN AND GENDER"
        }
    },
    {
        "data": {
            "description": "Examines the contemporary global health project in historical and cultural context, highlighting some of the greatest sources of tension and struggle. Using a feminist lens and focusing on gender as key analytic category, explores the ways that the distribution of global wealth and power impacts health and well-being around the world. Explores social, demographic, political and economic determinants of global health, and the ways that these factors interconnect with biomedicine to create and affect health outcomes, both within and across countries. Drawing on critical theories, situates the study and practice of global health in an intersectional framework.",
            "id": "GEN&WS 525",
            "parent": "GEN&WS",
            "title": "GENDER AND GLOBAL HEALTH IN CRITICAL PERSPECTIVE"
        }
    },
    {
        "data": {
            "description": "Examines the relationship between dominant images of gender representation as they emerge in expressive culture in various societies.",
            "id": "FOLKLORE/GEN&WS 428",
            "title": "GENDER AND EXPRESSIVE CULTURE"
        }
    },
    {
        "data": {
            "description": "Examines the relationship between gender and education and explores notions of gender as socially constructed categories and identities. Identify the ways schools (re)produce and mediate gender identities and explore the experiences of students. Draws on critical and feminist perspectives to analyze the ways gender intersects with understandings of identity performance and expression such as masculinity and femininity, as well as at the intersection of race, ethnicity, class, and sexuality in schooling processes.",
            "id": "EDPOL/GEN&WS 560",
            "title": "GENDER AND EDUCATION"
        }
    },
    {
        "data": {
            "description": "Examines the social, cultural, political, and symbolic constructions of the intersecting categories of gender and disability.",
            "id": "GEN&WS 370",
            "parent": "GEN&WS",
            "title": "TOPICS IN GENDER AND DISABILITY"
        }
    },
    {
        "data": {
            "description": "Examines the theories and methodologies of the relevant research areas in biology and animal behavior that underlie biological determinist theories of gender and gender differences, and explores alternative approaches, theoretical constructs and interpretations.",
            "id": "GEN&WS 530",
            "parent": "GEN&WS",
            "title": "BIOLOGY AND GENDER"
        }
    },
    {
        "data": {
            "description": "Examines the work, representation and interpretation of Carmen Miranda from her early days as a radio star in Brazil to a film actress and entertainer in Hollywood in the 1940s and 50s.",
            "id": "GEN&WS/PORTUG 460",
            "title": "CARMEN MIRANDA"
        }
    },
    {
        "data": {
            "description": "Exploration and analysis of recent debates related to gender issues in international educational policy, including the intersection of education and demographic processes, the play of history and culture, and the social construction of gender.",
            "id": "EDPOL/GEN&WS/PUBAFFR 805",
            "title": "GENDER ISSUES IN INTERNATIONAL EDUCATIONAL POLICY"
        }
    },
    {
        "data": {
            "description": "Explore the intersections of religiosity and queerness, including the role of religion in the lives of LGBTQ+ individuals and communities, the role of queerness and LGBTQ inclusion in various religious traditions, and what queerness can add to the study of religion (and vice versa).",
            "id": "GEN&WS/RELIGST 202",
            "title": "QUEERING RELIGION"
        }
    },
    {
        "data": {
            "description": "Explores a broad range of contemporary theories concerned with bodies and power.  Intersections with gender, race, class, dis / ability, sexuality and nation.",
            "id": "GEN&WS 445",
            "parent": "GEN&WS",
            "title": "THE BODY IN THEORY"
        }
    },
    {
        "data": {
            "description": "Explores feminist activism in the United States, Canada, the Caribbean, and Latin America. Feminist activism, broadly construed, will be explored through ethnography, interviews, documentaries, public facing scholarship, among other forms of intellectual production. Applies transdisciplinary perspectives to consider work from a range of academic fields and topics to understand the major political, economic, and social issues framing feminist social movements across the Americas.",
            "id": "CHICLA/GEN&WS 334",
            "title": "FEMINIST SOCIAL MOVEMENTS ACROSS THE AMERICAS"
        }
    },
    {
        "data": {
            "description": "Explores feminist approaches to methods in the social sciences, humanities, and health sciences, such as ethnography, interviews, statistics, focus groups, surveys, archival research, discourse analysis, and visual analysis. Applies transdisciplinary perspectives to consider work from a range of academic fields and topics in order to critique issues of epistemology, methodology, methods, interpretation, and writing.",
            "id": "GEN&WS 800",
            "parent": "GEN&WS",
            "title": "RESEARCH METHODS IN GENDER & WOMEN'S STUDIES"
        }
    },
    {
        "data": {
            "description": "Explores feminist theories from a broad array of disciplines and perspectives. Beginning with early feminist writings, to the significance of the Second Wave, examines consciousness raising, political pamphlets, personal manifestos, and the feminist ideology of the \"personal is political.\" Explores work from Black feminist thought, queer theory, theory from disability studies, fat studies, ecofeminism, and transnational and global feminisms. Identifies and addresses crucial areas of contestation that punctuate the dynamic relationships among texts from past and present-the arrivals, departures, and returns-in feminist theory. Listens to voices that align and voices that dissent. Engages with the work of writers and thinkers from the past and bringing these ideas to our current cultural configurations and conceptualizations of feminism(s) and feminist movement(s).",
            "id": "GEN&WS 444",
            "parent": "GEN&WS",
            "title": "FROM PAST FEMINISMS TO POSTFEMINISM: FEMINISMS FOR THE 21ST CENTURY"
        }
    },
    {
        "data": {
            "description": "Explores gender identity and sexuality among disabled people using historical and theoretical articles to discuss and analyze films, memoirs, and poetry by people with disabilities. Provides a brief introduction to disability studies and intersectionality before delving into academic discussions and artistic representations of the intersections of disability, gender, and sexuality.",
            "id": "GEN&WS 374",
            "parent": "GEN&WS",
            "title": "DISABILITY, GENDER AND SEXUALITY"
        }
    },
    {
        "data": {
            "description": "Explores how gender, sexuality, and gender identity are conceptualized, practiced, protected, and policed in K-12 schools and in out-of-school contexts in the United States and globally. Examines how gender, sexuality, and gender identity intersect with race, class, language, nationality, and religion to shape the experiences of school-age children and youth.",
            "id": "EDPOL/GEN&WS 160",
            "title": "GENDER, SEXUALITY, AND EDUCATION POLICY"
        }
    },
    {
        "data": {
            "description": "Explores scientific approaches to studying sexuality. Examines current biological and neuroscientific research about sexuality, as well as feminist scholarship on these topics and critical responses to this research. Topics cover the intersections between biology (e.g., hormones, anatomy, neural activity, psychophysiology, evolution, etc.), sexuality (e.g., desire, dysfunction, arousal, bisexuality, orgasm, same-sex sexuality, pleasure, etc.), and feminist/critical scholarship about this research (e.g., feminist science studies, queer theory, feminist psychology, medicalization, etc.).",
            "id": "GEN&WS 528",
            "parent": "GEN&WS",
            "title": "SEXUALITY AND SCIENCE"
        }
    },
    {
        "data": {
            "description": "Explores several theoretical lenses, disciplinary approaches, and substantive topical areas relating to reproductive and sexual health. Begin by investigating the development of \"sexual health\" as a phenomenon in public health research, policy, and programs looking back to feminist responses to population control policies of the 1970s. Covers substantive topical areas in the field (e.g., adolescent sexual development, contraception, and AIDS).",
            "id": "GEN&WS 534",
            "parent": "GEN&WS",
            "title": "GENDER, SEXUALITY, AND REPRODUCTION: PUBLIC HEALTH PERSPECTIVES"
        }
    },
    {
        "data": {
            "description": "Explores the contemporary science and politics of reproductive health in North America. Taught from a reproductive justice (RJ) perspective, a framework for analysis and action developed by Black women health organizers and scholars. Examines several aspects and applications of the reproductive justice framework itself; RJ approaches to pregnancy and birth; RJ as a diagnosis and refusal of eugenics; and RJ and abortion. Engages with case studies, scholarship, and theory from a variety of literatures relevant to public health: epidemiology, feminist and queer theory, critical race studies, gender/sexuality studies, activist and policy analyses, and historical and contemporary primary sources. Explores a variety of experiences and meanings of reproductive health and illness, as well as the relationships between health/disease and racism, poverty, sexism, hetero- and cis- normativity, colonization, incarceration, and environmental degradation.",
            "id": "GEN&WS 529",
            "parent": "GEN&WS",
            "title": "THE SCIENCE AND POLITICS OF REPRODUCTIVE HEALTH"
        }
    },
    {
        "data": {
            "description": "Explores the genre of visionary fiction - speculative fiction written for social justice purposes - as a means to create, build and maintain new worlds. Examines the political potential of literature and multiple examples of visionary fiction.",
            "id": "ENGL/GEN&WS 359",
            "title": "VISIONARY AND SPECULATIVE FICTION: SOCIAL JUSTICE APPROACHES"
        }
    },
    {
        "data": {
            "description": "Explores the intersection between race and sexuality in American literature with an emphasis on sex/gender difference, feminism, transgenderism, and nationalism. Focuses on the nature of literature as advocacy, with an emphasis on Asian-American issues.",
            "id": "ASIANAM/ENGL/GEN&WS 463",
            "title": "RACE AND SEXUALITY IN AMERICAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Explores the multiracial and multicultural reality of Latina societies by becoming familiar with the history and cultures of Chicana, Cuban-American, and Puerto Rican women. Interdisciplinary readings in law, journalism, public policy, history, and self-reflective literature.",
            "id": "CHICLA/GEN&WS 332",
            "title": "LATINAS: SELF IDENTITY AND SOCIAL CHANGE"
        }
    },
    {
        "data": {
            "description": "Explores the social, cultural, and political construction of the female/feminine body. Considers specifically the bodies of women and girls, transgender women, non-binary people that embody the feminine, female masculinities, and bodies that identify and are identified as female, as bodies that have historically and traditionally been sites of political contention, of societal meaning making, of cultural symbolism, and active resistance. Seeks to challenge what we think we know about bodies, challenging tacit knowledge and investigating how normative discourses of the female/feminine body are formed across cultures, around the world. Considers the impacts of phenomena such as globalization, neoliberalism, \"global\" feminism, imperialism, capitalism, and human rights movements on cultural conceptions of health, ability, beauty, representation, and the \"value\" of female/feminine bodies.",
            "id": "GEN&WS 423",
            "parent": "GEN&WS",
            "title": "THE FEMALE BODY IN THE WORLD: GENDER AND CONTEMPORARY BODY POLITICS IN CROSS CULTURAL PERSPECTIVE"
        }
    },
    {
        "data": {
            "description": "Explores themes significant to the impact of religion on women and women on religion, historically and today, across a diverse range of contexts.",
            "id": "GEN&WS/RELIGST 305",
            "title": "WOMEN, GENDER AND RELIGION"
        }
    },
    {
        "data": {
            "description": "Explores topics in gender and visual culture, including artistic practice, political and creative expression, and cultural phenomena. Course topic changes; may be repeated with a different topic.",
            "id": "GEN&WS 410",
            "parent": "GEN&WS",
            "title": "SPECIAL TOPICS IN GENDER AND VISUAL CULTURE"
        }
    },
    {
        "data": {
            "description": "Explores various aspects of identity politics and body politics such as gender, race, ethnicity, sexuality, ability, and citizenship status as they relate to and intersect with body size and constructions of fatness. Situates how fatness has been conceptualized over time, the formation of the gendered body ideals, and the proliferation of obesity rhetoric. Investigates how fat individuals experience the social world, in particular related to arenas such as the American health care system, and other societal institutions such as education, social welfare, immigration, and media. Interrogates how the \"obesity epidemic\" came to be, how it is framed in the United States, and how it intersects with other systems like big pharma, the food industry, beauty industry, globalization, neoliberalism, and consumerism. Deploys a critical approach in understanding fatness and body size as dimensions of difference that inform experiences of privilege and oppression.",
            "id": "GEN&WS 523",
            "parent": "GEN&WS",
            "title": "FRAMING FATNESS: GENDER, SIZE, CONSTRUCTING HEALTH"
        }
    },
    {
        "data": {
            "description": "Feminist theory, with an emphasis on literary and cultural theory and criticism in English.",
            "id": "ENGL/GEN&WS 737",
            "title": "FEMINIST THEORY AND CRITICISM"
        }
    },
    {
        "data": {
            "description": "Focuses on how specific schools of feminist thought redefine the political, spanning historical and contemporary feminist political theory.",
            "id": "GEN&WS/POLISCI 933",
            "title": "FEMINIST POLITICAL THEORY"
        }
    },
    {
        "data": {
            "description": "Focuses on the intersection between gender, crime and justice from a cross-cultural perspective. The gendered nature of the criminal justice system, female experiences of crime, prosecution and incarceration as well as the extent to which women are victims, offenders, and participants in the criminal justice system will be explored. Special emphasis will be placed on the theoretical implications of offending behavior and the intersection of gender with sexuality, race, ethnicity and class. The goal of this course is to provide a foundation for critically assessing the often controversial issues surrounding race, gender, crime, and criminal justice in society.",
            "id": "GEN&WS/LEGALST/SOC 425",
            "title": "CRIME, GENDER AND JUSTICE"
        }
    },
    {
        "data": {
            "description": "For highly qualified and motivated students.",
            "id": "GEN&WS 299",
            "parent": "GEN&WS",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Global, interdisciplinary, social science-oriented analysis of gender, race, class and sexuality in relationship to social institutions and movements for social change. Focus on gender and women in institutions such as education, the economy, the family, law, media, medicine, and politics.",
            "id": "GEN&WS 102",
            "parent": "GEN&WS",
            "title": "GENDER, WOMEN, AND SOCIETY IN GLOBAL PERSPECTIVE"
        }
    },
    {
        "data": {
            "description": "Graded on lettered basis.",
            "id": "GEN&WS 699",
            "parent": "GEN&WS",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Historical interplay of racism and sexism in the lives of Black and White women of different class backgrounds in the United States.",
            "id": "AFROAMER/GEN&WS 323",
            "title": "GENDER, RACE AND CLASS: WOMEN IN U.S. HISTORY"
        }
    },
    {
        "data": {
            "description": "In addition to reviewing gender-within-development theory and practice, this course examines specific gender issues including social status and roles, productive and reproductive work, access to resources, identity and citizenship, empowerment, and intersection of race, class, and ethnicity with gender.",
            "id": "GEN&WS/URBRPL 644",
            "title": "INTERNATIONAL DEVELOPMENT AND GENDER"
        }
    },
    {
        "data": {
            "description": "Independent research and writing to complete dissertation requirement",
            "id": "GEN&WS 990",
            "parent": "GEN&WS",
            "title": "RESEARCH & THESIS"
        }
    },
    {
        "data": {
            "description": "Introduces the cultural, economic, social, and political history of Chicanas and Latinas in the U.S. and focuses on four major themes: contact between different ethnic/racial groups; ideas of nation and nationalism; constructions of identity; and struggles for social justice.",
            "id": "CHICLA/GEN&WS/HISTORY 245",
            "title": "CHICANA AND LATINA HISTORY"
        }
    },
    {
        "data": {
            "description": "Introduction to the field of American sociology, its subfields and specialized areas of research, theoretical traditions and research methods.",
            "id": "C&ESOC/SOC 210",
            "title": "SURVEY OF SOCIOLOGY"
        }
    },
    {
        "data": {
            "description": "Introduction to the history, literature and theory of feminist theatre and of feminist criticism of mainstream theatre in the United States from 1960 to the present.",
            "id": "GEN&WS/THEATRE 415",
            "title": "INTRODUCTION TO CONTEMPORARY FEMINIST THEATRE AND CRITICISM"
        }
    },
    {
        "data": {
            "description": "Investigation of specific theorists, themes, problems, or eras in feminist social and cultural theory. Course topic differs each semester. Course may be repeated with different topics.",
            "id": "GEN&WS 449",
            "parent": "GEN&WS",
            "title": "SPECIAL TOPICS IN FEMINIST THEORY"
        }
    },
    {
        "data": {
            "description": "Legal system, laws, and proposed legislation that have specific impact on the lives of women. Topics investigated in both the social and legal contexts.",
            "id": "GEN&WS/LEGALST 422",
            "title": "WOMEN AND THE LAW"
        }
    },
    {
        "data": {
            "description": "Major texts by Asian American women writers.",
            "id": "ASIANAM/ENGL/GEN&WS 464",
            "title": "ASIAN AMERICAN WOMEN WRITERS"
        }
    },
    {
        "data": {
            "description": "Provides an introductory overview to critical global health studies, linking past trends to current research and health inequalities. Examines current trajectories in disaster relief and public health interventions through a gendered lens, with a solid grounding in the historical context. Explores social, demographic, political, economic, and ecological determinants of global health, and the ways that these factors interconnect with biomedicine to create and affect health outcomes, both within and across countries. Uses an intersectional approach to analyze how public health policies prioritize whose lives represent \"save-able\" or \"salvageable\" ones in the public, political, and corporate eye.",
            "id": "GEN&WS 104",
            "parent": "GEN&WS",
            "title": "GENDER, SEXUALITY, AND GLOBAL HEALTH"
        }
    },
    {
        "data": {
            "description": "Provides an opening to some of the key debates and practices in feminist (political) geography. Feminist geography focuses on questions of power, difference, embodiment, and social change. How are feminist geographies in conversation with or part of other fields of inquiry, such as critical ethnic studies and Indigenous studies, which also focus on questions of difference, epistemologies of knowledge, and social transformation and/or decolonization? That is, what are the relationships of feminist geographic inquiry to liberatory projects of ending racism, capitalism, settler colonialism, and heteropatriarchy. Explore how feminist theories and approaches in geography transformed prevailing political geographic questions and concerns, such as power, politics, territory, boundaries, sovereignty, and violence. What do feminist principles and debates over feminist politics and methods bring to (political) geography?",
            "id": "GEN&WS/GEOG 504",
            "title": "FEMINIST GEOGRAPHY: THEORETICAL APPROACHES"
        }
    },
    {
        "data": {
            "description": "Read and discuss works by Scandinavian writers of the nineteenth and twentieth century reflecting sexual politics and the roles of women in literature. Course taught in English.",
            "id": "GEN&WS/LITTRANS/SCANDST 438",
            "title": "SEXUAL POLITICS IN SCANDINAVIA"
        }
    },
    {
        "data": {
            "description": "Research and preparation for the writing of a senior thesis.",
            "id": "GEN&WS 691",
            "parent": "GEN&WS",
            "title": "SENIOR THESIS I"
        }
    },
    {
        "data": {
            "description": "See 520.",
            "id": "GEN&WS/HISTORY 354",
            "title": "WOMEN AND GENDER IN THE U.S. SINCE 1870"
        }
    },
    {
        "data": {
            "description": "Senior thesis.",
            "id": "GEN&WS 692",
            "parent": "GEN&WS",
            "title": "SENIOR THESIS II"
        }
    },
    {
        "data": {
            "description": "Sex as a source of domination and liberation in Ancient Greek and Roman literature and modern European and North American theory and practice, including questions of sexual orientation, gender identity, violence, and self-realization.",
            "id": "CLASSICS/GEN&WS 361",
            "title": "SEX AND POWER IN GREECE AND ROME"
        }
    },
    {
        "data": {
            "description": "Situates sexual health education in historical and contemporary context by tracing its discursive production and envisioning a queering of both content and practice. An examination of what might it mean to queer sex education and what would a queer sex education look like. Utilizing theoretical interventions from critical education studies, queer theory, and trans/gender studies, this course.",
            "id": "GEN&WS 536",
            "parent": "GEN&WS",
            "title": "QUEERING SEXUALITY EDUCATION"
        }
    },
    {
        "data": {
            "description": "Teaches students fluency with basic terms, concepts, and methodologies within the interdisciplinary field of Transgender Studies. Content includes transnational and cultural considerations; contemporary transgender issues in medicine, law, and education; cultural production, art and activism; transgender, feminist, and queer theories.",
            "id": "GEN&WS 342",
            "parent": "GEN&WS",
            "title": "TRANSGENDER STUDIES"
        }
    },
    {
        "data": {
            "description": "Theoretical and ethnographic approaches to the anthropology of gender, focusing on current works. Topics include sexual inequality, research methods, gender and history, gender and ethnographic writing, cultural constructions of masculinity, sexuality, and gender studies and anthropological theory.",
            "id": "ANTHRO/GEN&WS 920",
            "title": "ANTHROPOLOGY OF GENDER"
        }
    },
    {
        "data": {
            "description": "This course demonstrates that human bodies have social and cultural histories. It will highlight the social values placed on different bodies, the changing social expectations bodies create, and the role of science and medicine in creating the cultural meanings of bodies.",
            "id": "GEN&WS/HISTSCI/MEDHIST 532",
            "title": "THE HISTORY OF THE (AMERICAN) BODY"
        }
    },
    {
        "data": {
            "description": "This course focuses on the emerging field of gender studies in the scholarship on the post-World War II civil rights movement in the United States.",
            "id": "AFROAMER/GEN&WS 625",
            "title": "GENDER, RACE AND THE CIVIL RIGHTS MOVEMENT"
        }
    },
    {
        "data": {
            "description": "This seminar is for residents of Open House Gender Learning Community. It addresses various topics of interest to this community.",
            "id": "GEN&WS 100",
            "parent": "GEN&WS",
            "title": "OPEN HOUSE GENDER LEARNING COMMUNITY SEMINAR"
        }
    },
    {
        "data": {
            "description": "Topics in feminist study of LGBTQ sexualities, considering race, nationality, and time.",
            "id": "GEN&WS 340",
            "parent": "GEN&WS",
            "title": "TOPICS IN LGBTQ SEXUALITY"
        }
    },
    {
        "data": {
            "description": "Topics in the feminist study of inequality and difference based on class, gender and race/ethnicity, with a humanities emphasis.",
            "id": "GEN&WS 330",
            "parent": "GEN&WS",
            "title": "TOPICS IN GENDER/CLASS/RACE/ETHNICITY (HUMANITIES)"
        }
    },
    {
        "data": {
            "description": "Topics in the feminist study of inequality and difference based on class, gender and race/ethnicity, with a social science emphasis.",
            "id": "GEN&WS 331",
            "parent": "GEN&WS",
            "title": "TOPICS IN GENDER/CLASS/RACE/ETHNICITY (SOCIAL SCIENCES)"
        }
    },
    {
        "data": {
            "description": "Uses an interdisciplinary framework to interrogate core assumptions, arguments, and silences in past and present black feminist thought.",
            "id": "AFROAMER/GEN&WS 333",
            "title": "BLACK FEMINISMS"
        }
    },
    {
        "data": {
            "description": "Using a reproductive justice framework, analyze contexts, experiences, practices, ideologies, and historiographies of childbirth in the United States from roughly the 17th century to the present, with the heaviest emphasis on the 20th and 21st century. Examines the ways that colonization, genocide, enslavement, racism, capitalism, heterosexism, patriarchy, and ableism have shaped all of these aspects of childbirth. Inquire how key movements and groups resisting some of these forms of oppression have had the power to reshape birth, as well as locating in birth a source of transformational power.",
            "id": "GEN&WS/HISTSCI 537",
            "title": "CHILDBIRTH IN THE UNITED STATES"
        }
    },
    {
        "data": {
            "description": "Using sexuality as a category of historical analysis, examines historiographical, methodological, and theoretical contributions to understanding all aspects of the past.",
            "id": "GEN&WS/HISTORY 938",
            "title": "HISTORY OF SEXUALITY"
        }
    },
    {
        "data": {
            "description": "Women as patients and as health professionals in America from the colonial period to the present.",
            "id": "GEN&WS/HISTSCI/MEDHIST 531",
            "title": "WOMEN AND HEALTH IN AMERICAN HISTORY"
        }
    },
    {
        "data": {
            "description": "Works by British and American writers, with emphasis on women writers of the twentieth century; close reading of texts and discussion of trends, themes, and special characteristics of the role of women in literature.",
            "id": "ENGL/GEN&WS 250",
            "title": "WOMEN IN LITERATURE"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "GEN&WS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "AFROAMER/GEN&WS 333",
            "target": "GEN&WS 547"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 210",
            "target": "C&ESOC/SOC 211"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 210",
            "target": "C&ESOC/SOC 475"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 211",
            "target": "C&ESOC/SOC 210"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 211",
            "target": "C&ESOC/SOC 475"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 475",
            "target": "GEN&WS/SOC 611"
        }
    },
    {
        "data": {
            "source": "GEN&WS 101",
            "target": "COMARTS/GEN&WS 418"
        }
    },
    {
        "data": {
            "source": "GEN&WS 101",
            "target": "ENGL/GEN&WS 350"
        }
    },
    {
        "data": {
            "source": "GEN&WS 102",
            "target": "COMARTS/GEN&WS 418"
        }
    },
    {
        "data": {
            "source": "GEN&WS 102",
            "target": "GEN&WS/LEGALST/SOC 406"
        }
    },
    {
        "data": {
            "source": "GEN&WS 102",
            "target": "GEN&WS/LEGALST/SOC 425"
        }
    },
    {
        "data": {
            "source": "GEN&WS 102",
            "target": "GEN&WS/PSYCH 522"
        }
    },
    {
        "data": {
            "source": "GEN&WS 103",
            "target": "GEN&WS 528"
        }
    },
    {
        "data": {
            "source": "GEN&WS 103",
            "target": "GEN&WS 530"
        }
    },
    {
        "data": {
            "source": "GEN&WS 103",
            "target": "GEN&WS/LEGALST/SOC 425"
        }
    },
    {
        "data": {
            "source": "GEN&WS 103",
            "target": "GEN&WS/PSYCH 522"
        }
    },
    {
        "data": {
            "source": "GEN&WS 441",
            "target": "GEN&WS 546"
        }
    },
    {
        "data": {
            "source": "GEN&WS 441",
            "target": "GEN&WS/SOC 611"
        }
    },
    {
        "data": {
            "source": "GEN&WS 445",
            "target": "GEN&WS/SOC 611"
        }
    },
    {
        "data": {
            "source": "GEN&WS 546",
            "target": "GEN&WS 547"
        }
    },
    {
        "data": {
            "source": "GEN&WS 547",
            "target": "GEN&WS 546"
        }
    }
]