[
    {
        "data": {
            "description": "An overview of marketing's role within an organization, the key elements of a marketing plan, and how the plan is implemented. Students will learn about buyer demographic, psychographic and purchasing decision behavior. A thorough understanding of the customer enables students to develop a coordinated marketing mix (product, price promotion and place) that will satisfy the customer better than the competition and at the required margin. Students will leave the course understanding the degree to which all company functions must be coordinated and focused on the customer. This course will not apply toward fulfilling the MBA degree requirements.",
            "id": "EPD/GENBUS/MARKETNG 782",
            "title": "MARKETING FOR NON-MARKETING PROFESSIONALS"
        }
    },
    {
        "data": {
            "description": "Explore the roles and responsibilities of Management and Directors in protecting the interests of Shareholders and other Stakeholders.  Topics include: the history of Corporate Governance, Board of Directors responsibilities, Corporate Governance nuances outside of the U.S., and current trends in Corporate Governance.  Analyze how an entity's Corporate Governance environment can either prevent or permit failures and have a direct impact on the success of an organization.",
            "id": "GENBUS 714",
            "parent": "GENBUS",
            "title": "CORPORATE GOVERNANCE AND BOARD MEMBERSHIP"
        }
    },
    {
        "data": {
            "description": "Improves students' negotiating skills, doing so by providing a theoretical underpinning that will help them to understand the sources of effective and ineffective approaches to negotiations.",
            "id": "EPD/GENBUS/MHR 785",
            "title": "EFFECTIVE NEGOTIATION STRATEGIES"
        }
    },
    {
        "data": {
            "description": "Topics covered include axioms of probability, random variables, the most important discrete and continuous probability distributions, expectation and variance, moment generating functions, conditional probability and conditional expectations, multivariate distributions, Markov's and Chebyshev's inequalities, laws of large numbers, and the central limit theorem.",
            "id": "MATH/STAT 431",
            "title": "INTRODUCTION TO THE THEORY OF PROBABILITY"
        }
    },
    {
        "data": {
            "description": "A compact primer in statistics and an introduction to programming as a foundation for data-driven business analyses. The first part covers elementary concepts such as random variables, probability distributions, estimation, and ordinary least-squares regression. In the second part, the course exposes students to Python and R programming, including numerical and statistical packages that are relevant for practical applications in business.",
            "id": "GENBUS 705",
            "parent": "GENBUS",
            "title": "STATISTICS AND PROGRAMMING FOR BUSINESS ANALYTICS"
        }
    },
    {
        "data": {
            "description": "A compact primer in statistics as a foundation for data-driven business analysis. A selection of concepts include probability, estimation, inference, correlation, and regression.",
            "id": "GENBUS 881",
            "parent": "GENBUS",
            "title": "BUSINESS STATISTICS USING PYTHON"
        }
    },
    {
        "data": {
            "description": "A course for the exploration of subject areas possibly to be introduced into the business curriculum.",
            "id": "GENBUS 365",
            "parent": "GENBUS",
            "title": "CONTEMPORARY TOPICS"
        }
    },
    {
        "data": {
            "description": "An introduction for new business students covering academic exploration and planning, career development, self-assessment for personal development, leadership, and diversity and inclusion.",
            "id": "GENBUS 110",
            "parent": "GENBUS",
            "title": "PERSONAL AND PROFESSIONAL FOUNDATIONS IN BUSINESS"
        }
    },
    {
        "data": {
            "description": "An introduction to consulting tools and models.",
            "id": "GENBUS 777",
            "parent": "GENBUS",
            "title": "CONSULTING SKILLS BOOTCAMP"
        }
    },
    {
        "data": {
            "description": "An introduction to machine learning models for business applications. Builds on the predictive modeling basics by developing general algorithmic prediction models for supervised machine learning. Covers additive models, CARTs, bagging/boosting, and basic deep learning approaches. Discussion of unsupervised learning techniques, including clustering and dimensionality reduction approaches.",
            "id": "GENBUS 888",
            "parent": "GENBUS",
            "title": "APPLIED MACHINE LEARNING FOR BUSINESS ANALYTICS"
        }
    },
    {
        "data": {
            "description": "An introduction to predictive modeling for business applications beginning with some of the foundations, including a primer in matrix algebra and numerical optimization. Leads to development of linear regression and classification models, and discussion of building models for prediction. Topics include selection, regularization, and the bias-variance tradeoff.",
            "id": "GENBUS 886",
            "parent": "GENBUS",
            "title": "FOUNDATIONS OF PREDICTIVE MODELING FOR BUSINESS ANALYTICS"
        }
    },
    {
        "data": {
            "description": "An introduction to text mining and generation for business applications. Includes an overview of text data and approaches for making text data useful for descriptive and predictive analytics. Also, includes key applications of natural language processing, such as chatbots and recommender systems.",
            "id": "GENBUS 891",
            "parent": "GENBUS",
            "title": "TEXT MINING AND GENERATION FOR BUSINESS ANALYTICS"
        }
    },
    {
        "data": {
            "description": "Apply statistics and data literacy to business problems using the most popular analytics tools and technologies, many of which are in the cloud.",
            "id": "GENBUS 308",
            "parent": "GENBUS",
            "title": "CLOUD BASED BUSINESS ANALYTICS"
        }
    },
    {
        "data": {
            "description": "Build fundamental skills and processes to develop a strong foundation in business analysis utilizing Excel. Learn the fundamentals of data construction, manipulation, summarization, analysis and presentation.",
            "id": "GENBUS 106",
            "parent": "GENBUS",
            "title": "FOUNDATIONAL SKILLS FOR BUSINESS ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Capstone integrating the curriculum through the application of business strategy to business problems in cross-functional teams. Develops and refines key skills introduced in core courses, including professional communications, inclusive leadership, and quantitative analysis.",
            "id": "GENBUS 400",
            "parent": "GENBUS",
            "title": "INTEGRATED STRATEGIC LEADERSHIP"
        }
    },
    {
        "data": {
            "description": "Complete a team project as a capstone to graduate studies in business analytics. Use analytics and project management to develop a solution to a provided business case.",
            "id": "GENBUS 895",
            "parent": "GENBUS",
            "title": "MASTERS CAPSTONE IN BUSINESS ANALYTICS"
        }
    },
    {
        "data": {
            "description": "Conditioning, distribution theory, approximation to distributions, modes of convergence, limit theorems, statistical models, parameter estimation, comparision of estimators, confidence sets, theory of hypothesis tests, introduction to Bayesian inference and nonparametric estimation.",
            "id": "STAT 610",
            "parent": "STAT",
            "title": "INTRODUCTION TO STATISTICAL INFERENCE"
        }
    },
    {
        "data": {
            "description": "Construct a wide variety of SQL statements; such as joins, common table expressions, window functions, etc.  Basics of query optimization and data modeling.",
            "id": "GENBUS 882",
            "parent": "GENBUS",
            "title": "SQL FUNDAMENTALS"
        }
    },
    {
        "data": {
            "description": "Covers emerging and current topics in the industry through applied learning experiences - case studies, industry meetings, and exercises or workshops.",
            "id": "GENBUS 840",
            "parent": "GENBUS",
            "title": "CURRENT TOPICS IN BUSINESS ANALYTICS AND ARTIFICIAL INTELLIGENCE"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Design thinking is an iterative problem-solving process geared toward producing innovative solutions for complex and persistent problems in various fields and organizations. Its process, culture, and value system from both design and business point of views will be covered: Empathetic understanding of the end users, problem definition rooted in systems thinking, ideation with a strong emphasis on creativity, visualization and prototyping, testing rooted in a set of research methods, and finally, the importance of iteration in bringing about innovative solutions. The path from project to market will also be explored, with an understanding of how one might balance desirability, feasibility and viability.",
            "id": "DS/GENBUS 240",
            "title": "HUMAN-CENTERED DESIGN AND BUSINESS"
        }
    },
    {
        "data": {
            "description": "Develop and practice workplace communication skills: writing, speaking, and listening. A theoretical foundation provides a method of deep audience analysis; apply that analysis when producing a variety of written genres and when preparing content for formal presentations. Research communication and information sources specific to future careers. Strengthen information literacy by developing professional research skills and analyzing sources. Revise written work through a workshop process that requires giving, receiving, and implementing feedback.",
            "id": "GENBUS 360",
            "parent": "GENBUS",
            "title": "WORKPLACE WRITING AND COMMUNICATION"
        }
    },
    {
        "data": {
            "description": "Develop student success strategies, engage with a community of peers, professionals, faculty and staff, and explore the breadth of professional opportunities available to launch an inspiring and meaningful career.",
            "id": "GENBUS 112",
            "parent": "GENBUS",
            "title": "EXPLORING BUSINESS"
        }
    },
    {
        "data": {
            "description": "Development of quantitative intuition through practical applications and use of analysis tools. Specifically, emphasis will be on how to manage, summarize, explore, and visualize databases. The essentials of probability will be introduced and applied to decision problems where there is uncertainty. Emphasis on hypothesis testing and regression analysis and include an introduction to simulation methods. Throughout, attention will be paid to effective communication of data analysis. The use of business cases will connect the course material to both real world settings and recent advances in data analysis, including big data and data mining.",
            "id": "GENBUS 306",
            "parent": "GENBUS",
            "title": "BUSINESS ANALYTICS I"
        }
    },
    {
        "data": {
            "description": "Develops awareness and knowledge of cultural influences on business. Focuses on various attitudes toward work, time, material possession, business, and the relationship of these attitudes to different social, religious, philosophical, and educational backgrounds of business people from cultures around the world.",
            "id": "GENBUS/INTLBUS 320",
            "title": "INTERCULTURAL COMMUNICATION IN BUSINESS"
        }
    },
    {
        "data": {
            "description": "Economic problems of individuals, firms and industries with emphasis on value, price, and distribution of income.",
            "id": "ECON 101",
            "parent": "ECON",
            "title": "PRINCIPLES OF MICROECONOMICS"
        }
    },
    {
        "data": {
            "description": "Emphasis on hands-on experience with many commonly used analytic methodologies using the modeling and optimization tools available on almost every professional desktop. The focus is predictive and prescriptive analytics. Predictive approaches use historical data to infer causal relationships and forecast future outcomes from a given action. Prescriptive methods take this a step further, helping managers formulate decision models that identify optimal actions given a set of circumstances.",
            "id": "GENBUS 307",
            "parent": "GENBUS",
            "title": "BUSINESS ANALYTICS II"
        }
    },
    {
        "data": {
            "description": "Enables you to understand and apply useful approaches to analyzing and presenting data to support business decision making. Emphasis on applications of predictive and prescriptive analytics. Predictive approaches use historical data to infer relationships and forecast future outcomes. Prescriptive methods formulate decision models to identify choices that are optimal with respect to a desired, measurable outcome. Provides experience integrating diverse data sources, modelling uncertainty, and visualizing key insights.",
            "id": "GENBUS 207",
            "parent": "GENBUS",
            "title": "INTERMEDIATE DATA ANALYSIS FOR BUSINESS"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "Examination of how firms, government, and civil society interplay in free market capitalism to bring about not only prosperity and economic freedom but also economic inequality, environmental degradation, and a weakening of institutions. Application of this knowledge to how capitalism can be reimagined for free market economies and business to foster prosperous societies and planetary health.",
            "id": "GENBUS 250",
            "parent": "GENBUS",
            "title": "SUSTAINABLE CAPITALISM"
        }
    },
    {
        "data": {
            "description": "Exploration of advanced subject areas possibly to be introduced into the business curriculum.",
            "id": "GENBUS 765",
            "parent": "GENBUS",
            "title": "CONTEMPORARY TOPICS"
        }
    },
    {
        "data": {
            "description": "Exploration of statistical inference and data analytics tools. Review of relevant foundations of statistics, machine learning and probability theory. Emphasis on applying the resulting concepts to canonical business examples, using both Excel and R.",
            "id": "GENBUS 704",
            "parent": "GENBUS",
            "title": "DATA TO DECISIONS"
        }
    },
    {
        "data": {
            "description": "Explore the fundamentals of Robotic Process Automation, including common use cases and popular tools.  Provides an opportunity to automate a variety of processes using this technology.",
            "id": "GENBUS 745",
            "parent": "GENBUS",
            "title": "ROBOTIC PROCESS AUTOMATION"
        }
    },
    {
        "data": {
            "description": "Explore the fundamentals of the Python programming language - such as data structures, functions, loops, and control flow - and utilize Python for data wrangling and analysis.",
            "id": "GENBUS 885",
            "parent": "GENBUS",
            "title": "PYTHON FUNDAMENTALS"
        }
    },
    {
        "data": {
            "description": "Explores and implements the critical thinking, communication, and managerial skills necessary for developing ethical organizations.",
            "id": "GENBUS 713",
            "parent": "GENBUS",
            "title": "ROLE OF BUSINESS IN SOCIETY"
        }
    },
    {
        "data": {
            "description": "First order differential equations, introduction to multivariable calculus and constrained optimization, infinite sequences and series, methods of approximation, and a brief introduction to probability. Models and applications from business and the social sciences.",
            "id": "MATH 213",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 2"
        }
    },
    {
        "data": {
            "description": "Focus on applications, highlighting key practical issues in analytics projects. Discussion of pitfalls with regards to analytics applications, ethical aspects of analytics applications, as well as talent management and leadership in the context of analytics.",
            "id": "GENBUS 894",
            "parent": "GENBUS",
            "title": "PITFALLS, ETHICS, COMMUNICATION, AND LEADERSHIP IN BUSINESS ANALYTICS"
        }
    },
    {
        "data": {
            "description": "Focuses on various technologies needed to perform data analytics. Techniques of extracting structured and unstructured data from databases, applications, or social networks. Transform and combine data with other relevant information and load into targeted systems. How to use programming languages to collect data from the web and leverage libraries for other, more, advanced data analysis.",
            "id": "GENBUS 760",
            "parent": "GENBUS",
            "title": "DATA TECHNOLOGY FOR BUSINESS ANALYTICS"
        }
    },
    {
        "data": {
            "description": "High-level introduction to concepts and practices in business. Overview of management, marketing, strategy, entrepreneurship, ethics, supply chain, and international business.",
            "id": "GENBUS 311",
            "parent": "GENBUS",
            "title": "FUNDAMENTALS OF MANAGEMENT AND MARKETING FOR NON-BUSINESS MAJORS"
        }
    },
    {
        "data": {
            "description": "History of legal development, contracts, agency, sale of goods, insurance.",
            "id": "GENBUS 301",
            "parent": "GENBUS",
            "title": "BUSINESS LAW"
        }
    },
    {
        "data": {
            "description": "Individual work suited to the needs of Ph.D. students may be arranged.",
            "id": "GENBUS 999",
            "parent": "GENBUS",
            "title": "READING AND RESEARCH-BUSINESS RESEARCH PHD"
        }
    },
    {
        "data": {
            "description": "Individual work suited to the needs of graduate students may be arranged both during regular sessions and during the intersession periods.",
            "id": "GENBUS 799",
            "parent": "GENBUS",
            "title": "READING AND RESEARCH-BUSINESS RESEARCH"
        }
    },
    {
        "data": {
            "description": "Individual work suited to the needs of undergraduate students may be arranged with a faculty member.",
            "id": "GENBUS 399",
            "parent": "GENBUS",
            "title": "READING AND RESEARCH-BUSINESS RESEARCH"
        }
    },
    {
        "data": {
            "description": "Integrated treatment of macroeconomics and microeconomics (seeECON 101andECON 102). Accelerated approach to economics training, especially for Economics: Math Emphasis majors.",
            "id": "ECON 111",
            "parent": "ECON",
            "title": "PRINCIPLES OF ECONOMICS-ACCELERATED TREATMENT"
        }
    },
    {
        "data": {
            "description": "Internship which allows students to augment their business education and gain professional experience in their major through related work experience. Intended for undergraduates in the School of Business. Not available with firms who participate in theACCT I S 600internship. See listing on Accounting Dept. website.",
            "id": "GENBUS 450",
            "parent": "GENBUS",
            "title": "PROFESSIONAL EXPERIENCE IN BUSINESS"
        }
    },
    {
        "data": {
            "description": "Internship which allows students to augment their business education and gain professional experience in their major through related work experience.",
            "id": "GENBUS 750",
            "parent": "GENBUS",
            "title": "PROFESSIONAL EXPERIENCE IN BUSINESS"
        }
    },
    {
        "data": {
            "description": "Introduce students to principles of data visualization and provide hands-on experience using data visualization tools and techniques for business applications. Develop proficiency in current visualization software tools, and leverage these tools for data exploration, insight into decision-making, and data presentation. Recommended for students to have general computing skills and familiarity with MS Word, MS Excel and MS PowerPoint; introductory-level exposure to coding in any language; some R experience; basic statistical literacy, equivalent to at least one semester of statistics.",
            "id": "GENBUS 720",
            "parent": "GENBUS",
            "title": "DATA VISUALIZATION FOR BUSINESS ANALYTICS"
        }
    },
    {
        "data": {
            "description": "Introduces the theory, methods, and computational procedures needed to perform advanced Bayesian data analyses. Predictive and decision-theoretic motivations including subjective probability, risk, admissibility, and exchangeability; highlights key components of Bayesian analysis (i.e., prior, likelihood, posterior, and predictive distributions) within standard parametric models and advanced hierarchical and multilevel models; demonstrates the iterative process of model specification, implementation, criticism, and revision with applied case studies; implements computational techniques (e.g., Markov chain Monte Carlo, variational inference) in modern probabilistic programming languages.",
            "id": "ECON/GENBUS/STAT 775",
            "title": "BAYESIAN STATISTICS"
        }
    },
    {
        "data": {
            "description": "Introduction to calculus of functions of several variables; calculus on parameterized curves, derivatives of functions of several variables, multiple integrals, vector calculus.",
            "id": "MATH 234",
            "parent": "MATH",
            "title": "CALCULUS--FUNCTIONS OF SEVERAL VARIABLES"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Introduction to fundamentals of prescriptive analytics with emphasis on business applications.  Modeling and mathematical optimization using Excel and Python. Designing, building, testing, and analyzing models, including sensitivity and risk analysis. Developing and solving optimization models, including linear, integer, and nonlinear problems. Course includes some principles of model-building and fundamentals of optimization theory but emphasizes practical application, hands-on learning, and problem-driven exercises.",
            "id": "GENBUS 730",
            "parent": "GENBUS",
            "title": "PRESCRIPTIVE MODELING AND OPTIMIZATION FOR BUSINESS ANALYTICS"
        }
    },
    {
        "data": {
            "description": "Introduction to machine learning techniques in business. Focus on applications for solving business problems, including hands-on practice in the context of various real-world data sets. Materials covered include machine learning foundations, different methodological approaches, and implementation tools for machine learning for business applications. Methods include both supervised learning techniques (linear regression and classification, non-linear regression, CARTs, random forests, SVMs, artificial neural nets, etc.) as well as unsupervised learning techniques (clustering, principal components, etc.).",
            "id": "GENBUS 656",
            "parent": "GENBUS",
            "title": "MACHINE LEARNING FOR BUSINESS ANALYTICS"
        }
    },
    {
        "data": {
            "description": "Lays the foundation for understanding how to engage with external and internal clients and manage a business analytics consulting project. Covers consulting tools and models, as well as traditional and agile project management tools and concepts.",
            "id": "GENBUS 893",
            "parent": "GENBUS",
            "title": "ANALYTICS CONSULTING PROJECT MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Learn basic business statistical skills to comprehend business reports, and to calculate statistical findings from business data using Excel. Understand simple probability calculations and how to apply probability to specific business uncertainties. Build capability to use simple statistical models and tests to estimate business variables of interest, and learn about predictive relationships between variables. Become comfortable using Excel for data manipulation, data analytics, and data visualization. Apply statistical analysis to address business issues.",
            "id": "GENBUS 206",
            "parent": "GENBUS",
            "title": "BEGINNING DATA ANALYSIS FOR BUSINESS"
        }
    },
    {
        "data": {
            "description": "Legal implications for business managers of selected areas of the law including negligence, contract, intellectual property, officer/director liability, financing the business enterprise, and employment and trade regulation; introduction to the legal process, including alternative dispute resolution systems.",
            "id": "GENBUS/RMI 701",
            "title": "MANAGING LEGAL RISKS"
        }
    },
    {
        "data": {
            "description": "Linear fixed and random effects models; estimation and prediction; data exploration, diagnostics and model selection techniques; generalized linear panel data models.",
            "id": "GENBUS 806",
            "parent": "GENBUS",
            "title": "PANEL DATA ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Macroeconomic measurement and models of aggregate demand and supply; fiscal and monetary policy for unemployment, inflation, and growth.",
            "id": "ECON 102",
            "parent": "ECON",
            "title": "PRINCIPLES OF MACROECONOMICS"
        }
    },
    {
        "data": {
            "description": "Managing operations and supply chains is about people, information, equipment, and materials and how these are combined to produce and/or deliver goods and services to customers. Emphasis is on how systems and processes can be designed, managed, and improved to achieve operations excellence and competitive advantage.",
            "id": "OTM 300",
            "parent": "OTM",
            "title": "OPERATIONS AND SUPPLY CHAIN MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Only allowed for six to eight month internships which will allow students to augment their business education and gain professional experience in their major area. Students receive one credit and will remain a full-time student. Intended for undergraduates in the School of Business",
            "id": "GENBUS 451",
            "parent": "GENBUS",
            "title": "PROFESSIONAL EXPERIENCE IN BUSINESS-EXTENDED INTERNSHIP"
        }
    },
    {
        "data": {
            "description": "Part of a two course sequence introducing non-business students to basic concepts, practices and analytical methods that are part of the market enterprise system. This course is a basic overview on: accounting, finance, and business law.",
            "id": "GENBUS 310",
            "parent": "GENBUS",
            "title": "FUNDAMENTALS OF ACCOUNTING AND FINANCE FOR NON-BUSINESS MAJORS"
        }
    },
    {
        "data": {
            "description": "Probability and combinatorial methods, discrete and continuous, univariate and multivariate distributions, expected values, moments, normal distribution and derived distributions, estimation.",
            "id": "MATH/STAT 309",
            "title": "INTRODUCTION TO PROBABILITY AND MATHEMATICAL STATISTICS I"
        }
    },
    {
        "data": {
            "description": "Probability distributions, statistical inference; multiple linear regression; introduction to econometric methods. It is expected that students will have completed three semesters calculus (such asMATH 234) and linear algebra (such asMATH 340).",
            "id": "ECON 709",
            "parent": "ECON",
            "title": "ECONOMIC STATISTICS AND ECONOMETRICS I"
        }
    },
    {
        "data": {
            "description": "Project-based applications of statistics, programming, data visualization, and database management.",
            "id": "GENBUS 884",
            "parent": "GENBUS",
            "title": "APPLIED ANALYTICS - CASE STUDIES"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Provides a framework for evaluating marketing problems and developing a marketing strategy. Customer, competitor, and collaborator factors are emphasized as foundations for marketing decision-making. Examines the key aspects of product, pricing, distribution, and promotion strategy.",
            "id": "MARKETNG 700",
            "parent": "MARKETNG",
            "title": "MARKETING MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Provides a fundamental understanding of how to prepare for a case interview, analyze problems based on limited information, consider alternatives to develop a solution and present the solution effectively.",
            "id": "GENBUS 370",
            "parent": "GENBUS",
            "title": "CASE INTERVIEW ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Provides an introduction to experimental and causal methods for driving business insights. Topics include: (1) Review and distinction of correlation vs. causation; (2) design and analysis of randomized-controlled experiments; and (3) identification of \"natural experiments\" in business data and corresponding empirical strategies.",
            "id": "GENBUS 740",
            "parent": "GENBUS",
            "title": "EXPERIMENTS AND CAUSAL METHODS FOR BUSINESS INSIGHTS"
        }
    },
    {
        "data": {
            "description": "Provides an opportunity to bring together all material learned throughout the program and synthesize it through an applied consulting project. Explore and apply concepts to a future career through: identifying and understanding the business challenge, applying analytic methods to discover insight(s) to answer the business challenge, developing recommendations based on the findings, and communicating those findings and recommendation(s).",
            "id": "GENBUS 790",
            "parent": "GENBUS",
            "title": "CONSULTING PROJECT CAPSTONE"
        }
    },
    {
        "data": {
            "description": "Provides an opportunity to bring together all of the material learned throughout the program and synthesize it through an applied consulting project. Allows exploration and application of concepts to a future career through identifying and understanding the business challenge and applying research and analysis to discover insight(s).",
            "id": "GENBUS 791",
            "parent": "GENBUS",
            "title": "EMBA CONSULTING PRACTICUM I"
        }
    },
    {
        "data": {
            "description": "Provides an opportunity to bring together all the material learned throughout the program and synthesize it through an applied consulting project. Allows exploration and application of concepts to a future career through developing recommendations based on the research and findings from the first course and communicating those findings and recommendation(s).",
            "id": "GENBUS 792",
            "parent": "GENBUS",
            "title": "EMBA CONSULTING PRACTICUM II"
        }
    },
    {
        "data": {
            "description": "Provides an opportunity to construct advanced SQL statements (including joins, common table expressions, window functions, etc.) and build cloud data warehouses in a variety of software vendor platforms.",
            "id": "GENBUS 746",
            "parent": "GENBUS",
            "title": "ADVANCED SQL & DATA WAREHOUSING"
        }
    },
    {
        "data": {
            "description": "Provides an overview of cloud services that support business analytics. Load and analyze data, build and deploy machine learning models, and develop data pipelines through hands-on, in-class activities working in cloud environments.",
            "id": "GENBUS 780",
            "parent": "GENBUS",
            "title": "CLOUD TECHNOLOGY FOR BUSINESS ANALYTICS"
        }
    },
    {
        "data": {
            "description": "Provides experience in data visualization and cloud technologies to support business analytics.  Create and share compelling data visualizations to enhance decision making.  Use cloud technologies to build scalable data warehouses, analyze big data, and develop and deploy machine learning models.",
            "id": "GENBUS 883",
            "parent": "GENBUS",
            "title": "DATA VISUALIZATION & CLOUD TECHNOLOGIES"
        }
    },
    {
        "data": {
            "description": "Required of incoming students in the Wisconsin School of Business PhD program. Students are often overwhelmed and do not absorb material when offered all at once before they begin their regular courses. This format offers fundamental content about conducting research and academic life that is not specific to a given department in the business school, but will help to frame and motivate other studies. This format gives students more time to absorb the content at a point when they can better see how it applies to them.",
            "id": "GENBUS 933",
            "parent": "GENBUS",
            "title": "BEGINNING A RESEARCH CAREER IN BUSINESS"
        }
    },
    {
        "data": {
            "description": "Solve critical business challenges. Drawing on and integrating the MBA core curriculum, conduct an in-depth analysis and make recommendations on a strategic problem posed by the sponsor company.",
            "id": "GENBUS 725",
            "parent": "GENBUS",
            "title": "CONSULTING PRACTICUM"
        }
    },
    {
        "data": {
            "description": "Statistical inference and analyses based on models will be introduced and applied in a business context using a calculus-based focus. Topics covered include point estimation, confidence intervals, hypothesis testing, regression models, and time series models. Various methods for fitting a model to data will be explored, and uncertainty about parameter estimates will be quantified so decision makers have information about the quality of the estimates. Regression and time series models are commonly used in business analytics applications and will be used to analyze business data and make inferences and predictions.",
            "id": "GENBUS 317",
            "parent": "GENBUS",
            "title": "MATHEMATICAL FOUNDATIONS OF BUSINESS ANALYTICS"
        }
    },
    {
        "data": {
            "description": "Students will gain the knowledge and skills to continuously enhance their own team performance and productivity as well as the teams they are involved with. They will also be in a much better position to lead teams effectively.",
            "id": "EPD/GENBUS/MHR 783",
            "title": "LEADING TEAMS"
        }
    },
    {
        "data": {
            "description": "Techniques of integration, improper integrals, first order ordinary differential equations, sequences and series, Taylor series, vector geometry in two and three dimensions.",
            "id": "MATH 222",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 2"
        }
    },
    {
        "data": {
            "description": "Techniques that will help to plan, execute, and deliver projects with desired scope on time and on budget. Learn to document clear project objectives and goals, accurately estimate project time and costs, schedule and allocate time-critical resources, and establish feedback systems for optimal project control.",
            "id": "EPD/GENBUS/OTM 784",
            "title": "PROJECT MANAGEMENT ESSENTIALS"
        }
    },
    {
        "data": {
            "description": "The management of people and organizations: diversity, attitude and job satisfaction, emotions, personality and value, individual and group decision making, motivation, teams, leadership, influence, strategy, organizational structure and culture, and change management.",
            "id": "MHR 300",
            "parent": "MHR",
            "title": "MANAGING ORGANIZATIONS"
        }
    },
    {
        "data": {
            "description": "Theory and applications of the general linear model; graphical methods; simultaneous inference; regression diagnostics; analysis of variance of fixed, random and mixed effects models; ANCOVA: violations of assumptions.",
            "id": "STAT 849",
            "parent": "STAT",
            "title": "THEORY AND APPLICATION OF REGRESSION AND ANALYSIS OF VARIANCE I"
        }
    },
    {
        "data": {
            "description": "This class is designed to prepare students for dealing with ethical challenges in the world outside academia. Focus is on the role of personal values in all types of decision making, from personal to professional.",
            "id": "GENBUS 710",
            "parent": "GENBUS",
            "title": "ETHICS, INTEGRITY AND SOCIETY"
        }
    },
    {
        "data": {
            "description": "This course is designed with a keen awareness for the needs of the non-financial student or professional. For this class, no previous financial training is required. The intent is to equip you with the essential concepts used to develop financial literacy. Content will cover basic financial terms and reports, analytical tools to help interpret financial data and using financial data in budgets and forecasts.",
            "id": "ACCTIS/EPD/GENBUS 781",
            "title": "FINANCIAL AND BUSINESS ACUMEN"
        }
    },
    {
        "data": {
            "description": "Topics in multi-variable calculus and introduction to differential equations.",
            "id": "MATH 376",
            "parent": "MATH",
            "title": "TOPICS IN MULTI-VARIABLE CALCULUS AND DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "description": "Vector spaces and linear transformations, differential calculus of scalar and vector fields, determinants, eigenvalues and eigenvectors, multiple integrals, line integrals, and surface integrals. Freshmen students are invited to enroll by the Department of Mathematics.",
            "id": "MATH 375",
            "parent": "MATH",
            "title": "TOPICS IN MULTI-VARIABLE CALCULUS AND LINEAR ALGEBRA"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ECON",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "GENBUS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MARKETNG",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MHR",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "OTM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "STAT",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "GENBUS 250"
        }
    },
    {
        "data": {
            "source": "ECON 102",
            "target": "ECON 111"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON 101"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON 102"
        }
    },
    {
        "data": {
            "source": "ECON 709",
            "target": "GENBUS 806"
        }
    },
    {
        "data": {
            "source": "GENBUS 106",
            "target": "GENBUS 206"
        }
    },
    {
        "data": {
            "source": "GENBUS 106",
            "target": "GENBUS 306"
        }
    },
    {
        "data": {
            "source": "GENBUS 106",
            "target": "GENBUS 307"
        }
    },
    {
        "data": {
            "source": "GENBUS 110",
            "target": "GENBUS 360"
        }
    },
    {
        "data": {
            "source": "GENBUS 206",
            "target": "GENBUS 207"
        }
    },
    {
        "data": {
            "source": "GENBUS 306",
            "target": "GENBUS 307"
        }
    },
    {
        "data": {
            "source": "GENBUS 307",
            "target": "GENBUS 308"
        }
    },
    {
        "data": {
            "source": "GENBUS 307",
            "target": "GENBUS 656"
        }
    },
    {
        "data": {
            "source": "GENBUS 360",
            "target": "GENBUS 400"
        }
    },
    {
        "data": {
            "source": "GENBUS 704",
            "target": "GENBUS 725"
        }
    },
    {
        "data": {
            "source": "GENBUS 704",
            "target": "GENBUS 740"
        }
    },
    {
        "data": {
            "source": "GENBUS 705",
            "target": "GENBUS 740"
        }
    },
    {
        "data": {
            "source": "GENBUS 720",
            "target": "GENBUS 883"
        }
    },
    {
        "data": {
            "source": "GENBUS 760",
            "target": "GENBUS 746"
        }
    },
    {
        "data": {
            "source": "GENBUS 780",
            "target": "GENBUS 746"
        }
    },
    {
        "data": {
            "source": "GENBUS 780",
            "target": "GENBUS 883"
        }
    },
    {
        "data": {
            "source": "GENBUS 791",
            "target": "GENBUS 792"
        }
    },
    {
        "data": {
            "source": "GENBUS 881",
            "target": "GENBUS 884"
        }
    },
    {
        "data": {
            "source": "GENBUS 881",
            "target": "GENBUS 886"
        }
    },
    {
        "data": {
            "source": "GENBUS 882",
            "target": "GENBUS 746"
        }
    },
    {
        "data": {
            "source": "GENBUS 883",
            "target": "GENBUS 884"
        }
    },
    {
        "data": {
            "source": "GENBUS 883",
            "target": "GENBUS 891"
        }
    },
    {
        "data": {
            "source": "GENBUS 883",
            "target": "GENBUS 894"
        }
    },
    {
        "data": {
            "source": "GENBUS 884",
            "target": "GENBUS 895"
        }
    },
    {
        "data": {
            "source": "GENBUS 886",
            "target": "GENBUS 888"
        }
    },
    {
        "data": {
            "source": "GENBUS 888",
            "target": "GENBUS 891"
        }
    },
    {
        "data": {
            "source": "GENBUS 888",
            "target": "GENBUS 894"
        }
    },
    {
        "data": {
            "source": "GENBUS 893",
            "target": "GENBUS 895"
        }
    },
    {
        "data": {
            "source": "MARKETNG 700",
            "target": "GENBUS 725"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "GENBUS 206"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "GENBUS 306"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 213"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 213",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 222"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 234"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "MATH/STAT 431"
        }
    },
    {
        "data": {
            "source": "MATH 375",
            "target": "MATH 376"
        }
    },
    {
        "data": {
            "source": "MATH 376",
            "target": "MATH/STAT 431"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH/STAT 309",
            "target": "GENBUS 317"
        }
    },
    {
        "data": {
            "source": "MATH/STAT 431",
            "target": "MATH/STAT 309"
        }
    },
    {
        "data": {
            "source": "MHR 300",
            "target": "GENBUS 400"
        }
    },
    {
        "data": {
            "source": "OTM 300",
            "target": "GENBUS 400"
        }
    },
    {
        "data": {
            "source": "STAT 610",
            "target": "ECON/GENBUS/STAT 775"
        }
    },
    {
        "data": {
            "source": "STAT 849",
            "target": "GENBUS 806"
        }
    }
]