[
    {
        "data": {
            "description": "A preparation and introductory math course for students enrolled in the Summer Collegiate Experience program. Includes material from precalculus and calculus and related topics depending on students' results on the math placement exam.",
            "id": "MATH 118",
            "parent": "MATH",
            "title": "SUMMER COLLEGIATE EXPERIENCE MATHEMATICS COURSE"
        }
    },
    {
        "data": {
            "description": "Covers the graphs, properties and geometric significance of trigonometric functions of a real variable. Other topics include trigonometric equations and identities, application, trigonometric form of complex numbers, DeMoivre's theorem, and polar and parametric equations. The course also has a significant number of applications, especially related to other disciplines.",
            "id": "MATH 113",
            "parent": "MATH",
            "title": "TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "Introductory course in epigenetics - the layer of chemical information that sits on top of the genome - that switch genes 'on' or 'off'. Will introduce how the epigenome, in collaboration with the genome, controls versatile biological processes and cell fates. Will also cover the latest advances of how humans can control their own epigenetic destiny by lifestyle, diet, and other environmental factors.",
            "id": "GENETICS 525",
            "parent": "GENETICS",
            "title": "EPIGENETICS"
        }
    },
    {
        "data": {
            "description": "",
            "id": "ANSCI/DYSCI/GENETICS 951",
            "title": "SEMINAR IN ANIMAL BREEDING"
        }
    },
    {
        "data": {
            "description": "A comprehensive review of cellular biology, the study of optical methods with emphasis on the light microscope and the various techniques used in preparation and staining of specimens for cytologic and histologic study.",
            "id": "GENETICS 470",
            "parent": "GENETICS",
            "title": "BASIC CYTOLOGY AND LABORATORY PROCEDURES"
        }
    },
    {
        "data": {
            "description": "A research-level analysis of the current status of the investigation of processes controlling differential gene activity and cellular behavior. The major emphasis is genetic. In successive years, the focus moves from the gene to the cell to the organism.",
            "id": "GENETICS/MDGENET 707",
            "title": "GENETICS OF DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Accelerated coverage of topics in general chemistry, including introduction to laboratory techniques. Topics include atomic and molecular structure, chemical equilibrium, acid-base chemistry, thermodynamics, kinetics, and electrochemistry.",
            "id": "CHEM 109",
            "parent": "CHEM",
            "title": "ADVANCED GENERAL CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Advanced genetics course focusing on genetic mechanisms of animal embryonic development, with particular emphasis on central molecular circuitries that control development and genetic analytical tools used to reveal them. Address topics including maternal and epigenetic inheritance, the egg-to-embryo transition, pattern formation, organogenesis, coordination of cellular and molecular mechanisms, and animal models of human congenital disorders.",
            "id": "GENETICS 627",
            "parent": "GENETICS",
            "title": "ANIMAL DEVELOPMENTAL GENETICS"
        }
    },
    {
        "data": {
            "description": "An internship under guidance of a faculty or instructional academic staff member in Genetics and internship site supervisor. Students are responsible for arranging the work and credits with the faculty or instructional academic staff member and the internship site supervisor.",
            "id": "GENETICS 399",
            "parent": "GENETICS",
            "title": "COORDINATIVE INTERNSHIP/COOPERATIVE EDUCATION"
        }
    },
    {
        "data": {
            "description": "Anatomy, histology, physiology and pathology of skin, thyroid, lymph nodes and other sites and the corresponding celluular manifestations which provide diagnostic information. Emphasis on specimen collection by fine needle aspiration. Correlation of the didactic information with the microscopic cellular patterns to provide a diagnosis.",
            "id": "GENETICS 575",
            "parent": "GENETICS",
            "title": "MISCELLANEOUS SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Anatomy, histology, physiology and pathology of the breast and the corresponding cellular manifestations which provide diagnostic information. Cell changes related to specimen processing. Correlation of the didactic information with the microscopic cell patterns to provide a diagnosis.",
            "id": "GENETICS 569",
            "parent": "GENETICS",
            "title": "THE BREAST"
        }
    },
    {
        "data": {
            "description": "Anatomy, histology, physiology and pathology of the gastrointestinal system and the corresponding cellular manifestations which provide diagnostic information. Cell changes related to specimen processing. Correlation of the didactic information with the microscopic cellular patterns to provide a diagnosis.",
            "id": "GENETICS 574",
            "parent": "GENETICS",
            "title": "THE GASTROINTESTINAL SYSTEM"
        }
    },
    {
        "data": {
            "description": "Anatomy, histology, physiology and pathology of the respiratory tract and the corresponding cellular manifestations which provide diagnostic information. Cell changes related to specimen processing. Correlation of the didactic information with the microscopic cellular patterns to provide a diagnosis.",
            "id": "GENETICS 572",
            "parent": "GENETICS",
            "title": "THE RESPIRATORY SYSTEM"
        }
    },
    {
        "data": {
            "description": "Anatomy, histology, physiology, and pathology of the female reproductive tract and the corresponding cellular manifestations which provide diagnostic information. Cellular changes due to therapy and specimen collection. Correlation of the didactic information with the microscopic cellular patterns to provide a diagnosis.",
            "id": "GENETICS 570",
            "parent": "GENETICS",
            "title": "THE FEMALE REPRODUCTIVE SYSTEM"
        }
    },
    {
        "data": {
            "description": "Anatomy, physiology, histology and pathology of the body cavities. Cytologic manifestations which provide diagnostic information. Cell changes related to specimen processing. Correlation of the didactic information with the microscopic cellular patterns to provide a diagnosis.",
            "id": "GENETICS 576",
            "parent": "GENETICS",
            "title": "EFFUSIONS"
        }
    },
    {
        "data": {
            "description": "Anatomy, physiology, histology and pathology of the central nervous system and the corresponding cellular manifestations which provide diagnostic information. Cell changes related to specimen preparation. Correlation of the didactic information with the microscopic cellular patterns to provide a diagnosis.",
            "id": "GENETICS 568",
            "parent": "GENETICS",
            "title": "THE CENTRAL NERVOUS SYSTEM"
        }
    },
    {
        "data": {
            "description": "Anatomy, physiology, histology and pathology of the urinary tract and male reproductive systems and the corresponding cellular manifestations which provide diagnostic information. Cell changes related to specimen processing. Correlation of didactic information with microscopic cell patterns to provide a diagnosis.",
            "id": "GENETICS 573",
            "parent": "GENETICS",
            "title": "THE GENITOURINARY SYSTEM"
        }
    },
    {
        "data": {
            "description": "Basic biology of microorganisms, including structure, function, physiology, genetics, ecology, diversity, and evolution.",
            "id": "MICROBIO 303",
            "parent": "MICROBIO",
            "title": "BIOLOGY OF MICROORGANISMS"
        }
    },
    {
        "data": {
            "description": "Basic mechanisms in cellular neurophysiology: electrophysiology and chemistry of nerve signals, mechanisms in integration, simple nervous pathways and their behavioral correlates.",
            "id": "PSYCH/ZOOLOGY 523",
            "title": "NEUROBIOLOGY"
        }
    },
    {
        "data": {
            "description": "Basic principles of ecology and interrelations between individuals, populations, communities, ecosystems and their environment; transmission genetics and introduction to population genetics; origin of life, evolutionary mechanisms, ancestral relationships among species, and the diversity of life.",
            "id": "BIOCORE 381",
            "parent": "BIOCORE",
            "title": "EVOLUTION, ECOLOGY, AND GENETICS"
        }
    },
    {
        "data": {
            "description": "Basic principles of molecular ecology. Lecture topics include population genetics, molecular phylogenetics, rates and patterns of evolution, genome evolution, and molecular ecology.",
            "id": "ENTOM/GENETICS/ZOOLOGY 624",
            "title": "MOLECULAR ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Biosynthesis of biological molecules, signal transduction mechanisms, chemistry and metabolism of nucleic acids, protein synthesis, and molecular and cellular biology.",
            "id": "BIOCHEM 508",
            "parent": "BIOCHEM",
            "title": "GENERAL BIOCHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Brings cutting-edge topics in the genomic sciences into the reach of those in chemistry, biology, engineering, computer science  statistics fields. Enables biologically-oriented students to deal with advances in analytical science so that they may incorporate new genomic science concepts into their own scientific repertoires.",
            "id": "CHEM/GENETICS 626",
            "title": "GENOMIC SCIENCE"
        }
    },
    {
        "data": {
            "description": "Chemistry of biological materials, intermediary metabolism and protein structure.",
            "id": "BIOCHEM 507",
            "parent": "BIOCHEM",
            "title": "GENERAL BIOCHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Chemistry, nutrition, and metabolism of biological systems.",
            "id": "BIOCHEM 501",
            "parent": "BIOCHEM",
            "title": "INTRODUCTION TO BIOCHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Clinical practicum to develop diagnostic expertise involving the microscopic examination of routine gynecologic specimens (Pap smears).  Observe the signout of abnormal cytologic specimens by cytopathologist staff.",
            "id": "GENETICS 571",
            "parent": "GENETICS",
            "title": "CLINICAL PRACTICE I"
        }
    },
    {
        "data": {
            "description": "Clinical practicum to develop diagnostic expertise of cytologic specimens. Examine challenging cases with emphasis on diagnostic pitfalls. Observe patient clinics related to cytologic specimen collection. Participate at clinical experiences in fine needle aspiration, histology, and a private cytology laboratory.",
            "id": "GENETICS 671",
            "parent": "GENETICS",
            "title": "ADVANCED CLINICAL PRACTICE"
        }
    },
    {
        "data": {
            "description": "Computing-intensive course to prepare students for genetic mapping research; linkage analysis and QTL mapping in designed crosses; linkage disequilibrium and association analysis (GWAS). Recommended preparation is undergraduate courses in genetics and statistics and prior experience writing R scripts (such as module 1 of STAT 327).",
            "id": "AGRONOMY/ANSCI/GENETICS/HORT 615",
            "title": "GENETIC MAPPING"
        }
    },
    {
        "data": {
            "description": "Contemporary issues in genetic, developmental, cell, and molecular biology are addressed in a discussion format. Invited speakers give research lectures and reading material is taken from the primary literature. The discussion focuses on evaluating genetic approaches to biological problems.",
            "id": "GENETICS/MDGENET 708",
            "title": "METHODS AND LOGIC IN GENETIC ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Contents vary; consideration of subjects not included in the curriculum.",
            "id": "GENETICS/MDGENET 677",
            "title": "ADVANCED TOPICS IN GENETICS"
        }
    },
    {
        "data": {
            "description": "Core organic chemistry concepts of structure, reactivity, and synthesis with regards to the functional groups commonly found in commercial and biological substances. Covers a selection of topics fromCHEM 343and345.",
            "id": "CHEM 341",
            "parent": "CHEM",
            "title": "ELEMENTARY ORGANIC CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Covers a broad range of topics in animal development, with an emphasis on molecular mechanisms. Focuses on common themes, with the goal of understanding and analyzing current research in developmental biology and genetics.",
            "id": "CRB/GENETICS 710",
            "title": "DEVELOPMENTAL GENETICS"
        }
    },
    {
        "data": {
            "description": "Covers the basic concepts of genetics and genomics as applied to plants and their development, including discussions on breeding systems (modes of reproduction, sex determination, self incompatibility and crossing barriers), linkage analysis, genome structure and function (structure, function and evolution of nuclear and organellar chromosomes; haploidy and polyploidy; expression regulation and epigenetics), along with a description of current methodologies used in the analysis of these processes within the context of plant development. The objective is to instigate a broader knowledge and understanding of the principles and methodologies used in plant genetics and their applications in investigations of the molecular mechanisms that modulate plant development.",
            "id": "BIOCHEM/GENETICS 631",
            "title": "PLANT GENETICS AND DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "Evolutionary biology, emphasizing how modern scientists study evolution. Topics include: nature and mechanisms of microevolution, macroevolution, adaptation, speciation; systematics and taxonomy; quantitative genetics and measurement of natural selection; phylogenetic analyses of behavior, physiology, morphology, biochemistry; current controversies in evolution.",
            "id": "ANTHRO/BOTANY/ZOOLOGY 410",
            "title": "EVOLUTIONARY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Examines modern microbial genetics and molecular processes. Emphasis on the use of eubacterial and eukaryotic microbes to elucidate cellular function. Discussion of experimental approaches to study microbes and their use in biotechnology, bioremediation, and medicine.",
            "id": "MICROBIO 470",
            "parent": "MICROBIO",
            "title": "MICROBIAL GENETICS & MOLECULAR MACHINES"
        }
    },
    {
        "data": {
            "description": "Explore some of the most important themes and debates that have permeated evolutionary biology over the last 50 years. Read key papers related to each controversial topic, debate the pros and cons of competing viewpoints, and reflect on the relevance of the issue to contemporary evolutionary biology.",
            "id": "BOTANY/ENTOM/GENETICS/ZOOLOGY 820",
            "title": "FOUNDATIONS OF EVOLUTION"
        }
    },
    {
        "data": {
            "description": "Explore the biological science PhD student experience, from the initial stages of consideration through applications and interviews, to graduate student life and career opportunities.  Reflect on personal goals and the nature of graduate study to confirm that a research-focused PhD is right for you. Consider whether to apply this year or later on, in light of admissions expectations and personal readiness. Identify research areas, PhD programs, and prospective advisors of interest. Improve application materials, strengthen interview skills, and consider individual priorities for selecting a program.",
            "id": "GENETICS 695",
            "parent": "GENETICS",
            "title": "ADVANCING TO BIOLOGICAL SCIENCES PHD STUDY"
        }
    },
    {
        "data": {
            "description": "Explores a detailed atomic and molecular view of matter and its interactions, with a specific focus on quantum theory, molecular structure, and chemical bonding. Application required for enrollment.",
            "id": "CHEM 115",
            "parent": "CHEM",
            "title": "CHEMICAL PRINCIPLES I"
        }
    },
    {
        "data": {
            "description": "Explores the interaction between genetics and the immune system. Examines the genetic mechanisms that drive the immunological and clinical differences observed between individuals when confronted with the same environment of immunological insults, such as COVID-19, influenza, allergies and cancer. Stresses clinical and research perspectives and their societal implications.",
            "id": "GENETICS 588",
            "parent": "GENETICS",
            "title": "IMMUNOGENETICS"
        }
    },
    {
        "data": {
            "description": "Exposure to diverse topics in contemporary evolutionary biology and development of critical thinking and communication skills. Most weeks guest lecturers present their own primary research on a specialized topic in evolutionary biology. Seminars include perspectives from genetics, ecology, geoscience, zoology, botany, microbiology, systematics, molecular biology, and integrative research. Some weeks feature special topics and discussions on pedagogical, legal, outreach, or other issues in evolutionary biology. Includes thinking critically about methodology, experimental design and interpretation, and how conclusions are reached in evolutionary biology by reading primary and secondary literature, attending seminars, discussing topics with speakers and other students, and preparing a written report.  The 3-credit version of the course delves deeper into communication of evolutionary biology to researchers, undergraduates, K-12 students, and the general public.",
            "id": "BIOLOGY/GENETICS 522",
            "title": "COMMUNICATING EVOLUTIONARY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "First semester of professional level training in genetic mechanisms and analysis as applied to genetic transmission, gene expression, forward and reverse genetics, molecular genetics, genonmics, developmental genetics, and epigenetics.",
            "id": "GENETICS 701",
            "parent": "GENETICS",
            "title": "ADVANCED GENETICS"
        }
    },
    {
        "data": {
            "description": "Focuses on the basic molecular mechanisms that regulate DNA, RNA, and protein metabolism in eukaryotic organisms.",
            "id": "BIOCHEM/GENETICS/MDGENET 620",
            "title": "EUKARYOTIC MOLECULAR BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Focuses on the genetic basis by which cancer manifests. Provides a comprehensive overview of how cancer is generated as a result of abnormalities at the DNA level, paying special attention to oncogenes, tumor suppressors, DNA mutations, DNA repair mechanisms, chromosomal instability, and tumor heterogeneity. Stresses the role of the immune system in combating cancer, the phenomenon of cancer resistance, anti-tumor strategies, and epigenetic influences on tumorigenesis. Highlights connections between course material and clinical relevance.",
            "id": "GENETICS/MDGENET 662",
            "title": "CANCER GENETICS"
        }
    },
    {
        "data": {
            "description": "Fungal genetics, genomics, and physiology using plant pathogenic fungi and the genetic models Aspergillus nidulans and Neurospora crassa as model systems to explore the current knowledge of fungal genetics and plant/fungal interactions.",
            "id": "BOTANY/GENETICS/MM&I/PLPATH 655",
            "title": "BIOLOGY AND GENETICS OF FUNGI"
        }
    },
    {
        "data": {
            "description": "Gain practical experience in classical and molecular genetic laboratory techniques using plants, animals, and fungi. Topics include complementation and linkage analysis, gene mapping, library screening, yeast and bacterial transformation, restriction analysis, PCR, sequencing, and Southern blot analysis.",
            "id": "GENETICS 545",
            "parent": "GENETICS",
            "title": "GENETICS LABORATORY"
        }
    },
    {
        "data": {
            "description": "General biological principles. Topics include: evolution, ecology, animal behavior, cell structure and function, genetics and molecular genetics and the physiology of a variety of organ systems emphasizing function in humans.",
            "id": "BIOLOGY/ZOOLOGY 101",
            "title": "ANIMAL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Genetic analysis, population genetics, evolution and quantitative genetics. Includes mutant screens, pathway analysis, mosaic analysis, reverse genetics, genomics, Hardy-Weinberg  linkage equilibrium, inbreeding, genetic drift, natural selection, population structure, inheritance of complex traits, domestication and human evolution.",
            "id": "GENETICS 468",
            "parent": "GENETICS",
            "title": "GENERAL GENETICS 2"
        }
    },
    {
        "data": {
            "description": "Genetics in eukaryotes and prokaryotes.  Includes transmission genetics, molecular genetics, evolutionary genetics, genetic engineering, and societal issues associated with genetics.  Illustrative material includes bacteria, plants, insects, and vertebrates.",
            "id": "GENETICS 466",
            "parent": "GENETICS",
            "title": "PRINCIPLES OF GENETICS"
        }
    },
    {
        "data": {
            "description": "Genetics of eukaryotes and prokaryotes. Includes transmission genetics, probability and hypothesis testing, genetic mapping, molecular genetics, gene expression, and genetic engineering. Illustrative material includes viruses, bacteria, plants, fungi, insects, and humans.",
            "id": "GENETICS 467",
            "parent": "GENETICS",
            "title": "GENERAL GENETICS 1"
        }
    },
    {
        "data": {
            "description": "Graduate seminar in Plant Breeding  Plant Genetics (PBPG) that requires students to give oral scientific presentations on topics chosen by the instructors and/or the student¿s thesis research. This seminar is coordinated by PBPG faculty on a rotating basis.",
            "id": "AGRONOMY/GENETICS/HORT 957",
            "title": "SEMINAR-PLANT BREEDING"
        }
    },
    {
        "data": {
            "description": "Human-induced factors such as changes in land use and global climate are causing rapid worldwide biodiversity loss. Can modern molecular genetics contribute to species preservation? In this course, we will first explore the challenges and potential of molecular genetic methods based on biobanking, gene editing and nuclear transfer for animal biodiversity preservation. Topics covered will include: i) maternal factors and early animal development, ii) interspecies somatic cell nuclear transfer (isSCNT) and oocyte-mediated reprogramming in animal cloning, iii) developmental, phylogenetic and ecological considerations for biobanking, iv) gene editing and synthetic biology as potential tools to recapture biodiversity. Use knowledge in animal population status, developmental genetics and phylogeny to address real-life problems involving the conservation of threatened animal populations.",
            "id": "GENETICS 527",
            "parent": "GENETICS",
            "title": "DEVELOPMENTAL GENETICS FOR CONSERVATION AND REGENERATION"
        }
    },
    {
        "data": {
            "description": "Independent laboratory research in preparation of a graduate thesis under supervision of a faculty member.",
            "id": "GENETICS 990",
            "parent": "GENETICS",
            "title": "RESEARCH"
        }
    },
    {
        "data": {
            "description": "Individual advanced work in an area of Genetics under the direct guidance of a faculty member.",
            "id": "GENETICS 699",
            "parent": "GENETICS",
            "title": "SPECIAL PROBLEMS"
        }
    },
    {
        "data": {
            "description": "Individual study for majors completing theses for Honors degrees as arranged with a faculty member.",
            "id": "GENETICS 681",
            "parent": "GENETICS",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Individual study for majors completing theses for Honors degrees as arranged with a faculty member.",
            "id": "GENETICS 682",
            "parent": "GENETICS",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Introduction of basic concepts of plant molecular biology and molecular techniques in current use. Topics include: organization and regulation of plant genes, gene cloning and analysis, transformation systems for plants, and molecular techniques for crop improvement.",
            "id": "GENETICS/HORT 550",
            "title": "MOLECULAR APPROACHES FOR POTENTIAL CROP IMPROVEMENT"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Introduction to professional scientific writing in the field of genetics. Develop skills and expertise in scientific writing with a special emphasis on preparing grant and fellowship research proposals in genetics and genomics.",
            "id": "GENETICS 808",
            "parent": "GENETICS",
            "title": "FROM GENES TO GRANTS: WRITING WINNING RESEARCH PROPOSALS IN GENETICS"
        }
    },
    {
        "data": {
            "description": "Introduction to the discipline of genetics, to the UW Laboratory of Genetics, to some of the research projects the faculty are pursuing, to resources available at UW-Madison, and to the career options open to an individual with a genetics undergraduate degree.",
            "id": "GENETICS 155",
            "parent": "GENETICS",
            "title": "FRESHMAN SEMINAR IN GENETICS"
        }
    },
    {
        "data": {
            "description": "Molecular basis of bacterial physiology and genetics with emphasis on molecular mechanisms; topics include nucleic acid-protein interactions, transcription, translation, replication, recombination, regulation of gene expression.",
            "id": "BIOCHEM/GENETICS/MICROBIO 612",
            "title": "PROKARYOTIC MOLECULAR BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Molecular mechanisms whereby endogenous and environmental regulatory factors control development; emphasis on stimulus perception and primary events in the signal chain leading to modulated gene expression and cellular development.",
            "id": "BIOCHEM/BOTANY/GENETICS 840",
            "title": "REGULATORY MECHANISMS IN PLANT DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Overview of the basic features of chromosome structure and behavior including karyotyping clinical correlates of numerical and structural chromosome aberrations, sex chromosome abnormalities, breakage syndromes and the chromosomal changes associated with the development of cancer.",
            "id": "GENETICS 670",
            "parent": "GENETICS",
            "title": "SEMINAR IN CLINICAL CYTOGENETICS"
        }
    },
    {
        "data": {
            "description": "Participants and outside speakers will discuss current research in computation and informatics in biology and medicine. This seminar is required of all CIBM program trainees.",
            "id": "BIOCHEM/BME/BMI/CBE/COMPSCI/GENETICS 915",
            "title": "COMPUTATION AND INFORMATICS IN BIOLOGY AND MEDICINE"
        }
    },
    {
        "data": {
            "description": "Population genetics, aimed at preparing students to initiate research in this field. Explore how genetic variation is influenced by mutation and recombination, population size changes and migration, and natural selection for or against new mutations.",
            "id": "GENETICS 633",
            "parent": "GENETICS",
            "title": "POPULATION GENETICS"
        }
    },
    {
        "data": {
            "description": "Preparation of a case study or clinical topic of choice by each student to present to a peer professional group of cytology staff and medical faculty. Preparation of a referenced scientific term paper or participation in an approved research or class project pertaining to cliniccal cytology.",
            "id": "GENETICS 673",
            "parent": "GENETICS",
            "title": "SEMINAR IN CLINICAL CYTOLOGY"
        }
    },
    {
        "data": {
            "description": "Preparation of non-gynecologic cytologic specimens using several different instrument methodologies. Application of universal precautions and safety in the handling of unknown biologic hazards. Introduction to histologic preparatory techniques and special staining methods.",
            "id": "GENETICS 471",
            "parent": "GENETICS",
            "title": "ADVANCED LABORATORY PROCEDURES"
        }
    },
    {
        "data": {
            "description": "Principles and application of chemical equilibrium, coordination chemistry, oxidation-reduction and electrochemistry, kinetics, nuclear chemistry, introduction to organic chemistry, and chemistry laboratory skills.",
            "id": "CHEM 104",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Principles of classical and modern genetic analysis taught through readings in the scientific literature and group projects. Capstone course.",
            "id": "GENETICS 566",
            "parent": "GENETICS",
            "title": "ADVANCED GENETICS"
        }
    },
    {
        "data": {
            "description": "Principles of molecular structure and bonding applied to predict and explain the reactivity of alkanes, alkenes, alkynes, alkyl halides, alcohols, and thiols. Emphasis placed on rationalizing the stereochemical and regiochemical outcome of chemical processes.",
            "id": "CHEM 343",
            "parent": "CHEM",
            "title": "ORGANIC CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Principles of molecular structure and bonding applied to predict and explain the reactivity of aromatic systems, benzylic and allylic systems, aryl and vinyl halides, and carbonyl-containing compounds (e.g., ketones, carboxylic acids, esters, acid chlorides, amides). Emphasis placed on rationalizing the stereochemical and regiochemical outcome of chemical processes as well as arguing reaction outcomes from spectroscopic evidence.",
            "id": "CHEM 345",
            "parent": "CHEM",
            "title": "ORGANIC CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Principles, problems, and methods of modern human genetics. Focuses on how researchers discover the genetics of diseases and how those discoveries are used to improve clinical practice. Surveys aspects of (i) the molecular function of the human genome, (ii) the basic principles of human genetics including statistical genetics, quantitative genetics, and genomic variation in human populations, (iii) the genetics of rare disorders and common diseases, and genomic analysis approaches, including genome-wide association studies and sequencing, and (iv) how genetics are used in medicine and discussions covering ethical considerations of human genomic data.",
            "id": "GENETICS/MDGENET 565",
            "title": "HUMAN GENETICS"
        }
    },
    {
        "data": {
            "description": "Profound advances are now possible thanks to genomic data and analysis. Introduces the structure, function, and evolution of genomes. It also outlines the realized and prospective benefits of genomic technology for human health, agriculture, and conservation.",
            "id": "GENETICS 548",
            "parent": "GENETICS",
            "title": "THE GENOMIC REVOLUTION"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Provides an area equivalency for courses taken on Madison Study Abroad Programs that do not equate to existing UW courses.",
            "id": "GENETICS 400",
            "parent": "GENETICS",
            "title": "STUDY ABROAD IN GENETICS"
        }
    },
    {
        "data": {
            "description": "Provides an introduction to public health genomics through a review of fundamental principles of genetics, the use of genetic information in clinical and research settings, and its implications for disease management and prevention, and health promotion.  Explores policies that guide public health and discusses current ethical, legal, and social implications of these policies.",
            "id": "GENETICS/MDGENET/POPHLTH 636",
            "title": "PUBLIC HEALTH GENOMICS"
        }
    },
    {
        "data": {
            "description": "Research work for Honors students under direct guidance of a faculty member in an area encompassing Genetics. Students are responsible for arranging the work and credits with the supervising instructor.",
            "id": "GENETICS 289",
            "parent": "GENETICS",
            "title": "HONORS INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Research work for students under direct guidance of a faculty member in an area encompassing Genetics. Students are responsible for arranging the work and credits with the supervising instructor.",
            "id": "GENETICS 299",
            "parent": "GENETICS",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Review the fundamentals of basic administrative functions and regulatory requirements including planning, organizing, supervising and controlling business management, record keeping, data processing and laboratory safety. Quality assurance procedures necessary for obtaining, processing, diagnosing and reporting cytologic specimens.",
            "id": "GENETICS 672",
            "parent": "GENETICS",
            "title": "SEMINAR IN LABORATORY OPERATIONS AND QUALITY CONTROL"
        }
    },
    {
        "data": {
            "description": "Second of semester of professional level training in genetic mechanisms and analysis as applied to genetic transmission, gene expression, forward and revese genetics, molecular genetics, genonmics, developmental genetics, and epigenetics.",
            "id": "GENETICS 702",
            "parent": "GENETICS",
            "title": "ADVANCED GENETICS II"
        }
    },
    {
        "data": {
            "description": "Special topics of current interest to graduate students.",
            "id": "GENETICS 875",
            "parent": "GENETICS",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "Specialized subject matter of current interest to undergraduate students.",
            "id": "GENETICS 375",
            "parent": "GENETICS",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "Stoichiometry and the mole concept, the behavior of gases, liquids and solids, thermochemistry, electronic structure of atoms and chemical bonding, descriptive chemistry of selected elements and compounds, intermolecular forces, and chemistry laboratory skills.",
            "id": "CHEM 103",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Student-led discussions on scientific, societal, and professional topics relevant to Senior research and selected original research presentations.",
            "id": "GENETICS 567",
            "parent": "GENETICS",
            "title": "COMPANION RESEARCH SEMINAR"
        }
    },
    {
        "data": {
            "description": "Study abroad course that provides an on-site educational experience where we use developmental genetics concepts to guide projects of biobanking and oocyte-mediated cloning, as a potential last-defense resort for the preservation of living species under risk of extinction. It will provide hands-on experience in current research and activities in biodiversity areas, including visits to biodiversity-rich ecosystems, on site seminars and demonstrations, biodiversity preservation activities, as well as exposure to local culture and social needs.",
            "id": "GENETICS 528",
            "parent": "GENETICS",
            "title": "BANKING ANIMAL BIODIVERSITY: INTERNATIONAL FIELD STUDY IN COSTA RICA"
        }
    },
    {
        "data": {
            "description": "The basic principles of genomics, proteomics and bioinformatics will be taught through a semester-long project of the students choosing. Creative problem solving in science skills will be learned through a variety of active-learning techniques that include: reading of primary literature, group presentations, peer review, bioinformatic lab exercises, science communication skills (writing  visualization), and creating a website. Emphasis will be placed upon how to effectively communicate science (written, oral and written). Topics include: genomic sequencing, phylogeny, domain analysis, transcriptomics, CRISPR screens, chemical genomics, quantitative proteomics and protein networks. Capstone course.",
            "id": "GENETICS 564",
            "parent": "GENETICS",
            "title": "GENOMICS AND PROTEOMICS"
        }
    },
    {
        "data": {
            "description": "The genetic basis of nervous system development, structure, function, and dysfunction. Will emphasize both current research findings on the genetic basis of specific neurological disorders, as well as genetic methodologies and experimental approaches used in neurobiological research.",
            "id": "GENETICS 520",
            "parent": "GENETICS",
            "title": "NEUROGENETICS"
        }
    },
    {
        "data": {
            "description": "The science of genetics is at the heart of many issues facing our society, and as such, genetics is often in the news. Explores the underlying genetics and methodologies to gain a deeper understanding of the science behind the headlines so that we can make more informed decisions as citizens, and you can be part of a movement to help educate those around you.",
            "id": "GENETICS 133",
            "parent": "GENETICS",
            "title": "GENETICS IN THE NEWS"
        }
    },
    {
        "data": {
            "description": "The sequencing of genomes has transformed our understanding of the evolution of species and human history, our approaches to improve health and medicine, as well as how we tackle global environmental challenges. Explore the many ways in which the sequencing of genomes is revolutionizing our world, and dive into DNA from viral to human genomes. Understand how genomes are expressed, the impact on phenotype, as well as how it can change over time and in different conditions, are processes that are essential for life and the evolution of species.",
            "id": "GENETICS 234",
            "parent": "GENETICS",
            "title": "GENOMES AND SOCIETY"
        }
    },
    {
        "data": {
            "description": "The two semester sequenceMATH 112-MATH 113covers similar material asMATH 114, but in a slower pace. Not recommended for students with less than an AB inMATH 96.",
            "id": "MATH 114",
            "parent": "MATH",
            "title": "ALGEBRA AND TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "The use of genetics in medicine has experienced significant growth over the past 50 years, identifying risk genes, and devising diagnostic tests and therapies based on this knowledge for specific clinical disorders such as cystic fibrosis, achondroplasia, and Retts syndrome.  MDs and biomedical scientists from UW Hospital and Clinics, the School of Medicine and Public Health, and other UW units will present lectures in this field followed by question-answers sessions. Other class sessions will be devoted to student presentations and open discussion of research literature.",
            "id": "GENETICS 605",
            "parent": "GENETICS",
            "title": "CLINICAL CASES IN MEDICAL GENETICS"
        }
    },
    {
        "data": {
            "description": "This course will provide an introduction to genetic epidemiology. Topics will include a general overview of genetics and Mendelian and complex inheritance, as well as various elements of study design, including participant ascertainment; phenotype definition; biologic sample selection; genotyping, sequencing, and quality control; measurement of covariates, and choice of analytic methods. We will briefly discuss some of the original study designs and then focus on current study designs for the remainder of the class. Additional emerging topics will be briefly touched upon. Students will complete short homework assignments to enforce concepts learned during lectures, discuss journal articles, and prepare a very short grant application for the mid-term project. In the final weeks of class, students will work together to analyze data from a real genetic study, prepare tables, interpret the findings, and present their project to their peers.",
            "id": "ANSCI/GENETICS/POPHLTH 849",
            "title": "GENETIC EPIDEMIOLOGY"
        }
    },
    {
        "data": {
            "description": "Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Part of a 2-semester sequence withMATH 217; these two courses together are equivalent toMATH 114and221.",
            "id": "MATH 171",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY I"
        }
    },
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics and selected topics in Animal Physiology.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Various aspects of genetics: Drosophila, maize, immunogenetics, developmental genetics, or other special topics.",
            "id": "GENETICS 993",
            "parent": "GENETICS",
            "title": "SEMINAR IN GENETICS"
        }
    },
    {
        "data": {
            "description": "With the availability of genome sequences and high-throughput techniques, organismal physiology can now be examined on a global scale by monitoring the behavior of all genes or proteins in a single experiment. This course will present modern techniques in genomics and proteomics, with particular focus on analyzing the data generated by these techniques. Course material will cover genomic sequencing, comparative sequence analysis, phylogeny construction and phylogenomics, transcription factor motif discovery, DNA microarray analysis, techniques in mass spectrometry, proteomic screening methods, and protein-interaction network analysis. In addition to lecture time, the course includes computer lab where students get hands-on experience analyzing genomic and proteomic datasets. Students should have coursework in general statistics and intermediate or advanced genetics.",
            "id": "GENETICS 885",
            "parent": "GENETICS",
            "title": "ADVANCED GENOMIC AND PROTEOMIC ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Written and practical application of the advanced comprehensive body of knowledge to all aspects of preparation, evaluation, correlation and diagnosis of cytologic specimens. Practice in nationally offered cytologic examinations.",
            "id": "GENETICS 578",
            "parent": "GENETICS",
            "title": "APPLIED CYTOLOGY II"
        }
    },
    {
        "data": {
            "description": "Written and practical application of the comprehensive body of knowledge to all aspects of preparation, evaluation, correlation and diagnosis of cytologic speciments.",
            "id": "GENETICS 577",
            "parent": "GENETICS",
            "title": "APPLIED CYTOLOGY I"
        }
    },
    {
        "data": {
            "id": "BIOCHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "BIOCORE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "GENETICS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MICROBIO",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ANTHRO/BOTANY/ZOOLOGY 410",
            "target": "BIOLOGY/GENETICS 522"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 501",
            "target": "BIOCHEM/GENETICS/MICROBIO 612"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 501",
            "target": "GENETICS/HORT 550"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 507",
            "target": "BIOCHEM 508"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 508",
            "target": "BIOCHEM/GENETICS/MDGENET 620"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "ANTHRO/BOTANY/ZOOLOGY 410"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "GENETICS 466"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 101"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "GENETICS 467"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "GENETICS/MDGENET/POPHLTH 636"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 151"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "MICROBIO 303"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "PSYCH/ZOOLOGY 523"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 109"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 341"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 343"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "GENETICS 467"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "MICROBIO 303"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "PSYCH/ZOOLOGY 523"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 115",
            "target": "GENETICS 466"
        }
    },
    {
        "data": {
            "source": "CHEM 341",
            "target": "BIOCHEM 501"
        }
    },
    {
        "data": {
            "source": "CHEM 343",
            "target": "CHEM 345"
        }
    },
    {
        "data": {
            "source": "CHEM 345",
            "target": "BIOCHEM 507"
        }
    },
    {
        "data": {
            "source": "CHEM 345",
            "target": "CHEM 341"
        }
    },
    {
        "data": {
            "source": "GENETICS 133",
            "target": "GENETICS 234"
        }
    },
    {
        "data": {
            "source": "GENETICS 466",
            "target": "BIOCHEM/GENETICS 631"
        }
    },
    {
        "data": {
            "source": "GENETICS 466",
            "target": "ENTOM/GENETICS/ZOOLOGY 624"
        }
    },
    {
        "data": {
            "source": "GENETICS 466",
            "target": "GENETICS 467"
        }
    },
    {
        "data": {
            "source": "GENETICS 466",
            "target": "GENETICS 525"
        }
    },
    {
        "data": {
            "source": "GENETICS 466",
            "target": "GENETICS 527"
        }
    },
    {
        "data": {
            "source": "GENETICS 466",
            "target": "GENETICS 528"
        }
    },
    {
        "data": {
            "source": "GENETICS 466",
            "target": "GENETICS 545"
        }
    },
    {
        "data": {
            "source": "GENETICS 466",
            "target": "GENETICS 564"
        }
    },
    {
        "data": {
            "source": "GENETICS 466",
            "target": "GENETICS 566"
        }
    },
    {
        "data": {
            "source": "GENETICS 466",
            "target": "GENETICS 588"
        }
    },
    {
        "data": {
            "source": "GENETICS 466",
            "target": "GENETICS 605"
        }
    },
    {
        "data": {
            "source": "GENETICS 466",
            "target": "GENETICS/HORT 550"
        }
    },
    {
        "data": {
            "source": "GENETICS 466",
            "target": "GENETICS/MDGENET 662"
        }
    },
    {
        "data": {
            "source": "GENETICS 466",
            "target": "GENETICS/MDGENET 677"
        }
    },
    {
        "data": {
            "source": "GENETICS 467",
            "target": "GENETICS 466"
        }
    },
    {
        "data": {
            "source": "GENETICS 467",
            "target": "GENETICS 468"
        }
    },
    {
        "data": {
            "source": "GENETICS 468",
            "target": "GENETICS 548"
        }
    },
    {
        "data": {
            "source": "GENETICS 468",
            "target": "GENETICS 627"
        }
    },
    {
        "data": {
            "source": "GENETICS 468",
            "target": "GENETICS 633"
        }
    },
    {
        "data": {
            "source": "GENETICS 468",
            "target": "GENETICS/MDGENET 565"
        }
    },
    {
        "data": {
            "source": "GENETICS 701",
            "target": "GENETICS 702"
        }
    },
    {
        "data": {
            "source": "GENETICS 701",
            "target": "GENETICS 808"
        }
    },
    {
        "data": {
            "source": "GENETICS 702",
            "target": "GENETICS 808"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 113"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 113",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 114",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 114"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "CHEM 109"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 114"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "MICROBIO 303",
            "target": "MICROBIO 470"
        }
    },
    {
        "data": {
            "source": "MICROBIO 470",
            "target": "BIOCHEM/GENETICS/MICROBIO 612"
        }
    },
    {
        "data": {
            "source": "PSYCH/ZOOLOGY 523",
            "target": "GENETICS 520"
        }
    }
]