[
    {
        "data": {
            "description": "A series of selected basic issues and topics that are core curricular requirements specific to genetics counseling.",
            "id": "GENECSLR 737",
            "parent": "GENECSLR",
            "title": "CONTEMPORARY PROFESSIONAL ISSUES IN GENETICS COUNSELING"
        }
    },
    {
        "data": {
            "description": "Advanced practicum experience consisting of participatory fieldwork experiences in a diversity of clinic specialties and service delivery methods.",
            "id": "GENECSLR 814",
            "parent": "GENECSLR",
            "title": "ADVANCED PRACTICUM IN GENETICS COUNSELING"
        }
    },
    {
        "data": {
            "description": "Advanced practicum experience for second year genetic counseling students, consisting of participatory fieldwork experiences in a diversity of clinic specialties and service delivery methods.",
            "id": "GENECSLR 813",
            "parent": "GENECSLR",
            "title": "ADVANCED PRACTICUM IN GENETICS COUNSELING"
        }
    },
    {
        "data": {
            "description": "Advanced topics in clinical communication skills for the genetic counselor. Emphasis on different counseling strategies and approaches including counselor self-reference, facilitating family communication, shared decision-making, crisis counseling and, applying techniques from select counseling models to GC practice (e.g., cognitive behavioral therapy, solution-focused therapy).",
            "id": "GENECSLR 743",
            "parent": "GENECSLR",
            "title": "ADVANCED INTERVIEWING AND COUNSELING FOR THE GC I"
        }
    },
    {
        "data": {
            "description": "Advanced topics in the discipline of genetic counseling. Emphasis will be on advanced practice topics including setting boundaries, delivering life altering news, developing a socially responsible practice, moving from a novice to master counselor, and the job search.",
            "id": "GENECSLR 748",
            "parent": "GENECSLR",
            "title": "SPECIAL TOPICS IN GENETIC COUNSELING"
        }
    },
    {
        "data": {
            "description": "An advanced course covering clinical genetic concepts including phenotype, genetic mechanisms, approach to diagnosis (medical, clinical and genetic testing protocols), and natural history (including management approaches).",
            "id": "GENECSLR 731",
            "parent": "GENECSLR",
            "title": "ADVANCED CLINICAL GENETICS CONCEPTS"
        }
    },
    {
        "data": {
            "description": "Comprehensive overview of clinical biochemical genetics through a systematic review of classic and rare inborn errors of metabolism (IEM).  Psychosocial issues are discussed as related to care of patients, and their families, with metabolic disorders.",
            "id": "GENECSLR 744",
            "parent": "GENECSLR",
            "title": "APPLICATIONS OF BIOCHEMICAL GENETICS FOR GENETIC COUNSELORS"
        }
    },
    {
        "data": {
            "description": "Emphasis will be on the tasks necessary to complete a genetic counseling session including, contracting/goal setting, history gathering, education, psychosocial assessment and support, clinical documentation and session management.",
            "id": "GENECSLR 741",
            "parent": "GENECSLR",
            "title": "INTRODUCTION TO GENETIC COUNSELING"
        }
    },
    {
        "data": {
            "description": "Integrative introduction to the mechanisms of clinical genetic disease at the molecular, individual and population level.",
            "id": "GENECSLR 721",
            "parent": "GENECSLR",
            "title": "INTRODUCTION TO CLINICAL GENETICS"
        }
    },
    {
        "data": {
            "description": "Introduction to a variety of tools and resources commonly used in clinical genetics. Learn to critique these resources and start thinking about developing their own research projects. Emphasizes developing oral presentation skills through a variety of student presentations.",
            "id": "GENECSLR 739",
            "parent": "GENECSLR",
            "title": "RESEARCH STRATEGIES AND ANALYSIS IN CLINICAL GENETICS"
        }
    },
    {
        "data": {
            "description": "Introduction to clinical laboratory genetics with a particular focus on the relevance of human cytogenetics and molecular genetics to the practice of medical genetics. Covers the fundamental principles of human cytogenetic and molecular genetics including human chromosome structure, function, cytogenetic and molecular nomenclature, and current clinical laboratory testing methods relevant to medical genetic professionals. Apply cytogenetic and molecular genetic understanding to clinical scenarios to help diagnosis and manage individuals with genetic disease.",
            "id": "GENECSLR 740",
            "parent": "GENECSLR",
            "title": "LABORATORY GENETICS AND GENOMICS  FOR THE GENETIC COUNSELOR"
        }
    },
    {
        "data": {
            "description": "Practice qualitative and quantitative research methods in genetic counseling.  Develop research question, prepare research proposal including internal review board application.",
            "id": "GENECSLR 745",
            "parent": "GENECSLR",
            "title": "SEMINAR IN MEDICAL GENETIC COUNSELING RESEARCH"
        }
    },
    {
        "data": {
            "description": "Provides a background in cancer genetics from a medical, biological, and clinical perspective. Includes: general principles and topics in oncology; familial cancers and cancer syndromes; and management, counseling, social, ethical, and legal issues.",
            "id": "GENECSLR 724",
            "parent": "GENECSLR",
            "title": "CANCER GENETICS RISK ASSESSMENT AND COUNSELING"
        }
    },
    {
        "data": {
            "description": "Provides additional opportunities to develop and improve skills in interviewing, data collection, case management and counseling. Develop skills through didactic work and observational and experiential clinical activities. Activities include clinic observation according to a structured format, and fieldwork participation.",
            "id": "GENECSLR 714",
            "parent": "GENECSLR",
            "title": "INTRODUCTORY PRACTICUM IN GENETIC COUNSELING"
        }
    },
    {
        "data": {
            "description": "Provides opportunities to develop skills in interviewing, data collection, case management and counseling through didactic work and observational and experiential clinical activities. Activities include clinic observation according to a structured format, and fieldwork participation.",
            "id": "GENECSLR 713",
            "parent": "GENECSLR",
            "title": "INTRODUCTORY PRACTICUM IN GENETIC COUNSELING"
        }
    },
    {
        "data": {
            "description": "Research and/or scholarly work (e.g. quality improvement, clinical case reports) supervised by faculty and/or staff member with appropriate content expertise and/or experience in research mentorship.",
            "id": "GENECSLR 990",
            "parent": "GENECSLR",
            "title": "RESEARCH IN GENETIC COUNSELING"
        }
    },
    {
        "data": {
            "description": "Review human development (normal and abnormal) and the influence of genetic disorders and teratogens, common indications for prenatal genetic counseling as well as available prenatal diagnosis and screening techniques. Prepares the genetic counseling student for the prenatal clinical practicum.",
            "id": "GENECSLR 742",
            "parent": "GENECSLR",
            "title": "CLINICAL EMBRYOLOGY AND PRENATAL GENETICS"
        }
    },
    {
        "data": {
            "id": "GENECSLR",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "GENECSLR 713",
            "target": "GENECSLR 714"
        }
    },
    {
        "data": {
            "source": "GENECSLR 714",
            "target": "GENECSLR 813"
        }
    },
    {
        "data": {
            "source": "GENECSLR 721",
            "target": "GENECSLR 724"
        }
    },
    {
        "data": {
            "source": "GENECSLR 721",
            "target": "GENECSLR 731"
        }
    },
    {
        "data": {
            "source": "GENECSLR 721",
            "target": "GENECSLR 740"
        }
    },
    {
        "data": {
            "source": "GENECSLR 721",
            "target": "GENECSLR 742"
        }
    },
    {
        "data": {
            "source": "GENECSLR 739",
            "target": "GENECSLR 745"
        }
    },
    {
        "data": {
            "source": "GENECSLR 739",
            "target": "GENECSLR 990"
        }
    },
    {
        "data": {
            "source": "GENECSLR 741",
            "target": "GENECSLR 743"
        }
    },
    {
        "data": {
            "source": "GENECSLR 743",
            "target": "GENECSLR 748"
        }
    },
    {
        "data": {
            "source": "GENECSLR 745",
            "target": "GENECSLR 990"
        }
    },
    {
        "data": {
            "source": "GENECSLR 813",
            "target": "GENECSLR 814"
        }
    }
]