[
    {
        "data": {
            "description": "Traces the history and evolution of the American cultural landscape from precolonial times to present. Explores how class, ethnic, and racial inequality have shaped the appearance of the American landscape over time, and how that landscape in turn has affected relationships between people and groups through the present day. Examines extraordinary things (civic structures (like our State Capitol), National Parks, War Memorials) and more ordinary kinds of places (mining towns, cotton plantations, sites of recreation and leisure, and suburban tract housing) to stimulate critical thinking about how these places have served people and groups unequally and disproportionately over time and across space. Considers complex meanings of American spaces and places to different people and groups, stimulating empathy and encouraging participation in a multicultural society.",
            "id": "ARTHIST/ENVIRST/GEOG/HISTORY/LANDARC 239",
            "title": "MAKING THE AMERICAN LANDSCAPE"
        }
    },
    {
        "data": {
            "description": "Surveys the concepts, practices, and issues associated with caring for nature in American Indian communities.",
            "id": "AMERIND/ENVIRST/GEOG 345",
            "title": "CARING FOR NATURE IN NATIVE NORTH AMERICA"
        }
    },
    {
        "data": {
            "description": "A broad introduction to cartography emphasizing the theory and practice of map-making. Topics include the basics in mapping (e.g., scale, spatial reference systems, projections), data acquisition, key techniques for thematic mapping, and principles of cartographic abstraction and design.",
            "id": "GEOG 370",
            "parent": "GEOG",
            "title": "INTRODUCTION TO CARTOGRAPHY"
        }
    },
    {
        "data": {
            "description": "Explores the links between nature, power and society in today's world. Considers the complex relationships between humans and the earth's resources, including food, energy, physical materials, water, biota, and landscapes. Examines issues linked to population and scarcity, resource tenure, green consumerism, political economy, environmental ethics, risks and hazards, political ecology, and environmental justice.",
            "id": "ENVIRST/GEOG 337",
            "title": "NATURE, POWER AND SOCIETY"
        }
    },
    {
        "data": {
            "description": "Investigates urbanization as a general process, as well as the resulting contemporary physical, social, cultural and political- economic forms of cities. Emphasis will be placed on the history and current forms of spatial and social segregation of cities by race, class, ethnicity, and gender. The myriad ways that cities have addressed the tensions emerging from this history of spatial and social segregation will be highlighted. Further, emphasis will be placed on understanding the experiences of those most-affected by historical and continuing segregation.",
            "id": "GEOG/URBRPL 305",
            "title": "INTRODUCTION TO THE CITY"
        }
    },
    {
        "data": {
            "description": "Examines the political, socio-cultural, economic and ecological aspects of contemporary development and human-environment relations in mainland Southeast Asia, applying a critical and theoretically informed perspective, and focusing largely on rural issues.",
            "id": "ENVIRST/GEOG 557",
            "title": "DEVELOPMENT AND ENVIRONMENT IN SOUTHEAST ASIA"
        }
    },
    {
        "data": {
            "description": "An introduction to the breadth and practice of Geography. Introduces geographic perspectives, theories, themes, and research design. Covers the history of the discipline, applied quantitative and qualitative methodologies used in geographic research, and a selection of subfields within the discipline.",
            "id": "GEOG 365",
            "parent": "GEOG",
            "title": "GEOGRAPHICAL TRADITIONS AND PRACTICES"
        }
    },
    {
        "data": {
            "description": "As an introduction to Southeast Asia, covers the ethnic, cultural, religious, and political histories of the region from the classical states period to the present, with an emphasis on colonialism, nationalism, decolonization, and the emergence of modern political and social systems into the 21st century, including an exposure to region's contemporary literature. Not open to students who completed LCA 244 prior to Fall 2019.",
            "id": "ASIAN/GEOG/HISTORY/POLISCI/SOC 244",
            "title": "INTRODUCTION TO SOUTHEAST ASIA:  VIETNAM TO THE PHILIPPINES"
        }
    },
    {
        "data": {
            "description": "Orientation to geography as a scholarly discipline; its development, objectives, essential concepts, methods of investigation, institutions, opportunities, problems, and trends.",
            "id": "GEOG 565",
            "parent": "GEOG",
            "title": "COLLOQUIUM FOR UNDERGRADUATE MAJORS"
        }
    },
    {
        "data": {
            "description": "Individual mentored study for seniors completing theses for Honors in the Major as arranged with a faculty member",
            "id": "GEOG 682",
            "parent": "GEOG",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "SOILSCI 301"
        }
    },
    {
        "data": {
            "description": "Principles and algorithms for spatial analysis in geographic imformation systems. A theoretical and practical examination of analytical methods used in GIS, including point, line and polygon processing, interpolation, smoothing, spatial overlay and query, network analysis, terrain analysis, and classification.",
            "id": "GEOG 579",
            "parent": "GEOG",
            "title": "GIS AND SPATIAL ANALYSIS"
        }
    },
    {
        "data": {
            "source": "MATH 113",
            "target": "ENVIRST/F&WECOL/GEOG/GEOSCI/GLE/LANDARC 371"
        }
    },
    {
        "data": {
            "source": "CHEM 115",
            "target": "SOILSCI 301"
        }
    },
    {
        "data": {
            "description": "Soils are fundamental to ecosystem science. A systems approach is used to investigate how soils look and function. Topics investigated include soil structure, biology, water, fertility, and taxonomy as well as the human impact on the soil environment.",
            "id": "ENVIRST/GEOG/SOILSCI 230",
            "title": "SOIL: ECOSYSTEM AND RESOURCE"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "ENVIRST/F&WECOL/GEOG/GEOSCI/GLE/LANDARC 371"
        }
    },
    {
        "data": {
            "id": "ENVIRST",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Should all individuals in society receive a regular transfer of cash from the state without any strings attached? If that question had been posed fifteen years ago, it would likely have been dismissed as unrealistic, undesirable, or just plain crazy. In recent years, however, the idea of introducing a universal basic income [UBI] has gained a lot of traction around the world. Growing inequalities, financial crises, fears about jobs being automated, and the COVID-19 pandemic have all helped to put UBI on the political map. But where did the idea come from? How is it traveling to different parts of the world? And on what grounds do different advocates justify their claims? Address these questions and more by exploring the history, philosophy, and political economy of UBI from a range of perspectives. Ongoing UBI experiments from different parts of the world will also be examined.",
            "id": "GEOG/INTLST 315",
            "title": "UNIVERSAL BASIC INCOME: THE POLITICS BEHIND A GLOBAL MOVEMENT"
        }
    },
    {
        "data": {
            "description": "Principles and application of chemical equilibrium, coordination chemistry, oxidation-reduction and electrochemistry, kinetics, nuclear chemistry, introduction to organic chemistry, and chemistry laboratory skills.",
            "id": "CHEM 104",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Surveys recent and classic works in cartography and geographic information science.",
            "id": "GEOG 970",
            "parent": "GEOG",
            "title": "SEMINAR IN GEOGRAPHIC INFORMATION SCIENCE"
        }
    },
    {
        "data": {
            "source": "ENVIRST/GEOSCI 106",
            "target": "GEOSCI 100"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "GEOSCI 100",
            "target": "GEOG/GEOSCI 326"
        }
    },
    {
        "data": {
            "description": "Comprehensive interdisciplinary survey of Russian civilization from its beginnings through the present day.",
            "id": "GEOG/HISTORY/POLISCI/SLAVIC 253",
            "title": "RUSSIA: AN INTERDISCIPLINARY SURVEY"
        }
    },
    {
        "data": {
            "description": "Introduction to the collection, representation and use of geospatial data.  Introduction to geospatial technologies like GPS, Google Earth, satellite imagery, and GIS, and provides a critical understanding of the strengths and limitations of spatial representations (e.g., maps, images).",
            "id": "GEOG 170",
            "parent": "GEOG",
            "title": "OUR DIGITAL GLOBE: AN OVERVIEW OF GISCIENCE AND ITS TECHNOLOGY"
        }
    },
    {
        "data": {
            "description": "The two semester sequenceMATH 112-MATH 113covers similar material asMATH 114, but in a slower pace. Not recommended for students with less than an AB inMATH 96.",
            "id": "MATH 114",
            "parent": "MATH",
            "title": "ALGEBRA AND TRIGONOMETRY"
        }
    },
    {
        "data": {
            "source": "GEOG 370",
            "target": "GEOG 572"
        }
    },
    {
        "data": {
            "description": "Accelerated coverage of topics in general chemistry, including introduction to laboratory techniques. Topics include atomic and molecular structure, chemical equilibrium, acid-base chemistry, thermodynamics, kinetics, and electrochemistry.",
            "id": "CHEM 109",
            "parent": "CHEM",
            "title": "ADVANCED GENERAL CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Survey of development and change within each of the world's regions (e.g., Africa, Southeast Asia). Attention devoted to environment and society; history, economy, and demographic change; culture and politics; future challenges; key actors.",
            "id": "GEOG 340",
            "parent": "GEOG",
            "title": "WORLD REGIONS IN GLOBAL CONTEXT"
        }
    },
    {
        "data": {
            "source": "COMPSCI 220",
            "target": "GEOG 573"
        }
    },
    {
        "data": {
            "description": "Introduction to scripting for Geographic Information Science. Geoprocessing with open-source GIS utilities. Python scripting with ArcGIS and open-source libraries.",
            "id": "GEOG 378",
            "parent": "GEOG",
            "title": "INTRODUCTION TO GEOCOMPUTING"
        }
    },
    {
        "data": {
            "source": "GEOG 170",
            "target": "GEOG 574"
        }
    },
    {
        "data": {
            "id": "GEOG",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Covers practical and challenging cases in GIS which require programming and other GIS development skills (such as geospatial algorithm development and implementation). Cases cover the wide spectrum of GIS development projects in the GIS professions ranging from GIS data management, advanced spatial analysis, spatial database development and web/mobile programming, to cartography/geovisualization. Focuses on integration of skills from other courses into a GIS development project.",
            "id": "GEOG 777",
            "parent": "GEOG",
            "title": "CAPSTONE IN GIS DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Selected topics in the analysis of spatial distributions with emphasis on multivariate techniques.",
            "id": "GEOG 560",
            "parent": "GEOG",
            "title": "ADVANCED QUANTITATIVE METHODS"
        }
    },
    {
        "data": {
            "description": "Physical and human distributions and interrelationships, with emphasis on the spatial processes and patterns of modernization.",
            "id": "GEOG 355",
            "parent": "GEOG",
            "title": "AFRICA, SOUTH OF THE SAHARA"
        }
    },
    {
        "data": {
            "source": "GEOG 574",
            "target": "GEOG 777"
        }
    },
    {
        "data": {
            "description": "Geographic approaches to culture-nature relationships, including human perception of, use of, and adaptation to the physical environment, with emphasis on traditional subsistence systems; selected topics from contemporary and historical sources.",
            "id": "ENVIRST/GEOG 537",
            "title": "CULTURE AND ENVIRONMENT"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "description": "Explores several key events, sites, thinkers, and texts that contribute to the social, personal, and intellectual landscapes of Queer Geographies. An invitation to survey and reflect on queer critical strategies that sample, record, and remix constellations of relationships between theory, space, sexuality, gender, and identity. It foregrounds modes of queer spacing and placemaking in academic and popular works devoted to queer lives, studies, sexualities, narratives, publics and privates, joys and griefs, art, theory, and beyond. Offers a range of strategies for reading, interpreting, and developing nuanced scholarly interventions and theories. Question and reimagine normative notions of the personal, the social, and the socio-spatial.",
            "id": "GEOG 513",
            "parent": "GEOG",
            "title": "QUEER GEOGRAPHIES"
        }
    },
    {
        "data": {
            "description": "Surveys recent and classic works in physical geography.",
            "id": "GEOG 920",
            "parent": "GEOG",
            "title": "SEMINAR IN PHYSICAL GEOGRAPHY"
        }
    },
    {
        "data": {
            "description": "An introduction to natural environmental systems, emphasizing the interconnections between the systems of the solid earth (minerals, rocks, soils), the hydrosphere (water in all its forms), the biosphere, and the atmosphere. Emphasizes connections between basic concepts and specific environmental issues through hands-on case studies, lab projects, and field trips to collect samples and observations for lab projects.",
            "id": "ENVIRST/GEOG 127",
            "title": "PHYSICAL SYSTEMS OF THE ENVIRONMENT"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 113"
        }
    },
    {
        "data": {
            "description": "Principles and analysis of geomorphic processes and resulting land forms.",
            "id": "GEOG/GEOSCI 320",
            "title": "GEOMORPHOLOGY"
        }
    },
    {
        "data": {
            "id": "SOILSCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Latin American culture and society from an interdisciplinary perspective; historical developments from pre-Columbian times to the present; political movements; economic problems; social change; ecology in tropical Latin America; legal systems; literature and the arts; cultural contrasts involving the US and Latin America; land reform; labor movements; capitalism, socialism, imperialism; mass media.",
            "id": "AFROAMER/ANTHRO/C&ESOC/GEOG/HISTORY/LACIS/POLISCI/SOC/SPANISH 260",
            "title": "LATIN AMERICA: AN INTRODUCTION"
        }
    },
    {
        "data": {
            "description": "An opportunity to re-imagine human geography. The history of geography is particularly violent and exclusive. It is well known that systems of colonialist exploitation, theft, kidnapping, and murder were facilitated in part by the work of modern cartographers and \"explorers.\" The discipline that we have today is a product of these earlier colonial epistemologies and ideologies. The science that emerged from these fields - geography - institutionalizes and reproduces many the ideas and viewpoints of their modern practitioners. Creates a space to re-imagine and re-invent what the field of human geography might be. Interrogates the colonial history of geography as a social science and practice. Explores several ways of thinking about space and social life that might not fit cleanly into the discipline at large.",
            "id": "GEOG 300",
            "parent": "GEOG",
            "title": "WEIRD GEOGRAPHIES"
        }
    },
    {
        "data": {
            "description": "Covers the graphs, properties and geometric significance of trigonometric functions of a real variable. Other topics include trigonometric equations and identities, application, trigonometric form of complex numbers, DeMoivre's theorem, and polar and parametric equations. The course also has a significant number of applications, especially related to other disciplines.",
            "id": "MATH 113",
            "parent": "MATH",
            "title": "TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "Individual course of study for those completing an internship.",
            "id": "GEOG 602",
            "parent": "GEOG",
            "title": "INTERNSHIP"
        }
    },
    {
        "data": {
            "source": "ENVIRST/GEOG 120",
            "target": "GEOG/SOILSCI 526"
        }
    },
    {
        "data": {
            "source": "ENVIRST/GEOG 127",
            "target": "ENVIRST/GEOG 120"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Explores the relationship between humans and wildlife amid diverse landscapes, both historic and contemporary, tropical and temperate. Investigates how humans shape wild animal populations by modifying physical environments, and by hunting, domesticating and introducing species.",
            "id": "C&ESOC/ENVIRST/GEOG 434",
            "title": "PEOPLE, WILDLIFE AND LANDSCAPES"
        }
    },
    {
        "data": {
            "description": "Introduction to Data Science programming using Python.  No previous programming experience required.  Emphasis on analyzing real datasets in a variety of forms and visual communication.",
            "id": "COMPSCI 220",
            "parent": "COMPSCI",
            "title": "DATA SCIENCE PROGRAMMING I"
        }
    },
    {
        "data": {
            "source": "GEOG 579",
            "target": "GEOG 777"
        }
    },
    {
        "data": {
            "description": "Introduction to how the Earth system works and what makes Earth livable. Gain appreciation for how the atmosphere, oceans, life, and earth's surface interact to shape our local, regional and global landscapes.",
            "id": "ENVIRST/GEOG 120",
            "title": "INTRODUCTION TO THE EARTH SYSTEM"
        }
    },
    {
        "data": {
            "source": "ENVIRST/GEOG 120",
            "target": "ENVIRST/GEOG 127"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Introduction to how and why humans have transformed natural landscapes around the world, including tropical deforestation. Exploration of different agricultural systems, and topics such as food security, land scarcity, bioenergy and the impacts of food production on the environment.",
            "id": "ENVIRST/GEOG 309",
            "title": "PEOPLE, LAND AND FOOD: COMPARATIVE STUDY OF AGRICULTURE SYSTEMS"
        }
    },
    {
        "data": {
            "source": "CHEM 115",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "description": "Surveys recent and classic works in political geography.",
            "id": "GEOG 918",
            "parent": "GEOG",
            "title": "SEMINAR IN POLITICAL GEOGRAPHY"
        }
    },
    {
        "data": {
            "description": "Explores a detailed atomic and molecular view of matter and its interactions, with a specific focus on quantum theory, molecular structure, and chemical bonding. Application required for enrollment.",
            "id": "CHEM 115",
            "parent": "CHEM",
            "title": "CHEMICAL PRINCIPLES I"
        }
    },
    {
        "data": {
            "description": "Explores planning-related Geographic Information System (GIS) data, applications, analytical tools, and implementation issues.",
            "id": "ENVIRST/GEOG/LANDARC/URBRPL 532",
            "title": "APPLICATIONS OF GEOGRAPHIC INFORMATION SYSTEMS IN PLANNING"
        }
    },
    {
        "data": {
            "description": "Surveys recent and classic works in people-environment geography.",
            "id": "GEOG 930",
            "parent": "GEOG",
            "title": "SEMINAR IN PEOPLE-ENVIRONMENT GEOGRAPHY"
        }
    },
    {
        "data": {
            "source": "CIVENGR/ENVIRST/GEOG 377",
            "target": "GEOG 574"
        }
    },
    {
        "data": {
            "description": "Historical geography of urban development in Europe from classical times to the post-Word War II era, with emphasis on changes in built environment, public space and infrastructure, land use, and urban systems.",
            "id": "GEOG/URBRPL 506",
            "title": "HISTORICAL GEOGRAPHY OF EUROPEAN URBANIZATION"
        }
    },
    {
        "data": {
            "source": "GEOG 104",
            "target": "GEOG 101"
        }
    },
    {
        "data": {
            "description": "Introduction to the contemporary study of geopolitics, featuring the main concepts and research themes encountered in this field.  Examine the formation of geopolitical images of the world, where these images come from, and how they have shaped our thinking and politics over time.",
            "id": "GEOG 318",
            "parent": "GEOG",
            "title": "INTRODUCTION TO GEOPOLITICS"
        }
    },
    {
        "data": {
            "description": "Application and use of GIS techniques in physical and human geography. Includes an introduction to a generic framework of GIS applications, case studies, and student projects. Cases range from urban and regional geography, to marketing geography, and to physical and environmental geography.",
            "id": "GEOG 578",
            "parent": "GEOG",
            "title": "GIS APPLICATIONS"
        }
    },
    {
        "data": {
            "description": "Explores how physical and biological factors affect the distribution of terrestrial biomes, ecosystem types, and biodiversity, as well as the role of disturbance and recent human activities on differences in past and modern day species distributions.",
            "id": "BOTANY/GEOG 338",
            "title": "ENVIRONMENTAL BIOGEOGRAPHY"
        }
    },
    {
        "data": {
            "description": "Soccer (or football) is played in almost every part of the world. Soccer will be used as a lens through which to think critically about a range of issues within our own societies and around the world. This includes examining the relationship between European imperialism and the globalization of soccer in the early 20th century; thinking about who gets to play (and who gets paid) across different contexts; and analyzing how soccer is both globally networked and intensely local in its passions and rivalries. Draws from a range of perspectives on soccer, from those who consider it to be an opium for the masses to those who see it as a vehicle for positive social change, in order to illuminate some of the big questions facing the world today.",
            "id": "GEOG/INTLST 311",
            "title": "THE GLOBAL GAME: SOCCER, POLITICS, AND IDENTITY"
        }
    },
    {
        "data": {
            "description": "Independent study as arranged with a faculty member.",
            "id": "GEOG 698",
            "parent": "GEOG",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "An examination of Latinx women's lives, experiences, and activism through the lens of testimonio, life histories, and feminist writings rooted in social justice movements and critical pedagogies.",
            "id": "CHICLA/GEN&WS/GEOG 308",
            "title": "LATINX FEMINISMS: WOMEN'S LIVES, WORK, AND ACTIVISM"
        }
    },
    {
        "data": {
            "description": "Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Part of a 2-semester sequence withMATH 217; these two courses together are equivalent toMATH 114and221.",
            "id": "MATH 171",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY I"
        }
    },
    {
        "data": {
            "description": "An introduction to foundational approaches to feminist qualitative research in human geography. Research is not separate from a social world that historically has been and continues to be shaped by (settler) colonial, racialized, gendered, sexualized, and class-inflected relations of power (among others). Research practices and \"findings\" have been and continue to be used to inform and rationalize relations of oppression, exploitation, and violence. For feminist researchers, then, questions of power, difference, and social change are central to how we design and conduct research. Engages in political-ethical discussions about the positionality and responsibilities of ourselves as researchers, and how our knowledge production can reproduce and challenge prevailing relations of power.",
            "id": "GEN&WS/GEOG 514",
            "title": "FEMINIST GEOGRAPHY: METHODOLOGICAL APPROACHES"
        }
    },
    {
        "data": {
            "description": "An analysis of the development and significance of basic geographic concepts and theories. Major emphasis on concepts of place, spatial relations, landscape, and human-environment relations.",
            "id": "GEOG 566",
            "parent": "GEOG",
            "title": "HISTORY OF GEOGRAPHIC THOUGHT"
        }
    },
    {
        "data": {
            "source": "GEOG 378",
            "target": "GEOG 573"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 114"
        }
    },
    {
        "data": {
            "description": "Introduction to state-of-the-art technologies that capture properties of the landscape, which is critical to better characterize and understand environmental properties and change. Develop skills in geospatial systems applicable to a variety of research and industry fields. Includes an overview of unmanned aerial systems (drones), light detection and ranging (LiDAR), high-grade Differential GPS (DGPS), Global Navigation Satellite Systems (GNSS), virtual reality, optical sensors, geocaching, and geotagging.",
            "id": "GEOG 379",
            "parent": "GEOG",
            "title": "GEOSPATIAL TECHNOLOGIES: DRONES, SENSORS, AND APPLICATIONS"
        }
    },
    {
        "data": {
            "source": "CIVENGR/ENVIRST/GEOG 377",
            "target": "GEOG 578"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "SOILSCI 301"
        }
    },
    {
        "data": {
            "source": "CIVENGR/ENVIRST/GEOG 377",
            "target": "GEOG 576"
        }
    },
    {
        "data": {
            "description": "An introduction to many key movements and thinkers within Critical Social Theory. Explores the changing histories and presents of the field through a range of primary works from philosophy, critical theory, and geography - paying particular attention to the points where social theory intersects with problems of space and place. Covers classic problems in social theory ranging from theories of the political-economic constitution of the social (Marxism) and its extensions into the culture (the Frankfurt School) to a range of mid- to late-twentieth-century epistemological interventions framed around questions of difference and identity. Recent contestations and reformulations that have surfaced across ontological, decolonial, non-human, algorithmic, and other reimaginings and extensions of the social are examined.",
            "id": "GEOG 511",
            "parent": "GEOG",
            "title": "CRITICAL SOCIAL THEORY"
        }
    },
    {
        "data": {
            "source": "GEOG 576",
            "target": "GEOG 777"
        }
    },
    {
        "data": {
            "description": "Geospatial big data is an extension of big data with an emphasis on the geospatial component. It is used to describe large volumes of georeferenced data about various aspects of the environment and society captured by millions of environmental and human sensors. An introduction to the theory, techniques, and analytical methods for geospatial big data. Methods for storing, processing, analyzing, and visualizing various types of geospatial big data using advanced Python programming will be introduced. Designed for students who have programming experience and want to reinforce their programming skills and learn AI and machine learning methods for solving geospatial big data problems.",
            "id": "GEOG 573",
            "parent": "GEOG",
            "title": "ADVANCED GEOCOMPUTING AND GEOSPATIAL BIG DATA ANALYTICS"
        }
    },
    {
        "data": {
            "description": "Principles, characteristics and work of glaciers; events of the Pleistocene. Field trip.",
            "id": "GEOG/GEOSCI 420",
            "title": "GLACIAL AND PLEISTOCENE GEOLOGY"
        }
    },
    {
        "data": {
            "description": "Offers a fundamental understanding of how and why global warming is happening and what to expect in the future. Investigate and discuss the evidence for change, the science that explains these observations, predicted impacts on humans and ecosystems, and the societal debate over  proposed solutions.",
            "id": "ATMOCN/ENVIRST/GEOG 332",
            "title": "GLOBAL WARMING: SCIENCE AND IMPACTS"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "description": "Covers the programming concepts and skills for understanding construction and implementation of high quality spatial web portal and mobile Apps to support geospatial data access, analysis, sharing, and synthesis over the internet. Builds on basic programming experience.",
            "id": "GEOG 576",
            "parent": "GEOG",
            "title": "GEOSPATIAL WEB AND MOBILE PROGRAMMING"
        }
    },
    {
        "data": {
            "source": "ENVIRST/GEOG 339",
            "target": "ENVIRST/GEOG 537"
        }
    },
    {
        "data": {
            "description": "Introduces new graduate students to the diversity of ecologists across the UW-Madison campus. Includes discussions of key topics in professional development, research presentations by faculty members, and discussions of assigned papers with senior graduate students.",
            "id": "AGRONOMY/ATMOCN/BOTANY/ENTOM/ENVIRST/F&WECOL/GEOG/ZOOLOGY 953",
            "title": "INTRODUCTION TO ECOLOGY RESEARCH AT UW-MADISON"
        }
    },
    {
        "data": {
            "source": "GEOG 170",
            "target": "GEOG 576"
        }
    },
    {
        "data": {
            "source": "CIVENGR/ENVIRST/GEOG 377",
            "target": "ENVIRST/GEOG/LANDARC/URBRPL 532"
        }
    },
    {
        "data": {
            "source": "ENVIRST/GEOG 337",
            "target": "ENVIRST/GEOG 537"
        }
    },
    {
        "data": {
            "description": "Theoretical aspects of spatial economic distributions and locational analysis.",
            "id": "GEOG 510",
            "parent": "GEOG",
            "title": "ECONOMIC GEOGRAPHY"
        }
    },
    {
        "data": {
            "description": "African society and culture, polity and economy in multidisciplinary perspectives from prehistory and ancient kingdoms through the colonial period to contemporary developments, including modern nationalism, economic development and changing social structure.",
            "id": "AFRICAN/AFROAMER/ANTHRO/GEOG/HISTORY/POLISCI/SOC 277",
            "title": "AFRICA: AN INTRODUCTORY SURVEY"
        }
    },
    {
        "data": {
            "source": "ENVIRST/GEOSCI 106",
            "target": "GEOG/GEOSCI 320"
        }
    },
    {
        "data": {
            "description": "Study under direct guidance of a faculty member. Appropriate for initial exploration of an area of scholarship in Geography through laboratory, field, or literary study.",
            "id": "GEOG 399",
            "parent": "GEOG",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Engaging in geographic research: analysis of successful proposals and published papers and books; different approaches to geographic research; writing of proposals for students' own research.",
            "id": "GEOG 766",
            "parent": "GEOG",
            "title": "GEOGRAPHICAL INQUIRY AND ANALYSIS: TECHNIQUES"
        }
    },
    {
        "data": {
            "source": "GEOSCI 100",
            "target": "GEOG/GEOSCI 420"
        }
    },
    {
        "data": {
            "description": "Explores, and applies, qualitative methods in the field of urban geography. An introduction to debates around the analysis and interpretation of qualitative data is provided, grounded in concrete urban research. Participation in a three-day field course is required.",
            "id": "GEOG/URBRPL 503",
            "title": "RESEARCHING THE CITY: QUALITATIVE STRATEGIES"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "description": "Environmental change in the landscapes of the American West, in the recent past, present, and future, from the physical science background to human-environment interactions.",
            "id": "GEOG 344",
            "parent": "GEOG",
            "title": "CHANGING LANDSCAPES OF THE AMERICAN WEST"
        }
    },
    {
        "data": {
            "description": "Develop the ability to conceive and manage a real-world GIS development project, and to design a plan for solving the project.",
            "id": "GEOG 778",
            "parent": "GEOG",
            "title": "PRACTICUM IN GIS DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Surveys recent and classic works in cultural and human geography.",
            "id": "GEOG 901",
            "parent": "GEOG",
            "title": "SEMINAR IN CULTURAL GEOGRAPHY"
        }
    },
    {
        "data": {
            "source": "GEOG 378",
            "target": "GEOG 575"
        }
    },
    {
        "data": {
            "description": "Examines emerging topics related to the design of user interfaces for manipulating maps, focusing on new cartographic challenges in Interactive Cartography, Geographic Visualization, and Geovisual Analytics and drawing upon relevant insight in Human-Computer Interaction, Information Visualization, and Usability Engineering.",
            "id": "GEOG 575",
            "parent": "GEOG",
            "title": "INTERACTIVE CARTOGRAPHY & GEOVISUALIZATION"
        }
    },
    {
        "data": {
            "description": "Explore the concepts of space and place from the perspective of learning and everyday experience. Examines how space and place emerge out of fundamental human needs, experiences, and ways of thinking.",
            "id": "GEOG 501",
            "parent": "GEOG",
            "title": "SPACE AND PLACE: A GEOGRAPHY OF EXPERIENCE"
        }
    },
    {
        "data": {
            "description": "Explores different social science approaches to interpreting the relationship between environment and society at various scales, from the local to the global. Traces the social origins of environmental concerns, their social impacts, and the different responses they engender.",
            "id": "ENVIRST 112",
            "parent": "ENVIRST",
            "title": "ENVIRONMENTAL STUDIES: SOCIAL SCIENCE PERSPECTIVES"
        }
    },
    {
        "data": {
            "source": "SOILSCI 301",
            "target": "ENVIRST/GEOG/SOILSCI 230"
        }
    },
    {
        "data": {
            "description": "Stoichiometry and the mole concept, the behavior of gases, liquids and solids, thermochemistry, electronic structure of atoms and chemical bonding, descriptive chemistry of selected elements and compounds, intermolecular forces, and chemistry laboratory skills.",
            "id": "CHEM 103",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY I"
        }
    },
    {
        "data": {
            "source": "GEOG 101",
            "target": "GEOG 104"
        }
    },
    {
        "data": {
            "source": "MATH 114",
            "target": "ENVIRST/F&WECOL/GEOG/GEOSCI/GLE/LANDARC 371"
        }
    },
    {
        "data": {
            "description": "Geographic perspectives and analyses: history of the discipline, issues and research frontiers, interests and perspectives of Madison faculty, structure of graduate study in the department, research facilities and opportunities.",
            "id": "GEOG 765",
            "parent": "GEOG",
            "title": "GEOGRAPHICAL INQUIRY AND ANALYSIS: AN INTRODUCTION"
        }
    },
    {
        "data": {
            "description": "Over half of the world's population now lives in urban areas, with an expected increase of 2.5 billion people in the next 30 years. As urbanization (broadly defined as the conversion of previously undeveloped lands into urbanized uses) continues and intensifies, we are faced with a number of environmental issues, for instance, fragmentation and destruction of habitats, and decreased air and water quality.  Explore how urbanization impacts ecological processes and resulting environmental outcomes, strategies for \"designing with nature,\" and behavioral, planning, and policy responses to urban environmental problems.",
            "id": "ENVIRST/GEOG 333",
            "title": "GREEN URBANISM"
        }
    },
    {
        "data": {
            "description": "Covers real-world questions of how the environment is managed and governed through state policy, economics, and social institutions. Includes strategies within and outside of the formal institutions of government, and extends the discussion to the commodification of nature and the use of science to understand and govern the environment. Also includes case studies of environmental governance in water, carbon, species, and urban sustainability.",
            "id": "ENVIRST/GEOG 534",
            "title": "ENVIRONMENTAL GOVERNANCE: MARKETS, STATES AND NATURE"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Interdisciplinary inquiry in African societies and cultures.",
            "id": "AFRICAN/ANTHRO/ECON/GEOG/HISTORY/POLISCI 983",
            "title": "INTERDEPARTMENTAL SEMINAR IN AFRICAN STUDIES TOPICS"
        }
    },
    {
        "data": {
            "description": "Human geographers explore socio-spacial relations, processes and representations of the world in which we live. Engages economic, political, urban, socio-cultural and environmental geographic perspectives to investigate patterns and processes that have come to be associated with 'globalization'.",
            "id": "GEOG 104",
            "parent": "GEOG",
            "title": "INTRODUCTION TO HUMAN GEOGRAPHY"
        }
    },
    {
        "data": {
            "description": "Examines major environmental conservation approaches in the U.S. and developing countries and how they are influenced by sociopolitical factors, cultural values and scientific understandings of nature. Historical and contemporary cases are explored with emphasis on biodiversity and climate change issues.",
            "id": "ENVIRST/GEOG 339",
            "title": "ENVIRONMENTAL CONSERVATION"
        }
    },
    {
        "data": {
            "description": "Emphasis on natural and human processes that control the morphology of the land and its waterways.",
            "id": "GEOG/GEOSCI 326",
            "title": "LANDFORMS-TOPICS AND REGIONS"
        }
    },
    {
        "data": {
            "description": "Physical chemical and biological properties of soils as they affect soil-plant-water relations, soil classification and suitability for agricultural and other uses.",
            "id": "SOILSCI 301",
            "parent": "SOILSCI",
            "title": "GENERAL SOIL SCIENCE"
        }
    },
    {
        "data": {
            "id": "GEOSCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Surveys recent and classic works on American environmental history to introduce students to the methods and historiography of the field.",
            "id": "GEOG/HISTORY 932",
            "title": "SEMINAR IN AMERICAN ENVIRONMENTAL HISTORY"
        }
    },
    {
        "data": {
            "description": "Classic location theory with modern extensions. Examination of theoretical statements and selected empirical examples. Principles of economic regionalization and network analysis with emphasis on spatial implications of the economic development process.",
            "id": "GEOG 302",
            "parent": "GEOG",
            "title": "ECONOMIC GEOGRAPHY: LOCATIONAL BEHAVIOR"
        }
    },
    {
        "data": {
            "description": "Critical Indigenous Ecological Knowledges are a set of diverse understandings, responsibilities, and laws held by distinct groups of Indigenous peoples that are enacted in multiple ways across socio-political and geographical contexts. These knowledges intersect with Indigenous political sovereignties and longstanding, complex, and nuanced relationships to the more-than-human world. Learn multiple entry points to exploring and examining these knowledge sets in the context of what's for now called the U.S. and Canada to think critically about the politics of Nature, environmentalism, race, indigeneity, and colonialism both historically and in the contemporary moment. Reflect upon how critical Indigenous knowledges about ecology, environment, and government have been erased, co-opted, criminalized, and also continually practiced, reimagined, and revitalized in multiple spheres through a range of interdisciplinary, critical, and cutting-edge Native scholarships and writings.",
            "id": "AMERIND/GEOG 410",
            "title": "CRITICAL INDIGENOUS ECOLOGICAL KNOWLEDGES"
        }
    },
    {
        "data": {
            "description": "Application of geology to problems resulting from the ever more intense use of the earth and its resources.",
            "id": "ENVIRST/GEOSCI 106",
            "title": "ENVIRONMENTAL GEOLOGY"
        }
    },
    {
        "data": {
            "description": "Takes an earth systems approach to explore the role of human societies in shaping earth surface processes from local to global scales. We address how alterations to our landscapes and waterways affect biological, physical and chemical interactions among our biosphere, geosphere, hydrosphere and atmosphere. We discuss methods used to distinguish the \"human impact\" from background variability.",
            "id": "GEOG/SOILSCI 526",
            "title": "HUMAN TRANSFORMATIONS OF EARTH SURFACE PROCESSES"
        }
    },
    {
        "data": {
            "source": "CIVENGR/ENVIRST/GEOG 377",
            "target": "GEOG 579"
        }
    },
    {
        "data": {
            "description": "Interdisciplinary inquiry in Latin American society and culture.",
            "id": "AAE/ANTHRO/C&ESOC/GEOG/HISTORY/LACIS/POLISCI/PORTUG/SOC/SPANISH 982",
            "title": "INTERDEPARTMENTAL SEMINAR IN THE LATIN-AMERICAN AREA"
        }
    },
    {
        "data": {
            "source": "GEOG 576",
            "target": "GEOG 778"
        }
    },
    {
        "data": {
            "description": "Individual mentored study for seniors completing theses for Honors in the Major as arranged with a faculty member",
            "id": "GEOG 681",
            "parent": "GEOG",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Explores waste as discarded material, a polluting and threatening substance that must be managed, and as a political object. Waste's distribution across space and among groups of people, as well as the reasons for the effects of that distribution, will be examined using geographic perspectives. Who has the ability to avoid or remove themselves from waste? Who must live and work with it? The concept of infrastructure as a set of material things (roads, trucks, boats); laws and regulations; labor relations; and economies of disposal and consumption determining waste flows unites disparate topics and case studies across the semester. Concepts of and social movements for environmental justice are recurring themes.",
            "id": "GEOG 507",
            "parent": "GEOG",
            "title": "WASTE GEOGRAPHIES: POLITICS, PEOPLE, AND INFRASTRUCTURES"
        }
    },
    {
        "data": {
            "id": "COMPSCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "CIVENGR/ENVIRST/GEOG 377",
            "target": "GEOG 378"
        }
    },
    {
        "data": {
            "source": "GEOG 579",
            "target": "GEOG 778"
        }
    },
    {
        "data": {
            "description": "An introduction to the spatial dimensions of social movements, social struggles, and radical social change. Provides a range of critical and theoretical perspectives for reading and interpreting space as a tool of social transformation. Explores a variety of historical examples from the nineteenth century to the present.",
            "id": "GEOG 301",
            "parent": "GEOG",
            "title": "REVOLUTIONS AND SOCIAL CHANGE"
        }
    },
    {
        "data": {
            "description": "Explores emerging topics in physical geography.",
            "id": "GEOG 676",
            "parent": "GEOG",
            "title": "SPECIAL TOPICS IN GEOGRAPHY"
        }
    },
    {
        "data": {
            "description": "Provides an opening to some of the key debates and practices in feminist (political) geography. Feminist geography focuses on questions of power, difference, embodiment, and social change. How are feminist geographies in conversation with or part of other fields of inquiry, such as critical ethnic studies and Indigenous studies, which also focus on questions of difference, epistemologies of knowledge, and social transformation and/or decolonization? That is, what are the relationships of feminist geographic inquiry to liberatory projects of ending racism, capitalism, settler colonialism, and heteropatriarchy. Explore how feminist theories and approaches in geography transformed prevailing political geographic questions and concerns, such as power, politics, territory, boundaries, sovereignty, and violence. What do feminist principles and debates over feminist politics and methods bring to (political) geography?",
            "id": "GEN&WS/GEOG 504",
            "title": "FEMINIST GEOGRAPHY: THEORETICAL APPROACHES"
        }
    },
    {
        "data": {
            "source": "ENVIRST 112",
            "target": "ENVIRST/GEOG 337"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 109"
        }
    },
    {
        "data": {
            "source": "ENVIRST/GEOSCI 106",
            "target": "GEOG/GEOSCI 420"
        }
    },
    {
        "data": {
            "description": "Study of the map as a graphic communication, the technical and perceptual aspects of its organization, symbolic coding, color and lettering.",
            "id": "GEOG 572",
            "parent": "GEOG",
            "title": "GRAPHIC DESIGN IN CARTOGRAPHY"
        }
    },
    {
        "data": {
            "description": "Comprehensive interdisciplinary survey of East European culture, society, politics, and literature from its beginnings to the present day.",
            "id": "GEOG/HISTORY/POLISCI/SLAVIC 254",
            "title": "EASTERN EUROPE: AN INTERDISCIPLINARY SURVEY"
        }
    },
    {
        "data": {
            "description": "Introduction to the Earth as viewed from above, focusing on use of aerial photography and satellite imagery to study the environment. Includes physical processes of electromagnetic radiation, data types and sensing capabilities, methods for interpretation, analysis and mapping, and applications.",
            "id": "ENVIRST/F&WECOL/GEOG/GEOSCI/GLE/LANDARC 371",
            "title": "INTRODUCTION TO ENVIRONMENTAL REMOTE SENSING"
        }
    },
    {
        "data": {
            "description": "Surveys qualitative research and methods in geography, including the human subjects review process, research ethics, preparing for fieldwork, participant observation, interviewing, focus groups, filmic experiences, archival research, participatory action research, analyzing field materials and writing styles in qualitative research.",
            "id": "GEOG 500",
            "parent": "GEOG",
            "title": "QUALITATIVE STRATEGIES IN GEOGRAPHY"
        }
    },
    {
        "data": {
            "source": "GEOG 574",
            "target": "GEOG 778"
        }
    },
    {
        "data": {
            "description": "Independent study as arranged with a faculty member.",
            "id": "GEOG 699",
            "parent": "GEOG",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Geographic and temporal responses of plant species and terrestrial ecosystems to the major environmental changes of the last 1,000,000 to 1,000 years, particularly glacial-interglacial changes in climate, carbon dioxide, and the end-Pleistocene extinctions of large animals. Key concepts include novel and no-analog ecosystems, abrupt climate and ecological change, and megaherbivore-vegetation interactions. This time period is of direct interest to global change ecologists and biogeographers studying species responses to 21st-century climate change. Hands-on practice emphasizes multivariate data analysis and quantitative paleoecological inference.",
            "id": "GEOG 523",
            "parent": "GEOG",
            "title": "ADVANCED PALEOECOLOGY: SPECIES RESPONSES TO PAST ENVIRONMENTAL CHANGE"
        }
    },
    {
        "data": {
            "description": "Topics in earth system science. Emphasis on the coupling between atmospheric, oceanic and land surface systems, involving physical geochemical and biological processes, and including interactions with human systems.",
            "id": "ATMOCN/BOTANY/ENVIRST/F&WECOL/GEOG/GEOSCI/ZOOLOGY 980",
            "title": "EARTH SYSTEM SCIENCE SEMINAR"
        }
    },
    {
        "data": {
            "source": "GEOG/GEOSCI 320",
            "target": "GEOG/GEOSCI 326"
        }
    },
    {
        "data": {
            "description": "Covers a broad cross-section of American environmental policy by focusing on specific statutes and policy arenas. Surveys the basic elements of American environmental policy and regulation with a particular focus on the specific people, sites and scales at which environmental decision-making happens through primary-source case material. Maintains a dual focus on (a) the legal and regulatory aspects of environmental regulation and (b) the specific geographic and social features of actual cases in which regulations and policy are used. Understanding environmental outcomes in a complex society depends on observing both the structure of regulations and the geographic and social context in which such regulations emerge.",
            "id": "ENVIRST/GEOG 439",
            "title": "US ENVIRONMENTAL POLICY AND REGULATION"
        }
    },
    {
        "data": {
            "description": "Explores the global and local nature of environmental problems, including issues of climate change, food, energy, globalization, deforestation, biodiversity loss, resource access, environmental justice, and population. Considers how we should analyze and act on environmental problems as we confront the apparently daunting scale of such issues. What appear to be single global environmental issues are actually composed of many smaller, context-specific, and place-dependent problems or conflicts. Through an interdisciplinary and geographic perspective, these issues can be understood and addressed at the scale of our lived lives.",
            "id": "ENVIRST/GEOG 139",
            "title": "GLOBAL ENVIRONMENTAL ISSUES"
        }
    },
    {
        "data": {
            "source": "GEOG 378",
            "target": "GEOG 576"
        }
    },
    {
        "data": {
            "description": "Geologic processes; structure and history of the earth; earthquakes, volcanos, glaciers, groundwater, minerals, rocks, deserts, fossils; topographic and geologic maps; climate change on geologic and human time scales.",
            "id": "GEOSCI 100",
            "parent": "GEOSCI",
            "title": "INTRODUCTORY GEOLOGY: HOW THE EARTH WORKS"
        }
    },
    {
        "data": {
            "description": "Design, implementation and use of automated procedures for storage, analysis and display of spatial information. Covers data bases, information manipulation and display techniques, software systems and management issues. Case studies.",
            "id": "CIVENGR/ENVIRST/GEOG 377",
            "title": "AN INTRODUCTION TO GEOGRAPHIC INFORMATION SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Introduces the basic concepts, techniques and methodologies for designing and implementing a spatial database to prepare for professional work as a GIS designer, analyst, specialist or researcher. Design conceptual spatial database models and  implement them within specific spatial data management systems (DBMS). Covers basic SQL database language and the latest developments in database systems (e.g. NoSQL database) for managing and mining spatial big data such as social media datasets and GPS trajectories.",
            "id": "GEOG 574",
            "parent": "GEOG",
            "title": "GEOSPATIAL DATABASE DESIGN AND DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Individual mentored study for seniors completing theses as arranged with a faculty member",
            "id": "GEOG 692",
            "parent": "GEOG",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Provides an introduction to health and human mobility in a global context. Mobility is part of the human condition and international law enshrines freedom of movement, yet nation-states reserve the right to exclude. Examines the development of laws and institutions governing people on the move; how these solidify or reshape existing global, racial-ethnic, class, and gender hierarchies; and how they contribute to individual and population-level health.",
            "id": "GEOG 307",
            "parent": "GEOG",
            "title": "INTERNATIONAL MIGRATION, HEALTH, AND HUMAN RIGHTS"
        }
    },
    {
        "data": {
            "description": "Explores emerging topics in human and people-environment geography.",
            "id": "GEOG 675",
            "parent": "GEOG",
            "title": "SPECIAL TOPICS IN GEOGRAPHY"
        }
    },
    {
        "data": {
            "description": "Independent study as arranged with a faculty member.",
            "id": "GEOG 799",
            "parent": "GEOG",
            "title": "INDEPENDENT READING"
        }
    },
    {
        "data": {
            "description": "Individual mentored study for seniors completing theses as arranged with a faculty member",
            "id": "GEOG 691",
            "parent": "GEOG",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "description": "Individual mentored study for completing theses, as arranged with a faculty member.",
            "id": "GEOG 990",
            "parent": "GEOG",
            "title": "RESEARCH AND THESIS"
        }
    },
    {
        "data": {
            "description": "Advanced political geography course that explores reconceptualizations of power, place, and identity, as well as the interactive forces at work that continually reshape place-making and the inter-related processes of identification and differentiation.",
            "id": "GEOG 518",
            "parent": "GEOG",
            "title": "POWER, PLACE, IDENTITY"
        }
    },
    {
        "data": {
            "description": "Overview of the physical and human geography of Wisconsin, with an emphasis on the physical, historical, and cultural processes that shaped the Badger State.",
            "id": "GEOG 342",
            "parent": "GEOG",
            "title": "GEOGRAPHY OF WISCONSIN"
        }
    },
    {
        "data": {
            "source": "ENVIRST/GEOG 337",
            "target": "ENVIRST 112"
        }
    },
    {
        "data": {
            "description": "Description and analysis of humid-tropical ecosystems, with emphasis on the relationships, production potential, and human modification of biotic resources.",
            "id": "GEOG 538",
            "parent": "GEOG",
            "title": "THE HUMID TROPICS: ECOLOGY, SUBSISTENCE, AND DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Survey of interactions among people and natural environments from before European colonization to present. Equal attention to problems of ecological change, human ideas, and uses of nature and history of conservation and environmental public policy.",
            "id": "ENVIRST/GEOG/HISTORY 460",
            "title": "AMERICAN ENVIRONMENTAL HISTORY"
        }
    },
    {
        "data": {
            "description": "Independent study as arranged with a faculty member.",
            "id": "GEOG 199",
            "parent": "GEOG",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Independent study as arranged with a faculty member.",
            "id": "GEOG 198",
            "parent": "GEOG",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Explores emerging topics in human geography (e.g., economic geography, urban geography, political geography) and people-environment geography (e.g., political ecology, environmental history).",
            "id": "GEOG 175",
            "parent": "GEOG",
            "title": "TOPICS IN GEOGRAPHY"
        }
    },
    {
        "data": {
            "description": "An introduction to the human and environmental geography of Australia, including Australian geology, ecology, society, and culture. Topics include analysis of  current events in Australia and current resource management problems using Google Earth and other tools. Australia is a settler country, the scene of indigenous genocide, a former English colony, a mythical unknown, a biophysical puzzle, home to a startling diversity of life, a cradle of modern democracy, and a powerful industrial economy with a rich resource base. It thus serves in many ways as a mirror for the US - even matching the US roughly in size, if not in population. The two countries share many elements of a common history and biogeography and yet the human and environmental geographies of the two countries have traced very different paths into the modern world.",
            "id": "GEOG 359",
            "parent": "GEOG",
            "title": "AUSTRALIA: ENVIRONMENT AND SOCIETY"
        }
    },
    {
        "data": {
            "description": "Independent study as arranged with a faculty member.",
            "id": "GEOG 999",
            "parent": "GEOG",
            "title": "INDEPENDENT WORK"
        }
    },
    {
        "data": {
            "description": "Explores emerging topics in Geography.",
            "id": "GEOG 475",
            "parent": "GEOG",
            "title": "TOPICS IN GEOGRAPHY"
        }
    },
    {
        "data": {
            "description": "Reviews the past, present, and future of the Arctic and Antarctic regions. Covers the history, geography, atmospheric and ocean circulations, permafrost, ice sheets, glaciers, and future state of the Arctic and Antarctica as projected by earth system models. Also explores the role of the polar regions in the earth's system and associated global climatic feedbacks.",
            "id": "ATMOCN/ENVIRST/GEOG 322",
            "title": "POLAR REGIONS AND THEIR IMPORTANCE IN THE GLOBAL ENVIRONMENT"
        }
    },
    {
        "data": {
            "source": "GEOSCI 100",
            "target": "GEOG/GEOSCI 320"
        }
    },
    {
        "data": {
            "source": "GEOSCI 100",
            "target": "ENVIRST/GEOSCI 106"
        }
    },
    {
        "data": {
            "description": "Surveys recent and classic works in geography.",
            "id": "GEOG 900",
            "parent": "GEOG",
            "title": "SEMINAR IN GEOGRAPHY"
        }
    },
    {
        "data": {
            "description": "Soil development as related to landscape throughout the Quaternary; focusing on the relationship of soils to climate and vegetation, landscape evolution, and time; principles of soil stratigraphy; case histories of soil geomorphic studies; field trips. Students should have completed one course in geomorphology to feel comfortable with the course content.",
            "id": "GEOG/SOILSCI 525",
            "title": "SOIL GEOMORPHOLOGY"
        }
    },
    {
        "data": {
            "source": "GEOG 370",
            "target": "GEOG 575"
        }
    },
    {
        "data": {
            "description": "Human geographers explore socio-spacial relations, processes and representations of the world in which we live. Engages economic, political, urban, socio-cultural and environmental geographic perspectives to investigate patterns and processes that have come to be associated with 'globalization'.",
            "id": "GEOG 101",
            "parent": "GEOG",
            "title": "INTRODUCTION TO HUMAN GEOGRAPHY"
        }
    },
    {
        "data": {
            "description": "Offers an in-depth examination of trans lives, selves, and ways of knowing. Focuses on the trans \"I\" as it appears in autobiography, memoir, theory, performance, visual arts, music, spacing, place making, zines, and vlogs. These works ask how styles of self-making (\"auto\") might lead to new and changing conceptions of trans lives, worlds, and social formations (\"theory\"). The trans artists and writers explored fashion selves into prisms to fracture, negotiate, meditate upon, think, and re/present the encounters, becomings, transitions, and enframings that constitute trans existence. This \"auto-theoretical\" strategy reimagines genre, style, space, and media to create launching points for new trans aesthetics, theories, joys, and struggles. The polyphonic voices of these trans selves, taken together, bring a trans \"we\" into view, creating a discursive trans space made material.",
            "id": "GEOG 515",
            "parent": "GEOG",
            "title": "TRANS AUTOTHEORIES"
        }
    },
    {
        "data": {
            "description": "Various urban empirical regularities and theories which explain them.",
            "id": "GEOG/URBRPL 505",
            "title": "URBAN SPATIAL PATTERNS AND THEORIES"
        }
    },
    {
        "data": {
            "description": "Introduction to the human geography and history of Southeast Asia, including important political and theoretical issues and policies and positionings of relevance for understanding the spatiality of the region, including the ways that ethnicity and indigeneity are playing out in Southeast Asia and among Southeast Asians in the United States.",
            "id": "GEOG 358",
            "parent": "GEOG",
            "title": "HUMAN GEOGRAPHY OF SOUTHEAST ASIA"
        }
    },
    {
        "data": {
            "description": "Climate change at timescales from the last several million years to the last 100 years, with emphasis on more recent timescales. Examines how climate variability arises from interplay between external forcings, feedbacks within the earth system, and (more recently) human activity.",
            "id": "ATMOCN/ENVIRST/GEOG/GEOSCI 335",
            "title": "CLIMATIC ENVIRONMENTS OF THE PAST"
        }
    }
]