[
    {
        "data": {
            "description": "Covers the graphs, properties and geometric significance of trigonometric functions of a real variable. Other topics include trigonometric equations and identities, application, trigonometric form of complex numbers, DeMoivre's theorem, and polar and parametric equations. The course also has a significant number of applications, especially related to other disciplines.",
            "id": "MATH 113",
            "parent": "MATH",
            "title": "TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "Elasticity and flexure of the earth's lithosphere, heat conduction, mantle convection, earthquake mechanisms, rock rheology, and fluid migration in the earth's crust; integration of geophysical observations, laboratory experiments, and theoretical models.",
            "id": "GEOSCI/GLE 747",
            "title": "TECTONOPHYSICS"
        }
    },
    {
        "data": {
            "description": "Investigates the history of the Earth's oceans, focusing on the last 65 million years, with discussion of the chemical and physical methods through which oceans are studied and the role of oceans in the climate system.",
            "id": "GEOSCI 551",
            "parent": "GEOSCI",
            "title": "PALEOCEANOGRAPHY"
        }
    },
    {
        "data": {
            "description": "Quantitative study of processes that shape Earth's surface. Use theory and field observations to investigate major components of continental geomorphic systems, including hillslopes, rivers, and glaciers. Understand how the major factors that shape Earth's surface-tectonics, climate, and life-create the landscapes we observe.",
            "id": "GEOSCI 701",
            "parent": "GEOSCI",
            "title": "QUANTITATIVE GEOMORPHOLOGY"
        }
    },
    {
        "data": {
            "description": "A critical examination of the full spectrum of renewable and nonrenewable energy options, from the unifying perspective of the Earth systems that govern their use.  Energy conversion and efficiency, consumption patterns and trends, and environmental consequences of energy production and use.",
            "id": "ENVIRST/GEOSCI 411",
            "title": "ENERGY RESOURCES"
        }
    },
    {
        "data": {
            "description": "Addresses current topics and controversies on fault mechanics, earthquake physics, and the rock record of seismicity. Emphasizes critical reading and in-depth discussion of recent publications drawn from a variety of disciplines, including geophysical, geological, and geochemical studies and approaches.",
            "id": "GEOSCI 758",
            "parent": "GEOSCI",
            "title": "MECHANICS OF EARTHQUAKES AND FAULTING"
        }
    },
    {
        "data": {
            "description": "Addresses the fundamentals of glaciology and glacier landform mechanics: mass balance, ice deformation, basal slip, temperature structure, glacial hydrology, sediment deformation and deposition, and landform building processes. Emphasizes an understanding of the mathematical principles that dictate how glaciers function. Begins with a classical treatment of the mechanics of glaciers and moves onto fundamental advances in the field of glaciology.",
            "id": "GEOSCI 720",
            "parent": "GEOSCI",
            "title": "GLACIOLOGY"
        }
    },
    {
        "data": {
            "description": "Advanced level mentored reading and research for students with dissertator status.",
            "id": "GEOSCI 999",
            "parent": "GEOSCI",
            "title": "ADVANCED INDEPENDENT READING"
        }
    },
    {
        "data": {
            "description": "Advanced topics in Hydrogeology.",
            "id": "GEOSCI 727",
            "parent": "GEOSCI",
            "title": "ADVANCED HYDROGEOLOGY"
        }
    },
    {
        "data": {
            "description": "An examination of the origin and evolution of life in the universe based on our knowledge of astronomy, biology, and geology. Includes discussions on the search for extraterrestrial life and the history of life in our solar system.",
            "id": "ASTRON/GEOSCI 160",
            "title": "LIFE IN THE UNIVERSE"
        }
    },
    {
        "data": {
            "description": "An exploration of modern glacial, glaciology, and Pleistocene geology literature. Includes a field trip to explore local glacial geology.",
            "id": "GEOSCI 920",
            "parent": "GEOSCI",
            "title": "SEMINAR IN GLACIAL AND PLEISTOCENE GEOLOGY"
        }
    },
    {
        "data": {
            "description": "An exploration of the science behind natural disasters including earthquakes, tsunamis, volcanic eruptions, landslides, tornadoes, hurricanes, and floods. Why, where, and when do these events occur, and why are some predictable but others are not? Addresses hazard assessment, forecasting, and mitigation to lessen their impact on society.",
            "id": "ATMOCN/GEOSCI 140",
            "title": "NATURAL HAZARDS AND DISASTERS"
        }
    },
    {
        "data": {
            "description": "An integrative approach to studying the interaction between the atmosphere, hydrosphere, biosphere, and geosphere as they have evolved during earth history. Overarching theme includes ocean-climate system changes, biogeochemical cycles, evolution from microbes to mammals, and critical events in life history.",
            "id": "GEOSCI 304",
            "parent": "GEOSCI",
            "title": "GEOBIOLOGY"
        }
    },
    {
        "data": {
            "description": "An introduction to the principles of modeling groundwater flow systems, with emphasis on regional flow system analysis. Conceptual understanding of governing equations, and the use of finite difference techniques to solve such equations are stressed. Develop codes and become introduced to packaged models, including those developed by the U. S. Geological Survey. Knowledge of hydrogeology [such asG L E/​GEOSCI  627or629] required.",
            "id": "GEOSCI/GLE 724",
            "title": "GROUNDWATER FLOW MODELING"
        }
    },
    {
        "data": {
            "description": "Application of geology to problems resulting from the ever more intense use of the earth and its resources.",
            "id": "ENVIRST/GEOSCI 106",
            "title": "ENVIRONMENTAL GEOLOGY"
        }
    },
    {
        "data": {
            "description": "Application of inverse methods to geophysical measurements of the structure of the earth.",
            "id": "GEOSCI 793",
            "parent": "GEOSCI",
            "title": "GEOPHYSICAL INVERSE THEORY"
        }
    },
    {
        "data": {
            "description": "Application of radioisotopic (Ar-Ar, U-Pb, U-Th, U-He) and cosmogenic (He, Ne, Cl, Be, C) dating methods. Status of geologic, astronomic and paleomagnetic timescales, Chronology of flood basalts, impacts, extinctions, glaciations. Constraints on rates of magmatism, mountain uplift, deformation, erosion, sedimentation.",
            "id": "GEOSCI 610",
            "parent": "GEOSCI",
            "title": "GEOCHRONOLOGY, TIMESCALES, AND RATES OF GEOLOGIC PROCESSES"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for engineering students. Electricity, magnetism, light, and sound.",
            "id": "PHYSICS 202",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for engineering students. Mechanics: kinematics, statics, dynamics; energy and momentum.",
            "id": "PHYSICS 201",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Classification of rock masses, stress and strain in rock, linear and non-linear behavior of rock, failure mechanisms, state of stress in rock masses, lab testing, geological and engineering applications.",
            "id": "CIVENGR/GEOSCI/GLE/MS&E 474",
            "title": "ROCK MECHANICS"
        }
    },
    {
        "data": {
            "description": "Classification, characteristics, and petrogenesis of igneous rocks. Representative rock suites studied in lab.",
            "id": "GEOSCI 771",
            "parent": "GEOSCI",
            "title": "IGNEOUS PETROLOGY"
        }
    },
    {
        "data": {
            "description": "Climate change at timescales from the last several million years to the last 100 years, with emphasis on more recent timescales. Examines how climate variability arises from interplay between external forcings, feedbacks within the earth system, and (more recently) human activity.",
            "id": "ATMOCN/ENVIRST/GEOG/GEOSCI 335",
            "title": "CLIMATIC ENVIRONMENTS OF THE PAST"
        }
    },
    {
        "data": {
            "description": "Composition, structure, occurrence, origin, and economic investigation of important groups of mineral deposits; problems of mineral deposition.",
            "id": "GEOSCI 515",
            "parent": "GEOSCI",
            "title": "PRINCIPLES OF ECONOMIC GEOLOGY"
        }
    },
    {
        "data": {
            "description": "Comprehensive survey of the processes and products of carbonate sedimentation.",
            "id": "GEOSCI 731",
            "parent": "GEOSCI",
            "title": "CARBONATE GEOLOGY"
        }
    },
    {
        "data": {
            "description": "Comprehensive survey of the processes and products of sedimentation, including depositional environments, sedimentary tectonics, sequence stratigraphic principles, and analytical methods.",
            "id": "GEOSCI 430",
            "parent": "GEOSCI",
            "title": "SEDIMENTOLOGY AND STRATIGRAPHY"
        }
    },
    {
        "data": {
            "description": "Contemporary views of the origin and diversification of life and evolutionary processes; crises in the history of life, with emphasis on controversies regarding evolution, mass extinctions, and the co-evolution of Earth and life.",
            "id": "GEOSCI 110",
            "parent": "GEOSCI",
            "title": "EVOLUTION AND EXTINCTION"
        }
    },
    {
        "data": {
            "description": "Covers Sedimentology and Stratigraphy; emphasizes qualitative and quantitative description and interpretation of sediments and sedimentary deposits.",
            "id": "GEOSCI/GLE 431",
            "title": "SEDIMENTARY & STRATIGRAPHY LAB"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Describes the basic climate principles governing the climate system. It describes the climate and climate variability at present, climate evolution in the past, and the projected climate change into the future. The scientific principles underlying the natural and anthropogenic greenhouse effect and climate model forecasts are elucidated.",
            "id": "ATMOCN/ENVIRST/GEOSCI 102",
            "title": "CLIMATE AND CLIMATE CHANGE"
        }
    },
    {
        "data": {
            "description": "Detailed geologic mapping and solution of related problems in the field.",
            "id": "GEOSCI 459",
            "parent": "GEOSCI",
            "title": "FIELD GEOLOGY"
        }
    },
    {
        "data": {
            "description": "Emphasis on natural and human processes that control the morphology of the land and its waterways.",
            "id": "GEOG/GEOSCI 326",
            "title": "LANDFORMS-TOPICS AND REGIONS"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "Examination of interaction of tectonic plates and the resulting structures.",
            "id": "GEOSCI 556",
            "parent": "GEOSCI",
            "title": "MOUNTAIN BELTS"
        }
    },
    {
        "data": {
            "description": "Examines the earth and environmental science behind the news with the goal of producing more informed and knowledgeable citizens.",
            "id": "GEOSCI 115",
            "parent": "GEOSCI",
            "title": "SCIENCE BEHIND THE NEWS - THE WORLD AROUND US"
        }
    },
    {
        "data": {
            "description": "Experimental rock mechanics, rock mechanics apparatus design, static and dynamic rock friction, rate and state friction, crack phenomena and rock fracture mechanics, earthquake energy budget, elastic/viscoelastic/plastic behavior of rocks, engineering and geological applications. Knowledge of introductory rock mechanics [such as M S  E/GEOSCI/​CIV ENGR/​G L E/​M S & E  474] required.",
            "id": "GEOSCI/GLE 757",
            "title": "ADVANCED ROCK MECHANICS"
        }
    },
    {
        "data": {
            "description": "Exploration of topics in the field of Geochemistry with an emphasis on engagement with recent literature.",
            "id": "GEOSCI 970",
            "parent": "GEOSCI",
            "title": "SEMINAR-GEOCHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Explores the diversity of microbial life forms in modern and ancient geological environments, with a focus on extreme environments of geological origin or relevance. Includes exploration of unusual aspects of microbial life in everyday settings.",
            "id": "GEOSCI 117",
            "parent": "GEOSCI",
            "title": "EX-FILES: LIFE IN THE EARTH'S EXTREME ENVIRONMENT"
        }
    },
    {
        "data": {
            "description": "Explores the formation, collection, properties, and treatment of many popular gemstones.",
            "id": "GEOSCI 331",
            "parent": "GEOSCI",
            "title": "GEMS: THE SCIENCE BEHIND THE SPARKLE"
        }
    },
    {
        "data": {
            "description": "Famously called \"America's best idea\", the National Parks of the US record two-thirds of Earth's history, from the most ancient mountains to active volcanic eruptions. The geologic story of the National Parks is explored in the framework of physiography, tectonics, time, and fundamental geologic processes, highlighting the major parks from Hawaii, to Alaska, to the conterminous US. Provides a view of the geological evolution of the Earth using specific examples.",
            "id": "GEOSCI 109",
            "parent": "GEOSCI",
            "title": "THREE BILLION YEARS BENEATH YOUR FEET: GEOLOGY OF THE NATIONAL PARKS"
        }
    },
    {
        "data": {
            "description": "Fundamentals of satellite imagery applied to the earth sciences. Basics of image interpretation. Multitemporal data. Resolution and uncertainty. Existing and emerging technologies. Orbits, wavelengths, and satellites. Socio-economic impact of remotely-sensed data.",
            "id": "GEOSCI 118",
            "parent": "GEOSCI",
            "title": "EYE IN THE SKY: MONITORING THE EARTH BY SATELLITE"
        }
    },
    {
        "data": {
            "description": "Geologic processes; structure and history of the earth; earthquakes, volcanos, glaciers, groundwater, minerals, rocks, deserts, fossils; topographic and geologic maps; climate change on geologic and human time scales.",
            "id": "GEOSCI 100",
            "parent": "GEOSCI",
            "title": "INTRODUCTORY GEOLOGY: HOW THE EARTH WORKS"
        }
    },
    {
        "data": {
            "description": "Global positioning system surveying for field applications. Signals. Coordinate systems. Datums. Cartographic projections. Satellite orbits. Choosing hardware. Strategies for data collection and analysis. Assessing uncertainty. Geocoding satellite images. Integrating data with Geographic Information Systems. Emerging technologies.",
            "id": "CIVENGR/ENVIRST/GEOSCI/GLE 444",
            "title": "PRACTICAL APPLICATIONS OF GPS SURVEYING"
        }
    },
    {
        "data": {
            "description": "Igneous and metamorphic rocks, studied in hand sample and thin section.",
            "id": "GEOSCI/GLE 370",
            "title": "ELEMENTARY PETROLOGY"
        }
    },
    {
        "data": {
            "description": "Independent study as arranged with a faculty member.",
            "id": "GEOSCI 198",
            "parent": "GEOSCI",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Independent study as arranged with a faculty member.",
            "id": "GEOSCI 199",
            "parent": "GEOSCI",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Independent study as arranged with a faculty member.",
            "id": "GEOSCI 698",
            "parent": "GEOSCI",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Independent study as arranged with a faculty member.",
            "id": "GEOSCI 699",
            "parent": "GEOSCI",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Individual mentored study for seniors completing theses for Honors in the Major as arranged with a faculty member.",
            "id": "GEOSCI 681",
            "parent": "GEOSCI",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Individual mentored study for seniors completing theses for Honors in the Major as arranged with a faculty member.",
            "id": "GEOSCI 682",
            "parent": "GEOSCI",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Instruction and practice in instrumentation and techniques used in collection and interpretation of data. Includes field work in and around Madison.",
            "id": "GEOSCI 729",
            "parent": "GEOSCI",
            "title": "FIELD APPLICATIONS IN HYDROGEOLOGY"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Introduction to recognition and mapping of geologic structures in the field. Landforms, folds, faults, tectonics, geologic maps, and field instrumentation.",
            "id": "GEOSCI 202",
            "parent": "GEOSCI",
            "title": "INTRODUCTION TO GEOLOGIC STRUCTURES"
        }
    },
    {
        "data": {
            "description": "Introduction to techniques used in the study of the biology, chemistry, geology, and physics of the marine environment.",
            "id": "ATMOCN/ENVIRST/GEOSCI/ZOOLOGY 750",
            "title": "PROBLEMS IN OCEANOGRAPHY"
        }
    },
    {
        "data": {
            "description": "Introduction to the Earth as viewed from above, focusing on use of aerial photography and satellite imagery to study the environment. Includes physical processes of electromagnetic radiation, data types and sensing capabilities, methods for interpretation, analysis and mapping, and applications.",
            "id": "ENVIRST/F&WECOL/GEOG/GEOSCI/GLE/LANDARC 371",
            "title": "INTRODUCTION TO ENVIRONMENTAL REMOTE SENSING"
        }
    },
    {
        "data": {
            "description": "MATLAB is a powerful, high-level programming language and integrated development environment (IDE) that is used across a broad variety of scientific disciplines for tasks including data visualization, modeling, and application development. Focus on the active use of MATLAB for developing practical programming and data analysis skills that can be applied across a range of geoscience- relevant problems. Applications will include: data visualization and publishable figure development; automation of data processing; statistical and time-series analysis; image processing and mapping; and optimization. Additional topics may be guided by student interest.",
            "id": "GEOSCI/GLE 537",
            "title": "QUANTITATIVE METHODS FOR GEOSCIENCE"
        }
    },
    {
        "data": {
            "description": "Major concepts from earliest to modern times.",
            "id": "GEOSCI/HISTSCI 514",
            "title": "HISTORY OF GEOLOGIC THOUGHT"
        }
    },
    {
        "data": {
            "description": "Mathematical treatment of the physical principles governing the flow of groundwater; emphasis on well hydraulics and flow system analysis.",
            "id": "GEOSCI/GLE 627",
            "title": "HYDROGEOLOGY"
        }
    },
    {
        "data": {
            "description": "Mentored individual research and study for students completing a senior thesis.",
            "id": "GEOSCI 691",
            "parent": "GEOSCI",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Mentored individual research and study for students completing a senior thesis.",
            "id": "GEOSCI 692",
            "parent": "GEOSCI",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Methods of geophysics applied to earth structure and plate tectonics. Principles of seismology, gravity, geodesy, magnetism and heat flow.",
            "id": "GEOSCI/GLE 350",
            "title": "INTRODUCTION TO GEOPHYSICS: THE DYNAMIC EARTH"
        }
    },
    {
        "data": {
            "description": "Minerals, their physical and chemical properties, crystallography, and geologic significance.",
            "id": "GEOSCI/GLE 360",
            "title": "PRINCIPLES OF MINERALOGY"
        }
    },
    {
        "data": {
            "description": "Nature and behavior of ocean water, interaction of oceans and atmosphere, structure of the ocean floor, life in the oceans, our relationship to the marine environment.",
            "id": "ATMOCN/GEOSCI 105",
            "title": "SURVEY OF OCEANOGRAPHY"
        }
    },
    {
        "data": {
            "description": "Observation, description, and prediction of deformation of geomechanical systems at depth, and the forces (stress) causing those deformations, relevant for petroleum/geothermal reservoirs and studies of earthquake mechanics. Emphasis on computational exercises using datasets from the petroleum industry and earthquake catalogues, as well as prediction of ground deformation.",
            "id": "GEOSCI/GLE 596",
            "title": "GEOMECHANICS"
        }
    },
    {
        "data": {
            "description": "Petrographic investigation of rock fabrics and deformation using thin sections. Use of petrographic microscopes and Scanning Electron Microscopes (SEMs).",
            "id": "GEOSCI 557",
            "parent": "GEOSCI",
            "title": "STRUCTURAL PETROLOGY"
        }
    },
    {
        "data": {
            "description": "Physical and chemical processes governing the transport of solutes in groundwater; application of hydrogeologic and geochemical theory and practice to the protection of aquifers from contamination.",
            "id": "GEOSCI/GLE 629",
            "title": "CONTAMINANT HYDROGEOLOGY"
        }
    },
    {
        "data": {
            "description": "Physical evolution of the earth and its relationship to the development of life through geologic time. Includes field trip.",
            "id": "GEOSCI 204",
            "parent": "GEOSCI",
            "title": "GEOLOGIC EVOLUTION OF THE EARTH"
        }
    },
    {
        "data": {
            "description": "Principles and analysis of geomorphic processes and resulting land forms.",
            "id": "GEOG/GEOSCI 320",
            "title": "GEOMORPHOLOGY"
        }
    },
    {
        "data": {
            "description": "Principles and application of chemical equilibrium, coordination chemistry, oxidation-reduction and electrochemistry, kinetics, nuclear chemistry, introduction to organic chemistry, and chemistry laboratory skills.",
            "id": "CHEM 104",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Principles of crystal chemistry, emphasizing the structure and behavior of rock forming minerals.",
            "id": "GEOSCI 765",
            "parent": "GEOSCI",
            "title": "CRYSTAL CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Principles of mechanics, force systems, equilibrium, structures, distributed forces, moments of inertia of areas, and friction.",
            "id": "EMA 201",
            "parent": "EMA",
            "title": "STATICS"
        }
    },
    {
        "data": {
            "description": "Principles of rock deformation, structures in layered rocks, structural analysis, intrusive structures. Lab: three-dimensional problems involving structural concepts; field trip.",
            "id": "GEOSCI/GLE 455",
            "title": "STRUCTURAL GEOLOGY"
        }
    },
    {
        "data": {
            "description": "Principles, characteristics and work of glaciers; events of the Pleistocene. Field trip.",
            "id": "GEOG/GEOSCI 420",
            "title": "GLACIAL AND PLEISTOCENE GEOLOGY"
        }
    },
    {
        "data": {
            "description": "Processes involved in the origin of chemical sediments; shales, carbonates, and evaporites.",
            "id": "GEOSCI 732",
            "parent": "GEOSCI",
            "title": "GEOCHEMISTRY OF SEDIMENTS"
        }
    },
    {
        "data": {
            "description": "Proper use and functioning of electron probe and SEM, their use in microanalysis (WDS, EDS), range of applications, and limitations.",
            "id": "GEOSCI 777",
            "parent": "GEOSCI",
            "title": "ELECTRON MICROPROBE ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Provides a chemical basis for understanding the origin, evolution, distribution and interactions of chemical elements and isotopes between the lithosphere, hydrosphere, biosphere, and atmosphere in geological and environmental processes.",
            "id": "GEOSCI 375",
            "parent": "GEOSCI",
            "title": "PRINCIPLES OF GEOCHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Research supervised by individual faculty members.",
            "id": "GEOSCI 990",
            "parent": "GEOSCI",
            "title": "RESEARCH"
        }
    },
    {
        "data": {
            "description": "Sections in various fields of zoological research.",
            "id": "ATMOCN/BOTANY/CIVENGR/ENVIRST/GEOSCI/ZOOLOGY 911",
            "title": "LIMNOLOGY AND MARINE SCIENCE SEMINAR"
        }
    },
    {
        "data": {
            "description": "Skills and strategies to conduct research in the geological sciences, including collection of data, analysis of the data, generation of models to explain the data, and clear communication of both the research process and results. As part of the research process, find, evaluate, and utilize information in the existing scientific literature. Practice effective scientific communication skills, including writing, oral presentations, and producing effective visualizations.",
            "id": "GEOSCI 402",
            "parent": "GEOSCI",
            "title": "RESEARCH AND COMMUNICATION IN THE GEOLOGICAL SCIENCES"
        }
    },
    {
        "data": {
            "description": "Special topics in Geoscience.",
            "id": "GEOSCI 875",
            "parent": "GEOSCI",
            "title": "ADVANCED TOPICS IN GEOLOGY"
        }
    },
    {
        "data": {
            "description": "Special topics in Hydrogeology.",
            "id": "GEOSCI 929",
            "parent": "GEOSCI",
            "title": "SEMINAR-HYDROGEOLOGY"
        }
    },
    {
        "data": {
            "description": "Special topics or discussions of recent research in Geoscience.",
            "id": "GEOSCI 376",
            "parent": "GEOSCI",
            "title": "TOPICS IN GEOLOGY"
        }
    },
    {
        "data": {
            "description": "Stoichiometry and the mole concept, the behavior of gases, liquids and solids, thermochemistry, electronic structure of atoms and chemical bonding, descriptive chemistry of selected elements and compounds, intermolecular forces, and chemistry laboratory skills.",
            "id": "CHEM 103",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Structures in layered, intrusive, and metamorphic rocks; structural analysis.",
            "id": "GEOSCI 755",
            "parent": "GEOSCI",
            "title": "ADVANCED STRUCTURAL GEOLOGY"
        }
    },
    {
        "data": {
            "description": "Study of the principles and methods of geologic mapping.",
            "id": "GEOSCI 457",
            "parent": "GEOSCI",
            "title": "CONDUCTED FIELD TRIP"
        }
    },
    {
        "data": {
            "description": "Survey of applied geophysics, including seismic refraction, seismic reflection, electrical resistivity, gravity, and magnetics methods. Basic physics of each method and modeling techniques and field procedures.",
            "id": "GEOSCI/GLE 594",
            "title": "INTRODUCTION TO APPLIED GEOPHYSICS"
        }
    },
    {
        "data": {
            "description": "Techniques of integration, improper integrals, first order ordinary differential equations, sequences and series, Taylor series, vector geometry in two and three dimensions.",
            "id": "MATH 222",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 2"
        }
    },
    {
        "data": {
            "description": "The application of geophysical field methods for delineating near-surface features and/or structures as applied to engineering, environmental and exploration problems.",
            "id": "GEOSCI/GLE 595",
            "title": "FIELD METHODS IN APPLIED AND ENGINEERING GEOPHYSICS"
        }
    },
    {
        "data": {
            "description": "The evolutionary history, morphology, and ecology of fossil invertebrates. Labs emphasize fossil identification and recognition of basic morphological features.",
            "id": "GEOSCI/ZOOLOGY 542",
            "title": "INVERTEBRATE PALEONTOLOGY"
        }
    },
    {
        "data": {
            "description": "The evolutionary process as interpreted from the fossil record. Topics include: the study of form; tempo and mode of evolution; levels and mechanisms of evolutionary change; extinction in the fossil record; trends and patterns in the history of life; macroevolution.",
            "id": "GEOSCI/ZOOLOGY 541",
            "title": "PALEOBIOLOGY"
        }
    },
    {
        "data": {
            "description": "The two semester sequenceMATH 112-MATH 113covers similar material asMATH 114, but in a slower pace. Not recommended for students with less than an AB inMATH 96.",
            "id": "MATH 114",
            "parent": "MATH",
            "title": "ALGEBRA AND TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "Theory and observations of earthquakes, seismic waves and plate tectonics.",
            "id": "GEOSCI 796",
            "parent": "GEOSCI",
            "title": "PHYSICS OF THE EARTH II"
        }
    },
    {
        "data": {
            "description": "Theory and techniques of geologic mapping; field trips.",
            "id": "GEOSCI 456",
            "parent": "GEOSCI",
            "title": "GEOLOGIC FIELD METHODS"
        }
    },
    {
        "data": {
            "description": "Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Part of a 2-semester sequence withMATH 217; these two courses together are equivalent toMATH 114and221.",
            "id": "MATH 171",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY I"
        }
    },
    {
        "data": {
            "description": "Topics in earth system science. Emphasis on the coupling between atmospheric, oceanic and land surface systems, involving physical geochemical and biological processes, and including interactions with human systems.",
            "id": "ATMOCN/BOTANY/ENVIRST/F&WECOL/GEOG/GEOSCI/ZOOLOGY 980",
            "title": "EARTH SYSTEM SCIENCE SEMINAR"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "EMA",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "GEOSCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "PHYSICS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ATMOCN/GEOSCI 105",
            "target": "GEOSCI 551"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "GEOSCI/GLE 360"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "GEOSCI 375"
        }
    },
    {
        "data": {
            "source": "CIVENGR/GEOSCI/GLE/MS&E 474",
            "target": "GEOSCI/GLE 596"
        }
    },
    {
        "data": {
            "source": "EMA 201",
            "target": "CIVENGR/GEOSCI/GLE/MS&E 474"
        }
    },
    {
        "data": {
            "source": "ENVIRST/GEOSCI 106",
            "target": "GEOG/GEOSCI 320"
        }
    },
    {
        "data": {
            "source": "ENVIRST/GEOSCI 106",
            "target": "GEOSCI 100"
        }
    },
    {
        "data": {
            "source": "ENVIRST/GEOSCI 106",
            "target": "GEOSCI/GLE 627"
        }
    },
    {
        "data": {
            "source": "GEOG/GEOSCI 320",
            "target": "GEOG/GEOSCI 326"
        }
    },
    {
        "data": {
            "source": "GEOSCI 100",
            "target": "ENVIRST/GEOSCI 106"
        }
    },
    {
        "data": {
            "source": "GEOSCI 100",
            "target": "GEOG/GEOSCI 420"
        }
    },
    {
        "data": {
            "source": "GEOSCI 100",
            "target": "GEOSCI 202"
        }
    },
    {
        "data": {
            "source": "GEOSCI 100",
            "target": "GEOSCI 204"
        }
    },
    {
        "data": {
            "source": "GEOSCI 100",
            "target": "GEOSCI/GLE 360"
        }
    },
    {
        "data": {
            "source": "GEOSCI 202",
            "target": "GEOSCI 459"
        }
    },
    {
        "data": {
            "source": "GEOSCI 202",
            "target": "GEOSCI/GLE 455"
        }
    },
    {
        "data": {
            "source": "GEOSCI 204",
            "target": "GEOSCI 304"
        }
    },
    {
        "data": {
            "source": "GEOSCI 204",
            "target": "GEOSCI 430"
        }
    },
    {
        "data": {
            "source": "GEOSCI 204",
            "target": "GEOSCI 515"
        }
    },
    {
        "data": {
            "source": "GEOSCI 204",
            "target": "GEOSCI/GLE 431"
        }
    },
    {
        "data": {
            "source": "GEOSCI 204",
            "target": "GEOSCI/GLE 455"
        }
    },
    {
        "data": {
            "source": "GEOSCI 204",
            "target": "GEOSCI/HISTSCI 514"
        }
    },
    {
        "data": {
            "source": "GEOSCI 204",
            "target": "GEOSCI/ZOOLOGY 542"
        }
    },
    {
        "data": {
            "source": "GEOSCI 304",
            "target": "GEOSCI/ZOOLOGY 541"
        }
    },
    {
        "data": {
            "source": "GEOSCI/GLE 360",
            "target": "GEOSCI 375"
        }
    },
    {
        "data": {
            "source": "GEOSCI/GLE 360",
            "target": "GEOSCI/GLE 370"
        }
    },
    {
        "data": {
            "source": "GEOSCI/GLE 370",
            "target": "GEOSCI 375"
        }
    },
    {
        "data": {
            "source": "GEOSCI/GLE 370",
            "target": "GEOSCI 430"
        }
    },
    {
        "data": {
            "source": "GEOSCI/GLE 370",
            "target": "GEOSCI 457"
        }
    },
    {
        "data": {
            "source": "GEOSCI/GLE 370",
            "target": "GEOSCI 459"
        }
    },
    {
        "data": {
            "source": "GEOSCI/GLE 370",
            "target": "GEOSCI 515"
        }
    },
    {
        "data": {
            "source": "GEOSCI/GLE 370",
            "target": "GEOSCI 557"
        }
    },
    {
        "data": {
            "source": "GEOSCI/GLE 370",
            "target": "GEOSCI 610"
        }
    },
    {
        "data": {
            "source": "GEOSCI/GLE 370",
            "target": "GEOSCI/GLE 455"
        }
    },
    {
        "data": {
            "source": "GEOSCI/GLE 455",
            "target": "GEOSCI 456"
        }
    },
    {
        "data": {
            "source": "GEOSCI/GLE 455",
            "target": "GEOSCI 459"
        }
    },
    {
        "data": {
            "source": "GEOSCI/GLE 455",
            "target": "GEOSCI 556"
        }
    },
    {
        "data": {
            "source": "GEOSCI/GLE 455",
            "target": "GEOSCI 557"
        }
    },
    {
        "data": {
            "source": "GEOSCI/GLE 594",
            "target": "GEOSCI/GLE 595"
        }
    },
    {
        "data": {
            "source": "GEOSCI/GLE 627",
            "target": "GEOSCI/GLE 629"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 113"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 113",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 114",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "ENVIRST/F&WECOL/GEOG/GEOSCI/GLE/LANDARC 371"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "CIVENGR/ENVIRST/GEOSCI/GLE 444"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "GEOSCI/GLE 350"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "GEOSCI/GLE 627"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 222"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "PHYSICS 201"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "PHYSICS 202"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "EMA 201"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "GEOSCI/GLE 537"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "GEOSCI/GLE 594"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "GEOSCI/GLE 629"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 114"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "PHYSICS 201",
            "target": "PHYSICS 202"
        }
    },
    {
        "data": {
            "source": "PHYSICS 202",
            "target": "GEOSCI/GLE 594"
        }
    }
]