[
    {
        "data": {
            "description": "In the twentieth century, Berlin functioned as the seat of government and as a showcase for conflicting ideologies during the Cold War, and it now faces the challenge of returning to its function as reunified Germany's capital without ignoring its past. Through it all, Berlin has maintained a reputation as a center for artistic experimentation and a mecca for alternative culture. Examine the various arts and forms of entertainment from the turn of the century through the Weimar Republic, the Third Reich, the Cold War, and the reunification, in an effort to determine how politics, economics, and demographics have come together to shape a unique Berlin culture.",
            "id": "GERMAN 264",
            "parent": "GERMAN",
            "title": "CULTURE IN 20TH CENTURY BERLIN"
        }
    },
    {
        "data": {
            "description": "Surveys experiences through the centuries of America's German-speaking immigrants, including their situations in Europe, their reasons for leaving, and their successes and difficulties in their new home. Historical, sociological, linguistic, cultural, and other aspects will be considered.",
            "id": "GERMAN 271",
            "parent": "GERMAN",
            "title": "THE GERMAN IMMIGRATION EXPERIENCE"
        }
    },
    {
        "data": {
            "description": "",
            "id": "FRENCH/GERMAN/HISTORY/POLISCI/SOC 804",
            "title": "INTERDISCIPLINARY WESTERN EUROPEAN AREA STUDIES SEMINAR"
        }
    },
    {
        "data": {
            "description": "A review of Dutch Grammar and vocabulary and intensive development of writing and speaking skills. Provides a strong linguistic preparation for study in a Dutch-speaking university. Taught in Dutch.",
            "id": "GERMAN 335",
            "parent": "GERMAN",
            "title": "DUTCH CONVERSATION AND COMPOSITION"
        }
    },
    {
        "data": {
            "description": "A review of Dutch grammar and vocabulary and intensive development of writing and speaking skills in Dutch. Provides a strong linguistic preparation for study in a Dutch-speaking university.",
            "id": "GERMAN 235",
            "parent": "GERMAN",
            "title": "DUTCH CONVERSATION AND COMPOSITION"
        }
    },
    {
        "data": {
            "description": "A review of Dutch grammar and vocabulary development. Reading and discussion of newspaper articles and modern short stories.",
            "id": "GERMAN 313",
            "parent": "GERMAN",
            "title": "THIRD SEMESTER DUTCH FOR GRADUATE STUDENTS"
        }
    },
    {
        "data": {
            "description": "Acquire a minimal communication level of proficiency in Dutch through listening, speaking, reading, and writing.",
            "id": "GERMAN 311",
            "parent": "GERMAN",
            "title": "FIRST SEMESTER DUTCH FOR GRADUATE STUDENTS"
        }
    },
    {
        "data": {
            "description": "Acquire a minimal communication level of proficiency in Dutch through listening, speaking, reading, and writing.",
            "id": "GERMAN 312",
            "parent": "GERMAN",
            "title": "SECOND SEMESTER DUTCH FOR GRADUATE STUDENTS"
        }
    },
    {
        "data": {
            "description": "Advanced study under guidance.",
            "id": "GERMAN 799",
            "parent": "GERMAN",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Analyze texts of a specific period of German cultural history (e.g., the Romantic era, the Baroque).",
            "id": "GERMAN 677",
            "parent": "GERMAN",
            "title": "SEMINAR IN GERMAN CULTURE STUDIES"
        }
    },
    {
        "data": {
            "description": "Analyzes the German-speaking world in the 20th and 21st centuries using variety of authors, films, music, and other art media. Works include literary and historical texts, central texts from German sociologists, and art history.",
            "id": "GERMAN 411",
            "parent": "GERMAN",
            "title": "KULTUR DES 20. UND 21. JAHRHUNDERTS"
        }
    },
    {
        "data": {
            "description": "Cultivate a deep knowledge and appreciation of German literature and German intellectual history.",
            "id": "GERMAN 947",
            "parent": "GERMAN",
            "title": "SEMINAR IN GERMAN LITERATURE AND CULTURE"
        }
    },
    {
        "data": {
            "description": "Cultivate a deep knowledge and discussion of German linguistics.",
            "id": "GERMAN 970",
            "parent": "GERMAN",
            "title": "ADVANCED SEMINAR IN GERMAN LINGUISTICS"
        }
    },
    {
        "data": {
            "description": "Cultural history and traditions of Dutch speaking countries. All readings and lectures in English.",
            "id": "GERMAN 245",
            "parent": "GERMAN",
            "title": "TOPICS IN DUTCH LIFE AND CULTURE"
        }
    },
    {
        "data": {
            "description": "Develop reading skills by working with literary and cultural texts from 1800 to the present. Emphasizes close reading, textual analysis, historical context, and the use of appropriate reading strategies.",
            "id": "GERMAN 258",
            "parent": "GERMAN",
            "title": "INTERMEDIATE GERMAN-READING"
        }
    },
    {
        "data": {
            "description": "Developing skills in critical reading, logical thinking, use of evidence, and use of library resources. Emphasis on writing in the conventions of specific fields.",
            "id": "GERMAN 236",
            "parent": "GERMAN",
            "title": "BASCOM COURSE"
        }
    },
    {
        "data": {
            "description": "Discuss German-language specific instruction. Emphasis on teaching German and developing identity as a language instructor.",
            "id": "GERMAN 720",
            "parent": "GERMAN",
            "title": "COLLEGE TEACHING OF GERMAN"
        }
    },
    {
        "data": {
            "description": "Drawing mainly on contemporary audio and video materials from German-speaking countries, deepen understanding of German as a spoken language by learning how native speakers vary their use of sound structures, vocabulary, and grammar according to speech situation.",
            "id": "GERMAN 249",
            "parent": "GERMAN",
            "title": "INTERMEDIATE GERMAN - SPEAKING AND LISTENING"
        }
    },
    {
        "data": {
            "description": "Emphasis on proficiency in Dutch through speaking, listening, reading, and writing, and on communication in cultural context.",
            "id": "GERMAN 111",
            "parent": "GERMAN",
            "title": "FIRST SEMESTER DUTCH"
        }
    },
    {
        "data": {
            "description": "Emphasis on proficiency in Dutch through speaking, listening, reading, and writing, and on communication in cultural context.",
            "id": "GERMAN 112",
            "parent": "GERMAN",
            "title": "SECOND SEMESTER DUTCH"
        }
    },
    {
        "data": {
            "description": "Emphasis on proficiency in German through speaking, listening, reading, and writing, and on communication in cultural context.",
            "id": "GERMAN 101",
            "parent": "GERMAN",
            "title": "FIRST SEMESTER GERMAN"
        }
    },
    {
        "data": {
            "description": "Emphasis on proficiency in German through speaking, listening, reading, and writing, and on communication in cultural context.",
            "id": "GERMAN 102",
            "parent": "GERMAN",
            "title": "SECOND SEMESTER GERMAN"
        }
    },
    {
        "data": {
            "description": "Emphasis on proficiency in German through speaking, listening, reading, and writing, and on communication in cultural context.",
            "id": "GERMAN 401",
            "parent": "GERMAN",
            "title": "FIRST-SEMESTER GERMAN FOR GRADUATE STUDENTS"
        }
    },
    {
        "data": {
            "description": "Emphasis on proficiency in German through speaking, listening, reading, and writing, and on communication in cultural context.",
            "id": "GERMAN 402",
            "parent": "GERMAN",
            "title": "SECOND-SEMESTER GERMAN FOR GRADUATE STUDENTS"
        }
    },
    {
        "data": {
            "description": "Enhances speaking, reading, listening, and writing skills within a range of situations; uses a variety of texts to cover current topics in German society, develop essay strategies, improve vocabulary, and review advanced grammar topics.",
            "id": "GERMAN 337",
            "parent": "GERMAN",
            "title": "ADVANCED COMPOSITION & CONVERSATION"
        }
    },
    {
        "data": {
            "description": "Examines a wide selection of texts by Franz Kafka to approach an understanding of his universe and prepare ourselves to view this universe in comparison with other contemporary authors as well as authors from other cultures and eras (A. Camus, W. G. Sebald, T. Pynchon, H. Mulisch, P. Roth, H. Murakami). Also highlights literature, film, and art works in the tradition of the Kafkaesque.",
            "id": "GERMAN 275",
            "parent": "GERMAN",
            "title": "KAFKA AND THE KAFKAESQUE"
        }
    },
    {
        "data": {
            "description": "Examines how ideology and new policies influenced cultural life in the Third Reich. Topics include propaganda and entertainment films, music, literature and theater, visual arts and architecture, youth education, and consumer culture specifically in its appeal to women.",
            "id": "GERMAN 272",
            "parent": "GERMAN",
            "title": "NAZI CULTURE"
        }
    },
    {
        "data": {
            "description": "Explains how films work using classics such as \"Citizen Kane,\" \"Vertigo,\" \"Battleship Potemkin,\" and \"Do The Right Thing.\" Study film as an art form and a medium, cover all the major film types (silent, classical, and contemporary narrative cinema, art cinema, animation, documentary, and experimental film), and get introduced to two basic approaches to film criticism: authorship criticism and genre criticism. Learn to recognize film techniques--mise-en-scène, cinematography, editing, and sound--and to analyze how filmmakers make us watch, think, and feel.",
            "id": "COMARTS 350",
            "parent": "COMARTS",
            "title": "INTRODUCTION TO FILM"
        }
    },
    {
        "data": {
            "description": "Exploration of American Yiddish poetry, fiction, theater, and cinema created by European Jews in the United States.",
            "id": "GERMAN/JEWISH/LITTRANS 279",
            "title": "YIDDISH LITERATURE AND CULTURE IN AMERICA"
        }
    },
    {
        "data": {
            "description": "Exploration of European Yiddish fiction, poetry, folklore, and cinema, with a focus on works of the 19th and 20th centuries.",
            "id": "GERMAN/JEWISH/LITTRANS 269",
            "title": "YIDDISH LITERATURE AND CULTURE IN EUROPE"
        }
    },
    {
        "data": {
            "description": "Exploration of diverse world literary traditions with an emphasis on German and German speaking cultures.",
            "id": "GERMAN/LITTRANS 276",
            "title": "SPECIAL TOPICS IN GERMAN AND WORLD LITERATURE/S"
        }
    },
    {
        "data": {
            "description": "Explore German literary, philosophical and aesthetic questions, and the interplay of German music and theater, art and literature, philosophy and science, art and architecture.",
            "id": "GERMAN 632",
            "parent": "GERMAN",
            "title": "A THEME IN GERMAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Explores Yiddish song as an expression of the modern Jewish experience from Eastern Europe to the US. Covers folk song, popular and art music. Music and readings together provide an analytical framework to examine cultural and historical issues.",
            "id": "GERMAN 267",
            "parent": "GERMAN",
            "title": "YIDDISH SONG AND THE JEWISH EXPERIENCE"
        }
    },
    {
        "data": {
            "description": "Explores the historical connections between capitalism and religion. Considers if and how religious ideas and practices facilitated the rise of capitalism; asks whether religious institutions have supported the reproduction of social inequalities, unjust labor practices, and exploitative economies; and studies the role played by religious actors in the critique of capitalism. Pays attention to the historical specificity of the capitalist system, its conditions of emergence in the Christian West, and the effects of its globalization on non-Christian traditions. Covers topics including classical social theories of religion and capitalism; contemporary examples of religious practice and capital accumulation; and the relationship between religious movements and social-economic justice.",
            "id": "GERMAN/RELIGST/SOC 273",
            "title": "GOD & MONEY"
        }
    },
    {
        "data": {
            "description": "Focuses on a topic in German studies.",
            "id": "GERMAN 676",
            "parent": "GERMAN",
            "title": "ADVANCED SEMINAR IN GERMAN STUDIES"
        }
    },
    {
        "data": {
            "description": "Focuses on a topic in German studies.",
            "id": "GERMAN 683",
            "parent": "GERMAN",
            "title": "SENIOR HONORS SEMINAR IN GERMAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Four-skills approach (speaking, listening, wiriting, reading) centered around authentic texts, recordings, and images. Grammar review, concereted vocabulary expansion, and intensive practice.",
            "id": "GERMAN 403",
            "parent": "GERMAN",
            "title": "THIRD-SEMESTER GERMAN FOR GRADUATE STUDENTS"
        }
    },
    {
        "data": {
            "description": "Four-skills approach (speaking, listening, wiriting, reading) centered around authentic texts, recordings, and images. Grammar review, concereted vocabulary expansion, and intensive practice.",
            "id": "GERMAN 404",
            "parent": "GERMAN",
            "title": "FOURTH-SEMESTER GERMAN FOR GRADUATE STUDENTS"
        }
    },
    {
        "data": {
            "description": "Four-skills approach (speaking, listening, writing, reading) centered around authentic texts, recordings, and images. Grammar review, concerted vocabulary expansion, and intensive practice.",
            "id": "GERMAN 203",
            "parent": "GERMAN",
            "title": "THIRD SEMESTER GERMAN"
        }
    },
    {
        "data": {
            "description": "Four-skills approach (speaking, listening, writing, reading) centered around authentic texts, recordings, and images. Grammar review, concerted vocabulary expansion, and intensive practice.",
            "id": "GERMAN 204",
            "parent": "GERMAN",
            "title": "FOURTH SEMESTER GERMAN"
        }
    },
    {
        "data": {
            "description": "From Rumpelstiltskin to Rapunzel, the rich fairy-tale tradition of the German-speaking world is filled with familiar themes and subversive morals. With an eye to depictions of gender, gender roles, sexuality, and race, we critically engage with these tales and contextualize them within the social and political landscapes that shaped them.",
            "id": "GERMAN/LITTRANS 280",
            "title": "FROM GRIMM TO GRYFFINDOR: GERMAN FAIRYTALES (RE)IMAGINED"
        }
    },
    {
        "data": {
            "description": "General characteristics of the Old Germanic languages, especially in phonology; methods of reconstruction.",
            "id": "GERMAN 768",
            "parent": "GERMAN",
            "title": "COMPARATIVE AND HISTORICAL GRAMMAR OF THE OLD GERMANIC LANGUAGES"
        }
    },
    {
        "data": {
            "description": "German dramatic theory, interpretation of German drama, practice of dramatic elocution and performance.",
            "id": "GERMAN 644",
            "parent": "GERMAN",
            "title": "THEORY AND PRACTICE OF GERMAN DRAMA"
        }
    },
    {
        "data": {
            "description": "Hands-on introduction to a topic in German language study. Topics are designed for future teachers of German and those interested in graduate study in German philology/linguistics.",
            "id": "GERMAN 352",
            "parent": "GERMAN",
            "title": "TOPICS IN GERMAN LINGUISTICS"
        }
    },
    {
        "data": {
            "description": "Ideas and theories of literary movements exemplified in selected primary and secondary literature.",
            "id": "GERMAN 612",
            "parent": "GERMAN",
            "title": "GERMAN LITERARY MOVEMENTS SINCE 1750"
        }
    },
    {
        "data": {
            "description": "Important filmmakers from 1910 to the present; their relation to German cultural and social history of the period.",
            "id": "COMARTS/GERMAN 655",
            "title": "GERMAN FILM"
        }
    },
    {
        "data": {
            "description": "Independent research and writing on the subject of linguistics and philology under the supervision of a faculty member.",
            "id": "GERMAN 991",
            "parent": "GERMAN",
            "title": "INDIVIDUAL RESEARCH LINGUISTICS AND GERMANIC PHILOLOGY"
        }
    },
    {
        "data": {
            "description": "Independent research and writing under the supervision of a faculty member.",
            "id": "GERMAN 990",
            "parent": "GERMAN",
            "title": "INDIVIDUAL RESEARCH IN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Independent study as arranged with a faculty member.",
            "id": "GERMAN 298",
            "parent": "GERMAN",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Independent study as arranged with a faculty member.",
            "id": "GERMAN 299",
            "parent": "GERMAN",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Independent study as arranged with a faculty member.",
            "id": "GERMAN 698",
            "parent": "GERMAN",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Independent study as arranged with a faculty member.",
            "id": "GERMAN 699",
            "parent": "GERMAN",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Individual and collaborative writing as well as teacher- and student-guided writing activities. Writings rely on authentic text models, many with German-specific cultural connotations.",
            "id": "GERMAN 262",
            "parent": "GERMAN",
            "title": "INTERMEDIATE GERMAN-WRITING"
        }
    },
    {
        "data": {
            "description": "Individual mentored study for seniors completing theses for Honors in the Major as arranged with a faculty member.",
            "id": "GERMAN 681",
            "parent": "GERMAN",
            "title": "SENIOR HONORS THESIS-FIRST SEMESTER"
        }
    },
    {
        "data": {
            "description": "Individual mentored study for seniors completing theses for Honors in the Major as arranged with a faculty member.",
            "id": "GERMAN 682",
            "parent": "GERMAN",
            "title": "SENIOR HONORS THESIS-SECOND SEMESTER"
        }
    },
    {
        "data": {
            "description": "Intensive grammar and reading.",
            "id": "GERMAN 391",
            "parent": "GERMAN",
            "title": "GERMAN FOR GRADUATE READING KNOWLEDGE I"
        }
    },
    {
        "data": {
            "description": "Intensive grammar and reading.",
            "id": "GERMAN 392",
            "parent": "GERMAN",
            "title": "GERMAN FOR GRADUATE READING KNOWLEDGE II"
        }
    },
    {
        "data": {
            "description": "Intensive introduction to German-language culture and texts of varying length and genre, emphasizing reading, writing, and discussion skills. Equivalent toGERMAN 258and262.",
            "id": "GERMAN 285",
            "parent": "GERMAN",
            "title": "INTERMEDIATE INTENSIVE (HONORS) GERMAN: LANGUAGE, CULTURE, TEXTS"
        }
    },
    {
        "data": {
            "description": "Introduction to German-speaking cultures. Topics may include Weimar culture, Nazi culture, Berlin, fin-de-siecle Vienna, minorities, representatives of the Holocaust, Germanic mythology, East Germany, Germans in America. Readings and lectures in English.",
            "id": "GERMAN 278",
            "parent": "GERMAN",
            "title": "TOPICS IN GERMAN CULTURE"
        }
    },
    {
        "data": {
            "description": "Introduction to diverse cultural expressions of German and/or Yiddish speakers worldwide.",
            "id": "GERMAN 266",
            "parent": "GERMAN",
            "title": "TOPICS IN GERMAN AND/OR YIDDISH CULTURE"
        }
    },
    {
        "data": {
            "description": "Investigates German-Jewish culture since the 18th century, concentrating on toleration, emancipation, acculturation, assimilation, anti-Semitism, and Bildung.",
            "id": "GERMAN/JEWISH 510",
            "title": "GERMAN-JEWISH CULTURE SINCE THE 18TH CENTURY"
        }
    },
    {
        "data": {
            "description": "Key concepts for the critical analysis of television, film, radio, and digital media. Focusing primarily on meanings, aesthetics, technology, media industries, representations, and audiences.",
            "id": "COMARTS 250",
            "parent": "COMARTS",
            "title": "SURVEY OF CONTEMPORARY MEDIA"
        }
    },
    {
        "data": {
            "description": "Middle High German grammar and vocabulary with the goals of fluency and accuracy in reading medieval texts. Covers topics in phonology, morphology, syntax, and lexicon.",
            "id": "GERMAN/MEDIEVAL 651",
            "title": "INTRODUCTION TO MIDDLE HIGH GERMAN"
        }
    },
    {
        "data": {
            "description": "Observation and discussion of undergraduate culture course. Consideration of pedagogical issues and limited opportunity for practice teaching.",
            "id": "GERMAN 725",
            "parent": "GERMAN",
            "title": "PRACTICUM IN TEACHING UNDERGRADUATE CULTURE"
        }
    },
    {
        "data": {
            "description": "Observation and discussion of undergraduate linguistics course. Consideration of pedagogical issues and limited opportunity for practice teaching.",
            "id": "GERMAN 724",
            "parent": "GERMAN",
            "title": "PRACTICUM IN TEACHING UNDERGRADUATE LINGUISTICS"
        }
    },
    {
        "data": {
            "description": "Observation and discussion of undergraduate literature course. Consideration of pedagogical issues and limited opportunity for practice teaching.",
            "id": "GERMAN 723",
            "parent": "GERMAN",
            "title": "PRACTICUM IN TEACHING UNDERGRADUATE LITERATURE"
        }
    },
    {
        "data": {
            "description": "Old High German, Old Saxon, and Gothic on a rotating basis.",
            "id": "GERMAN/MEDIEVAL 755",
            "title": "OLD GERMANIC LANGUAGES"
        }
    },
    {
        "data": {
            "description": "Overview of new and recent literature in German within its historical and cultural contexts using a variety of genres and cultural artifacts, including fiction, drama, poetry, film, and popular songs.",
            "id": "GERMAN 305",
            "parent": "GERMAN",
            "title": "LITERATUR DES 20. UND 21. JAHRHUNDERTS"
        }
    },
    {
        "data": {
            "description": "Overview of the history of the German language; basic methodological and bibliographical training necessary for work in German philology/linguistics and the older Germanic languages.",
            "id": "GERMAN 650",
            "parent": "GERMAN",
            "title": "HISTORY OF THE GERMAN LANGUAGE"
        }
    },
    {
        "data": {
            "description": "Reading and discussion of texts dealing with the cultural history of the Netherlands and Flanders as well as samples of modern Dutch fiction.",
            "id": "GERMAN 314",
            "parent": "GERMAN",
            "title": "FOURTH SEMESTER DUTCH FOR GRADUATE STUDENTS"
        }
    },
    {
        "data": {
            "description": "Review of Dutch grammar and continuation of systematic vocabulary development.",
            "id": "GERMAN 213",
            "parent": "GERMAN",
            "title": "THIRD SEMESTER DUTCH"
        }
    },
    {
        "data": {
            "description": "Review of Dutch grammar and continuation of systematic vocabulary development.",
            "id": "GERMAN 214",
            "parent": "GERMAN",
            "title": "FOURTH SEMESTER DUTCH"
        }
    },
    {
        "data": {
            "description": "Selected issues in language acquisition and language teaching.",
            "id": "GERMAN 727",
            "parent": "GERMAN",
            "title": "TOPICS IN APPLIED LINGUISTICS"
        }
    },
    {
        "data": {
            "description": "Selected topics in German culture.",
            "id": "GERMAN 742",
            "parent": "GERMAN",
            "title": "TOPICS IN GERMAN CULTURAL STUDIES"
        }
    },
    {
        "data": {
            "description": "Selected topics in the culture of German-speaking countries.",
            "id": "GERMAN 372",
            "parent": "GERMAN",
            "title": "TOPICS IN GERMAN CULTURE"
        }
    },
    {
        "data": {
            "description": "Selected topics in the literature of German-speaking countries.",
            "id": "GERMAN 362",
            "parent": "GERMAN",
            "title": "TOPICS IN GERMAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Selected topics in the literature of German-speaking countries.",
            "id": "GERMAN 385",
            "parent": "GERMAN",
            "title": "HONORS SEMINAR IN GERMAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Study of an author or theme in modern Dutch/Flemish literature, presented by the current Dutch/Flemish writer in residence.",
            "id": "GERMAN 325",
            "parent": "GERMAN",
            "title": "TOPICS IN DUTCH LITERATURE"
        }
    },
    {
        "data": {
            "description": "Theory and analysis of such topics as: construction of Dutch and Belgian identities; medieval culture; the Dutch Revolt and Golden Age; colonialism, anti-colonialism, post-colonialism; immigration and emigration; Dutch and Flemish regionalism vis-a-vis Europeanization and globalization. Taught primarily in Dutch.",
            "id": "GERMAN 645",
            "parent": "GERMAN",
            "title": "CULTUURKUNDE DER LAGE LANDEN"
        }
    },
    {
        "data": {
            "description": "Theory and methodology of teaching German as a second language.",
            "id": "GERMAN 722",
            "parent": "GERMAN",
            "title": "THEORY OF TEACHING GERMAN"
        }
    },
    {
        "data": {
            "description": "Topic from a core area of linguistics, with integrated discussion of methodological approaches; bibliographical skills; basics of linguistic scholarship.",
            "id": "GERMAN 960",
            "parent": "GERMAN",
            "title": "SEMINAR IN GERMAN LINGUISTICS"
        }
    },
    {
        "data": {
            "description": "Topic in Dutch-language cultures.",
            "id": "GERMAN 445",
            "parent": "GERMAN",
            "title": "TOPICS IN DUTCH CULTURE"
        }
    },
    {
        "data": {
            "description": "Topics in contemporary German culture, literature, and linguistics.",
            "id": "GERMAN 758",
            "parent": "GERMAN",
            "title": "TOPICS IN CONTEMPORARY GERMAN"
        }
    },
    {
        "data": {
            "description": "Topics vary. May include: medieval literature; Golden Age literature; texts from Europe, South Africa, Indonesia, the Caribbean; memory in post-war literature; women writers; twentieth-century movements; Dutch-Jewish literature. Taught primarily in Dutch.",
            "id": "GERMAN 625",
            "parent": "GERMAN",
            "title": "LETTERKUNDE DER LAGE LANDEN"
        }
    },
    {
        "data": {
            "description": "Topics will vary. Each seminar will focus on a topic in German Studies.",
            "id": "GERMAN 560",
            "parent": "GERMAN",
            "title": "TOPICS IN GERMAN STUDIES"
        }
    },
    {
        "data": {
            "description": "Treatment of a topic in Dutch culture in a course offered at a university outside the United States. Enrollment in a UW-Madison resident study abroad program.",
            "id": "GERMAN 378",
            "parent": "GERMAN",
            "title": "STUDY ABROAD IN DUTCH CULTURE"
        }
    },
    {
        "data": {
            "description": "Treatment of a topic in Dutch linguistics in a course offered at a university outside the United States. Enrollment in a UW-Madison resident study abroad program.",
            "id": "GERMAN 379",
            "parent": "GERMAN",
            "title": "STUDY ABROAD IN DUTCH LINGUISTICS"
        }
    },
    {
        "data": {
            "description": "Treatment of a topic in Dutch literature in a course offered at a university outside the United States. Enrollment in a UW-Madison resident study abroad program.",
            "id": "GERMAN 377",
            "parent": "GERMAN",
            "title": "STUDY ABROAD IN DUTCH LITERATURE"
        }
    },
    {
        "data": {
            "description": "Treatment of a topic in German culture in a course carried with a UW-Madison study abroad program which has no equivalent on this campus. Enrollment in a UW-Madison resident study abroad program.",
            "id": "GERMAN 368",
            "parent": "GERMAN",
            "title": "STUDY ABROAD IN GERMAN CULTURE"
        }
    },
    {
        "data": {
            "description": "Treatment of a topic in German linguistics in a course carried with a UW-Madison study abroad program which has no equivalent on this campus. Enrollment in a UW-Madison resident study abroad program.",
            "id": "GERMAN 369",
            "parent": "GERMAN",
            "title": "STUDY ABROAD IN GERMAN LINGUISTICS"
        }
    },
    {
        "data": {
            "description": "Treatment of a topic in German literature in a course carried with a UW-Madison study abroad program which has no equivalent on this campus. Enrollment in a UW-Madison resident study abroad program.",
            "id": "GERMAN 367",
            "parent": "GERMAN",
            "title": "STUDY ABROAD IN GERMAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Understanding the German language in its historical development and its contemporary manifestations, using English as a point of reference.",
            "id": "GERMAN 351",
            "parent": "GERMAN",
            "title": "INTRODUCTION TO GERMAN LINGUISTICS"
        }
    },
    {
        "data": {
            "id": "COMARTS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "GERMAN",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "COMARTS 250",
            "target": "COMARTS 350"
        }
    },
    {
        "data": {
            "source": "COMARTS 350",
            "target": "COMARTS/GERMAN 655"
        }
    },
    {
        "data": {
            "source": "GERMAN 101",
            "target": "GERMAN 102"
        }
    },
    {
        "data": {
            "source": "GERMAN 102",
            "target": "GERMAN 203"
        }
    },
    {
        "data": {
            "source": "GERMAN 111",
            "target": "GERMAN 112"
        }
    },
    {
        "data": {
            "source": "GERMAN 112",
            "target": "GERMAN 213"
        }
    },
    {
        "data": {
            "source": "GERMAN 203",
            "target": "GERMAN 204"
        }
    },
    {
        "data": {
            "source": "GERMAN 204",
            "target": "GERMAN 285"
        }
    },
    {
        "data": {
            "source": "GERMAN 213",
            "target": "GERMAN 214"
        }
    },
    {
        "data": {
            "source": "GERMAN 214",
            "target": "GERMAN 235"
        }
    },
    {
        "data": {
            "source": "GERMAN 214",
            "target": "GERMAN 325"
        }
    },
    {
        "data": {
            "source": "GERMAN 214",
            "target": "GERMAN 445"
        }
    },
    {
        "data": {
            "source": "GERMAN 249",
            "target": "GERMAN 258"
        }
    },
    {
        "data": {
            "source": "GERMAN 249",
            "target": "GERMAN 305"
        }
    },
    {
        "data": {
            "source": "GERMAN 249",
            "target": "GERMAN 337"
        }
    },
    {
        "data": {
            "source": "GERMAN 249",
            "target": "GERMAN 351"
        }
    },
    {
        "data": {
            "source": "GERMAN 249",
            "target": "GERMAN 362"
        }
    },
    {
        "data": {
            "source": "GERMAN 249",
            "target": "GERMAN 372"
        }
    },
    {
        "data": {
            "source": "GERMAN 249",
            "target": "GERMAN 385"
        }
    },
    {
        "data": {
            "source": "GERMAN 249",
            "target": "GERMAN 411"
        }
    },
    {
        "data": {
            "source": "GERMAN 249",
            "target": "GERMAN/MEDIEVAL 651"
        }
    },
    {
        "data": {
            "source": "GERMAN 258",
            "target": "GERMAN 249"
        }
    },
    {
        "data": {
            "source": "GERMAN 258",
            "target": "GERMAN 262"
        }
    },
    {
        "data": {
            "source": "GERMAN 258",
            "target": "GERMAN 337"
        }
    },
    {
        "data": {
            "source": "GERMAN 258",
            "target": "GERMAN 351"
        }
    },
    {
        "data": {
            "source": "GERMAN 258",
            "target": "GERMAN 362"
        }
    },
    {
        "data": {
            "source": "GERMAN 262",
            "target": "GERMAN 337"
        }
    },
    {
        "data": {
            "source": "GERMAN 262",
            "target": "GERMAN 351"
        }
    },
    {
        "data": {
            "source": "GERMAN 262",
            "target": "GERMAN 362"
        }
    },
    {
        "data": {
            "source": "GERMAN 285",
            "target": "GERMAN 305"
        }
    },
    {
        "data": {
            "source": "GERMAN 285",
            "target": "GERMAN 372"
        }
    },
    {
        "data": {
            "source": "GERMAN 285",
            "target": "GERMAN 385"
        }
    },
    {
        "data": {
            "source": "GERMAN 285",
            "target": "GERMAN 411"
        }
    },
    {
        "data": {
            "source": "GERMAN 285",
            "target": "GERMAN/MEDIEVAL 651"
        }
    },
    {
        "data": {
            "source": "GERMAN 305",
            "target": "GERMAN 612"
        }
    },
    {
        "data": {
            "source": "GERMAN 305",
            "target": "GERMAN 632"
        }
    },
    {
        "data": {
            "source": "GERMAN 311",
            "target": "GERMAN 312"
        }
    },
    {
        "data": {
            "source": "GERMAN 312",
            "target": "GERMAN 313"
        }
    },
    {
        "data": {
            "source": "GERMAN 313",
            "target": "GERMAN 314"
        }
    },
    {
        "data": {
            "source": "GERMAN 314",
            "target": "GERMAN 335"
        }
    },
    {
        "data": {
            "source": "GERMAN 314",
            "target": "GERMAN 625"
        }
    },
    {
        "data": {
            "source": "GERMAN 314",
            "target": "GERMAN 645"
        }
    },
    {
        "data": {
            "source": "GERMAN 337",
            "target": "GERMAN 676"
        }
    },
    {
        "data": {
            "source": "GERMAN 351",
            "target": "GERMAN 352"
        }
    },
    {
        "data": {
            "source": "GERMAN 385",
            "target": "GERMAN 644"
        }
    },
    {
        "data": {
            "source": "GERMAN 385",
            "target": "GERMAN 683"
        }
    },
    {
        "data": {
            "source": "GERMAN 391",
            "target": "GERMAN 392"
        }
    },
    {
        "data": {
            "source": "GERMAN 401",
            "target": "GERMAN 402"
        }
    },
    {
        "data": {
            "source": "GERMAN 402",
            "target": "GERMAN 403"
        }
    },
    {
        "data": {
            "source": "GERMAN 403",
            "target": "GERMAN 404"
        }
    },
    {
        "data": {
            "source": "GERMAN 411",
            "target": "GERMAN 677"
        }
    }
]