[
    {
        "data": {
            "description": "Introduction to the Yiddish language through speaking, listening, reading, and writing. Emphasis on communication with attention to cultural and historical context. Includes tasks designed to facilitate Yiddish-related research.",
            "id": "GNS/JEWISH 405",
            "title": "FIRST SEMESTER YIDDISH FOR GRADUATE STUDENTS"
        }
    },
    {
        "data": {
            "source": "GNS 331",
            "target": "GNS 332"
        }
    },
    {
        "data": {
            "source": "GNS 340",
            "target": "GNS 429"
        }
    },
    {
        "data": {
            "description": "Introduction to the Yiddish language through speaking, listening, reading, and writing. Emphasis on communication with attention to cultural and historical context.",
            "id": "GNS/JEWISH 106",
            "title": "SECOND SEMESTER YIDDISH"
        }
    },
    {
        "data": {
            "description": "Continues the study of the Turkish languages combined with Azerbaijani, which is a Turkic language closely related to Turkish. Learn Azerbaijani written in the Latin alphabet and its minor differences from Turkish.  Develop proficiency at the advanced level in listening, speaking, reading and writing in Turkish and in Azerbaijani.",
            "id": "GNS 539",
            "parent": "GNS",
            "title": "FIFTH SEMESTER TURKISH AND AZERI"
        }
    },
    {
        "data": {
            "description": "Introductory study of a Central Eurasian study, including introductory grammar to read, write and speak about daily life and interactions in the topic language. Upon completion, student can expect to possess a firm grammatical foundation for further study of oral and written Tajik, Uyghur, or Uzbek.",
            "id": "GNS 351",
            "parent": "GNS",
            "title": "FIRST SEMESTER CENTRAL EURASIAN LANGUAGE"
        }
    },
    {
        "data": {
            "description": "Continues the study of the Turkish language with an emphasis on four language skills: listening, reading, writing, and speaking in order to develop proficiency at the intermediate level. Improve communication in Turkish. Instruction will emphasize the language that is relevant to situations that students are likely to encounter if they travel to or live in Turkey. The secondary goal of the course is to improve students' understanding of Turkish  society and culture. Students  are deeply engaged in Turkish culture through history, literature, art and politics.",
            "id": "GNS 429",
            "parent": "GNS",
            "title": "INTERMEDIATE SUMMER IMMERSION TURKISH"
        }
    },
    {
        "data": {
            "description": "Selected studies in critical theory, continental philosophy, and/or literary criticism; topics may include German idealism, psychoanalysis, phenomenology, linguistics, Marxism, gender theory, critical race studies, religion, translation, poetics, media, migration studies, etc.",
            "id": "GNS 375",
            "parent": "GNS",
            "title": "PHILOSOPHY, THEORY, CRITICISM"
        }
    },
    {
        "data": {
            "description": "Introduction to the historiography of the Golden Horde and the Tatar, Kazak, and Uzbek nations; impact on Russia; Russian colonialism in Central Asia; innovative approaches to social and economic history. Not open to students with credit for LCA 640 prior to Fall 2019",
            "id": "GNS 624",
            "parent": "GNS",
            "title": "PROSEMINAR IN CENTRAL ASIAN HISTORY"
        }
    },
    {
        "data": {
            "description": "Critical survey of the development of medieval and modern literatures of the peoples of Central Asia from pre-Islamic times to the present with selected readings in English translation.  Not open to students with credit for LCA 314 prior to fall 2019.",
            "id": "GNS 324",
            "parent": "GNS",
            "title": "LITERATURES OF CENTRAL ASIA"
        }
    },
    {
        "data": {
            "description": "Building on skills learned in first semester Kazakh, learn to communicate in more extended situations. Information on holidays, traditions and colloquial phrases will be introduced. Pays special attention to reading and writing and to vocabulary expansion.",
            "id": "GNS 332",
            "parent": "GNS",
            "title": "SECOND SEMESTER KAZAKH"
        }
    },
    {
        "data": {
            "source": "GNS/JEWISH 105",
            "target": "GNS/JEWISH 106"
        }
    },
    {
        "data": {
            "source": "GNS 329",
            "target": "GNS 429"
        }
    },
    {
        "data": {
            "source": "GNS 332",
            "target": "GNS 431"
        }
    },
    {
        "data": {
            "description": "Continues the study of the Turkish language, focusing on four language skills--listening, reading, writing, and speaking--in order to develop proficiency at the intermediate level. In addition to the topics covered in previous semesters, learn more about the language through history, literature and art, in order to better understand its cultural codes.",
            "id": "GNS 440",
            "parent": "GNS",
            "title": "FOURTH SEMESTER TURKISH"
        }
    },
    {
        "data": {
            "id": "GNS",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Provides an introduction to the Kazakh language, which is a Turkic language spoken by about 11 million people in Kazakhstan, China, Mongolia, Turkey, Uzbekistan, Tajikistan, Turkmenistan, Russia, and Iran. Work within four language skills: listening, reading, writing, and speaking. Learn to communicate in Kazakh in authentic situations. Kazakh will be used as the primary language in classroom instructions, with minimal use of English for explanations of grammar.",
            "id": "GNS 331",
            "parent": "GNS",
            "title": "FIRST SEMESTER KAZAKH"
        }
    },
    {
        "data": {
            "source": "GNS 429",
            "target": "GNS 529"
        }
    },
    {
        "data": {
            "source": "GNS 431",
            "target": "GNS 432"
        }
    },
    {
        "data": {
            "description": "Intermediate topics in German, Nordic, and/or Slavic culture, folklore, lingusitics, and/or language.",
            "id": "GNS 370",
            "parent": "GNS",
            "title": "TOPICS IN GNS (INTERMEDIATE)"
        }
    },
    {
        "data": {
            "description": "Introduces advanced-level communication skills in Central Eurasian languages in varying settings. Students will learn a wide range of vocabulary, grammar structure and pragmatic usage in situated dialogues. They will improve four language skills (listening, speaking, reading and writing) and pragmatic competence through interactive and meaningful in-class activities and after-class assignments.",
            "id": "GNS 552",
            "parent": "GNS",
            "title": "SIXTH SEMESTER CENTRAL EURASIAN LANGUAGE"
        }
    },
    {
        "data": {
            "description": "Enhance speaking, listening, writing and reading skills. Build confidence in speaking about issues related to daily life.",
            "id": "GNS 532",
            "parent": "GNS",
            "title": "SIXTH SEMESTER KAZAKH"
        }
    },
    {
        "data": {
            "description": "A continuation of the study of Turkish language with Azerbaijani. Practice in understanding and employing Turkish at an advanced level, including spoken and written language in colloquial and professional modes. Analysis and interpretation of texts from a grammatical and cultural perspective.",
            "id": "GNS 540",
            "parent": "GNS",
            "title": "SIXTH SEMESTER TURKISH AND AZERI"
        }
    },
    {
        "data": {
            "source": "GNS 339",
            "target": "GNS 340"
        }
    },
    {
        "data": {
            "description": "Continues the study of the Turkish language, focusing on four language skills--listening, reading, writing, and speaking--in order to develop proficiency at the intermediate level. Improve communication in Turkish. Instruction will emphasize the language that is relevant to situations that students are likely to encounter if they travel to or live in Turkey. The secondary goal of the course is to improve students' understanding of Turkish society and culture.",
            "id": "GNS 439",
            "parent": "GNS",
            "title": "THIRD SEMESTER TURKISH"
        }
    },
    {
        "data": {
            "description": "Folklore of Central, Eastern and Northern Europe and among emigrants from these regions in North America. A survey of genres of folklore, history of research, and modes of interpretation, past and present.",
            "id": "FOLKLORE/GNS 200",
            "title": "FOLKLORE OF CENTRAL, EASTERN AND NORTHERN EUROPE"
        }
    },
    {
        "data": {
            "description": "Promotes the academic and professional development of graduate students in the humanities, in particular in the fields of German, Scandinavian, and Slavic studies. Students create and critique conference presentations, grant proposals, books reviews, CVs, and other important academic documents. The seminar includes visits from faculty in the various programs of German, Nordic, and Slavic.",
            "id": "GNS 700",
            "parent": "GNS",
            "title": "GRADUATE SEMINAR IN PROFESSIONAL DEVELOPMENT"
        }
    },
    {
        "data": {
            "source": "GNS 429",
            "target": "GNS 460"
        }
    },
    {
        "data": {
            "source": "GNS 539",
            "target": "GNS 540"
        }
    },
    {
        "data": {
            "description": "Continues the study of the Kazakh language with an emphasis on four language skills: listening, reading, writing, and speaking in order to develop proficiency at the intermediate level. The primary goal is to improve communication in Kazakh. Instruction will emphasize the language that is relevant to situations that students are likely to encounter if they travel to or live in Kazakhstan. The secondary goal of the course is to improve students' understanding of Kazakh society and culture.",
            "id": "GNS 431",
            "parent": "GNS",
            "title": "THIRD SEMESTER KAZAKH"
        }
    },
    {
        "data": {
            "description": "Improve reading skills in Turkish by also developing and employing analytical skills to comprehend, identify and respond to salient features of the contemporary Turkish society. Acquire skills to comprehend a variety of texts within Turkey's social and political framework. Designed for students participating in the Turkish Overseas Flagship Program.",
            "id": "GNS 460",
            "parent": "GNS",
            "title": "READINGS IN TURKISH: CONTEMPORARY TURKEY THROUGH LITERATURE AND MEDIA"
        }
    },
    {
        "data": {
            "source": "GNS 440",
            "target": "GNS 539"
        }
    },
    {
        "data": {
            "description": "Introduces advanced-level communication skills in Central Eurasian languages in varying settings. Students will learn a wide range of vocabulary, grammar structure and pragmatic usage in situated dialogues. They will improve four language skills (listening, speaking, reading and writing) and pragmatic competence through interactive and meaningful in-class activities and after-class assignments.",
            "id": "GNS 551",
            "parent": "GNS",
            "title": "FIFTH SEMESTER CENTRAL EURASIAN LANGUAGE"
        }
    },
    {
        "data": {
            "description": "Examination of human geography, ethnicity, nomadism and pastoralism, oases cultures, religion and international politics of the silk routes of central Asia. Not open to students with credit for HIST 265 prior to Fall 2018.",
            "id": "GNS/HISTORY 265",
            "title": "AN INTRODUCTION TO CENTRAL ASIA: FROM THE SILK ROUTE TO AFGHANISTAN"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Enhance speaking, listening, writing and reading skills. Build confidence in speaking about issues related to daily life.",
            "id": "GNS 531",
            "parent": "GNS",
            "title": "FIFTH SEMESTER KAZAKH"
        }
    },
    {
        "data": {
            "description": "Third semester level language taught in an intensive 8-week summer language program.",
            "id": "GNS 451",
            "parent": "GNS",
            "title": "THIRD SEMESTER CENTRAL EURASIAN LANGUAGE"
        }
    },
    {
        "data": {
            "source": "GNS 432",
            "target": "GNS 531"
        }
    },
    {
        "data": {
            "description": "Provides an introduction to the Turkish language, which is spoken by more than 80 million people in Turkey and Europe. Work within four language skills: listening, reading, writing, and speaking. Learn to communicate in Turkish in authentic situations. Turkish will be used as the primary language in classroom instructions, with minimal use of English.",
            "id": "GNS 339",
            "parent": "GNS",
            "title": "FIRST SEMESTER TURKISH"
        }
    },
    {
        "data": {
            "description": "Continues the study of the Turkish language with an emphasis on four language skills: listening, reading, writing, and speaking in order to develop proficiency at the advanced level. Improve communication in Turkish. Instruction will emphasize the language that is relevant to situations that students are likely to encounter if they travel to or live in Turkey. The secondary goal of the course is to improve students' understanding of Turkish society and culture. Students are deeply engaged in Turkish culture through history, literature, art and politics.",
            "id": "GNS 529",
            "parent": "GNS",
            "title": "ADVANCED SUMMER IMMERSION TURKISH"
        }
    },
    {
        "data": {
            "description": "Introductory study of a Central Eurasian study, including introductory grammar to read, write and speak about daily life and interactions in the topic language. Upon completion, student can expect to possess a firm grammatical foundation for further study of oral and written Tajik, Uyghur, or Uzbek.",
            "id": "GNS 352",
            "parent": "GNS",
            "title": "SECOND SEMESTER CENTRAL EURASIAN LANGUAGE"
        }
    },
    {
        "data": {
            "description": "Continue to learn more about the Kazakh language through history, literature and art, in order to better understand its cultural codes.",
            "id": "GNS 432",
            "parent": "GNS",
            "title": "FOURTH SEMESTER KAZAKH"
        }
    },
    {
        "data": {
            "description": "Introduction to the Yiddish language through speaking, listening, reading, and writing. Emphasis on communication with attention to cultural and historical context.",
            "id": "GNS/JEWISH 105",
            "title": "FIRST SEMESTER YIDDISH"
        }
    },
    {
        "data": {
            "source": "GNS 439",
            "target": "GNS 440"
        }
    },
    {
        "data": {
            "source": "GNS 440",
            "target": "GNS 529"
        }
    },
    {
        "data": {
            "description": "Advanced topics in East European and Central Asian culture, folklore, lingusitics, and/or language.",
            "id": "GNS 471",
            "parent": "GNS",
            "title": "ADVANCED TOPICS IN EAST EUROPEAN AND CENTRAL ASIAN LANGUAGES AND CULTURES"
        }
    },
    {
        "data": {
            "description": "Exploration of the ideals and realities of sustainability in Central, Northern and East European contexts. Cultural, historical, environmental and other perspectives on sustainability on a local and global scale.",
            "id": "ENVIRST/GNS 210",
            "title": "CULTURES OF SUSTAINABILITY: CENTRAL, EASTERN, AND NORTHERN EUROPE"
        }
    },
    {
        "data": {
            "source": "GNS 340",
            "target": "GNS 439"
        }
    },
    {
        "data": {
            "description": "Introduces intermediate-level communication skills in Central Eurasian languages in varying settings. Students will learn a wide range of vocabulary, grammar structure and pragmatic usage in situated dialogues. They will improve four language skills (listening, speaking, reading and writing) and pragmatic competence through interactive and meaningful in-class activities and after-class assignments.",
            "id": "GNS 452",
            "parent": "GNS",
            "title": "FOURTH SEMESTER CENTRAL EURASIAN LANGUAGE"
        }
    },
    {
        "data": {
            "description": "Elementary topics in German, Nordic, and/or Slavic culture, folklore, linguistics, and/or language.",
            "id": "GNS 270",
            "parent": "GNS",
            "title": "INTRODUCTORY TOPICS IN GNS"
        }
    },
    {
        "data": {
            "description": "Provides students with an introduction to the Turkish language, which is  spoken by more than 80 million people in Turkey and Europe. Work within four language skills: listening, reading, writing, and speaking. Provides to communicate in more extended situations in Turkish. Information on holidays, traditions and colloquial phrases will be introduced. Besides everyday Turkish, learn written Turkish such as formal letters, orders and messages. Pays special attention to reading and writing and to vocabulary expansion.",
            "id": "GNS 329",
            "parent": "GNS",
            "title": "ELEMENTARY SUMMER IMMERSION TURKISH"
        }
    },
    {
        "data": {
            "source": "GNS 531",
            "target": "GNS 532"
        }
    },
    {
        "data": {
            "description": "Building on skills learned in first semester Turkish, learn to communicate in more extended situations. Information on holidays, traditions and colloquial phrases will be introduced. Besides everyday Turkish, learn written Turkish such as formal letters, orders and messages. Pays special attention to reading and writing and to vocabulary expansion.",
            "id": "GNS 340",
            "parent": "GNS",
            "title": "SECOND SEMESTER TURKISH"
        }
    }
]