[
    {
        "data": {
            "description": "From Teddy Roosevelt's 1909 African safari to the Hollywood blockbuster King Kong, from the world of Walt Disney to The March of the Penguins, cinema has been a powerful force in shaping public and scientific understanding of nature throughout the twentieth and twenty-first century. How can film shed light on changing environmental ideas and beliefs in American thought, politics, and culture? And how can we come to see and appreciate contested issues of race, class, and gender in nature on screen? Explore such questions and come to understand the role of film in helping to define the contours of past, present, and future environmental visions in the United States, and their impact on the real world struggles of people and wildlife throughout the world.",
            "id": "ENVIRST/HISTORY/HISTSCI 125",
            "title": "GREEN SCREEN: ENVIRONMENTAL PERSPECTIVES THROUGH FILM"
        }
    },
    {
        "data": {
            "description": "Scientific, social, religious and related dimensions of the evolution hypothesis from predarwinian speculation and Darwin's own work to later support, criticism and continuing investigation. Coverage reaches into the twentieth century.",
            "id": "HISTSCI 343",
            "parent": "HISTSCI",
            "title": "THE DARWINIAN REVOLUTION"
        }
    },
    {
        "data": {
            "description": "Survey of Muslim religious understandings of science, technology, nature and environment. Gain a global perspective through case studies, covering sources such as the Qur'an, theology and law, and traditions of esoteric piety (mysticism), and historical and contemporary issues like medical ethics, virtual realities, and environmental change, challenge and crisis.",
            "id": "ENVIRST/HISTSCI/RELIGST 356",
            "title": "ISLAM, SCIENCE & TECHNOLOGY, AND THE ENVIRONMENT"
        }
    },
    {
        "data": {
            "description": "A survey of different conceptions of how the body as a site of sickness has been understood from Antiquity to contemporary medicine. Includes consideration of the origins and evolution of public health, the changing social role of healers, and the emergence of the modern \"standardized\" body in health and illness.",
            "id": "HISTSCI/MEDHIST 212",
            "title": "BODIES, DISEASES, AND HEALERS: AN INTRODUCTION TO THE HISTORY OF MEDICINE"
        }
    },
    {
        "data": {
            "description": "Advanced readings in primary and secondary literature of the history of the 16th-17th century European science, with emphasis on current historiographic issues.",
            "id": "HISTSCI 623",
            "parent": "HISTSCI",
            "title": "STUDIES IN EARLY MODERN SCIENCE"
        }
    },
    {
        "data": {
            "description": "Advanced research in History of Science.",
            "id": "HISTSCI 555",
            "parent": "HISTSCI",
            "title": "UNDERGRADUATE SEMINAR IN HISTORY OF SCIENCE"
        }
    },
    {
        "data": {
            "description": "An historical survey of the main lines of mathematical development.",
            "id": "HISTSCI/MATH 473",
            "title": "HISTORY OF MATHEMATICS"
        }
    },
    {
        "data": {
            "description": "An introduction to the formative period of modern science, including major ideas and events in the physical and life sciences from Copernicus to Newton.",
            "id": "HISTORY/HISTSCI 323",
            "title": "THE SCIENTIFIC REVOLUTION: FROM COPERNICUS TO NEWTON"
        }
    },
    {
        "data": {
            "description": "An introduction to the history of the computer from the 1940s to the present day, major developments in computer science and technology in their historical contexts, and recent trends in computing and society. We learn about machines, but emphasize the study of people: the institutions, scientists, workers, and social movements that invented, facilitated, and transformed digital technology in the 20th and early 21st century.",
            "id": "HISTSCI 150",
            "parent": "HISTSCI",
            "title": "THE DIGITAL AGE"
        }
    },
    {
        "data": {
            "description": "Analyze historical factors impacting healthcare cost, access, and services with focus on social determinants of health in the United States across the long 20th century. Evaluate current state of the field through literature reviews and conversations with guest lecturers. Apply historical analysis in consideration of current disparities in health resources. Produce original research project and policy proposal at intersection of public health, medical history, and health law and policy.",
            "id": "HISTSCI 360",
            "parent": "HISTSCI",
            "title": "HEALTH INEQUALITIES IN THE LONG 20TH CENTURY"
        }
    },
    {
        "data": {
            "description": "Analyzes the scientific and social aspects of the development of modern medicine and public health in Europe and America.",
            "id": "HISTSCI/MEDHIST 919",
            "title": "GRADUATE STUDIES IN MEDICAL HISTORY"
        }
    },
    {
        "data": {
            "description": "Application of geology to problems resulting from the ever more intense use of the earth and its resources.",
            "id": "ENVIRST/GEOSCI 106",
            "title": "ENVIRONMENTAL GEOLOGY"
        }
    },
    {
        "data": {
            "description": "Conduct original historical research and convey the results to others. Through engagement with archival materials, become historical detectives; practice defining important historical questions, collecting and analyzing evidence, presenting original conclusions, and contributing to ongoing discussions. Confer individually with and receive feedback from instructors to improve skills of historical analysis and communication in both written and spoken formats. May not be repeated for credit.",
            "id": "HISTORY 201",
            "parent": "HISTORY",
            "title": "THE HISTORIAN'S CRAFT"
        }
    },
    {
        "data": {
            "description": "Conduct original historical research in the fields of history of science, medicine, or technology and convey the results to others. Become historical detectives through engagement with archival materials and disciplinary methodologies in the histories of science, medicine and technology; practice defining important historical questions, collecting and analyzing evidence, presenting original conclusions, and contributing to ongoing discussions. Confer individually with and receive feedback from instructors to improve skills of historical analysis and communication in written and other formats. May not be repeated for credit.",
            "id": "HISTSCI 211",
            "parent": "HISTSCI",
            "title": "THE HISTORIAN'S CRAFT: SCIENCE, MEDICINE, AND TECHNOLOGY"
        }
    },
    {
        "data": {
            "description": "Considers the social and cultural history of 20th and early 21st century American medicine through the depiction of health care practitioners and health care systems in Hollywood movies. View films that featured medicine, doctors, nurses, patients, and hospitals. Using these films as primary sources, seek to place these representations into a broader social and cultural context. Evaluate the extent to which popular understandings of medicine, health, and healing as portrayed in the films corresponded to actual practices of medicine and medical research at the time the films were first screened for mass audiences.",
            "id": "HISTORY/HISTSCI 171",
            "title": "HISTORY OF MEDICINE IN FILM"
        }
    },
    {
        "data": {
            "description": "Development of economic thought from the middle ages to the present; emphasis on major schools of thought including Classical, Marxian, Neo-Classical, and Keynesian schools.",
            "id": "ECON/HISTSCI 305",
            "title": "DEVELOPMENT OF ECONOMIC THOUGHT"
        }
    },
    {
        "data": {
            "description": "Dig into the history of plant sciences to understand why plants and humans have the relationships they do today.  Focus on the experiences of Indigenous Americans and People of Color to understand the roots of inequities in horticulture, agriculture, and other plant sciences. Practice skills as a translator of science and history through engagement with scientific publications, library resources, and archival materials. Define important societal questions, collect and analyze evidence, present original conclusions, and contribute to ongoing discussions about the relationship of people and plants.  Includes intensive writing and oral presentations.",
            "id": "HISTSCI/HORT 301",
            "title": "(HORTI)CULTURAL ROOTS: HUMAN HISTORIES OF PLANTS AND SCIENCE"
        }
    },
    {
        "data": {
            "description": "Directed study under the supervision of a faculty member on topics in History of Science, Medicine, and Technology. Graded on a Cr/N basis.",
            "id": "HISTSCI 698",
            "parent": "HISTSCI",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Directed study under the supervision of a faculty member on topics in History of Science, Medicine, and Technology. Graded on a lettered basis.",
            "id": "HISTSCI 699",
            "parent": "HISTSCI",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Directed study under the supervision of a faculty member.",
            "id": "HISTSCI 999",
            "parent": "HISTSCI",
            "title": "INDEPENDENT WORK"
        }
    },
    {
        "data": {
            "description": "Economic problems of individuals, firms and industries with emphasis on value, price, and distribution of income.",
            "id": "ECON 101",
            "parent": "ECON",
            "title": "PRINCIPLES OF MICROECONOMICS"
        }
    },
    {
        "data": {
            "description": "Emergence of scientific method and scientific modes of thought out of ancient philosophical and religious traditions; the impact of ancient science on medieval Christendom; the origins and development of the Copernican-Newtonian world view.",
            "id": "HISTSCI 201",
            "parent": "HISTSCI",
            "title": "THE ORIGINS OF SCIENTIFIC THOUGHT"
        }
    },
    {
        "data": {
            "description": "Examines the history of illness and medical practice in Latin America and the Caribbean from the colonial era until the present. Using an interdisciplinary set of sources, students will explore the different meanings of disease, body normativity, medical practice, and ideas about public health across different historical circumstances in the region.",
            "id": "HISTORY/HISTSCI/MEDHIST 564",
            "title": "DISEASE, MEDICINE AND PUBLIC HEALTH IN THE HISTORY OF LATIN AMERICA AND THE CARIBBEAN"
        }
    },
    {
        "data": {
            "description": "Explores how a humanistic perspective can broaden our understanding of health and medicine. Specifically, we will examine the role of language and culture in the creation and circulation of biomedical knowledge; our lived experiences with illness (physical and mental); the intricate intersections of race, gender, sexuality, disability and medicine; the political dimensions of diagnosis, disease, and epidemics, and the role that fiction, creative non-fiction, comics, and film play in shaping our experiences with health and medicine as health care providers and as patients. The course does not assume any background in science or medicine. One of our recurrent topics, in fact, will be to consider how non-experts interact with medicine and its technical vocabularies. Although the primary objective of the course is to understand the cultural, social, and political dimensions of health and medicine, a secondary objective is for students to become more savvy patients and, for the few students who might emerge on the other side of the stethoscope one day, more well rounded health care professionals.",
            "id": "ENGL/HISTSCI/MEDHIST 525",
            "title": "HEALTH AND THE HUMANITIES"
        }
    },
    {
        "data": {
            "description": "From medical advancements to environmental crises and global food shortages, the life sciences are implicated in some of the most pressing social issues of our time. Explores events in the history of biology from the mid-twentieth century to today, and examines how developments in this science have shaped and are shaped by society. Investigates the origins of the institutions, technologies, and styles of practice that characterize contemporary biology, such as the use of mice as \"model organisms\" for understanding human diseases. Examines biological controversies such as the introduction of genetically modified plants into the food supply. Explores how biological facts and theories have been and continue to be used as a source for understanding ourselves.",
            "id": "HISTSCI 133",
            "parent": "HISTSCI",
            "title": "BIOLOGY AND SOCIETY, 1950 - TODAY"
        }
    },
    {
        "data": {
            "description": "Geologic processes; structure and history of the earth; earthquakes, volcanos, glaciers, groundwater, minerals, rocks, deserts, fossils; topographic and geologic maps; climate change on geologic and human time scales.",
            "id": "GEOSCI 100",
            "parent": "GEOSCI",
            "title": "INTRODUCTORY GEOLOGY: HOW THE EARTH WORKS"
        }
    },
    {
        "data": {
            "description": "Health problems in the U.S. from the colonial period to the twentieth century; efforts made toward their solutions.",
            "id": "HISTSCI/MEDHIST 509",
            "title": "THE DEVELOPMENT OF PUBLIC HEALTH IN AMERICA"
        }
    },
    {
        "data": {
            "description": "Honors thesis on topics in History of Science, Medicine, and Technology. Continuation ofHIST SCI 681.",
            "id": "HISTSCI 682",
            "parent": "HISTSCI",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Honors thesis on topics in History of Science, Medicine, and Technology.",
            "id": "HISTSCI 681",
            "parent": "HISTSCI",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "How did today's biology emerge out of the diverse traditions of agriculture and natural history (bees and trees), biomedicine and molecular biology (germs and genes), which stretch back into the eighteenth century? Examines classic texts and \"game-changers\" in the history of biology, putting them into broader scientific and social contexts to see how these different ways of knowing intertwined, competed, and yielded novel approaches to the study of life that still shape today's life sciences.",
            "id": "HISTORY/HISTSCI/MEDHIST 132",
            "title": "BEES, TREES, GERMS, AND GENES: A HISTORY OF BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Independent research and writing of a thesis under the supervision of a faculty member.",
            "id": "HISTSCI 990",
            "parent": "HISTSCI",
            "title": "RESEARCH AND THESIS"
        }
    },
    {
        "data": {
            "description": "Integrated treatment of macroeconomics and microeconomics (seeECON 101andECON 102). Accelerated approach to economics training, especially for Economics: Math Emphasis majors.",
            "id": "ECON 111",
            "parent": "ECON",
            "title": "PRINCIPLES OF ECONOMICS-ACCELERATED TREATMENT"
        }
    },
    {
        "data": {
            "description": "Intensive exploration of issues in the history of science. Emphasis on developing critical thinking about science through discussion of readings and written exercises.",
            "id": "HISTSCI 286",
            "parent": "HISTSCI",
            "title": "HONORS SEMINAR: STUDIES IN SCIENCE, TECHNOLOGY, MEDICINE"
        }
    },
    {
        "data": {
            "description": "Intensive exploration of issues in the history of science. Emphasis on developing critical thinking about science through formal and informal writing.",
            "id": "HISTSCI 280",
            "parent": "HISTSCI",
            "title": "HONORS SEMINAR: STUDIES IN SCIENCE, TECHNOLOGY, MEDICINE"
        }
    },
    {
        "data": {
            "description": "Introduction to economic ways of thinking about a wide range of problems and issues. Topics include consumption, production, prices, markets, finance, trade, pollution, growth, farms, taxes, and development.",
            "id": "AAE 101",
            "parent": "AAE",
            "title": "INTRODUCTION TO AGRICULTURAL AND APPLIED ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Introduction to the development of the modern American medical care system.",
            "id": "HISTSCI 218",
            "parent": "HISTSCI",
            "title": "HISTORY OF TWENTIETH CENTURY AMERICAN MEDICINE"
        }
    },
    {
        "data": {
            "description": "Introduction to the study of religion, science, and medicine. Focus on how religion, science, and medicine have shaped practices of knowledge production and meaning making with respect to human life, by considering theories of human history and racial progress; how logics of contagion structure human relationships and communal boundaries; the variety of ways of understanding and caring for bodies; and the place of humans within broader ecologies.",
            "id": "HISTSCI/MEDHIST/RELIGST 331",
            "title": "SCIENCE, MEDICINE AND RELIGION"
        }
    },
    {
        "data": {
            "description": "Macroeconomic measurement and models of aggregate demand and supply; fiscal and monetary policy for unemployment, inflation, and growth.",
            "id": "ECON 102",
            "parent": "ECON",
            "title": "PRINCIPLES OF MACROECONOMICS"
        }
    },
    {
        "data": {
            "description": "Major concepts from earliest to modern times.",
            "id": "GEOSCI/HISTSCI 514",
            "title": "HISTORY OF GEOLOGIC THOUGHT"
        }
    },
    {
        "data": {
            "description": "Major problems in international health from 1750 to the present. Focus on disease epidemiology and ecology; political economy of health; migration; quarantine; race, ethnicity, and health care; international health research; cross-cultural healing; mental and maternal health; growth of international health organizations.",
            "id": "HISTSCI/MEDHIST/POPHLTH 553",
            "title": "INTERNATIONAL HEALTH AND GLOBAL SOCIETY"
        }
    },
    {
        "data": {
            "description": "Major trends and developments in the sciences from the 17th century to the early 20th century. Emphasis on those with broad cultural and social implications.",
            "id": "HISTSCI 202",
            "parent": "HISTSCI",
            "title": "THE MAKING OF MODERN SCIENCE"
        }
    },
    {
        "data": {
            "description": "Medicine in Europe from the 18th century to mid-20th century, investigating changes in disease and demography, state interest in health care, the medical professions, and both scientific and alternative medical ideas.",
            "id": "HISTORY/HISTSCI/MEDHIST 508",
            "title": "HEALTH, DISEASE AND HEALING II"
        }
    },
    {
        "data": {
            "description": "Offers an introduction to the history of technology centered around the relationship between technology and various forms of social inequality. Addresses: 1) how gendered, racial, and class-based disparities have shaped the history of technology; 2) how forms of engineered inequity have intersected with state-building, colonial projects, environmental degradation, and revolutionary programs; 3) how technology has been implicated in attempts to imagine a more just society. Introduces central themes and concepts in the histories of science, medicine, and especially technology. Examines case-studies that are transnational in scope and move chronologically from the 17th century to the present. Also gives significant attention to histories of technology that originated outside of the U.S. and Europe.",
            "id": "HISTSCI 160",
            "parent": "HISTSCI",
            "title": "ENGINEERING INEQUALITY: TECHNOLOGY AND INEQUITY THROUGHOUT HISTORY"
        }
    },
    {
        "data": {
            "description": "Offers students enrolled in the Health and the Humanities certificate an opportunity to conduct independent research under the guidance of a faculty member. It allows students who have enrolled in or completed  a Health and the Humanities Capstone an opportunity to go into greater depth on a topic covered in the capstone course. In consultation with a faculty member, students will design a project that builds on lessons learned or work completed as part of their capstone experience.",
            "id": "ENGL/HISTSCI/MEDHIST 599",
            "title": "DIRECTED STUDY IN HEALTH AND THE HUMANITIES"
        }
    },
    {
        "data": {
            "description": "Pharmaceutical field, from antiquity to modern medical care; professional; structuring in principal countries of the West.",
            "id": "HISTSCI/S&APHM 401",
            "title": "HISTORY OF PHARMACY"
        }
    },
    {
        "data": {
            "description": "Philosophies, methods, and sources in the history of science, and their relations to the current state of scholarship.",
            "id": "HISTSCI 720",
            "parent": "HISTSCI",
            "title": "PROSEMINAR: HISTORIOGRAPHY AND METHODS"
        }
    },
    {
        "data": {
            "description": "Physical evolution of the earth and its relationship to the development of life through geologic time. Includes field trip.",
            "id": "GEOSCI 204",
            "parent": "GEOSCI",
            "title": "GEOLOGIC EVOLUTION OF THE EARTH"
        }
    },
    {
        "data": {
            "description": "Provides an introduction to the intersections of health and environment on a global scale.  Exposes students to a range of problems in global environmental health, including climate change, disease ecology, and the globalization of disease.",
            "id": "ENVIRST/HISTSCI 213",
            "title": "GLOBAL ENVIRONMENTAL HEALTH: AN INTERDISCIPLINARY INTRODUCTION"
        }
    },
    {
        "data": {
            "description": "Provides historical perspectives on current dilemmas facing black patients and health care professionals.",
            "id": "AFROAMER/HISTSCI/MEDHIST 523",
            "title": "RACE, AMERICAN MEDICINE AND PUBLIC HEALTH"
        }
    },
    {
        "data": {
            "description": "Readings and/or research on the history of biology and medicine. Topics vary.",
            "id": "HISTSCI 909",
            "parent": "HISTSCI",
            "title": "HISTORY OF BIOLOGY AND MEDICINE"
        }
    },
    {
        "data": {
            "description": "Readings and/or research on the history of medieval, Renaissance, and/or 17th-century science. Topics vary.",
            "id": "HISTSCI 903",
            "parent": "HISTSCI",
            "title": "SEMINAR: MEDIEVAL, RENAISSANCE, AND 17TH CENTURY SCIENCE"
        }
    },
    {
        "data": {
            "description": "Readings and/or research on the history of science in the 18th century. Topics vary.",
            "id": "HISTSCI 911",
            "parent": "HISTSCI",
            "title": "SEMINAR-EIGHTEENTH CENTURY SCIENCE"
        }
    },
    {
        "data": {
            "description": "Readings and/or research on the history of science, medicine, and technology. Topics vary.",
            "id": "HISTSCI 921",
            "parent": "HISTSCI",
            "title": "SEMINAR-SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "Readings/discussion of varying topics in History of Science, Medicine, and Technology.",
            "id": "HISTSCI 350",
            "parent": "HISTSCI",
            "title": "SPECIAL TOPICS IN THE HISTORY OF SCIENCE"
        }
    },
    {
        "data": {
            "description": "Research and readings on a topic of current interest in history of technology.",
            "id": "HISTSCI 907",
            "parent": "HISTSCI",
            "title": "SEMINAR: HISTORY OF TECHNOLOGY"
        }
    },
    {
        "data": {
            "description": "Senior thesis on topics in History of Science, Medicine, and Technology. Continuation ofHIST SCI 691.",
            "id": "HISTSCI 692",
            "parent": "HISTSCI",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Senior thesis on topics in History of Science, Medicine, and Technology.",
            "id": "HISTSCI 691",
            "parent": "HISTSCI",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Special topics in the history of science, medicine, and technology.",
            "id": "HISTSCI 250",
            "parent": "HISTSCI",
            "title": "SPECIAL TOPICS IN HISTORY OF SCIENCE (INTRODUCTORY)"
        }
    },
    {
        "data": {
            "description": "Surveys the medical and scientific constructions of categories of race, placing the development of racial theories in a broad social and political context. Pays particular attention to the importance of racial science in slavery and colonialism.",
            "id": "AFROAMER/HISTSCI 275",
            "title": "SCIENCE, MEDICINE, AND RACE: A HISTORY"
        }
    },
    {
        "data": {
            "description": "The development of astronomical knowledge and cosmological views from the earliest times to the present, viewed in their social, philosophical, and technological contexts.",
            "id": "ASTRON/HISTSCI 206",
            "title": "HISTORY OF ASTRONOMY AND COSMOLOGY"
        }
    },
    {
        "data": {
            "description": "This course demonstrates that human bodies have social and cultural histories. It will highlight the social values placed on different bodies, the changing social expectations bodies create, and the role of science and medicine in creating the cultural meanings of bodies.",
            "id": "GEN&WS/HISTSCI/MEDHIST 532",
            "title": "THE HISTORY OF THE (AMERICAN) BODY"
        }
    },
    {
        "data": {
            "description": "Topics in the history of technology. Themes include the social basis of technical change, the impact of technology on everyday life, and ethical issues in technology in the last four centuries.",
            "id": "HISTSCI 222",
            "parent": "HISTSCI",
            "title": "TECHNOLOGY AND SOCIAL CHANGE IN HISTORY"
        }
    },
    {
        "data": {
            "description": "Upper-level special topics course in the history of medicine.",
            "id": "HISTSCI/MEDHIST 668",
            "title": "TOPICS IN HISTORY OF MEDICINE"
        }
    },
    {
        "data": {
            "description": "Using a reproductive justice framework, analyze contexts, experiences, practices, ideologies, and historiographies of childbirth in the United States from roughly the 17th century to the present, with the heaviest emphasis on the 20th and 21st century. Examines the ways that colonization, genocide, enslavement, racism, capitalism, heterosexism, patriarchy, and ableism have shaped all of these aspects of childbirth. Inquire how key movements and groups resisting some of these forms of oppression have had the power to reshape birth, as well as locating in birth a source of transformational power.",
            "id": "GEN&WS/HISTSCI 537",
            "title": "CHILDBIRTH IN THE UNITED STATES"
        }
    },
    {
        "data": {
            "description": "What is disease? Who decides? What are the consequences of labeling a behavior a disease? Can disease be a tool of liberation? Can disease be an instrument of oppression? How do race, class, and gender affect our understandings of and experiences with illness? How have diseases shaped American history? Illustrates the various ways disease operates in America and examines the role of disease on at least four levels--political, social, cultural, and personal--to demonstrate that diseases are not merely bodily afflictions; they are also participants in the body politic. Each disease covered is chosen to illustrate a different point about the social and cultural lives of disease in the history of the United States. Though diseases are covered in a chronological fashion, this coverage is not meant as a narrative history of disease.",
            "id": "HISTSCI 404",
            "parent": "HISTSCI",
            "title": "A HISTORY OF DISEASE"
        }
    },
    {
        "data": {
            "description": "Women as patients and as health professionals in America from the colonial period to the present.",
            "id": "GEN&WS/HISTSCI/MEDHIST 531",
            "title": "WOMEN AND HEALTH IN AMERICAN HISTORY"
        }
    },
    {
        "data": {
            "id": "AAE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ECON",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "GEOSCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "HISTORY",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "HISTSCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "AAE 101",
            "target": "ECON/HISTSCI 305"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON/HISTSCI 305"
        }
    },
    {
        "data": {
            "source": "ECON 102",
            "target": "ECON 111"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON 101"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON 102"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON/HISTSCI 305"
        }
    },
    {
        "data": {
            "source": "ENVIRST/GEOSCI 106",
            "target": "GEOSCI 100"
        }
    },
    {
        "data": {
            "source": "GEOSCI 100",
            "target": "ENVIRST/GEOSCI 106"
        }
    },
    {
        "data": {
            "source": "GEOSCI 100",
            "target": "GEOSCI 204"
        }
    },
    {
        "data": {
            "source": "GEOSCI 204",
            "target": "GEOSCI/HISTSCI 514"
        }
    },
    {
        "data": {
            "source": "HISTORY 201",
            "target": "HISTSCI 211"
        }
    },
    {
        "data": {
            "source": "HISTORY 201",
            "target": "HISTSCI 555"
        }
    },
    {
        "data": {
            "source": "HISTORY/HISTSCI 323",
            "target": "HISTSCI 201"
        }
    },
    {
        "data": {
            "source": "HISTSCI 211",
            "target": "HISTORY 201"
        }
    },
    {
        "data": {
            "source": "HISTSCI 623",
            "target": "HISTORY/HISTSCI 323"
        }
    }
]