[
    {
        "data": {
            "description": "America's relations with the world, emphasizing the economic, political and ideological elements determining policy.",
            "id": "HISTORY 434",
            "parent": "HISTORY",
            "title": "AMERICAN FOREIGN RELATIONS, 1901 TO THE PRESENT"
        }
    },
    {
        "data": {
            "description": "As an introduction to Southeast Asia, covers the ethnic, cultural, religious, and political histories of the region from the classical states period to the present, with an emphasis on colonialism, nationalism, decolonization, and the emergence of modern political and social systems into the 21st century, including an exposure to region's contemporary literature. Not open to students who completed LCA 244 prior to Fall 2019.",
            "id": "ASIAN/GEOG/HISTORY/POLISCI/SOC 244",
            "title": "INTRODUCTION TO SOUTHEAST ASIA:  VIETNAM TO THE PHILIPPINES"
        }
    },
    {
        "data": {
            "description": "Civil rights history from 1930-1970. Legal, historical and economic origins of the civil rights movement. Study of the movement's impact on United States culture, politics, and international relations.",
            "id": "AFROAMER/HISTORY 628",
            "title": "HISTORY OF THE CIVIL RIGHTS MOVEMENT IN THE UNITED STATES"
        }
    },
    {
        "data": {
            "description": "Covers the graphs, properties and geometric significance of trigonometric functions of a real variable. Other topics include trigonometric equations and identities, application, trigonometric form of complex numbers, DeMoivre's theorem, and polar and parametric equations. The course also has a significant number of applications, especially related to other disciplines.",
            "id": "MATH 113",
            "parent": "MATH",
            "title": "TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "European intellectual history in the 17th and 18th centuries, from the Wars of Religion to the French Revolution. Examines the rise of Enlightenment thought in relation to political and religious conflict, revolutions in science and philosophy, and the emergence of the public sphere. Special attention is paid to the Enlightenment's relationship to religion and to contemporary critiques made of Enlightenment thinking, including those of the early Romantic movement.",
            "id": "HISTORY/RELIGST 411",
            "title": "THE ENLIGHTENMENT AND ITS CRITICS"
        }
    },
    {
        "data": {
            "description": "Events leading to the Pearl Harbor attack, the conduct of World War II in the Pacific, the nature of the wartime Japanese state and effects of the war on Japanese society, the dropping of the atomic bombs, and Japan's decision to surrender. The war as an epoch in Japanese history.",
            "id": "ASIAN/HISTORY 456",
            "title": "PEARL HARBOR & HIROSHIMA: JAPAN, THE US & THE CRISIS IN ASIA"
        }
    },
    {
        "data": {
            "description": "Examines the development of prisons from the ancient Mediterranean world to the present in the US and Europe. Pays particular attention to the way in which imprisonment has been used against marginalized populations. Examines the development of carceral tactics across a number of registers, including the prison as an ancient political tactic, the economic logic of early modern debtors' prisons, the relationship of prisons and workhouses to forms of capitalism, prisons and colonial expansion, the relationship between mass incarceration and democratic forms of government, as well as the connections between the abolition of slavery and modern carceral practices. Also looks at the legal and constitutional limitations that have been put on imprisonment by the American legal system. Relies on interdisciplinary approaches to the study of prisons, including History, law, literature, and political theory.",
            "id": "HISTORY/LEGALST 235",
            "title": "PRISONS: FROM ANTIQUITY TO SUPERMAX"
        }
    },
    {
        "data": {
            "description": "Explores a new approach to a part of the world with a very old history, but one that is now as 'modern' as any. The changing, complex relations between Europeans and their environments from antiquity to the twenty-first century offer instructive comparison with American and current global environmental concerns. Approaching Mediterranean and Western civilizations from an environmental viewpoint also offers fresh perspective on these enduring cultures.",
            "id": "ENVIRST/HISTORY 328",
            "title": "ENVIRONMENTAL HISTORY OF EUROPE"
        }
    },
    {
        "data": {
            "description": "Focuses on sex/gender crossing and variation in historical contexts including Japan, South Africa, Europe, the African diaspora, and North America. Considers perspectives of people who themselves passed, crossed, transitioned, transed, or otherwise exceeded their culture's definitions of normative sex/gender. Alongside, consider the ways that dominant social institutions reinforced norms, recognized, tolerated, punished and/or celebrated gender variation. Examine popular culture, medical and legal perspectives, memoir, queer and trans theory, and social movement treatises.",
            "id": "GEN&WS/HISTORY 346",
            "title": "TRANS/GENDER IN HISTORICAL PERSPECTIVE"
        }
    },
    {
        "data": {
            "description": "From Teddy Roosevelt's 1909 African safari to the Hollywood blockbuster King Kong, from the world of Walt Disney to The March of the Penguins, cinema has been a powerful force in shaping public and scientific understanding of nature throughout the twentieth and twenty-first century. How can film shed light on changing environmental ideas and beliefs in American thought, politics, and culture? And how can we come to see and appreciate contested issues of race, class, and gender in nature on screen? Explore such questions and come to understand the role of film in helping to define the contours of past, present, and future environmental visions in the United States, and their impact on the real world struggles of people and wildlife throughout the world.",
            "id": "ENVIRST/HISTORY/HISTSCI 125",
            "title": "GREEN SCREEN: ENVIRONMENTAL PERSPECTIVES THROUGH FILM"
        }
    },
    {
        "data": {
            "description": "From the Boxer Rebellion, to the dropping of the atomic bombs, to the nuclear stand-off with North Korea, American foreign relations with East Asia during the 20th century were as consequential as they were controversial. Survey the issues and questions that alternately made allies and enemies of these nations: How did the quest for markets influence American policy towards China? How did European imperialism shape Japan's rise? Why did communism seem to offer a more compelling economic and political arrangement to China and North Korea? While squarely rooted in East Asia this course will also explore the questions that united and divided Americans over their nation's foreign policy. Through examining these questions, develop answers and construct their own narrative of the relationship between the United States and East Asia.",
            "id": "HISTORY/INTLST 332",
            "title": "EAST ASIA & THE U.S. SINCE 1899"
        }
    },
    {
        "data": {
            "description": "Introduction to histories of places that have been called the American West, focusing on the period since 1850. Beginning in the mid nineteenth century, the United States sought to establish power over vast western regions that it claimed on maps but did not in fact control. Moving through the twentieth century to the present day, considers how attention to the American West allows us to reimagine US history more broadly - and how the United States represents just one facet the region's pasts. Learn to think like a historian by analyzing primary sources, evaluating competing narratives, and formulating arguments about the past. Investigate how people, ideas, and infrastructures have transformed a region repeatedly redrawn and consider the ongoing legacies of the past - and the stories we tell about it - in the American West today.",
            "id": "CHICLA/HISTORY 152",
            "title": "THE UNITED STATES WEST SINCE 1850"
        }
    },
    {
        "data": {
            "description": "Introduction to the life of a professional historian, to different styles and methods of history. Opportunity to present one's findings in a conference-type setting. Structured to support completion of the research paper requirement for the History MA, regardless of specialty.",
            "id": "HISTORY 800",
            "parent": "HISTORY",
            "title": "RESEARCH SEMINAR IN HISTORY"
        }
    },
    {
        "data": {
            "description": "Politics, society and culture in nineteenth century France. Emphasis on France's revolutionary heritage and problems of establishing a democratic regime.",
            "id": "HISTORY 348",
            "parent": "HISTORY",
            "title": "FRANCE FROM NAPOLEON TO THE GREAT WAR, 1799-1914"
        }
    },
    {
        "data": {
            "description": "Social, political, and cultural history of twentieth century France, especially the Great War, the Popular Front, the Vichy Regime, DeGaulle and the Fifth Republic, Mitterrand's socialist experiment, France's changing role in the world and the European Community.",
            "id": "HISTORY 349",
            "parent": "HISTORY",
            "title": "CONTEMPORARY FRANCE, 1914 TO THE PRESENT"
        }
    },
    {
        "data": {
            "description": "Surveys Soviet foreign relations from 1917-1991, examining the causes, course, and outcome of the Cold War. Topics include: Soviet-US relations, World War II, the Socialist Bloc, espionage, the space race, Sino-Soviet relations, and Soviet intervention in the 'Third World.'",
            "id": "HISTORY 424",
            "parent": "HISTORY",
            "title": "THE SOVIET UNION AND THE WORLD, 1917-1991"
        }
    },
    {
        "data": {
            "description": "Surveys the development of American law from the Civil War to the early Twenty-First Century. After a review of the U.S. Constitution and its modification by the Civil War amendments, examine the legal dimensions of such topics as race relations and the Civil Rights movement, the growth of modern business, the New Deal, labor rights, the women's movement, the individual rights revolution of the postwar period, and the contemporary conservative reaction. Emphasis on how law interacts with political, social, and cultural change.",
            "id": "HISTORY/LEGALST 262",
            "title": "AMERICAN LEGAL HISTORY, 1860 TO THE PRESENT"
        }
    },
    {
        "data": {
            "description": "Surveys the history of the Caribbean from the 15th century to the present. Emphasizes the importance of colonialism, commodity-based capitalism, globalization, slavery, and forced labor for the modeling of the region's social, economic, cultural, and political structures. Pay particular attention to the resilient, creative and resourceful ways in which Caribbean people have responded to these adverse conditions. Examine the circumstances that have shaped migrations from the region to the United States and Canada during the 20th and 21st centuries. Study how these diasporic communities have created social spaces in these two countries that have remained closely linked to the Caribbean through economic, political, and filial networks.",
            "id": "AFROAMER/HISTORY 347",
            "title": "THE CARIBBEAN AND ITS DIASPORAS"
        }
    },
    {
        "data": {
            "description": "The culture of the literati in the T'ang; major trends of Neo-Confucianism during the Sung and Ming; the Confucian response to the West in the nineteenth century; the emergence of the modern Chinese intelligentsia and iconoclasm in the early May Fourth period.",
            "id": "ASIAN/HISTORY 337",
            "title": "SOCIAL AND INTELLECTUAL HISTORY OF CHINA, 589 AD-1919"
        }
    },
    {
        "data": {
            "description": "Themes in Gender and Women's History within a transnational context.",
            "id": "HISTORY 752",
            "parent": "HISTORY",
            "title": "SEMINAR IN TRANSNATIONAL GENDER HISTORY"
        }
    },
    {
        "data": {
            "description": "Traces the formation of the states and societies that compose the contemporary Middle East. How have global phenomena, including two world wars, the Cold War, women's movements, and modern science, technology, and fossil fuels, affected the politics, culture, and daily lives of Middle Eastern people? What is Islamism, and how should we explain its influence? Why has the United States had such a troubled relationship with this part of the world? Balances a generally thematic approach with several weeks of country-specific studies, including Iran, Saudi Arabia, Egypt, Syria, and Israel and the Palestinian territories.",
            "id": "HISTORY 139",
            "parent": "HISTORY",
            "title": "INTRODUCTION TO THE MODERN MIDDLE EAST"
        }
    },
    {
        "data": {
            "description": "Utilizes an historical approach to explore the economic and business history of pre-modern and modern China. Topics addressed include: how people thought about property, labor, and value, money and the banking and financial systems, development of domestic and international markets and trade, major industries, the search for resources, agricultural economy, the connection of law and economy, organizations that affected the economy, systemic changes during the Republic and People's Republic, China's participation in international economic institutions, and more.",
            "id": "HISTORY 336",
            "parent": "HISTORY",
            "title": "CHINESE ECONOMIC AND BUSINESS HISTORY: FROM SILK TO IPHONES"
        }
    },
    {
        "data": {
            "description": "What motivates us to try to alleviate the suffering of people in distant parts of the world? Examines the origins of humanitarian ideas and institutions, and how various humanitarian campaigns have been shaped by geopolitical processes, including the abolition of the slave trade, the spread of missionary Christianity, European imperialism, the Cold War, neoliberalism and the emergence of new media forms. Questions include: who has benefited from various humanitarian aid campaigns throughout history? How have various humanitarian campaigns shaped, and been shaped by, patterns of global inequality? Why have some populations, and not others, been deemed worthy of the world's compassion? Explores the worlds, perspectives and visions of humanitarians through a range of primary sources, including diary entries, political propaganda, memoirs, journalistic reportage, photography and documentary film.",
            "id": "HISTORY/INTLST 330",
            "title": "GLOBAL HISTORY OF HUMANITARIANISM"
        }
    },
    {
        "data": {
            "description": "Whatever we do, wherever we go, we are encountering history and reckoning with some consequence radiating out from the past.  Designed to awaken us to the myriad ways in which the past is present all around us, and to help cultivate the historian's habits of mind in our everyday experiences.  In addition to faculty-led group discussions, centers on intellectual opportunities in Madison such as special lecture series and conversations with UW faculty and outside guests.  Themes and topics will vary, depending on the instructor and opportunities for engagement with the wider intellectual community of Madison.",
            "id": "HISTORY 400",
            "parent": "HISTORY",
            "title": "UNDERGRADUATE HISTORY SYMPOSIUM"
        }
    },
    {
        "data": {
            "description": "",
            "id": "FRENCH/GERMAN/HISTORY/POLISCI/SOC 804",
            "title": "INTERDISCIPLINARY WESTERN EUROPEAN AREA STUDIES SEMINAR"
        }
    },
    {
        "data": {
            "description": "",
            "id": "HISTORY 952",
            "parent": "HISTORY",
            "title": "SEMINAR IN COMPARATIVE HISTORY"
        }
    },
    {
        "data": {
            "description": "A broad overview of Latin American history in the modern period, since independence but with a primary focus on the twentieth century. Particular emphasis will be placed on the socioeconomic, cultural, and political structures and processes that shaped and continue to influence life in Latin America. Key issues such as colonialism, nationalism, democracy, and revolution will be examined critically in light of broad comparative themes in Latin American and world history. Among the topics to be explored in detail will be the Mexican and Cuban revolutions, populism and dictatorship, socialism and neoliberalism, and drugs and migration.",
            "id": "HISTORY/INTLST/LACIS 242",
            "title": "MODERN LATIN AMERICA"
        }
    },
    {
        "data": {
            "description": "A broad survey of American Indian history which centers Indigenous peoples, communities, and nations in the context of U.S. policy and culture that emphasizes decolonial methods and Native ways of knowing the past.",
            "id": "AMERIND/HISTORY 190",
            "title": "INTRODUCTION TO AMERICAN INDIAN HISTORY"
        }
    },
    {
        "data": {
            "description": "A critical examination of US-Latin American relations from the colonial era to the present, tracing the emergence and evolution of the United States as a hemispheric and global power and its political and economic impact on Latin America. Primary attention will be focused on US relations with Mexico, Central America and the Caribbean, but other Latin American countries will figure prominently during certain episodes.",
            "id": "CHICLA/HISTORY/LACIS/POLISCI 268",
            "title": "THE U.S. & LATIN AMERICA FROM THE COLONIAL ERA TO THE PRESENT: A CRITICAL SURVEY"
        }
    },
    {
        "data": {
            "description": "A critical review of major theories of anti-Semitism and a history of modern anti-Semitism.",
            "id": "HISTORY/JEWISH 518",
            "title": "ANTI-SEMITISM IN EUROPEAN CULTURE, 1700-1945"
        }
    },
    {
        "data": {
            "description": "A global (comparative and transnational) survey of women and gender from the ancient world to the modern period. Introduces students to key issues in the history of women and gender, including the historical construction of identities, roles, symbols, and power relationships.",
            "id": "GEN&WS/HISTORY 134",
            "title": "WOMEN AND GENDER IN WORLD HISTORY"
        }
    },
    {
        "data": {
            "description": "A historical examination of the Korean War and the politics and society of North Korea and South Korea.",
            "id": "ASIAN/HISTORY 335",
            "title": "THE KOREAS: KOREAN WAR TO THE 21ST CENTURY"
        }
    },
    {
        "data": {
            "description": "A historical introduction to the Puerto Rican experience, from island to mainland. Varieties of colonial rule, social institutions, cultural processes, and ethnic and national identity. Migration to the U.S. and social dynamics of stateside communities.",
            "id": "CHICLA/HISTORY 435",
            "title": "COLONY, NATION, AND MINORITY: THE PUERTO RICANS' WORLD"
        }
    },
    {
        "data": {
            "description": "A history of sexuality approach to a period of major social, economic, and political change in US history, 1880-1930; medical, legal, and popular discourses shaping urbanization, reform, nationalism and colonialism.",
            "id": "GEN&WS/HISTORY 519",
            "title": "SEXUALITY, MODERNITY AND SOCIAL CHANGE"
        }
    },
    {
        "data": {
            "description": "A survey of American military experience from the 16th century through the development of a nascent American \"empire\" at the turn of the 19th and 20th centuries, examining the influence of warfare on all aspects of American society.",
            "id": "HISTORY 427",
            "parent": "HISTORY",
            "title": "THE AMERICAN MILITARY EXPERIENCE TO 1902"
        }
    },
    {
        "data": {
            "description": "A survey of American military experience in the 20th and 21st centuries, examining the influence of warfare on all aspects of American society.",
            "id": "HISTORY 428",
            "parent": "HISTORY",
            "title": "THE AMERICAN MILITARY EXPERIENCE SINCE 1899"
        }
    },
    {
        "data": {
            "description": "A survey of Christianity from being a small, persecuted sect in the Roman Empire to becoming the dominant religion of western Europe, penetrating into the lives of Europeans, fissuring into multiple churches, and spreading across the globe. Attention is given to doctrine, ritual, worship, architecture, images, and music.",
            "id": "HISTORY/RELIGST 212",
            "title": "THE HISTORY OF WESTERN CHRISTIANITY TO 1750"
        }
    },
    {
        "data": {
            "description": "A survey of U.S. history by period and field with extensive discussion on how to plan a successful career as a historian. Designed to introduce masters and doctoral graduate students in the United States History field of study to the U.S. history faculty members.",
            "id": "HISTORY 900",
            "parent": "HISTORY",
            "title": "INTRODUCTION TO HISTORY FOR U.S. HISTORIANS"
        }
    },
    {
        "data": {
            "description": "A survey of major trends in Western intellectual history and religious thought in the modern era, a period that saw a new range of competing ideas about the divine, the human condition, justice and the social order, and the quest for meaning. Explores shifts in Christian and Jewish thought as well as secular alternatives to religious outlooks. Topics include the impact of the Reformation, Scientific Revolution, and Enlightenment; radical critiques of religion; existentialism; theological responses to World Wars and the Holocaust; and civil rights and social justice. Sources include films, novels, autobiographies, essays, theological works, and political manifestos.",
            "id": "HISTORY/RELIGST 209",
            "title": "WESTERN INTELLECTUAL AND RELIGIOUS HISTORY SINCE 1500"
        }
    },
    {
        "data": {
            "description": "Advanced exploration of selected topics, featuring small group discussion and intensive engagement with historical materials. Topics vary.",
            "id": "HISTORY 500",
            "parent": "HISTORY",
            "title": "READING SEMINAR IN HISTORY"
        }
    },
    {
        "data": {
            "description": "Advanced readings in primary and secondary literature of the history of the 16th-17th century European science, with emphasis on current historiographic issues.",
            "id": "HISTSCI 623",
            "parent": "HISTSCI",
            "title": "STUDIES IN EARLY MODERN SCIENCE"
        }
    },
    {
        "data": {
            "description": "African society and culture, polity and economy in multidisciplinary perspectives from prehistory and ancient kingdoms through the colonial period to contemporary developments, including modern nationalism, economic development and changing social structure.",
            "id": "AFRICAN/AFROAMER/ANTHRO/GEOG/HISTORY/POLISCI/SOC 277",
            "title": "AFRICA: AN INTRODUCTORY SURVEY"
        }
    },
    {
        "data": {
            "description": "African-American slavery and its impact on mid-19th century social, political, and economic life; the causes, course, and consequences of the Civil War; the rise and fall of postwar Reconstruction and non-racial citizenship; the impact of these histories on contemporary American society.",
            "id": "AFROAMER/HISTORY 393",
            "title": "SLAVERY, CIVIL WAR, AND RECONSTRUCTION, 1848-1877"
        }
    },
    {
        "data": {
            "description": "American political, economic and social development from the Civil War to the present.",
            "id": "HISTORY 102",
            "parent": "HISTORY",
            "title": "AMERICAN HISTORY, CIVIL WAR ERA TO THE PRESENT"
        }
    },
    {
        "data": {
            "description": "American political, economic, and social development from the founding of the colonies to the Civil War.",
            "id": "HISTORY 101",
            "parent": "HISTORY",
            "title": "AMER HIST TO THE CIVIL WAR ERA, THE ORIGIN & GROWTH OF THE U S"
        }
    },
    {
        "data": {
            "description": "An advanced and comparative study of the roles of gender, class, and race in American history and historiography. Themes include women as agents of social change and as builders of community.",
            "id": "GEN&WS/HISTORY 353",
            "title": "WOMEN AND GENDER IN THE U.S. TO 1870"
        }
    },
    {
        "data": {
            "description": "An examination of the Crusades from both Christian and Islamic perspectives; the historical, social, and religious context and significance of the Crusades for both Christians and Muslims.",
            "id": "HISTORY/MEDIEVAL/RELIGST 309",
            "title": "THE CRUSADES: CHRISTIANITY AND ISLAM"
        }
    },
    {
        "data": {
            "description": "An examination of the cultural role of gender and the social, economic, and political activities of women in modern Europe from the 18th to the late 20th centuries.",
            "id": "GEN&WS/HISTORY 392",
            "title": "WOMEN AND GENDER IN MODERN EUROPE"
        }
    },
    {
        "data": {
            "description": "An examination of the evolution of the human community in the Mediterranean Basin, from the beginning of the earliest civilizations in the Near East (3,000 B.C.E.) until the collapse of the Roman Empire in the West (500 C.E.).",
            "id": "CLASSICS/HISTORY 110",
            "title": "THE ANCIENT MEDITERRANEAN"
        }
    },
    {
        "data": {
            "description": "An introduction to key historical events, movements, and systems that have shaped our present moment.  Examines the relationship  between empire-building and anti-colonial movements from the late 18th century to the current day.  Focuses on the political, economic, and social/cultural dimensions of major global history themes, such as colonialism, capitalism, and revolution.",
            "id": "HISTORY/INTLST 146",
            "title": "A GLOBAL HISTORY OF NOW"
        }
    },
    {
        "data": {
            "description": "An introduction to the archives profession and basic  theory and practice of archives and records administration, including the uses of primary sources in research, appraisal, access, and preservation.",
            "id": "HISTORY/LIS 734",
            "title": "INTRODUCTION TO ARCHIVES AND RECORDS MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "An introduction to the formative period of modern science, including major ideas and events in the physical and life sciences from Copernicus to Newton.",
            "id": "HISTORY/HISTSCI 323",
            "title": "THE SCIENTIFIC REVOLUTION: FROM COPERNICUS TO NEWTON"
        }
    },
    {
        "data": {
            "description": "An introductory survey of colonial Latin American history, from the late fifteenth to the early nineteenth century. Examines developments in Spanish and Portuguese America by reading both secondary and primary sources.  Beginning with fifteenth-century Europe, the Americas and West Africa, discusses European expansion and invasion, first contacts between the so-called Old and the so-called New Worlds, as well as the role of religion, sexuality, gender, labor and production, trade and exchange, and politics. Each week, a central question will address the topic for that week. Become familiar with and contextualize key processes and events in colonial Latin American history and learn about the nature of colonization. Identify and evaluate historical arguments. Practice interpreting primary sources and building historical arguments about them.",
            "id": "HISTORY/LACIS 243",
            "title": "COLONIAL LATIN AMERICA: INVASION TO INDEPENDENCE"
        }
    },
    {
        "data": {
            "description": "Analysis of diplomatic, economic, cultural, and social interaction of Americans with foreign peoples and nations.",
            "id": "HISTORY 607",
            "parent": "HISTORY",
            "title": "THE AMERICAN IMPACT ABROAD: THE HISTORICAL DIMENSION"
        }
    },
    {
        "data": {
            "description": "Analysis of retention of African elements in African-American oral, written, and material culture. Social, cultural, and political issues regarding race, self-definition, and self-determination in both Africa and North America will be examined.",
            "id": "AFRICAN/AFROAMER/HISTORY/POLISCI 297",
            "title": "AFRICAN AND AFRICAN-AMERICAN LINKAGES: AN INTRODUCTION"
        }
    },
    {
        "data": {
            "description": "Analyzes the relationship between China and the United States since the birth of the U.S. in 1776, and tracks how the relationship has changed over time. Seeks to offer a broader perspective on the US-China relationship that includes not only diplomacy and war, but also culture, economics, and domestic politics. Contextualize the steady drumbeat of news stories about America and China, and make educated, historically rooted arguments about China, the US, and their complex relationship.",
            "id": "HISTORY 145",
            "parent": "HISTORY",
            "title": "AMERICA AND CHINA, 1776-TODAY"
        }
    },
    {
        "data": {
            "description": "Ancient religions in their political, social and cultural contexts; topics include ritual, literary and artistic representations, religious persecutions, and/or modern approaches to the study of ancient religions. Chronological and geographical focus will vary between Greece, Rome, Judaea and Egypt.",
            "id": "CLASSICS/HISTORY/RELIGST 517",
            "title": "RELIGIONS OF THE ANCIENT MEDITERRANEAN"
        }
    },
    {
        "data": {
            "description": "As much as we may try to convince ourselves that sport offers an escape from the \"real world,\" constant news of players' strikes, stadium financing controversies, and the lack of diversity in league management remind us that we cannot separate the games we play and watch from the political, social, and cultural contexts in which they are embedded. Explore how sport has shaped and been shaped by major trends in American social, political, and economic history. The focus is not on player stats or the morning edition of SportsCenter, rather with serious historical arguments and debates about sport's relationship to American capitalism, social movements, and urban development. Readings also provide a diverse set of perspectives on the politics of race, gender, and class in American sport in the twentieth century.",
            "id": "HISTORY 136",
            "parent": "HISTORY",
            "title": "SPORT, RECREATION, & SOCIETY IN THE UNITED STATES"
        }
    },
    {
        "data": {
            "description": "Background and history of World War II. Problems of peacemaking and international organizations; rise of Fascism, National Socialism, and Japanese imperialism; breaking the peace; World War II.",
            "id": "HISTORY 357",
            "parent": "HISTORY",
            "title": "THE SECOND WORLD WAR"
        }
    },
    {
        "data": {
            "description": "Between the late Middle Ages and the era of democratic revolutions Western Christianity saw a series of sweeping changes that altered its global profile and helped form the modern world - examines some of these shifts and their impact. Questions explored include: Why did the Reformations of the 16th century occur and with what effects on people's lives and on early modern societies? What was the relationship between European colonization, the Atlantic slave trade, new theories of race, and the spread of Christianity to the \"New World\"? How was the Christian religion resisted, received, and reshaped by Native Americans and people of African descent? What sparked movements of reform and renewal - including new Catholic religious orders and the Protestant Evangelical Awakening - and with what consequences for modern Christianity? How did the nature of Christian belief and identity change under the impact of religious conflict, political revolution, and new intellectual movements?",
            "id": "HISTORY/RELIGST 409",
            "title": "CHRISTIANITY IN THE ATLANTIC WORLD, 1500-1800"
        }
    },
    {
        "data": {
            "description": "Causes and consequences of urbanization, stressing social and economic aspects of major population movements, with particular attention to the United States.",
            "id": "HISTORY/SOC/URBRPL 979",
            "title": "SEMINAR IN URBAN HISTORY"
        }
    },
    {
        "data": {
            "description": "Chinese history in the nineteenth and twentieth centuries, with emphasis on intellectual history and the history of Chinese Communism.",
            "id": "HISTORY 854",
            "parent": "HISTORY",
            "title": "SEMINAR IN MODERN CHINESE HISTORY"
        }
    },
    {
        "data": {
            "description": "Colloquium for honors thesis writers. Students must be concurrently enrolled inHISTORY 681or682, orHIST SCI 681or682, and be declared in an Honors program.",
            "id": "HISTORY 680",
            "parent": "HISTORY",
            "title": "HONORS THESIS COLLOQUIUM"
        }
    },
    {
        "data": {
            "description": "Colloquium for thesis writers. Students must be concurrently enrolled inHISTORY 691or692.",
            "id": "HISTORY 690",
            "parent": "HISTORY",
            "title": "THESIS COLLOQUIUM"
        }
    },
    {
        "data": {
            "description": "Comprehensive interdisciplinary survey of East European culture, society, politics, and literature from its beginnings to the present day.",
            "id": "GEOG/HISTORY/POLISCI/SLAVIC 254",
            "title": "EASTERN EUROPE: AN INTERDISCIPLINARY SURVEY"
        }
    },
    {
        "data": {
            "description": "Comprehensive interdisciplinary survey of Russian civilization from its beginnings through the present day.",
            "id": "GEOG/HISTORY/POLISCI/SLAVIC 253",
            "title": "RUSSIA: AN INTERDISCIPLINARY SURVEY"
        }
    },
    {
        "data": {
            "description": "Conduct original historical research and convey the results to others. Through engagement with archival materials, become historical detectives; practice defining important historical questions, collecting and analyzing evidence, presenting original conclusions, and contributing to ongoing discussions. Confer individually with and receive feedback from instructors to improve skills of historical analysis and communication in both written and spoken formats. May not be repeated for credit.",
            "id": "HISTORY 201",
            "parent": "HISTORY",
            "title": "THE HISTORIAN'S CRAFT"
        }
    },
    {
        "data": {
            "description": "Conduct original historical research in the fields of history of science, medicine, or technology and convey the results to others. Become historical detectives through engagement with archival materials and disciplinary methodologies in the histories of science, medicine and technology; practice defining important historical questions, collecting and analyzing evidence, presenting original conclusions, and contributing to ongoing discussions. Confer individually with and receive feedback from instructors to improve skills of historical analysis and communication in written and other formats. May not be repeated for credit.",
            "id": "HISTSCI 211",
            "parent": "HISTSCI",
            "title": "THE HISTORIAN'S CRAFT: SCIENCE, MEDICINE, AND TECHNOLOGY"
        }
    },
    {
        "data": {
            "description": "Considers the social and cultural history of 20th and early 21st century American medicine through the depiction of health care practitioners and health care systems in Hollywood movies. View films that featured medicine, doctors, nurses, patients, and hospitals. Using these films as primary sources, seek to place these representations into a broader social and cultural context. Evaluate the extent to which popular understandings of medicine, health, and healing as portrayed in the films corresponded to actual practices of medicine and medical research at the time the films were first screened for mass audiences.",
            "id": "HISTORY/HISTSCI 171",
            "title": "HISTORY OF MEDICINE IN FILM"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Designed for those who are interested in the role of ideas and culture in modern American history. Examine developments in philosophy, science, political theory, social criticism, and the arts in American life from 1859 to the present. Read the works of a number of influential thinkers and writers, as well as explore a variety of intellectual movements, which shaped the cultural worlds of late 19th- and 20th-century Americans. Themes include: the influence of Darwinism on religion; the impact of industrialization on ideas about American society; the revolt against formalism in philosophy, literature, and the social sciences; early twentieth-century conceptions of race, ethnicity, and gender; the responsibility of the intellectual in times of national and global crisis; post-WWII liberalism and existentialism; the rise of postmodernism in the academy and American popular culture, and the persistent contestations over the meaning and scope of American national identity.",
            "id": "HISTORY 302",
            "parent": "HISTORY",
            "title": "HISTORY OF AMERICAN THOUGHT, 1859 TO THE PRESENT"
        }
    },
    {
        "data": {
            "description": "Designed to develop historiographic command of colonial and postcolonial South Asian history as a teaching and research field. Carefully explores the master narratives or \"schools\" of historiography of South Asia, and analyzes the erasures as well as the normative theoretical and archival axes around which the sub-field has developed. Topics include pre-colonial modes of representing the past; the social, cultural and economic turns in colonial and nationalist historiography; legal and environmental historiographical methods; South Asia in the world/global South Asia.",
            "id": "HISTORY 790",
            "parent": "HISTORY",
            "title": "PROSEMINAR: EMPIRE AND COLONIALISM IN SOUTH ASIA"
        }
    },
    {
        "data": {
            "description": "Development and application of advanced research skills to a specific historical topic. Intensive writing and small group discussion results in a project demonstrating original or creative analysis of primary and secondary sources.",
            "id": "HISTORY 600",
            "parent": "HISTORY",
            "title": "ADVANCED SEMINAR IN HISTORY"
        }
    },
    {
        "data": {
            "description": "Development of American librarianship from Colonial times to the present, with special reference to the relationship of library institutions to their contemporary social, economic, cultural and political environments.",
            "id": "HISTORY/LIS 569",
            "title": "HISTORY OF AMERICAN LIBRARIANSHIP"
        }
    },
    {
        "data": {
            "description": "Development of colleges, universities, and higher learning in Europe and America.",
            "id": "EDPOL/HISTORY 713",
            "title": "HISTORY OF HIGHER EDUCATION IN EUROPE AND AMERICA"
        }
    },
    {
        "data": {
            "description": "Development of society and culture in the Middle East and North Africa from the emergence of Islam (7th century) to early modern times.",
            "id": "HISTORY/RELIGST 205",
            "title": "THE MAKING OF THE ISLAMIC WORLD: THE MIDDLE EAST, 500-1500"
        }
    },
    {
        "data": {
            "description": "Development of the Soviet Union since 1917 and the political and diplomatic history of the nations lying between Russia and Germany.",
            "id": "HISTORY 850",
            "parent": "HISTORY",
            "title": "SMR-HIST OF THE SOVIET UNION & MODERN HIST OF E CENTRAL EUROPE"
        }
    },
    {
        "data": {
            "description": "Directed study under the supervision of a faculty member. Graded on a Cr/N basis.",
            "id": "HISTORY 698",
            "parent": "HISTORY",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Directed study under the supervision of a faculty member. Graded on a lettered basis.",
            "id": "HISTORY 699",
            "parent": "HISTORY",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Directed study under the supervision of a faculty member.",
            "id": "HISTORY 999",
            "parent": "HISTORY",
            "title": "INDEPENDENT WORK"
        }
    },
    {
        "data": {
            "description": "Economic problems of individuals, firms and industries with emphasis on value, price, and distribution of income.",
            "id": "ECON 101",
            "parent": "ECON",
            "title": "PRINCIPLES OF MICROECONOMICS"
        }
    },
    {
        "data": {
            "description": "Effects of the modern Western revolution on the established societies of Southeast Asia through colonial rule and economic and cultural change. Not open to students with credit for LCA 458 prior to Fall 2018.",
            "id": "ASIAN/HISTORY 458",
            "title": "HISTORY OF SOUTHEAST ASIA SINCE 1800"
        }
    },
    {
        "data": {
            "description": "Emergence of the large corporation; growth and instability since the mid-nineteenth century; increasing government participation in the economy; the impact of war, depression, discrimination, and international responsibilities.",
            "id": "ECON/HISTORY 466",
            "title": "THE AMERICAN ECONOMY SINCE 1865"
        }
    },
    {
        "data": {
            "description": "Emphasis upon handling of research problems. Focus upon methods, resources, intellectual approaches, and changing interpretations.",
            "id": "ASIAN/HISTORY 857",
            "title": "SEMINAR-HISTORY OF INDIA (SOUTH ASIA)"
        }
    },
    {
        "data": {
            "description": "Engage in ongoing reflection and dialogue on the Wisconsin Idea and how it informs the mission of the University of Wisconsin. Consider the Wisconsin Idea as it has developed since its beginnings, with a focus on what it means today and what it can mean in the future.",
            "id": "C&ESOC/HISTORY/POLISCI/SOC 259",
            "title": "FORWARD? THE WISCONSIN IDEA, PAST AND PRESENT"
        }
    },
    {
        "data": {
            "description": "Everything you ever hear about South Asia is true. But the exact opposite is also true. Tradition and modernity, development and stagnation, the past and the future all exist simultaneously, at times in harmony and at other times in conflict with one another. Through an exploration of the political, social and economic history of this region from the 18th century to the present day, learn about the making of modern South Asia and attempt to understand this paradox.",
            "id": "HISTORY 450",
            "parent": "HISTORY",
            "title": "MAKING OF MODERN SOUTH ASIA"
        }
    },
    {
        "data": {
            "description": "Evolution of the mass media in the United States in the context of political, social, and economic change.",
            "id": "HISTORY/JOURN 560",
            "title": "HISTORY OF U.S. MEDIA"
        }
    },
    {
        "data": {
            "description": "Examination of human geography, ethnicity, nomadism and pastoralism, oases cultures, religion and international politics of the silk routes of central Asia. Not open to students with credit for HIST 265 prior to Fall 2018.",
            "id": "GNS/HISTORY 265",
            "title": "AN INTRODUCTION TO CENTRAL ASIA: FROM THE SILK ROUTE TO AFGHANISTAN"
        }
    },
    {
        "data": {
            "description": "Examine the historical relationships between metropolitan change, economic transformation, and the construction of race and how those processes have shaped mass incarceration, educational, housing, and income inequality, and the experiences of racial/ethnic minorities who have been marginalized or discriminated against. Key questions include: What is the historical nature of inequality and opportunity in metropolitan America? What policies and ideas have historically promoted inequality, and how have those policies and ideas shifted over time? How have marginalized people responded to inequality, and what impacts have various modes of resistance had? Lastly, what is \"race,\" how has its meaning changed over time, and how has it historically shaped inequality and opportunity?",
            "id": "EDPOL/HISTORY 143",
            "title": "HISTORY OF RACE AND INEQUALITY IN URBAN AMERICA"
        }
    },
    {
        "data": {
            "description": "Examines punishment across a vast range of historical traditions, examining how wrongdoing and punishment have been figured in law, literature, art and philosophy. Examines ancient, medieval and modern traditions.",
            "id": "HISTORY/LEGALST 426",
            "title": "THE HISTORY OF PUNISHMENT"
        }
    },
    {
        "data": {
            "description": "Examines the comparative history of radical and experimental education in the United States and United Kingdom since 1800. It focuses on the social, cultural, and intellectual history of diverse educational experiments, including experiments related to socialism, abolitionism, anarchism, and religious fundamentalism.",
            "id": "EDPOL/HISTORY 622",
            "title": "HISTORY OF RADICAL AND EXPERIMENTAL EDUCATION IN THE US AND UK"
        }
    },
    {
        "data": {
            "description": "Examines the diverse paths followed by forensic science (including medical jurisprudence or forensic medicine) in various times and places, focusing on the English-speaking world from the nineteenth century until the present. Explore the many ways that law and science have worked together--or at cross-purposes--to generate and assess evidence at the crime scene, in the lab, in the courtroom, and beyond.",
            "id": "HISTORY/LEGALST 477",
            "title": "HISTORY OF FORENSIC SCIENCE"
        }
    },
    {
        "data": {
            "description": "Examines the growth of modern childhood and adolescent sub-cultures, class differences, literary and pictorial representations, legal and demographic developments, and the growth of educational theories and institutions.",
            "id": "EDPOL/HISTORY 478",
            "title": "COMPARATIVE HISTORY OF CHILDHOOD AND ADOLESCENCE"
        }
    },
    {
        "data": {
            "description": "Examines the historical, social, and legal experiences of Latinas/Latinos/Latinxs in the US since the mid-1800s with emphasis on Mexican migrations. Latinxs became an important part of the US population through western expansion, conquest, and immigration. We will learn about the 3 main Latinx groups in the US: Mexicans, Puerto Ricans, and Cubans, but will also learn about other Latinx communities. We begin with an examination of conquest by studying the Treaty of Guadalupe Hidalgo that annexed roughly half of former Mexican territory and the Spanish-American War that resulted in the possession of Puerto Rico. Then, we examine the history of Latinx immigration to understand the experiences of Mexicans, Central Americans, South Americans, and people from the Caribbean who have immigrated to the US in search of economic opportunities and political asylum. This course serves as an introduction to the varied experiences of Latinxs in the US in order to understand their unique histories.",
            "id": "CHICLA/HISTORY 153",
            "title": "LATINA/LATINO/LATINX HISTORY"
        }
    },
    {
        "data": {
            "description": "Examines the history of education in America from the colonization of North America to the present to consider education in its broadest sense - as a process of individual development and cultural transmission. Explores such topics as the rise of common schools in the urban North; the education of Native Americans, immigrants, slaves, and free blacks; the evolution of teacher training (primarily for women); various philosophies of \"progressive\" school reform; the politics of desegregation, bilingual education, and special education; the articulation between high school and college work; and the evolving federal role in American education.",
            "id": "EDPOL/HISTORY 412",
            "title": "HISTORY OF AMERICAN EDUCATION"
        }
    },
    {
        "data": {
            "description": "Examines the history of federal aid to education from 1776 to the present, with heavy emphasis on the post-World War II period. Explores the federal role in public education in the Early Republic and during Reconstruction; Traces the evolution of federal policies concerning racial desegregation, compensatory education for low-income students, bilingual education, and special education for the disabled. Critically reflect on the tradition of \"local control,\" policy implementation and evaluation, accountability, block grants, interest groups and lobbies; nationally standardized testing, and the different goals assigned to public schooling in the United States (e.g., social integration/inclusion, individual academic achievement, etc.).",
            "id": "EDPOL/HISTORY 665",
            "title": "HISTORY OF THE FEDERAL ROLE IN AMERICAN EDUCATION"
        }
    },
    {
        "data": {
            "description": "Examines the history of illness and medical practice in Latin America and the Caribbean from the colonial era until the present. Using an interdisciplinary set of sources, students will explore the different meanings of disease, body normativity, medical practice, and ideas about public health across different historical circumstances in the region.",
            "id": "HISTORY/HISTSCI/MEDHIST 564",
            "title": "DISEASE, MEDICINE AND PUBLIC HEALTH IN THE HISTORY OF LATIN AMERICA AND THE CARIBBEAN"
        }
    },
    {
        "data": {
            "description": "Examines the impact of colonialism, war, and capitalism on the movement of Asians to the U.S. Considers how racial, gendered, class, sexual, and national formations within the U.S. structured Asian immigration to North America.",
            "id": "ASIANAM/HISTORY 160",
            "title": "ASIAN AMERICAN HISTORY: MOVEMENT AND DISLOCATION"
        }
    },
    {
        "data": {
            "description": "Examines the significance of a particular event, phenomenon or question across national borders and in terms of the history of nation-state formation.",
            "id": "HISTORY 706",
            "parent": "HISTORY",
            "title": "TOPICS IN TRANSNATIONAL HISTORY"
        }
    },
    {
        "data": {
            "description": "Examines the significance of a particular historical phenomenon from the perspective of its importance world-wide.",
            "id": "HISTORY 705",
            "parent": "HISTORY",
            "title": "TOPICS IN GLOBAL HISTORY"
        }
    },
    {
        "data": {
            "description": "Examines the social, cultural, and political citizenship of Asians in the U.S. with particular emphasis on diaspora, transnationality, and place.",
            "id": "ASIANAM/HISTORY 161",
            "title": "ASIAN AMERICAN HISTORY: SETTLEMENT AND NATIONAL BELONGING"
        }
    },
    {
        "data": {
            "description": "Exploration of a thematic or chronological area of United States history from a variety of critical historical perspectives. Topics vary by instructor.",
            "id": "HISTORY 109",
            "parent": "HISTORY",
            "title": "INTRODUCTION TO U.S. HISTORY"
        }
    },
    {
        "data": {
            "description": "Explorations of the role of theory in historical research and writing. Content varies.",
            "id": "HISTORY 703",
            "parent": "HISTORY",
            "title": "HISTORY AND THEORY"
        }
    },
    {
        "data": {
            "description": "Explore the history of student activism in the United States, with an emphasis on the experiences racial/ethnic minority youths who have been marginalized or discriminated against. What motivated students to become politically active, and what forms did their activism take? How did student activism vary across time and space and from one group of activists to another? Why did some students become activists while others did not? What role did education and educational institutions play in their activism? What impact have student activists had, and what do their histories reveal about the capacity and mechanisms for achieving racial equity in particular and for affecting social, political, and economic change more broadly?",
            "id": "EDPOL/HISTORY 612",
            "title": "HISTORY OF STUDENT ACTIVISM FROM THE POPULAR FRONT TO BLACK LIVES MATTER"
        }
    },
    {
        "data": {
            "description": "Explores environmental studies through a focus on law and legal history. Although its main concentration is on U.S. environmental law, the course will begin and end with broader historical and global perspectives. Topics include a survey of English, European, and early American legal approaches to land use, natural resources, and pollution through World War II as well as an examination of the development and practice of contemporary U.S. environmental law and consideration of the recent emergence of international environmental law.",
            "id": "ENVIRST/HISTORY/LEGALST 430",
            "title": "LAW AND ENVIRONMENT: HISTORICAL AND CONTEMPORARY PERSPECTIVES"
        }
    },
    {
        "data": {
            "description": "Explores key issues in the ideology and practice of Athenian democracy. Examines democratic values, institutions, rhetoric, and sociology in order to provide the basic tools to understand democracy in its ancient context.  Engages with a variety of source material (literary, archaeological, epigraphic) in order to develop multiple skills of interpretation. Some questions examined include: What are the key features of Athenian democracy, how did it change over time, and how did it differ from modern democracy? How did the Athenians justify and critique this political system? How did they reconcile citizen egalitarianism with social inequalities of wealth, gender, and status? To what extent were women, foreigners, slaves, or the poor included or excluded from politics? Was Athenian democracy a robust political system or a system in crisis?",
            "id": "CLASSICS/HISTORY/POLISCI 362",
            "title": "ATHENIAN DEMOCRACY"
        }
    },
    {
        "data": {
            "description": "Explores the French Revolution and the Age of Napoleon. Why did Revolution break out in one of the most powerful and traditional monarchies of Europe? What were the roots of discontent and the sources of revolutionary ideas? Probes the exciting twists and turns of revolutionary politics and the attempt to spread \"liberty  equality\" into ordinary life, even abolishing slavery in response to massive slave revolt in the French colonies. Asks how the French interacted with a transnational revolutionary movement across Europe, the US, and the Atlantic world. Though focused on a specific revolutionary era, we will also reflect on timeless questions: Why is it so difficult to create democracy? Is violence ever justified to overcome oppression and injustice? Finally, why did this experiment in radical democracy also unleash the Terror and launch Napoleon Bonaparte, the politician and general who built an astonishing European Empire? And how did he pull it off for as long as he did?",
            "id": "HISTORY 358",
            "parent": "HISTORY",
            "title": "FRENCH REVOLUTION AND NAPOLEON"
        }
    },
    {
        "data": {
            "description": "Explores the generations-long effort by African Americans and allied forces to achieve full citizenship in the U.S. and equitable footholds in American society. Forged in a history of enslavement and in many ways ongoing, this freedom struggle encompasses the history of abolitionism to the struggle for civil rights to the fight for Black Power to the effort to make Black Lives Matter. Introduces the history of African American people in the U.S. from the end of the era of slavery to the present day; explores how that history has been shaped directly by the actions and activism of Black people and their allies; considers how that history intersects with, shapes, and is shaped by other historical moments and movements; provides opportunities to think more actively about issues of belonging, citizenship, difference, and interpersonal and structural power; develops skills in historical analysis and argumentation.",
            "id": "HISTORY 155",
            "parent": "HISTORY",
            "title": "THE LONG BLACK FREEDOM STRUGGLE FROM THE CIVIL WAR TO THE PRESENT"
        }
    },
    {
        "data": {
            "description": "Explores the historical relationship between education and the African American freedom struggle from the early twentieth century to the present. Topics include school segregation, desegregation, and resegregation; high school and college student activism; Black Power; civil rights protest strategies and tactics, and the role of the federal government.",
            "id": "AFROAMER/EDPOL/HISTORY 712",
            "title": "EDUCATION AND THE CIVIL RIGHTS MOVEMENT"
        }
    },
    {
        "data": {
            "description": "Explores the history of human relationships with animals around the world with focus on agriculture and hunting, political economic development, human identity, and biological science and conservation.",
            "id": "ENVIRST/HISTORY 369",
            "title": "THINKING THROUGH HISTORY WITH ANIMALS"
        }
    },
    {
        "data": {
            "description": "Explores the history of human relationships with the environment on a global scale through analysis of long-term changes, from early civilizations, to the beginnings of global trade, the Industrial Revolution, urbanization, and 20th century technological developments. Offers first-hand historiographical research experience and training in writing for public web audiences.",
            "id": "ENVIRST/HISTORY 465",
            "title": "GLOBAL ENVIRONMENTAL HISTORY"
        }
    },
    {
        "data": {
            "description": "Explores the history of places that have been called the American West before 1850. We start with Indigenous occupation; continue with European invasion and the creation of two new nations, Mexico and the U.S.; and end with U.S. conquest. We watch Indian lands becoming the object of Spanish, French, and English empires, and then see European incursions giving way to the hopes of new nation-states and newly empowered Indian peoples like Lakotas and Comanches. After studying the trails and trades that brought newcomers west, we reach key converging events: U.S. seizure of the Mexican North, resolution of the Oregon boundary dispute, discovery of western gold, West Coast arrival of Chinese immigrants, and Mormon exodus to the Great Basin. We use economic, environmental, political, cultural, and social analyses, and we attend to the dreams of many westerners: of North American, Latin American, European, African, and Asian origin or descent, and of all genders and class statuses.",
            "id": "CHICLA/HISTORY 151",
            "title": "THE NORTH AMERICAN WEST TO 1850"
        }
    },
    {
        "data": {
            "description": "Explores the interplay between Africa and the World from the 19th century to the present, covering subjects such as the slave- trade, repatriation, Africanizing of culture in the Americas and Europe, the spread and revival of world religions, colonialism, global capitalism, the rise of global popular culture such as pop music and video films, environmental concerns and global epidemics.",
            "id": "AFRICAN/HISTORY 129",
            "title": "AFRICA ON THE GLOBAL STAGE"
        }
    },
    {
        "data": {
            "description": "Explores the interplay between Jews and U. S. popular culture, covering such subjects as early 20th century vaudeville, the \"golden age\" of Hollywood, rhythm and blues music, television, and stand-up comedy.",
            "id": "HISTORY/JEWISH 213",
            "title": "JEWS AND AMERICAN POP. CULTURE"
        }
    },
    {
        "data": {
            "description": "Explores the prolonged cycle of wars in Vietnam and its neighbors, 1940 to date, with due regard for both local and U.S. perspectives.",
            "id": "ASIAN/HISTORY 319",
            "title": "THE VIETNAM WARS"
        }
    },
    {
        "data": {
            "description": "Explores the ways in which Holocaust history, memory and education are mutually entangled, politically charged and morally complex. Using primarily American sites of memory, critically analyze a variety of representations of the Shoah--in literature, films, memoirs, monuments, museums and classrooms.",
            "id": "CURRIC/EDPOL/HISTORY/JEWISH 515",
            "title": "HOLOCAUST: HISTORY, MEMORY AND EDUCATION"
        }
    },
    {
        "data": {
            "description": "Explores topics that involve at least two continents.  Topics vary reflecting the interests, expertise, and innovating intention of the instructor.",
            "id": "HISTORY 229",
            "parent": "HISTORY",
            "title": "EXPLORATIONS IN TRANSNATIONAL/COMPARATIVE HISTORY (HUMANITIES)"
        }
    },
    {
        "data": {
            "description": "Focuses on how a History major applies to the world of work. Explores how history skills relate to the needs of professional employers. Guides in the process of finding and obtaining professional internships. Polishes written and oral communication skills in forms appropriate for professional situations. Learn from the experiences of guest alumni speakers from a variety of fields.",
            "id": "HISTORY 300",
            "parent": "HISTORY",
            "title": "HISTORY AT WORK: PROFESSIONAL SKILLS OF THE MAJOR"
        }
    },
    {
        "data": {
            "description": "From the Bronze Age to the Hellenistic Age. Special emphases may vary with each offering.",
            "id": "HISTORY 303",
            "parent": "HISTORY",
            "title": "A HISTORY OF GREEK CIVILIZATION"
        }
    },
    {
        "data": {
            "description": "From the later Roman Empire to the end of the Middle Ages.",
            "id": "HISTORY 115",
            "parent": "HISTORY",
            "title": "MEDIEVAL EUROPE 410-1500"
        }
    },
    {
        "data": {
            "description": "From the perspectives of history and political theory, examines the multiple meanings of the idea of the rule of idea, and its uses in American history. Explore prominent critiques of the rule of law ideal.",
            "id": "HISTORY/LEGALST 459",
            "title": "RULE OF LAW: PHILOSOPHICAL AND HISTORICAL MODELS"
        }
    },
    {
        "data": {
            "description": "Hands-on instruction and experience in historical publishing. Discussion of the nature of historical research and writing.",
            "id": "HISTORY 601",
            "parent": "HISTORY",
            "title": "HISTORICAL PUBLISHING PRACTICUM"
        }
    },
    {
        "data": {
            "description": "Historical and anthropological perspectives on non-state \"law,\" or systems of rules generated by normative orders that lay beyond the state; case studies include the mafia, Tokyo tuna traders' court, orthodox Jewish diamond merchants, California gold miners' courts, Inuit song dueling.",
            "id": "HISTORY/LEGALST 510",
            "title": "LEGAL PLURALISM"
        }
    },
    {
        "data": {
            "description": "Historical intersections of race and nationalisms. Explores questions of the origin of race and nationalisms, the position and status of a variety of nationalisms and anti-colonial nationalisms; and the contemporary debates over postmodernism, postindustrialism, postcolonialism, and multiculturalism.",
            "id": "HISTORY 943",
            "parent": "HISTORY",
            "title": "RACE & NATIONALISM: COMPARATIVE & THEORETICAL PERSPECTIVES"
        }
    },
    {
        "data": {
            "description": "Historical literature of significant topics in Latin American history. The colonial period, Brazilian history, and Spanish-America in the national period.",
            "id": "HISTORY 730",
            "parent": "HISTORY",
            "title": "PROSEMINAR IN LATIN AMERICAN HISTORY"
        }
    },
    {
        "data": {
            "description": "History of Europe since 1500.",
            "id": "HISTORY 891",
            "parent": "HISTORY",
            "title": "PROSEMINAR IN MODERN EUROPEAN HISTORY"
        }
    },
    {
        "data": {
            "description": "History of books and print culture in the West from ancient times to the present. Focus on the influence of reading and writing on social, cultural, and intellectual life. Methodologies, theories, and sources for study  of book and print culture history.",
            "id": "ARTHIST/HISTORY/JOURN/LIS 650",
            "title": "HISTORY OF BOOKS AND PRINT CULTURE IN EUROPE AND NORTH AMERICA"
        }
    },
    {
        "data": {
            "description": "Honors, intermediate-level exploration of selected topics, featuring intensive reading, writing, and small-group discussion. Topics vary reflecting the interests, expertise, and innovating intention of the instructor.",
            "id": "HISTORY 283",
            "parent": "HISTORY",
            "title": "INTERMEDIATE HONORS SEMINAR-STUDIES IN HISTORY"
        }
    },
    {
        "data": {
            "description": "How did today's biology emerge out of the diverse traditions of agriculture and natural history (bees and trees), biomedicine and molecular biology (germs and genes), which stretch back into the eighteenth century? Examines classic texts and \"game-changers\" in the history of biology, putting them into broader scientific and social contexts to see how these different ways of knowing intertwined, competed, and yielded novel approaches to the study of life that still shape today's life sciences.",
            "id": "HISTORY/HISTSCI/MEDHIST 132",
            "title": "BEES, TREES, GERMS, AND GENES: A HISTORY OF BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Identify and analyze the differences between an internship and a non-professional job, with an eye towards articulating how a History degree and the skills it confers can be valuable in professional settings. Share internship experiences with classmates through short presentations. Discuss any issues or challenges that arose during internship experience. Concurrent enrollment inHISTORY 300for 2 credits, which includes a discussion section, or previous credit inHISTORY 300is required.",
            "id": "HISTORY 301",
            "parent": "HISTORY",
            "title": "HISTORY AT WORK: HISTORY INTERNSHIP SEMINAR"
        }
    },
    {
        "data": {
            "description": "In-depth study of the peoples, conflicts, and wars in Cambodia, Laos, and Vietnam, with emphasis on the Cold War era (1945-1990) and on the resulting migration and resettlement of over one million Hmong, Khmer, Lao, and Vietnamese in the United States. Not open to students with credit for LCA 246 prior to Fall 2019.",
            "id": "ASIAN/ASIANAM/HISTORY 246",
            "title": "SOUTHEAST ASIAN REFUGEES OF THE \"COLD\" WAR"
        }
    },
    {
        "data": {
            "description": "Independent research and writing of a thesis under the supervision of a faculty member.",
            "id": "HISTORY 990",
            "parent": "HISTORY",
            "title": "RESEARCH AND THESIS"
        }
    },
    {
        "data": {
            "description": "Independent study in collaboration with a faculty member.",
            "id": "HISTORY 199",
            "parent": "HISTORY",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Integrated treatment of macroeconomics and microeconomics (seeECON 101andECON 102). Accelerated approach to economics training, especially for Economics: Math Emphasis majors.",
            "id": "ECON 111",
            "parent": "ECON",
            "title": "PRINCIPLES OF ECONOMICS-ACCELERATED TREATMENT"
        }
    },
    {
        "data": {
            "description": "Intensive reading and discussion designed to introduce literature of mass communication.",
            "id": "HISTORY/JOURN 808",
            "title": "MASS COMMUNICATION HISTORY"
        }
    },
    {
        "data": {
            "description": "Interdisciplinary inquiry in African societies and cultures.",
            "id": "AFRICAN/ANTHRO/ECON/GEOG/HISTORY/POLISCI 983",
            "title": "INTERDEPARTMENTAL SEMINAR IN AFRICAN STUDIES TOPICS"
        }
    },
    {
        "data": {
            "description": "Interdisciplinary inquiry in Latin American society and culture.",
            "id": "AAE/ANTHRO/C&ESOC/GEOG/HISTORY/LACIS/POLISCI/PORTUG/SOC/SPANISH 982",
            "title": "INTERDEPARTMENTAL SEMINAR IN THE LATIN-AMERICAN AREA"
        }
    },
    {
        "data": {
            "description": "Introduces Europe when it entered the global stage economically, politically, socially, and culturally. How Europeans took to the seas and developed new forms of empire. How did this wave of contact, encounter, and conquest affect Europeans, indigenous peoples of the Americas, and Africans? Examine the early global economy and the development of plantation slavery. How did Europeans develop new ways to make sense of their world, its size, its peoples, its flora and fauna? Explore new forms of Christianity, the Jewish diaspora, and the globalization of Christianity. As thinkers debated how rulers should wield political power, monarchs strove to expand their authority and territory, and ordinary people demanded a greater share of political power, provoking revolutions across the Atlantic world. Encounter the lives of women and men from many backgrounds, from peasants to queens, and all kinds of people on the move.",
            "id": "HISTORY 119",
            "parent": "HISTORY",
            "title": "EUROPE AND THE WORLD, 1400-1815"
        }
    },
    {
        "data": {
            "description": "Introduces the cultural, economic, social, and political history of Chicanas and Latinas in the U.S. and focuses on four major themes: contact between different ethnic/racial groups; ideas of nation and nationalism; constructions of identity; and struggles for social justice.",
            "id": "CHICLA/GEN&WS/HISTORY 245",
            "title": "CHICANA AND LATINA HISTORY"
        }
    },
    {
        "data": {
            "description": "Introduces the dramatic history of twentieth-century Eastern Europe, a place where imperialism, Nazism, Communism, genocide, democracy, and capitalism all left their mark. Three interrelated themes--war, revolution, and society--allow us to place Eastern Europe within broader comparative contexts. In addition to exploring significant political, economic, and cultural changes, discover how ordinary people--including workers, peasants, women, and children--experienced attempts to change the region and its people. Throughout, discuss how East Europeans continue to wrestle with the ghosts of their past today.",
            "id": "HISTORY 270",
            "parent": "HISTORY",
            "title": "EASTERN EUROPE SINCE 1900"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Introduction to elementary-level historical studies at the research university. Emphasis on interpretation and critical thinking. Topics vary.",
            "id": "HISTORY 100",
            "parent": "HISTORY",
            "title": "HISTORICAL STUDIES: INTRODUCTORY"
        }
    },
    {
        "data": {
            "description": "Introduction to historical studies at the research university. Emphasis on interpretation and critical thinking. Topics vary.",
            "id": "HISTORY 200",
            "parent": "HISTORY",
            "title": "HISTORICAL STUDIES"
        }
    },
    {
        "data": {
            "description": "Introduction to major themes in world history. Such themes might include: empire and imperialism, environmental impacts, global trade and globalization, war, migration, gender, race, religion, nationalism, class, and the like.",
            "id": "HISTORY 130",
            "parent": "HISTORY",
            "title": "AN INTRODUCTION TO WORLD HISTORY"
        }
    },
    {
        "data": {
            "description": "Introduction to the central historical developments of law and legal institutions in the European middle ages (400-1500).",
            "id": "HISTORY/LEGALST 476",
            "title": "MEDIEVAL LAW AND SOCIETY"
        }
    },
    {
        "data": {
            "description": "Introduction to the history of American Indian education. Evaluate the relationship between education and sovereignty through a survey of schools including missions, boarding schools, survival schools, tribal colleges, language nests, charter schools, and more.",
            "id": "AMERIND/HISTORY 380",
            "title": "SOVEREIGNTY AND THE SCHOOLHOUSE"
        }
    },
    {
        "data": {
            "description": "Introduction to the major themes in the history of imperial Britain and the modern world. Themes include (but are not limited to) the changing patterns of life during those centuries, the development of modern identities and notions of the self, the emergence of a modern, commercial civil society, the rise of industrial capitalism, liberalism, the modern state, and imperial and total war.",
            "id": "HISTORY 124",
            "parent": "HISTORY",
            "title": "BRITAIN SINCE 1688"
        }
    },
    {
        "data": {
            "description": "Introduction to the practice of public history. Public historians ground their work in rigorous, academic research with the goal of presenting history in a collaborative and publicly focused manner. These projects come in many forms including exhibits, walking tours, podcasts, documentaries, web projects, and place-based interpretation, to name a few. Learn how academic history gets presented to the public, not only by reading about public history, but by doing it.",
            "id": "HISTORY 401",
            "parent": "HISTORY",
            "title": "PUBLIC HISTORY WORKSHOP"
        }
    },
    {
        "data": {
            "description": "Introduction to the ways of thinking characteristic of historical study and to the questions and methods that motivate the research fields in which department faculty work. Foundational instruction for PhD and History of Science, Medicine, and Technology PhD taken during the first semester of those programs.",
            "id": "HISTORY 701",
            "parent": "HISTORY",
            "title": "HISTORY IN A GLOBAL PERSPECTIVE"
        }
    },
    {
        "data": {
            "description": "Introductory examination of the role of war and peace in human history from the earliest forms of organized violence to the 21st century \"War on Terror.\" Rather than center on tactics, key battles, or even particular critical conflicts, instead focuses on how different military cultures and technologies emerged over time across the globe. Explores how organized violence shaped not just the lives of soldiers, but all members of society by examining key pieces of popular culture including poetry, propaganda, music, movies, and social media. Takes a deliberately global approach by examining the connections and commonalities of war across different world regions.",
            "id": "HISTORY 133",
            "parent": "HISTORY",
            "title": "GLOBAL MILITARY HISTORY (5000 BCE - PRESENT)"
        }
    },
    {
        "data": {
            "description": "Introductory exploration of a thematic or chronological area of African history. Topics vary by instructor.",
            "id": "AFRICAN/HISTORY 106",
            "title": "INTRODUCTION TO AFRICAN HISTORY"
        }
    },
    {
        "data": {
            "description": "Introductory seminar in modern Southeast Asian history; work mostly in English-language sources.",
            "id": "HISTORY 755",
            "parent": "HISTORY",
            "title": "PROSEMINAR IN SOUTHEAST ASIAN HISTORY"
        }
    },
    {
        "data": {
            "description": "Investigates how everyday people shaped European history and politics, from World War I through today. Takes a comparative and interdisciplinary approach to analyze a range of major social movements in Europe, thinking in detail about what constitutes a social movement in the first place, and what determines its effectiveness. Key topics include the rise and fall of Fascism; the fate of the Communist and Socialist Left in Europe; the role of youth movements as drivers of change; and the constraints imposed on political organizing by both democratic and authoritarian societies. Drawing on a range of texts, songs, and films, investigates how people power has shaped the European state, and vice-versa, from 1922 through today.",
            "id": "HISTORY/INTLST 366",
            "title": "FROM FASCISM TO TODAY: SOCIAL MOVEMENTS AND POLITICS IN EUROPE"
        }
    },
    {
        "data": {
            "description": "Investigates the complex history of European and American violence and war-making through the lens of race and religion. Taking a comparative approach, analyzes several major conflicts of the twentieth century, from World War I to the wars of decolonization, and from the genocide of the Herero peoples to the Armenian Genocide, the Holocaust, and beyond. Key topics include the genealogy of the modern idea of \"race\" in Europe and the U.S.; the drive towards a world of more homogeneous nation-states after World War I; and the emergence of transnational protest movements opposed to racism, imperialism, antisemitism, and Islamophobia. Drawing on a range of texts, songs, and films, investigates new connections between Europe and the United States. Take an international look at concepts like race and nation, and try to make sense of extreme violence, war-making, and the pre-requisites of peace.",
            "id": "HISTORY 269",
            "parent": "HISTORY",
            "title": "WAR, RACE, AND RELIGION IN EUROPE AND THE UNITED STATES, FROM THE SCRAMBLE FOR AFRICA TO TODAY"
        }
    },
    {
        "data": {
            "description": "Is there such a thing as a genuinely anti-war movie? The acclaimed, late French filmmaker Francois Truffaut thought not, as even the most brutal and honest depictions of war in film cannot help but valorize sacrifice and arouse something primordial in certain members of the audience. Nevertheless, some of the greatest films of all time are regarded as \"anti-war classics\" and not a few might be labeled \"pro-war.\" Critically examine more than fifteen full movies (and parts of many more) from across this spectrum and from around the world. In addition to testing the \"Truffaut Rule,\" evaluate the movies as both fictionalized secondary sources (conveying knowledge and influencing memory) and as primary sources that shed light on the moment and place in which they were created.",
            "id": "HISTORY 137",
            "parent": "HISTORY",
            "title": "THE HISTORY OF WAR IN FILM"
        }
    },
    {
        "data": {
            "description": "Japanese warriors, their ideals, and their images from the tenth century to the present.",
            "id": "ASIAN/HISTORY 454",
            "title": "SAMURAI: HISTORY AND IMAGE"
        }
    },
    {
        "data": {
            "description": "Latin American culture and society from an interdisciplinary perspective; historical developments from pre-Columbian times to the present; political movements; economic problems; social change; ecology in tropical Latin America; legal systems; literature and the arts; cultural contrasts involving the US and Latin America; land reform; labor movements; capitalism, socialism, imperialism; mass media.",
            "id": "AFROAMER/ANTHRO/C&ESOC/GEOG/HISTORY/LACIS/POLISCI/SOC/SPANISH 260",
            "title": "LATIN AMERICA: AN INTRODUCTION"
        }
    },
    {
        "data": {
            "description": "Life and literature during the Old English period (c450-c1100). Primary emphasis on the vernacular and Latin writings of the Anglo-Saxons themselves. Extensive historical and archaeological background; attention to the development and character of monasticism, to the production of manuscripts, etc. All reading in translation.",
            "id": "ENGL/HISTORY/RELIGST 360",
            "title": "THE ANGLO-SAXONS"
        }
    },
    {
        "data": {
            "description": "Main currents of Russian social thought in the eighteenth and nineteenth centuries.",
            "id": "HISTORY 420",
            "parent": "HISTORY",
            "title": "RUSSIAN SOCIAL AND INTELLECTUAL HISTORY"
        }
    },
    {
        "data": {
            "description": "Major political, economic and social developments in Russia since 1917.",
            "id": "HISTORY 419",
            "parent": "HISTORY",
            "title": "HISTORY OF SOVIET RUSSIA"
        }
    },
    {
        "data": {
            "description": "Major problems of historical interpretation in the early modern and recent histories of China, Japan, and Korea. Topics and periods of emphasis vary each year.",
            "id": "HISTORY 725",
            "parent": "HISTORY",
            "title": "SEMINAR IN EAST ASIAN HISTORY"
        }
    },
    {
        "data": {
            "description": "Medicine in Europe from the 18th century to mid-20th century, investigating changes in disease and demography, state interest in health care, the medical professions, and both scientific and alternative medical ideas.",
            "id": "HISTORY/HISTSCI/MEDHIST 508",
            "title": "HEALTH, DISEASE AND HEALING II"
        }
    },
    {
        "data": {
            "description": "Mentored independent research and thesis writing on an original topic for honors. Requires completion ofHISTORY 681. Must be concurrently enrolled inHISTORY 680.",
            "id": "HISTORY 682",
            "parent": "HISTORY",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Mentored independent research and thesis writing on an original topic for honors. Students must be concurrently enrolled inHISTORY 680and be declared in an Honors program.",
            "id": "HISTORY 681",
            "parent": "HISTORY",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Mentored independent research and writing on an original topic. Students must be concurrently enrolled inHISTORY 690.",
            "id": "HISTORY 691",
            "parent": "HISTORY",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Mentored research and writing on an original topic. Requires completion ofHISTORY 691. Must be concurrently enrolled inHISTORY 690.",
            "id": "HISTORY 692",
            "parent": "HISTORY",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Modern German history and the history of Central Europe.",
            "id": "HISTORY 845",
            "parent": "HISTORY",
            "title": "SEMINAR-CENTRAL EUROPEAN HISTORY"
        }
    },
    {
        "data": {
            "description": "Multidisciplinary and historical perspectives on the East Asian civilizations of China, Japan, Korea, Tibet and Mongolia from prehistory to the present, including developments in philosophy, economy, governance, social structure, kinship, geography, etc.",
            "id": "ASIAN/HISTORY/POLISCI 255",
            "title": "INTRODUCTION TO EAST ASIAN CIVILIZATIONS"
        }
    },
    {
        "data": {
            "description": "Organized around the title question: Who is an American? Explores how answers to that question have changed over time, focusing on people whose actions and ideas shaped those answers. Rather than an overview of U.S. history, focuses on a variety of topics related to our central theme, moving roughly chronologically from the Revolutionary era to the present. Covers the history of racial ideologies and racial inequities, arguments over citizenship and \"American\" identity, and the ways that various groups have been included or excluded from the nation.",
            "id": "HISTORY 154",
            "parent": "HISTORY",
            "title": "WHO IS AN AMERICAN?"
        }
    },
    {
        "data": {
            "description": "Origins and evolution of the Russian people and state; political, economic, and social history; foreign relations as they affect domestic policy; from the ninth century to 1800.",
            "id": "HISTORY 417",
            "parent": "HISTORY",
            "title": "HISTORY OF RUSSIA"
        }
    },
    {
        "data": {
            "description": "Political and social development of Central Europe from the establishment of the German Empire to the post-World War II period.",
            "id": "HISTORY 410",
            "parent": "HISTORY",
            "title": "HISTORY OF GERMANY, 1871 TO THE PRESENT"
        }
    },
    {
        "data": {
            "description": "Political institutional arrangements which have emerged since 1890 and how they have influenced social and economic policies implemented since the Second World War. Why the working class has been politically weak in America; policy consequences of this weakness.",
            "id": "HISTORY/SOC 670",
            "title": "CAPITALISM, SOCIALISM, AND DEMOCRACY IN AMERICA SINCE 1890"
        }
    },
    {
        "data": {
            "description": "Political, cultural, and social history of Europe from the Second World War to the present.",
            "id": "HISTORY 359",
            "parent": "HISTORY",
            "title": "HISTORY OF EUROPE SINCE 1945"
        }
    },
    {
        "data": {
            "description": "Political, economic, social, and cultural history from earliest historic times.",
            "id": "HISTORY 123",
            "parent": "HISTORY",
            "title": "ENGLISH HISTORY: ENGLAND TO 1688"
        }
    },
    {
        "data": {
            "description": "Political, economic, social, and cultural history of modern Western civilization.",
            "id": "HISTORY 120",
            "parent": "HISTORY",
            "title": "EUROPE AND THE MODERN WORLD 1815 TO THE PRESENT"
        }
    },
    {
        "data": {
            "description": "Political, social, economic, and cultural changes in the U.S. from World War II to the present.",
            "id": "HISTORY 306",
            "parent": "HISTORY",
            "title": "THE UNITED STATES SINCE 1945"
        }
    },
    {
        "data": {
            "description": "Political, social, economic, and cultural development: political realignments and rise of nationalism, industrialization and rise of liberalism and socialism, democratization, independence struggles and social conflict, evolution of welfare states, World War II and its aftermath.",
            "id": "HISTORY/SCANDST 432",
            "title": "HISTORY OF SCANDINAVIA SINCE 1815"
        }
    },
    {
        "data": {
            "description": "Political, social, economic, and cultural developments of Scandinavia through the \"Viking Age\" to the break-up of Sweden-Finland and Denmark-Norway; emphasis on the interplay between social and political forces and institutions and the area's relationship with the rest of Europe.",
            "id": "HISTORY/SCANDST 431",
            "title": "HISTORY OF SCANDINAVIA TO 1815"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Provides a critical examination of the history of labor and working people in the Americas, from the colonial era to the present. It focuses on the experience of the United States and Mexico, offering a comparative perspective on their distinct but also shared (and increasingly linked) histories. The seminar proceeds chronologically, highlighting major episodes in the evolution of labor systems in the two countries, beginning with the colonial labor systems implemented by the Spanish and British empires following the European conquest of the Western Hemisphere. Among other topics, we will examine the pivotal role of slavery and other forms of forced labor, the impact of the industrial revolution, the emergence and expansion of corporate capitalism and the labor unrest it provoked in the post-civil war U.S., the role of labor in the Mexican Revolution and its aftermath, the impact of the Great Depression and labor incorporation on the post-WWII social and political order of both countries, the breakdown of that order and the move to neo-liberalism in the 1970s and 1980s, and the emergence of an increasingly integrated North American production system and its consequences for labor and working people on both sides of the US-Mexico border.",
            "id": "CHICLA/HISTORY/LACIS/POLISCI 355",
            "title": "LABOR IN THE AMERICAS: US & MEXICO IN COMPARATIVE & HISTORICAL PERSPECTIVE"
        }
    },
    {
        "data": {
            "description": "Reading in European or American educational history.",
            "id": "EDPOL/HISTORY 906",
            "title": "PROSEMINAR ON THE HISTORY OF EDUCATION"
        }
    },
    {
        "data": {
            "description": "Reading seminar in American history. Topics and periods of emphasis vary.",
            "id": "HISTORY 901",
            "parent": "HISTORY",
            "title": "STUDIES IN AMERICAN HISTORY"
        }
    },
    {
        "data": {
            "description": "Readings and research on United States History, 1900-1945.",
            "id": "HISTORY 940",
            "parent": "HISTORY",
            "title": "SEMINAR-AMERICAN HISTORY 1900-1945"
        }
    },
    {
        "data": {
            "description": "Readings and/or research on the social, cultural, and political history of France from the late seventeenth century through the French Revolution.",
            "id": "HISTORY 707",
            "parent": "HISTORY",
            "title": "PROSEMINAR IN EARLY MODERN EUROPEAN HISTORY, 1500-1789"
        }
    },
    {
        "data": {
            "description": "Readings on U.S. military history.",
            "id": "HISTORY 958",
            "parent": "HISTORY",
            "title": "SEMINAR-AMERICAN MILITARY HISTORY"
        }
    },
    {
        "data": {
            "description": "Readings on the intellectual history of the United States/North America.",
            "id": "HISTORY 951",
            "parent": "HISTORY",
            "title": "SEMINAR-INTELLECTUAL HISTORY OF AMERICA"
        }
    },
    {
        "data": {
            "description": "References to the Holocaust abound in contemporary political debates and in our popular culture. But most people know very little about the history of the Holocaust, despite the mountains of superb historical scholarship that experts in the field have produced over decades of dedicated research. Utilize correspondence, diaries, or other firsthand accounts of Holocaust victims, together with study of the larger events around them, to reconstruct the experiences of ordinary families swept up in the Nazi genocide.",
            "id": "HISTORY/JEWISH 310",
            "title": "THE HOLOCAUST"
        }
    },
    {
        "data": {
            "description": "Research seminar in Japanese history. Focus varies each year.",
            "id": "HISTORY 855",
            "parent": "HISTORY",
            "title": "SEMINAR IN JAPANESE HISTORY"
        }
    },
    {
        "data": {
            "description": "Research studies in aspects of African history with emphasis on field research techniques and interpretation of non-archival data.",
            "id": "HISTORY 861",
            "parent": "HISTORY",
            "title": "SEMINAR-THE HISTORY OF AFRICA"
        }
    },
    {
        "data": {
            "description": "Roman civilization from the monarchy through the collapse of the Roman Empire in the west.",
            "id": "HISTORY 307",
            "parent": "HISTORY",
            "title": "A HISTORY OF ROME"
        }
    },
    {
        "data": {
            "description": "Russian political, economic, and social history from 1800 to 1917; foreign relations as they affect domestic policy.",
            "id": "HISTORY 418",
            "parent": "HISTORY",
            "title": "HISTORY OF RUSSIA"
        }
    },
    {
        "data": {
            "description": "See 520.",
            "id": "GEN&WS/HISTORY 354",
            "title": "WOMEN AND GENDER IN THE U.S. SINCE 1870"
        }
    },
    {
        "data": {
            "description": "Selected topics, issues and themes concerning the history of education of various groups of people of color in the United States, as well as selected issues, topics and themes focusing on immigration and ethnicity.",
            "id": "EDPOL/HISTORY 903",
            "title": "HISTORY OF EDUCATION OF MULTICULTURAL AMERICA"
        }
    },
    {
        "data": {
            "description": "Social, economic, and ideological changes, institutions, and movements and their relationships with the political processes and structures in the Nordic states.",
            "id": "HISTORY/SCANDST 577",
            "title": "CONTEMPORARY SCANDINAVIA: POLITICS AND HISTORY"
        }
    },
    {
        "data": {
            "description": "Social, political, and cultural history of France, 1800 to the present.",
            "id": "HISTORY 868",
            "parent": "HISTORY",
            "title": "SEMINAR IN MODERN FRENCH HISTORY"
        }
    },
    {
        "data": {
            "description": "Special problems in Greek and Roman history.",
            "id": "CLASSICS/HISTORY 801",
            "title": "SEMINAR-ANCIENT HISTORY"
        }
    },
    {
        "data": {
            "description": "Structure of American society, Britain and the Colonies; the revolutionary movement for independence; the war for independence; social, political, and constitutional change.",
            "id": "HISTORY 344",
            "parent": "HISTORY",
            "title": "THE AGE OF THE AMERICAN REVOLUTION, 1763-1789"
        }
    },
    {
        "data": {
            "description": "Students will examine the historical, social, political, economic, and cultural experiences and conditions of Latinos, one of the largest US racial/ethnic minority groups. Course focus is on people who trace their origins to Mexico, the Caribbean, and countries of Latin America.",
            "id": "CHICLA/HISTORY/POLISCI 422",
            "title": "LATINO HISTORY AND POLITICS"
        }
    },
    {
        "data": {
            "description": "Studies in European and American educational history.",
            "id": "EDPOL/HISTORY 907",
            "title": "SEMINAR-HISTORY OF EDUCATION"
        }
    },
    {
        "data": {
            "description": "Studies two or more nations or defined regions through a comparison of a single theme or set of themes in their history.",
            "id": "HISTORY 704",
            "parent": "HISTORY",
            "title": "TOPICS IN CONTEMPORARY HISTORY"
        }
    },
    {
        "data": {
            "description": "Survey of African American history from 1900 to the present. Topics covered include segregation, the Civil Rights Movement, the political, social and cultural changes of the late 20th century, and the Obama presidency.",
            "id": "AFROAMER/HISTORY 321",
            "title": "AFRO-AMERICAN HISTORY SINCE 1900"
        }
    },
    {
        "data": {
            "description": "Survey of African American history from its roots in Africa to the end of the 19th century. Topics considered include the slave trade, the political and cultural practices of enslaved communities, forms of resistance, Reconstruction, and systems of segregation.",
            "id": "AFROAMER/HISTORY 322",
            "title": "AFRO-AMERICAN HISTORY TO 1900"
        }
    },
    {
        "data": {
            "description": "Survey of immigration to the U.S. from colonial times to the present with analyses of the roles of ethnic and racial groups in economics and politics, the reactions of earlier arrivals to their successors, the extent of assimilation and contemporary ethnic and racial consciousness.",
            "id": "HISTORY 403",
            "parent": "HISTORY",
            "title": "IMMIGRATION AND ASSIMILATION IN AMERICAN HISTORY"
        }
    },
    {
        "data": {
            "description": "Survey of interactions among people and natural environments from before European colonization to present. Equal attention to problems of ecological change, human ideas, and uses of nature and history of conservation and environmental public policy.",
            "id": "ENVIRST/GEOG/HISTORY 460",
            "title": "AMERICAN ENVIRONMENTAL HISTORY"
        }
    },
    {
        "data": {
            "description": "Survey of key themes in Western intellectual history and religious thought from ancient Greece through the Renaissance, focusing on relationships among classical, Jewish, and Christian traditions.",
            "id": "HISTORY/RELIGST 208",
            "title": "WESTERN INTELLECTUAL AND RELIGIOUS HISTORY TO 1500"
        }
    },
    {
        "data": {
            "description": "Survey of major cultural, social, political and economic developments in Japanese history from ancient to recent times.",
            "id": "ASIAN/HISTORY 104",
            "title": "INTRODUCTION TO EAST ASIAN HISTORY: JAPAN"
        }
    },
    {
        "data": {
            "description": "Survey of major cultural, social, political, and intellectual developments in Korea from the 10th century to the 21st century.",
            "id": "ASIAN/HISTORY 108",
            "title": "INTRODUCTION TO EAST ASIAN HISTORY - KOREA"
        }
    },
    {
        "data": {
            "description": "Survey of major developments in Chinese history from 1500 B.C. to the founding of the Communist state in 1949. Emphasis on patterns and themes; equal time devoted to the classical and traditional period and the modern era.",
            "id": "ASIAN/HISTORY 103",
            "title": "INTRODUCTION TO EAST ASIAN HISTORY: CHINA"
        }
    },
    {
        "data": {
            "description": "Survey of political, social, and economic change in the history of American capitalism from the late colonial period to the near-present.",
            "id": "HISTORY 329",
            "parent": "HISTORY",
            "title": "HISTORY OF AMERICAN CAPITALISM"
        }
    },
    {
        "data": {
            "description": "Survey of the development of societies within the Indian subcontinent. Equal segments for the ancient, medieval and modern periods.",
            "id": "HISTORY 142",
            "parent": "HISTORY",
            "title": "HISTORY OF SOUTH ASIA TO THE PRESENT"
        }
    },
    {
        "data": {
            "description": "Surveys American Jews from the eighteenth century until after WW II, examining political behavior (radicalism, liberalism, and nationalism), class formation, social mobility, culture, inter-ethnic group relations, religion, and problems in community building.",
            "id": "HISTORY/JEWISH 219",
            "title": "THE AMERICAN JEWISH EXPERIENCE: FROM SHTETL TO SUBURB"
        }
    },
    {
        "data": {
            "description": "Surveys key theoretical work and secondary literature on the history of women and gender in the United States to 1870.",
            "id": "HISTORY 936",
            "parent": "HISTORY",
            "title": "THE HISTORY OF WOMEN AND GENDER IN THE U.S., TO 1870"
        }
    },
    {
        "data": {
            "description": "Surveys recent and classic works on American environmental history to introduce students to the methods and historiography of the field.",
            "id": "GEOG/HISTORY 932",
            "title": "SEMINAR IN AMERICAN ENVIRONMENTAL HISTORY"
        }
    },
    {
        "data": {
            "description": "Surveys the development of American law down to the U.S. Civil War. Reviews the English historical background, and examines how law changed in colonial America, culminating in the framing of the U.S. Constitution. Explores how territorial expansion, democracy, and slavery shaped nineteenth-century American law. Emphasis is on how law interacts with political, social, and cultural change, with a focus on the origins of modern civil and constitutional rights.",
            "id": "HISTORY/LEGALST 261",
            "title": "AMERICAN LEGAL HISTORY TO 1860"
        }
    },
    {
        "data": {
            "description": "The African-descended population of the Americas is around 180 million people. Roughly two-thirds of those live outside of the United States, mostly in Brazil and the Caribbean.  Provides an overview of the histories, aspirations, and problems that have most impacted peoples of the African diaspora in the years since the Haitian Revolution. As such, the focus will be thematic rather than chronological. The primary emphasis will be on the history of political, social, and intellectual movements. Topics will include slave resistance, black nationalism, socialism, and anti-colonialism. Learn about figures as varied as Toussaint L'Ouverture, Ida B. Wells, Marcus Garvey, WEB DuBois, Carolina Maria de Jesus, Frantz Fanon, Paul Robeson, and many others. Other topics to be covered include: the meaning of \"freedom,\" the construction of black \"masculinities,\" diasporic religious expressions, art and literature, and race and medicine.",
            "id": "HISTORY 179",
            "parent": "HISTORY",
            "title": "AFRO-ATLANTIC HISTORIES AND PEOPLES, 1791-PRESENT"
        }
    },
    {
        "data": {
            "description": "The Cold War was the first event to impact virtually all of humanity and left a lasting legacy that still shapes the current world order. Exploration of its conduct on five continents entails both a diversity of sources (film, fiction, documents, and memoir) and a range of topics (geopolitics, ideology, internationalism, empire, revolution, counterinsurgency, and covert operations). Its half-century history was marked by nuclear-armed stalemate and ideological competition in Europe, cultural politics of repression and generational revolt in America, interplay of anti-colonial nationalism and counterinsurgency in Asia, Africa, and Latin America, and a succession of major wars worldwide in Korea, Vietnam, Angola, and Afghanistan. By adopting an international perspective that carries us beyond the narrow ambit of the Moscow-Washington rivalry, integrate diverse global forces and particular national histories for a fuller understanding of an ever-changing world system.",
            "id": "HISTORY/INTLST 375",
            "title": "THE COLD WAR - FROM WORLD WAR II TO END OF SOVIET EMPIRE"
        }
    },
    {
        "data": {
            "description": "The basic thought, practices and history of Buddhism, including selflessness and relativity, practices of meditation, merit- making and compassion from both local and translocal perspectives. Includes a discussion of Buddhism as a contemporary, North American religion. Not open to students with credit for E ASIAN or LCA 308 prior to Fall 2019.",
            "id": "ASIAN/HISTORY/RELIGST 308",
            "title": "INTRODUCTION TO BUDDHISM"
        }
    },
    {
        "data": {
            "description": "The culture and society of Korea have evolved hand in hand with the country's transformation from the Choson dynasty, a relatively isolated Confucian kingdom built on an agrarian economy, to South Korea and North Korea, two modern, industrialized nation-states in the globalized present. Explores key aspects of Korea's great cultural and social transformation from the 15th century to the 21st century. Delves into recent studies on gender history and on the constructed notion of \"national culture.\" Also analyzes primary sources from different historical periods, as well as cinematic representations of Korea's past and present.",
            "id": "HISTORY 340",
            "parent": "HISTORY",
            "title": "CULTURAL HISTORY OF KOREA"
        }
    },
    {
        "data": {
            "description": "The disintegration of traditional Chinese society under the impact of Western imperialism, the rise of modern Chinese nationalism, and the emergence of modern revolutionary movements and ideologies.",
            "id": "ASIAN/HISTORY 341",
            "title": "HISTORY OF MODERN CHINA, 1800-1949"
        }
    },
    {
        "data": {
            "description": "The experience and legacy of the First World War has been linked to nearly every social, cultural, and political transformation that marked the short century that followed: mobilization and the experience of total war transformed the relations between governments and citizens, between men and women, and between social classes. Europeans experienced death on an unprecedented scale and came to terms with new forms of industrialized warfare, from the use of poison gas to modern practices of genocide. Europeans now learned to live with violence, both during as well as after the war, and found new ways to mourn or remember the dead. Using a wide variety of contemporary sources -- memoirs, essays, poems, or cinematic representations -- situates the upheaval of 1914-1918 within the larger framework of twentieth-century European history.",
            "id": "HISTORY 350",
            "parent": "HISTORY",
            "title": "THE FIRST WORLD WAR AND THE SHAPING OF TWENTIETH-CENTURY EUROPE"
        }
    },
    {
        "data": {
            "description": "The founding and growth of the military establishment, the exercise of the military art, and military policies treated in connection with relevant political, social, and economic factors.",
            "id": "HISTORY 345",
            "parent": "HISTORY",
            "title": "MILITARY HISTORY OF THE UNITED STATES"
        }
    },
    {
        "data": {
            "description": "The history of North America from the fifteenth through eighteenth centuries, with the primary focus on Anglo-America.",
            "id": "HISTORY 910",
            "parent": "HISTORY",
            "title": "HISTORY OF COLONIAL NORTH AMERICA"
        }
    },
    {
        "data": {
            "description": "The history of the Jews in selected parts of the world since the 17th century. Particular attention will be paid to the fact that this is the history of a minority group whose life unfolds in relationship to a larger society.",
            "id": "HISTORY/JEWISH 220",
            "title": "INTRODUCTION TO MODERN JEWISH HISTORY"
        }
    },
    {
        "data": {
            "description": "The major problems of historical interpretations in Chinese intellectual history from the classical period to 1840 on the basis of English translations of primary sources and English-language secondary sources. Topics vary.",
            "id": "HISTORY 700",
            "parent": "HISTORY",
            "title": "PROSEMINAR: TRADITIONAL & EARLY MODERN CHINESE INTELLECTUAL HISTORY"
        }
    },
    {
        "data": {
            "description": "The modern history of the concept \"East Meets West\" (or its variant \"East vs. West\"), with an emphasis on its changing meanings and uses from the nineteenth to the twenty-first centuries in East Asia (primarily Japan) and the United States. Analyzing works in the arts, literature, philosophy, political economy, and popular culture, trace how and why this intellectual construction became an important influence in modern history.",
            "id": "HISTORY 170",
            "parent": "HISTORY",
            "title": "EAST MEETS WEST: MYTH, MEANING, AND MODERNITY"
        }
    },
    {
        "data": {
            "description": "The social, economic and political transformation of China under Communism; the role of ideology in contemporary Chinese historical development; the nature of that historical development in the comparative perspective of other post-revolutionary histories.",
            "id": "ASIAN/HISTORY 342",
            "title": "HISTORY OF THE PEOPLES REPUBLIC OF CHINA, 1949 TO THE PRESENT"
        }
    },
    {
        "data": {
            "description": "This course introduces students to the interdisciplinary field of material culture studies. It is intended for students interested in any professional endeavor related to material culture, including careers in museums, galleries, historical societies, historic preservation organizations, and academic institutions. During the semester, students have varied opportunities to engage with and contemplate the material world to which people give meaning and which, in turn, influences their lives. Sessions combine in some way the following: presentations from faculty members and professionals who lecture on a phase of material culture related to his/her own scholarship or other professional work; discussion of foundational readings in the field; visits to collections and sites on campus and around Madison; discussion of readings assigned by visiting presenters or the professors; and exams and short papers that engage material culture topics.",
            "id": "ANTHRO/ARTHIST/DS/HISTORY/LANDARC 264",
            "title": "DIMENSIONS OF MATERIAL CULTURE"
        }
    },
    {
        "data": {
            "description": "This course introduces students to the interdisciplinary field of material culture studies. It is intended for students interested in any professional endeavor related to material culture, including careers in museums, galleries, historical societies, historic preservation organizations, and academic institutions. During the semester, students have varied opportunities to engage with and contemplate the material world to which people give meaning and which, in turn, influences their lives. Sessions combine in some way the following: presentations from faculty members and professionals who lecture on a phase of material culture related to his/her own scholarship or other professional work; discussion of foundational readings in the field; visits to collections and sites on campus and around Madison; discussion of readings assigned by visiting presenters or the professors; and exams and short papers that engage material culture topics.",
            "id": "ANTHRO/ARTHIST/DS/HISTORY/LANDARC 764",
            "title": "DIMENSIONS OF MATERIAL CULTURE"
        }
    },
    {
        "data": {
            "description": "This course is intended to help students understand World War II from the perspective of Asia. The focus is not only on the American and Japanese roles in the war but also on lesser, often overlooked participants such as China, Korea, and Southeast Asia. The course will focus not only on the diplomatic, political, and military situation of wartime Asia, but also on perceptions and experiences of the war from those most heavily affected by it: those experiencing it on the ground. Understanding this war is critical for helping us understand contemporary Asia. The foundations of the Cold War and the post-Cold War world that we live in today were forged on battlefields in mainland China, Burma, small islands in the Pacific, and in the skies over the archipelago of Japan. In order to provide the background and understand the legacies, this course covers an extended time frame, beginning in the 19th century with the arrival of the West in Asia and continues into the 1950s.",
            "id": "ASIAN/HISTORY 363",
            "title": "CHINA AND WORLD WAR II IN ASIA"
        }
    },
    {
        "data": {
            "description": "Topics in Medieval history.",
            "id": "HISTORY 805",
            "parent": "HISTORY",
            "title": "SEMINAR-MEDIEVAL HISTORY"
        }
    },
    {
        "data": {
            "description": "Topics in professional development for historians with an emphasis on building skills that are valuable both inside and outside the academy, such as managing the writing process, teaching college history, or communicating historical research to a broad, nonspecialist audience. Content varies.",
            "id": "HISTORY 710",
            "parent": "HISTORY",
            "title": "PROFESSIONAL DEVELOPMENT SEMINAR"
        }
    },
    {
        "data": {
            "description": "Topics in the major issues and themes in lesbian, gay, bisexual, and transgender history, considered across race, class, nationality, and time.",
            "id": "HISTORY 275",
            "parent": "HISTORY",
            "title": "TOPICS IN LGBT HISTORY"
        }
    },
    {
        "data": {
            "description": "Topics include demography and structure of the slave trade, but major focus on continuities and transformations of African cultures and social structures in the Americas--ethnicity, religion, kinship, gender, oral tradition, creolization, etc.",
            "id": "HISTORY 278",
            "parent": "HISTORY",
            "title": "AFRICANS IN THE AMERICAS, 1492-1808"
        }
    },
    {
        "data": {
            "description": "Topics on racial/ethnic minorities in the US in historical perspective; or topics that intersect with race or ethnicity in the US; or comparative historical topics that address how racial/ethnic minorities in the US negotiate exclusion and marginalization.",
            "id": "HISTORY 227",
            "parent": "HISTORY",
            "title": "EXPLORATIONS IN THE HISTORY OF RACE AND ETHNICITY"
        }
    },
    {
        "data": {
            "description": "Topics significant for the histories of Latin America, Africa, Islamic core, South Asia and Southeast Asia. A single topic chosen each semester for a series of comparative essays by seminar members.",
            "id": "HISTORY 753",
            "parent": "HISTORY",
            "title": "SEMINAR-COMPARATIVE WORLD HISTORY"
        }
    },
    {
        "data": {
            "description": "Topics vary reflecting the interests, expertise, and innovating intention of the instructor.",
            "id": "HISTORY 221",
            "parent": "HISTORY",
            "title": "EXPLORATIONS IN AMERICAN HISTORY (H)"
        }
    },
    {
        "data": {
            "description": "Topics vary reflecting the interests, expertise, and innovating intention of the instructor.",
            "id": "HISTORY 223",
            "parent": "HISTORY",
            "title": "EXPLORATIONS IN EUROPEAN HISTORY (H)"
        }
    },
    {
        "data": {
            "description": "Topics vary reflecting the interests, expertise, and innovating intention of the instructor.",
            "id": "HISTORY 224",
            "parent": "HISTORY",
            "title": "EXPLORATIONS IN EUROPEAN HISTORY (S)"
        }
    },
    {
        "data": {
            "description": "Topics vary reflecting the interests, expertise, and innovating intention of the instructor.",
            "id": "HISTORY 225",
            "parent": "HISTORY",
            "title": "EXPLORATIONS IN THIRD WORLD HISTORY (H)"
        }
    },
    {
        "data": {
            "description": "Topics vary reflecting the specializations, expertise, and curricula of study abroad programs. Enrollment in a UW-Madison resident study abroad program.",
            "id": "HISTORY 271",
            "parent": "HISTORY",
            "title": "HISTORY STUDY ABROAD:  EUROPEAN HISTORY"
        }
    },
    {
        "data": {
            "description": "Topics vary reflecting the specializations, expertise, and curricula of study abroad programs. Enrollment in a UW-Madison resident study abroad program.",
            "id": "HISTORY 272",
            "parent": "HISTORY",
            "title": "HISTORY STUDY ABROAD: UNITED STATES HISTORY"
        }
    },
    {
        "data": {
            "description": "Topics vary reflecting the specializations, expertise, and curricula of study abroad programs. Enrollment in a UW-Madison resident study abroad program.",
            "id": "HISTORY 273",
            "parent": "HISTORY",
            "title": "HISTORY STUDY ABROAD: NON-WESTERN HISTORY"
        }
    },
    {
        "data": {
            "description": "Topics vary reflecting the specializations, expertise, and curricula of study abroad programs. Enrollment in a UW-Madison resident study abroad program.",
            "id": "HISTORY 274",
            "parent": "HISTORY",
            "title": "HISTORY STUDY ABROAD: TRANSNATIONAL/GLOBAL HISTORY"
        }
    },
    {
        "data": {
            "description": "Topics vary related to the History of South Asia, Eurasia, and the Indian Ocean.",
            "id": "ASIAN/HISTORY 463",
            "title": "TOPICS IN SOUTH ASIAN HISTORY"
        }
    },
    {
        "data": {
            "description": "Traces the development of higher education and, specifically, the institution known as the \"university,\" in the United States and Europe since the Middle Ages. Concentrates on the intellectual, political, and social history of higher education, focusing particularly on the history of the \"university\" as an IDEA, an INSTITUTION, and as a community of PEOPLE, including students and faculty.",
            "id": "EDPOL/HISTORY 107",
            "title": "THE HISTORY OF THE UNIVERSITY IN THE WEST"
        }
    },
    {
        "data": {
            "description": "Traces the history and evolution of the American cultural landscape from precolonial times to present. Explores how class, ethnic, and racial inequality have shaped the appearance of the American landscape over time, and how that landscape in turn has affected relationships between people and groups through the present day. Examines extraordinary things (civic structures (like our State Capitol), National Parks, War Memorials) and more ordinary kinds of places (mining towns, cotton plantations, sites of recreation and leisure, and suburban tract housing) to stimulate critical thinking about how these places have served people and groups unequally and disproportionately over time and across space. Considers complex meanings of American spaces and places to different people and groups, stimulating empathy and encouraging participation in a multicultural society.",
            "id": "ARTHIST/ENVIRST/GEOG/HISTORY/LANDARC 239",
            "title": "MAKING THE AMERICAN LANDSCAPE"
        }
    },
    {
        "data": {
            "description": "Using sexuality as a category of historical analysis, examines historiographical, methodological, and theoretical contributions to understanding all aspects of the past.",
            "id": "GEN&WS/HISTORY 938",
            "title": "HISTORY OF SEXUALITY"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ECON",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "HISTORY",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "HISTSCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "AMERIND/HISTORY 190",
            "target": "AMERIND/HISTORY 380"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON/HISTORY 466"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON 101"
        }
    },
    {
        "data": {
            "source": "HISTORY 102",
            "target": "HISTORY/SOC 670"
        }
    },
    {
        "data": {
            "source": "HISTORY 201",
            "target": "HISTORY 401"
        }
    },
    {
        "data": {
            "source": "HISTORY 201",
            "target": "HISTORY 500"
        }
    },
    {
        "data": {
            "source": "HISTORY 201",
            "target": "HISTORY 600"
        }
    },
    {
        "data": {
            "source": "HISTORY 201",
            "target": "HISTSCI 211"
        }
    },
    {
        "data": {
            "source": "HISTORY 345",
            "target": "HISTORY 427"
        }
    },
    {
        "data": {
            "source": "HISTORY 345",
            "target": "HISTORY 428"
        }
    },
    {
        "data": {
            "source": "HISTORY 427",
            "target": "HISTORY 345"
        }
    },
    {
        "data": {
            "source": "HISTORY 428",
            "target": "HISTORY 345"
        }
    },
    {
        "data": {
            "source": "HISTORY/LEGALST 261",
            "target": "HISTORY/LEGALST 477"
        }
    },
    {
        "data": {
            "source": "HISTORY/LEGALST 261",
            "target": "HISTORY/LEGALST 510"
        }
    },
    {
        "data": {
            "source": "HISTSCI 211",
            "target": "HISTORY 201"
        }
    },
    {
        "data": {
            "source": "HISTSCI 623",
            "target": "HISTORY/HISTSCI 323"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 113"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 113",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "ECON 111"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    }
]