[
    {
        "data": {
            "description": "An introduction to grape production and wine culture targeting students interested in learning the science of growing grapes, winemaking, and wine appreciation. Topics include cultural history and geography of the world's grape-producing regions, principles of plant anatomy and physiology, biochemistry of wine production, wine producing regions of the world and wine styles, and sensory evaluation of wines. Includes a wine tasting discussion to explore the sensory attributes of the wines and production practices specific to the wine production regions to be covered.  Students must be 21 years old by the beginning of class.",
            "id": "HORT 330",
            "parent": "HORT",
            "title": "WINES AND VINES OF THE WORLD"
        }
    },
    {
        "data": {
            "description": "Indigenous foods of North America are a vital component of modern agricultural and food systems. Indigenous foods and foodways will be examined from interdisciplinary historical, legal, biological, and social perspectives. Historic indigenous foodways of the present-day upper Midwestern United States and the impact on food and seed sovereignty of settler colonialism and subsequent agricultural practices and policies will be explored. Current efforts to re-claim agricultural traditions and foodways to improve public health, economic opportunity, and food and seed sovereignty will be covered, including the right to healthy and culturally appropriate food produced through ecologically sound and sustainable methods, to define one's own food and agriculture systems, and to control the mechanisms and policies that govern food distribution. Hands-on activities are featured; previous examples include cooking with indigenous foods, ice fishing, and tapping maple trees for syrup.",
            "id": "HORT 380",
            "parent": "HORT",
            "title": "INDIGENOUS FOODWAYS: FOOD AND SEED SOVEREIGNTY"
        }
    },
    {
        "data": {
            "description": "Accelerated coverage of topics in general chemistry, including introduction to laboratory techniques. Topics include atomic and molecular structure, chemical equilibrium, acid-base chemistry, thermodynamics, kinetics, and electrochemistry.",
            "id": "CHEM 109",
            "parent": "CHEM",
            "title": "ADVANCED GENERAL CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Agroecology has blossomed across the world in recent decades as not only a science, but also a practice, and a movement. Employ the multiple disciplines and perspectives that Agroecology affords to analyze our agricultural and food systems wihin a broader context of dynamic social and ecological relationships.",
            "id": "AGROECOL/AGRONOMY/C&ESOC/ENTOM/ENVIRST 103",
            "title": "AGROECOLOGY: AN INTRODUCTION TO THE ECOLOGY OF FOOD AND AGRICULTURE"
        }
    },
    {
        "data": {
            "description": "An in-depth look at plant growth, development, respiration, photosynthesis, mineral nutrition, and water relations. Experimental approaches will be used to demonstrate principles described.",
            "id": "BOTANY 500",
            "parent": "BOTANY",
            "title": "PLANT PHYSIOLOGY"
        }
    },
    {
        "data": {
            "description": "An overview of the history, legality, regulation, anatomy and botany, agronomic and horticultural practices, and end-use potential of industrial hemp. Focus on sustainable agricultural production and processing of industrial hemp for food, fiber, and cannabinoids. Gain real world insight into this rapidly expanding area. Hands-on experience growing, propagating and pollinating hemp.",
            "id": "HORT 240",
            "parent": "HORT",
            "title": "THE SCIENCE OF CANNABIS"
        }
    },
    {
        "data": {
            "description": "An overview of the importance of fresh and processed vegetables worldwide. Vegetable origin, history, classification, culture, marketing, physiology, genetics, handling, quality, significance in world cultures and diets.",
            "id": "HORT 370",
            "parent": "HORT",
            "title": "WORLD VEGETABLE CROPS"
        }
    },
    {
        "data": {
            "description": "Basic principles of ecology and interrelations between individuals, populations, communities, ecosystems and their environment; transmission genetics and introduction to population genetics; origin of life, evolutionary mechanisms, ancestral relationships among species, and the diversity of life.",
            "id": "BIOCORE 381",
            "parent": "BIOCORE",
            "title": "EVOLUTION, ECOLOGY, AND GENETICS"
        }
    },
    {
        "data": {
            "description": "Chemistry, nutrition, and metabolism of biological systems.",
            "id": "BIOCHEM 501",
            "parent": "BIOCHEM",
            "title": "INTRODUCTION TO BIOCHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Computing-intensive course to prepare students for genetic mapping research; linkage analysis and QTL mapping in designed crosses; linkage disequilibrium and association analysis (GWAS). Recommended preparation is undergraduate courses in genetics and statistics and prior experience writing R scripts (such as module 1 of STAT 327).",
            "id": "AGRONOMY/ANSCI/GENETICS/HORT 615",
            "title": "GENETIC MAPPING"
        }
    },
    {
        "data": {
            "description": "Core organic chemistry concepts of structure, reactivity, and synthesis with regards to the functional groups commonly found in commercial and biological substances. Covers a selection of topics fromCHEM 343and345.",
            "id": "CHEM 341",
            "parent": "CHEM",
            "title": "ELEMENTARY ORGANIC CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Descriptive statistics, distributions, one- and two-sample normal inference, power, one-way ANOVA, simple linear regression, categorical data, non-parametric methods; underlying assumptions and diagnostic work.",
            "id": "F&WECOL/STAT 571",
            "title": "STATISTICAL METHODS FOR BIOSCIENCE I"
        }
    },
    {
        "data": {
            "description": "Dig into the history of plant sciences to understand why plants and humans have the relationships they do today.  Focus on the experiences of Indigenous Americans and People of Color to understand the roots of inequities in horticulture, agriculture, and other plant sciences. Practice skills as a translator of science and history through engagement with scientific publications, library resources, and archival materials. Define important societal questions, collect and analyze evidence, present original conclusions, and contribute to ongoing discussions about the relationship of people and plants.  Includes intensive writing and oral presentations.",
            "id": "HISTSCI/HORT 301",
            "title": "(HORTI)CULTURAL ROOTS: HUMAN HISTORIES OF PLANTS AND SCIENCE"
        }
    },
    {
        "data": {
            "description": "Discuss advanced topics in selection theory and the utilization of molecular markers in selection.",
            "id": "AGRONOMY/HORT 812",
            "title": "SELECTION THEORY FOR QUANTITATIVE TRAITS IN PLANTS"
        }
    },
    {
        "data": {
            "description": "Essential and beneficial elements, solutions and soil as nutrient sources, rhizosphere chemistry, nutritional physiology, ion uptake and translocation, functions of elements, nutrient interactions, genetics of plant nutrition.",
            "id": "BOTANY/HORT/SOILSCI 626",
            "title": "MINERAL NUTRITION OF PLANTS"
        }
    },
    {
        "data": {
            "description": "Explores a detailed atomic and molecular view of matter and its interactions, with a specific focus on quantum theory, molecular structure, and chemical bonding. Application required for enrollment.",
            "id": "CHEM 115",
            "parent": "CHEM",
            "title": "CHEMICAL PRINCIPLES I"
        }
    },
    {
        "data": {
            "description": "Explores how and why genetically modified (GM) crops are created and their regulation at the federal and state level. Through case studies, students will learn about the impacts of GM crops and critically evaluate arguments both for and against their use. Readings and discussion introduce students to the complex economic, cultural, and political issues surrounding GM crops.",
            "id": "AGRONOMY/HORT 360",
            "title": "GENETICALLY MODIFIED CROPS: SCIENCE, REGULATION & CONTROVERSY"
        }
    },
    {
        "data": {
            "description": "Faculty, regional professionals, local organic farmers, and students present and discuss topics relevant to history, marketing, economics, production, and social context of organic and sustainable agriculture.",
            "id": "HORT 372",
            "parent": "HORT",
            "title": "SEMINAR IN ORGANIC AGRICULTURE"
        }
    },
    {
        "data": {
            "description": "Field identification, landscape characteristics, uses, environmental requirements, adaptability of woody ornamental plants; their autumn and winter character.",
            "id": "HORT/LANDARC 263",
            "title": "LANDSCAPE PLANTS I"
        }
    },
    {
        "data": {
            "description": "Fluctuations and regulations of temperature, light, water, carbon dioxide and pollutants in natural and controlled environments. Effects upon plant growth and development. Adaptive mechanisms. Significance of air ions, electromagnetic fields and other geophysical factors.",
            "id": "HORT 320",
            "parent": "HORT",
            "title": "ENVIRONMENT OF HORTICULTURAL PLANTS"
        }
    },
    {
        "data": {
            "description": "For the beginning student. Scientific basis for horticultural practices; scope of the field of horticulture; introduction to propagation, culture, management, improvement, storage, and marketing of flowers, fruits, ornamentals and vegetables.",
            "id": "HORT 120",
            "parent": "HORT",
            "title": "SURVEY OF HORTICULTURE"
        }
    },
    {
        "data": {
            "description": "Functions, requirements and uptake of essential plant nutrients; chemical and microbial processes affecting nutrient availability; diagnosis of plant and soil nutrient status; fertilizers and efficient fertilizer use in different tillage systems.",
            "id": "AGRONOMY/HORT/SOILSCI 326",
            "title": "PLANT NUTRITION MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "General biological principles. Topics include: evolution, ecology, animal behavior, cell structure and function, genetics and molecular genetics and the physiology of a variety of organ systems emphasizing function in humans.",
            "id": "BIOLOGY/ZOOLOGY 101",
            "title": "ANIMAL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Genetic analysis, population genetics, evolution and quantitative genetics. Includes mutant screens, pathway analysis, mosaic analysis, reverse genetics, genomics, Hardy-Weinberg  linkage equilibrium, inbreeding, genetic drift, natural selection, population structure, inheritance of complex traits, domestication and human evolution.",
            "id": "GENETICS 468",
            "parent": "GENETICS",
            "title": "GENERAL GENETICS 2"
        }
    },
    {
        "data": {
            "description": "Genetics in eukaryotes and prokaryotes.  Includes transmission genetics, molecular genetics, evolutionary genetics, genetic engineering, and societal issues associated with genetics.  Illustrative material includes bacteria, plants, insects, and vertebrates.",
            "id": "GENETICS 466",
            "parent": "GENETICS",
            "title": "PRINCIPLES OF GENETICS"
        }
    },
    {
        "data": {
            "description": "Genetics of eukaryotes and prokaryotes. Includes transmission genetics, probability and hypothesis testing, genetic mapping, molecular genetics, gene expression, and genetic engineering. Illustrative material includes viruses, bacteria, plants, fungi, insects, and humans.",
            "id": "GENETICS 467",
            "parent": "GENETICS",
            "title": "GENERAL GENETICS 1"
        }
    },
    {
        "data": {
            "description": "Graduate seminar in Plant Breeding  Plant Genetics (PBPG) that requires students to give oral scientific presentations on topics chosen by the instructors and/or the student¿s thesis research. This seminar is coordinated by PBPG faculty on a rotating basis.",
            "id": "AGRONOMY/GENETICS/HORT 957",
            "title": "SEMINAR-PLANT BREEDING"
        }
    },
    {
        "data": {
            "description": "Hands-on turf establishment, cool- and warm-season grass, seed and weed identification, chemical application, and turf cultivation techniques and equipment use, plus field trips to major league sport facilities and golf courses.",
            "id": "HORT/PLPATH 262",
            "title": "TURFGRASS MANAGEMENT LABORATORY"
        }
    },
    {
        "data": {
            "description": "Highlights the connections between tropical plants and society. Topics include multidisciplinary reflections on the biology of tropical plants, as well as an overview of different production systems and some of the social and environmental problems associated with the utilization of tropical plants in the context of local and global markets. Provides the opportunity to demonstrate comparative skills with respect to local and international challenges posed by the topics we address in class. Illustrates connections between horticulture and conservation, food security, nutrition, and global health.",
            "id": "AGRONOMY/HORT 376",
            "title": "TROPICAL HORTICULTURAL SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Honors research work under direct guidance of a Horticulture faculty or instructional academic staff member. Students are responsible for arranging the work and credits with the supervising instructor. Intended for students in the CALS Honors Program.",
            "id": "HORT 289",
            "parent": "HORT",
            "title": "HONORS INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Independent research and writing for graduate students under the supervision of a faculty member.",
            "id": "HORT 990",
            "parent": "HORT",
            "title": "RESEARCH"
        }
    },
    {
        "data": {
            "description": "Individual study and research for students completing theses under direct guidance of a Horticulture faculty or instructional academic staff member. Students are responsible for arranging the work and credits with the supervising instructor. Intended for students in the CALS Honors Program. Continuation ofHORT 681",
            "id": "HORT 682",
            "parent": "HORT",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Individual study and research for students completing theses under direct guidance of a Horticulture faculty or instructional academic staff member. Students are responsible for arranging the work and credits with the supervising instructor. Intended for students in the CALS Honors Program.",
            "id": "HORT 681",
            "parent": "HORT",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Instructional orientation to teaching at the higher education level in the agricultural and life sciences, direct teaching experience under faculty supervision, experience in testing and evaluation of students, and the analysis of teaching performance.",
            "id": "HORT 799",
            "parent": "HORT",
            "title": "PRACTICUM IN HORTICULTURE TEACHING"
        }
    },
    {
        "data": {
            "description": "Internship under guidance of a Horticulture faculty or instructional academic staff member and internship site supervisor. Students are responsible for arranging the work and credits with the Horticulture faculty or instructional academic staff member and the internship site supervisor.",
            "id": "HORT 399",
            "parent": "HORT",
            "title": "COORDINATIVE INTERNSHIP/COOPERATIVE EDUCATION"
        }
    },
    {
        "data": {
            "description": "Introduction of basic concepts of plant molecular biology and molecular techniques in current use. Topics include: organization and regulation of plant genes, gene cloning and analysis, transformation systems for plants, and molecular techniques for crop improvement.",
            "id": "GENETICS/HORT 550",
            "title": "MOLECULAR APPROACHES FOR POTENTIAL CROP IMPROVEMENT"
        }
    },
    {
        "data": {
            "description": "Introduction to the basic principles and concepts of the biology of plants. an integrative approach stressing evolutionary sequences and the relationship between structure and function at succeeding levels of organization: molecule, cell, organism, population, community. Correlated lectures, laboratories, and discussions.",
            "id": "BIOLOGY/BOTANY 130",
            "title": "GENERAL BOTANY"
        }
    },
    {
        "data": {
            "description": "Lab and field techniques used in breeding and maintaining economic crops.",
            "id": "AGRONOMY/HORT 502",
            "title": "TECHNIQUES OF PLANT BREEDING"
        }
    },
    {
        "data": {
            "description": "Major emphasis on the roles of plants and microbes in past and present global ecology, and the past and present uses of plants and microbes by humans, including emerging applications of biotechnology.",
            "id": "BOTANY 100",
            "parent": "BOTANY",
            "title": "SURVEY OF BOTANY"
        }
    },
    {
        "data": {
            "description": "Methods of propagation of herbaceous and woody plants, fundamental anatomical and physiological principles underlying sexual and asexual propagation of plants.",
            "id": "HORT 227",
            "parent": "HORT",
            "title": "PROPAGATION OF HORTICULTURAL PLANTS"
        }
    },
    {
        "data": {
            "description": "Nutrient requirements of turfgrasses; nature of turfgrass response to fertilization; soil and tissue testing methodology and interpretation; irrigation scheduling; irrigation water quality; use of irrigation and fertilizer to minimize environmental impact; writing effective nutrient management plans.",
            "id": "HORT/SOILSCI 332",
            "title": "TURFGRASS NUTRIENT AND WATER MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "On-site identification and description, aesthetic qualities and uses, environmental requirements and adaptability of selected ornamental plants with emphasis on annuals, herbaceous perennials, and those used for interior design.",
            "id": "HORT 234",
            "parent": "HORT",
            "title": "ORNAMENTAL PLANTS"
        }
    },
    {
        "data": {
            "description": "Overview of world, national, and regional horticulture plants and industries presented by various faculty. History and profiles of research advancing horticulture presented by department faculty.",
            "id": "HORT 121",
            "parent": "HORT",
            "title": "HORTICULTURE COLLOQUIUM"
        }
    },
    {
        "data": {
            "description": "Physical chemical and biological properties of soils as they affect soil-plant-water relations, soil classification and suitability for agricultural and other uses.",
            "id": "SOILSCI 301",
            "parent": "SOILSCI",
            "title": "GENERAL SOIL SCIENCE"
        }
    },
    {
        "data": {
            "description": "Plant science applied to the growth, production, management, distribution and utilization of field crops.",
            "id": "AGRONOMY 100",
            "parent": "AGRONOMY",
            "title": "PRINCIPLES AND PRACTICES IN CROP PRODUCTION"
        }
    },
    {
        "data": {
            "description": "Plants are essential for human wellbeing, yet they are often manipulated in ways that contribute significantly to human and environmental detriment. Provides an opportunity for students to consider the scientific, social, economic, and public policy implications of plants or groups of plants and dive deeply into those subjects for a variety of crops that are essential for human societies.",
            "id": "HORT 351",
            "parent": "HORT",
            "title": "A DEEPER LOOK AT PLANTS AND HUMAN WELLBEING"
        }
    },
    {
        "data": {
            "description": "Plants provide not only the foundation of food, clothing, and shelter essential for human existence, but also some of the key raw materials for transcendence and abstraction through music, art, and spirituality. Since antiquity, we have co-evolved with plants and their derivative products, with each exerting a domesticating force on the other. It is, for example, impossible to think of our modern life without its plant-based accompaniments in the form of cotton, sugar, bread, coffee, and wood. Yet they are so ubiquitous we may forget they all derive from plants discovered, domesticated, bred, and farmed for millennia in a never-ending pursuit to improve our wellbeing. Major points of intersection between plants and human wellbeing will be explored from a horticultural point of view by highlighting a plant or group of plants that represent a primary commodity or resource through which humans have pursued their own aims and explore effects and impacts on human society.",
            "id": "HORT 350",
            "parent": "HORT",
            "title": "PLANTS AND HUMAN WELLBEING"
        }
    },
    {
        "data": {
            "description": "Polynomial regression, multiple regression, two-way ANOVA with and without interaction, split-plot design, subsampling, analysis of covariance, elementary sampling, introduction to bioassay.",
            "id": "F&WECOL/STAT 572",
            "title": "STATISTICAL METHODS FOR BIOSCIENCE II"
        }
    },
    {
        "data": {
            "description": "Presents an overview of the techniques, biology and underlying theory of plant tissue culture, genetic engineering and genome editing. Overviews of research and commercial applications, and issues/challenges in the area of plant biotechnology are also covered.",
            "id": "AGRONOMY/BOTANY/HORT 340",
            "title": "PLANT CELL CULTURE AND GENETIC ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Principles and application of chemical equilibrium, coordination chemistry, oxidation-reduction and electrochemistry, kinetics, nuclear chemistry, introduction to organic chemistry, and chemistry laboratory skills.",
            "id": "CHEM 104",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Principles involved in breeding and maintaining economic crops; factors affecting the choice of breeding methods; alternative approaches through hybridization and selection.",
            "id": "AGRONOMY/HORT 501",
            "title": "PRINCIPLES OF PLANT BREEDING"
        }
    },
    {
        "data": {
            "description": "Principles of molecular structure and bonding applied to predict and explain the reactivity of alkanes, alkenes, alkynes, alkyl halides, alcohols, and thiols. Emphasis placed on rationalizing the stereochemical and regiochemical outcome of chemical processes.",
            "id": "CHEM 343",
            "parent": "CHEM",
            "title": "ORGANIC CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Principles of molecular structure and bonding applied to predict and explain the reactivity of aromatic systems, benzylic and allylic systems, aryl and vinyl halides, and carbonyl-containing compounds (e.g., ketones, carboxylic acids, esters, acid chlorides, amides). Emphasis placed on rationalizing the stereochemical and regiochemical outcome of chemical processes as well as arguing reaction outcomes from spectroscopic evidence.",
            "id": "CHEM 345",
            "parent": "CHEM",
            "title": "ORGANIC CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Principles of selection, production, handling, use of fruits, vegetables, flowers, and foliage plants grown indoors. One-day field trip required.",
            "id": "HORT 334",
            "parent": "HORT",
            "title": "GREENHOUSE CULTIVATION"
        }
    },
    {
        "data": {
            "description": "Principles of transferring plant genes by sexual, somatic, and molecular methods and the application of gene transfer in plant breeding and genetic engineering to improve crop plants.",
            "id": "AGRONOMY/HORT 338",
            "title": "PLANT BREEDING AND BIOTECHNOLOGY"
        }
    },
    {
        "data": {
            "description": "Provide students with hands-on experience in and understanding of greenhouse cultivation. The optional lab component ofHORT 334Greenhouse Cultivation.",
            "id": "HORT 335",
            "parent": "HORT",
            "title": "GREENHOUSE CULTIVATION LAB"
        }
    },
    {
        "data": {
            "description": "Provides academic credit for directed study under direct guidance of a Horticulture faculty member or instructional academic staff member. Students are responsible for arranging the work and credits with the supervising instructor.",
            "id": "HORT 699",
            "parent": "HORT",
            "title": "SPECIAL PROBLEMS"
        }
    },
    {
        "data": {
            "description": "Provides an area equivalency for courses taken on Madison Study Abroad Programs that do not equate to existing UW courses. Current enrollment in a UW-Madison study abroad program",
            "id": "HORT 400",
            "parent": "HORT",
            "title": "STUDY ABROAD IN HORTICULTURE"
        }
    },
    {
        "data": {
            "description": "Provides an in-depth understanding of the history of organic agriculture, its production, processing, marketing, and social dimensions, and its impact on environmental, community, and human health.",
            "id": "AAE/AGRONOMY/HORT/PLPATH 367",
            "title": "INTRODUCTION TO ORGANIC AGRICULTURE: PRODUCTION, MARKETS, AND POLICY"
        }
    },
    {
        "data": {
            "description": "Research work under direct guidance of a Horticulture faculty or instructional academic staff member. Students are responsible for arranging the work and credits with the supervising instructor.",
            "id": "HORT 299",
            "parent": "HORT",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Soils are fundamental to ecosystem science. A systems approach is used to investigate how soils look and function. Topics investigated include soil structure, biology, water, fertility, and taxonomy as well as the human impact on the soil environment.",
            "id": "ENVIRST/GEOG/SOILSCI 230",
            "title": "SOIL: ECOSYSTEM AND RESOURCE"
        }
    },
    {
        "data": {
            "description": "Special topics on issues relevant to Horticulture.",
            "id": "HORT 875",
            "parent": "HORT",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "Special topics on issues relevant to horticulture.",
            "id": "HORT 375",
            "parent": "HORT",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "Stoichiometry and the mole concept, the behavior of gases, liquids and solids, thermochemistry, electronic structure of atoms and chemical bonding, descriptive chemistry of selected elements and compounds, intermolecular forces, and chemistry laboratory skills.",
            "id": "CHEM 103",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Survey of fruit production, emphasizing commercial production of temperate fruits. Fruit origin, history, classification, physiology, genetics, harvest and post-harvest handling.",
            "id": "HORT 345",
            "parent": "HORT",
            "title": "FRUIT CROP PRODUCTION"
        }
    },
    {
        "data": {
            "description": "Survey of the basic principles and concepts of the biology of plants and their application to cultivation of food crops in controlled environments. Integrates topics including: organic systems, sustainability, urban agriculture, and socioecological factors.",
            "id": "HORT 333",
            "parent": "HORT",
            "title": "SURVEY OF CONTROLLED ENVIRONMENT FOOD PRODUCTION"
        }
    },
    {
        "data": {
            "description": "Sustainable use and management of turfgrass landscapes in urban and suburban environments, including home lawns, golf courses, and sports fields. Focus is on creating sustainable and attractive turfgrass landscapes through proper species selection, use of slow-release or organic fertilizer practices, and minimizing the use of pesticides and supplemental irrigation.",
            "id": "HORT/PLPATH 261",
            "title": "SUSTAINABLE TURFGRASS USE AND MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "This international field study will meet during the winter intercession in a tropical country in Central America. Reflect on the role of plants in our daily lives and the effects that our daily choices have on the environment, human health, conflicts, poverty, and development. Provides an opportunity to develop a holistic appreciation of horticulture by highlighting the interactions between plants and society. Discuss some of the social, scientific and environmental challenges that conventional, sustainable and organic horticulture practices face in the production, marketing, and use of tropical crops. The field study will provide an opportunity to contextualize what was learned during \"Tropical Horticultural Systems\" (HORT/​AGRONOMY  376). Visit diverse agricultural systems, such as small farms, large-scale operations, market growers, and industrial export businesses. In addition, we will visit agronomic centers, botanical gardens, herbaria, germplasm banks, and nature preserves.",
            "id": "HORT 378",
            "parent": "HORT",
            "title": "TROPICAL HORTICULTURAL SYSTEMS INTERNATIONAL FIELD STUDY"
        }
    },
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics and selected topics in Animal Physiology.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Topics include: selected topics in plant physiology, a survey of the five major kingdoms of organisms, speciation and evolutionary theory, and ecology at multiple levels of the biological hierarchy.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Use of statistical methods to facilitate improvements in quantitative traits of cultivated plants.",
            "id": "AGRONOMY/HORT 811",
            "title": "BIOMETRICAL PROCEDURES IN PLANT BREEDING"
        }
    },
    {
        "data": {
            "description": "Weekly seminar topics in agronomy and horticulture.",
            "id": "HORT 910",
            "parent": "HORT",
            "title": "SEMINAR"
        }
    },
    {
        "data": {
            "id": "AGRONOMY",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "BIOCHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "BIOCORE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "BOTANY",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "GENETICS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "HORT",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "SOILSCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "AGROECOL/AGRONOMY/C&ESOC/ENTOM/ENVIRST 103",
            "target": "AAE/AGRONOMY/HORT/PLPATH 367"
        }
    },
    {
        "data": {
            "source": "AGRONOMY 100",
            "target": "AAE/AGRONOMY/HORT/PLPATH 367"
        }
    },
    {
        "data": {
            "source": "AGRONOMY/HORT 376",
            "target": "HORT 378"
        }
    },
    {
        "data": {
            "source": "AGRONOMY/HORT/SOILSCI 326",
            "target": "HORT/SOILSCI 332"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 501",
            "target": "GENETICS/HORT 550"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "AGRONOMY/BOTANY/HORT 340"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "BOTANY 500"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "GENETICS 466"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "GENETICS 467"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "AGRONOMY/BOTANY/HORT 340"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "AGRONOMY/HORT 360"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "AGRONOMY/HORT 501"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "AGRONOMY/HORT 502"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "BOTANY 500"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "HORT 227"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "HORT 345"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "HORT 370"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "HORT/LANDARC 263"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 152"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 101"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BOTANY 500"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "GENETICS 467"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "target": "AGRONOMY/BOTANY/HORT 340"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "target": "HORT/LANDARC 263"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 151"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "BOTANY 500"
        }
    },
    {
        "data": {
            "source": "BOTANY 100",
            "target": "HORT/LANDARC 263"
        }
    },
    {
        "data": {
            "source": "BOTANY 500",
            "target": "BOTANY/HORT/SOILSCI 626"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "AGRONOMY/HORT/SOILSCI 326"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "SOILSCI 301"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 109"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 343"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "SOILSCI 301"
        }
    },
    {
        "data": {
            "source": "CHEM 115",
            "target": "SOILSCI 301"
        }
    },
    {
        "data": {
            "source": "CHEM 341",
            "target": "BIOCHEM 501"
        }
    },
    {
        "data": {
            "source": "CHEM 343",
            "target": "BIOCHEM 501"
        }
    },
    {
        "data": {
            "source": "CHEM 343",
            "target": "CHEM 345"
        }
    },
    {
        "data": {
            "source": "CHEM 345",
            "target": "CHEM 341"
        }
    },
    {
        "data": {
            "source": "ENVIRST/GEOG/SOILSCI 230",
            "target": "AGRONOMY/HORT/SOILSCI 326"
        }
    },
    {
        "data": {
            "source": "F&WECOL/STAT 571",
            "target": "F&WECOL/STAT 572"
        }
    },
    {
        "data": {
            "source": "F&WECOL/STAT 572",
            "target": "AGRONOMY/HORT 811"
        }
    },
    {
        "data": {
            "source": "GENETICS 466",
            "target": "AGRONOMY/HORT 338"
        }
    },
    {
        "data": {
            "source": "GENETICS 466",
            "target": "AGRONOMY/HORT 501"
        }
    },
    {
        "data": {
            "source": "GENETICS 466",
            "target": "AGRONOMY/HORT 502"
        }
    },
    {
        "data": {
            "source": "GENETICS 466",
            "target": "GENETICS 467"
        }
    },
    {
        "data": {
            "source": "GENETICS 466",
            "target": "GENETICS/HORT 550"
        }
    },
    {
        "data": {
            "source": "GENETICS 467",
            "target": "AGRONOMY/HORT 338"
        }
    },
    {
        "data": {
            "source": "GENETICS 467",
            "target": "AGRONOMY/HORT 501"
        }
    },
    {
        "data": {
            "source": "GENETICS 467",
            "target": "AGRONOMY/HORT 502"
        }
    },
    {
        "data": {
            "source": "GENETICS 467",
            "target": "GENETICS 466"
        }
    },
    {
        "data": {
            "source": "GENETICS 467",
            "target": "GENETICS 468"
        }
    },
    {
        "data": {
            "source": "GENETICS 467",
            "target": "GENETICS/HORT 550"
        }
    },
    {
        "data": {
            "source": "GENETICS 468",
            "target": "GENETICS 466"
        }
    },
    {
        "data": {
            "source": "HORT 120",
            "target": "HORT 320"
        }
    },
    {
        "data": {
            "source": "HORT 120",
            "target": "HORT 334"
        }
    },
    {
        "data": {
            "source": "HORT 334",
            "target": "HORT 335"
        }
    },
    {
        "data": {
            "source": "HORT 350",
            "target": "HORT 351"
        }
    },
    {
        "data": {
            "source": "HORT/PLPATH 261",
            "target": "HORT/PLPATH 262"
        }
    },
    {
        "data": {
            "source": "SOILSCI 301",
            "target": "AGRONOMY/HORT/SOILSCI 326"
        }
    },
    {
        "data": {
            "source": "SOILSCI 301",
            "target": "ENVIRST/GEOG/SOILSCI 230"
        }
    }
]