[
    {
        "data": {
            "description": "The development of literature and the arts in the ancient and medieval world, including Akhenaton's Egypt, Homer's Troy, Euripides' Athens, Virgil's Rome, and Dante's Florence. Literature and art in the context of society and ideas.",
            "id": "ILS 203",
            "parent": "ILS",
            "title": "WESTERN CULTURE: LITERATURE AND THE ARTS I"
        }
    },
    {
        "data": {
            "id": "HISTSCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Introduces science as a process of inquiry and discovery, not as a pre-established set of facts. Emphasizes hands-on learning in both laboratory and lecture environments with small group work and interactive discussion.",
            "id": "ILS 153",
            "parent": "ILS",
            "title": "WAYS OF KNOWING IN THE SCIENCES"
        }
    },
    {
        "data": {
            "id": "ILS",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Explores literary forms through which religions originating in western culture convey ideas. Focuses on Jewish, Christian, Muslim and related religious texts.",
            "id": "ILS/RELIGST 234",
            "title": "GENRES OF WESTERN RELIGIOUS WRITING"
        }
    },
    {
        "data": {
            "description": "Individual mentored study with a faculty member.",
            "id": "ILS 199",
            "parent": "ILS",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Western science and technology in the making. Major developments viewed in philosophical and social context, from antiquity to 17th century.",
            "id": "ILS 201",
            "parent": "ILS",
            "title": "WESTERN CULTURE: SCIENCE, TECHNOLOGY, PHILOSOPHY I"
        }
    },
    {
        "data": {
            "description": "Individual study for juniors or seniors completing theses for honors as arranged with a faculty member.",
            "id": "ILS 681",
            "parent": "ILS",
            "title": "UNDERGRADUATE HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Interdisciplinary themes and issues from the Integrated Liberal Studies (ILS) program.",
            "id": "ILS 275",
            "parent": "ILS",
            "title": "SPECIAL TOPICS IN INTEGRATED LIBERAL STUDIES"
        }
    },
    {
        "data": {
            "description": "Explore the foundations of sustainability using the UW-Madison campus as a living laboratory.  Ground your feet on the UW-Madison campus and ask questions about the energy we use, the food we eat, the air we breathe, the land we occupy, the goods we purchase, and the waste we create. A blend of environmental sciences and studies. Use principles of chemistry, physics, and biology to understand the dynamics of our human and earth systems, but also explore societal issues like public health and social justice, all through the context of sustainability and the UW-Madison campus community.",
            "id": "ENVIRST/ILS 255",
            "title": "INTRODUCTION TO SUSTAINABILITY SCIENCE"
        }
    },
    {
        "data": {
            "description": "Selected interdisciplinary topics in literature and art with emphasis on social, historical and political contexts.",
            "id": "ILS 371",
            "parent": "ILS",
            "title": "INTERDISCIPLINARY STUDIES IN THE ARTS AND LITERATURE"
        }
    },
    {
        "data": {
            "description": "Explores the three modes of argument and expression: verbal, visual, numerical. Engages in critical thinking about how these modes are structured and used. Practice in, and interpretation of, the three modes.",
            "id": "ILS 200",
            "parent": "ILS",
            "title": "CRITICAL THINKING AND EXPRESSION"
        }
    },
    {
        "data": {
            "description": "The development of Western political, economic and social thought from the Reformation to the present day: the origins, logic and evolution of liberalism, Marxism, and organic conservatism as the principal systems of thought of the modern age.",
            "id": "ILS 206",
            "parent": "ILS",
            "title": "WESTERN CULTURE: POLITICAL, ECONOMIC, AND SOCIAL THOUGHT II"
        }
    },
    {
        "data": {
            "description": "Individual mentored study with a faculty member.",
            "id": "ILS 198",
            "parent": "ILS",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Individual study for juniors or seniors completing theses as arranged with a faculty member.",
            "id": "ILS 691",
            "parent": "ILS",
            "title": "UNDERGRADUATE THESIS"
        }
    },
    {
        "data": {
            "description": "Introduces students to the major works of Machiavelli through the close reading of his writings in cultural and historical contexts. Discussion and targeted writing assignments will aim at cultivating in students 1) a broad understanding of Machiavelli's principal intellectual attitudes, 2) a deeper understanding of his literary sensibility, and 3) the ability to articulate controversies and complexities surrounding his thought.",
            "id": "ILS/ITALIAN/LITTRANS/POLISCI 365",
            "title": "MACHIAVELLI AND HIS WORLD"
        }
    },
    {
        "data": {
            "description": "Interdisciplinary analysis of selected topics in the humanities.",
            "id": "ILS 373",
            "parent": "ILS",
            "title": "INTERDISCIPLINARY STUDIES IN THE HUMANITIES"
        }
    },
    {
        "data": {
            "description": "Advanced readings in primary and secondary literature of the history of the 16th-17th century European science, with emphasis on current historiographic issues.",
            "id": "HISTSCI 623",
            "parent": "HISTSCI",
            "title": "STUDIES IN EARLY MODERN SCIENCE"
        }
    },
    {
        "data": {
            "description": "Individual study for juniors or seniors completing theses as arranged with a faculty member.",
            "id": "ILS 692",
            "parent": "ILS",
            "title": "UNDERGRADUATE THESIS"
        }
    },
    {
        "data": {
            "description": "Explores literature to understand representations and experiences of migration within the United States, and in the Americas more broadly, over time and across cultures. Focusing on literature and employing historical and psychoanalytic interpretive approaches, critically analyze artistic and literary representations of the migrant experience. Topics include: the relationships between literature, art, and migration; the role of migrants in constructing the United States; the role of art and literature in the empowerment of marginalized groups. Analyze literary texts in their contexts using tools of literary analysis and express ideas about literary texts and art from a critical perspective.",
            "id": "ILS/LACIS 367",
            "title": "THE LITERATURE OF MIGRATION AND THE MIGRANT EXPERIENCE IN THE AMERICAS"
        }
    },
    {
        "data": {
            "description": "Capstone experience seminar for Integrated Liberal Studies (ILS) students.",
            "id": "ILS 400",
            "parent": "ILS",
            "title": "CAPSTONE INTEGRATION SEMINAR"
        }
    },
    {
        "data": {
            "description": "Examines the development of Rome, \"the Eternal City,\" and its continuing presence as both a metaphoric and physical focal point of Italian artistic and cultural sensibilities. Outline the development of Rome's authoritative or \"mythical\" status in literature, art, architecture and film, beginning in the Augustan era and arriving to today, focusing on significant moments in the creation and expansion of the actual city and its cultural influence in the late-Middle Ages, the Renaissance, the era of the Risorgimento (Unification of Italy), and the rise of Fascism. Develop ability to think critically about how the diverse material productions of writers (historians, playwrights, poets), painters, sculptors, architects, philosophical thinkers, and later filmmakers of the periods covered reflect one another and reflect the ideas and ideologies of their age.",
            "id": "ILS/ITALIAN 350",
            "title": "ROME: LUST FOR GLORY"
        }
    },
    {
        "data": {
            "description": "The development of Western political, economic and social thought, from its origins in classic Greece and the Judaeo-Christian tradition, through Rome and the Medieval period, to the Renaissance and Reformation.",
            "id": "ILS 205",
            "parent": "ILS",
            "title": "WESTERN CULTURE: POLITICAL, ECONOMIC, AND SOCIAL THOUGHT I"
        }
    },
    {
        "data": {
            "source": "HISTSCI 202",
            "target": "ILS 202"
        }
    },
    {
        "data": {
            "description": "Examination of the interactions between science, technology, and literature.",
            "id": "ILS 254",
            "parent": "ILS",
            "title": "LITERATURE AND SCIENCE"
        }
    },
    {
        "data": {
            "description": "An introduction to the formative period of modern science, including major ideas and events in the physical and life sciences from Copernicus to Newton.",
            "id": "HISTORY/HISTSCI 323",
            "title": "THE SCIENTIFIC REVOLUTION: FROM COPERNICUS TO NEWTON"
        }
    },
    {
        "data": {
            "description": "Emergence of scientific method and scientific modes of thought out of ancient philosophical and religious traditions; the impact of ancient science on medieval Christendom; the origins and development of the Copernican-Newtonian world view.",
            "id": "HISTSCI 201",
            "parent": "HISTSCI",
            "title": "THE ORIGINS OF SCIENTIFIC THOUGHT"
        }
    },
    {
        "data": {
            "source": "HISTSCI 201",
            "target": "ILS 201"
        }
    },
    {
        "data": {
            "source": "HISTORY/HISTSCI 323",
            "target": "HISTSCI 201"
        }
    },
    {
        "data": {
            "description": "Examines the concept of magical realism and its cultural implications.  Provides a critical framework for evaluating literature, art and movies and engaging in basic research, particularly when it comes to narrative analysis. Pays particular attention to the Latin-American boom, a time of big writers and big literature that presses the limits between fiction and reality, modernity and postmodernity.",
            "id": "ILS 369",
            "parent": "ILS",
            "title": "MAGICAL REALISM AND POSTMODERNITY"
        }
    },
    {
        "data": {
            "description": "Relates principles of environmental science to our daily activities, with an eye to sustainability, conservation, and systems thinking. Introduces science as a process of inquiry and discovery rather than just a pre-established set of facts. Topics relate to energy, water, and land use, and include food, electric power, materials, buildings, transportation, and waste.",
            "id": "ENVIRST/ILS 126",
            "title": "PRINCIPLES OF ENVIRONMENTAL SCIENCE"
        }
    },
    {
        "data": {
            "description": "Representative episodes in the interaction of literature and society, organized either around a set of social institutions and their literary connections or around a set of literary forms and their social connections.",
            "id": "ILS 253",
            "parent": "ILS",
            "title": "LITERATURE AND SOCIETY"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "A first-year seminar that explores how people make meaning across times, cultures, media, and disciplines.",
            "id": "ILS 110",
            "parent": "ILS",
            "title": "FIRST-YEAR TOPICS SEMINAR IN INTEGRATED LIBERAL STUDIES"
        }
    },
    {
        "data": {
            "description": "How do Jews fit into the modern world? While the \"Jewish Question\" initially referred to debates about Jewish emancipation (the struggle for equal citizenship and social integration that started with the French Revolution), it later served to describe modern Jewish political and social thought about the identity, place, and role of the Jews in the modern world. Beginning in the late 19th century, as cultural assimilation, economic impoverishment in eastern Europe, and rising antisemitism sowed doubts about the viability of emancipation and traditionalism alike, Jewish thinkers proposed new answers to the Jewish question. Learn about some of the major answers they debated, including revolutionary universalistic utopias (socialism and Communism), various forms of Jewish nationalism, hyphenated identities, cultural pluralism, and cosmopolitanism. Work to contextualize these ideas historically while also considering whether and how they remain relevant to the present.",
            "id": "ILS/JEWISH/SOC 423",
            "title": "MODERN JEWISH THOUGHT"
        }
    },
    {
        "data": {
            "description": "Provides opportunities to pursue advanced research in integrated liberal studies.",
            "id": "ILS 490",
            "parent": "ILS",
            "title": "RESEARCH IN INTEGRATED LIBERAL STUDIES"
        }
    },
    {
        "data": {
            "description": "Interdisciplinary analysis of selected topics in the social sciences.",
            "id": "ILS 372",
            "parent": "ILS",
            "title": "INTERDISCIPLINARY STUDIES IN THE SOCIAL SCIENCES"
        }
    },
    {
        "data": {
            "description": "Individual study for juniors or seniors completing theses for honors as arranged with a faculty member.",
            "id": "ILS 682",
            "parent": "ILS",
            "title": "UNDERGRADUATE HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Individual mentored study with a faculty member, at the intermediate level.",
            "id": "ILS 298",
            "parent": "ILS",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Western science and technology in the making. Major developments viewed in philosophical and social context from the 17th to early twentieth century.",
            "id": "ILS 202",
            "parent": "ILS",
            "title": "WESTERN CULTURE: SCIENCE, TECHNOLOGY, PHILOSOPHY II"
        }
    },
    {
        "data": {
            "description": "The development of literature and the arts from the Renaissance to the modern period, including such figures as Shakespeare and Michelangelo through T.S. Eliot and Picasso. Literature and art in the context of society and ideas.",
            "id": "ILS 204",
            "parent": "ILS",
            "title": "WESTERN CULTURE: LITERATURE AND THE ARTS II"
        }
    },
    {
        "data": {
            "description": "Individual mentored study with a faculty member, at the intermediate level.",
            "id": "ILS 299",
            "parent": "ILS",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Major trends and developments in the sciences from the 17th century to the early 20th century. Emphasis on those with broad cultural and social implications.",
            "id": "HISTSCI 202",
            "parent": "HISTSCI",
            "title": "THE MAKING OF MODERN SCIENCE"
        }
    },
    {
        "data": {
            "source": "HISTSCI 623",
            "target": "HISTORY/HISTSCI 323"
        }
    }
]