[
    {
        "data": {
            "description": "Use, control and administration of centralized and distributed data bases. Topics include the definition, design, creation, revision, interrogation, update, security and integrity of data bases.",
            "id": "INFOSYS/ISYE 722",
            "title": "COMPUTER-BASED DATA MANAGEMENT"
        }
    },
    {
        "data": {
            "source": "INFOSYS 371",
            "target": "INFOSYS 424"
        }
    },
    {
        "data": {
            "description": "Introduction to Data Science programming using Python.  No previous programming experience required.  Emphasis on analyzing real datasets in a variety of forms and visual communication.",
            "id": "COMPSCI 220",
            "parent": "COMPSCI",
            "title": "DATA SCIENCE PROGRAMMING I"
        }
    },
    {
        "data": {
            "source": "INFOSYS/ISYE 722",
            "target": "INFOSYS 724"
        }
    },
    {
        "data": {
            "source": "INFOSYS 322",
            "target": "INFOSYS 424"
        }
    },
    {
        "data": {
            "description": "Focus is on developing applications and business information systems on the web using a variety of programming languages and tools. Emphasis on deployment as well as design concepts.",
            "id": "INFOSYS 371",
            "parent": "INFOSYS",
            "title": "TECHNOLOGY OF COMPUTER-BASED BUSINESS SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Applied principles and techniques of information systems development including requirements identification and analysis, process and data modeling, team communication and collaboration, and system testing.",
            "id": "INFOSYS 424",
            "parent": "INFOSYS",
            "title": "SYSTEMS ANALYSIS AND DESIGN"
        }
    },
    {
        "data": {
            "description": "An introduction to data analysis procedures covering topics including: data collection, pre-processing, analysis, and presentation. Content covers important data analysis concepts, such as structured and unstructured data. Learn about supervised, unsupervised learning methods and advanced analytics topics, such as text mining, recommendation systems, and algorithm bias.",
            "id": "INFOSYS 423",
            "parent": "INFOSYS",
            "title": "DIGITAL PLATFORM ANALYTICS"
        }
    },
    {
        "data": {
            "description": "Analysis of business systems to identify possible need for new or improved computer-based systems and the design of systems to meet those needs.",
            "id": "INFOSYS 724",
            "parent": "INFOSYS",
            "title": "ANALYSIS AND DESIGN OF COMPUTER-BASED SYSTEMS"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Introduction to database management systems with a focus on relational databases. Covers designing, creating, populating, managing, and retrieving data from databases. SQL will be used with a focus on querying for business applications and intelligence, data retrieval for summary reports, and data visualization. Offers a brief introduction to non-relational databases for business applications.",
            "id": "INFOSYS 322",
            "parent": "INFOSYS",
            "title": "INTRODUCTION TO DATABASES"
        }
    },
    {
        "data": {
            "description": "Exploration of subject areas possibly to be introduced into the business curriculum.",
            "id": "INFOSYS 765",
            "parent": "INFOSYS",
            "title": "CONTEMPORARY TOPICS"
        }
    },
    {
        "data": {
            "id": "INFOSYS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "INFOSYS 371",
            "target": "INFOSYS/ISYE 722"
        }
    },
    {
        "data": {
            "source": "COMPSCI 220",
            "target": "INFOSYS 371"
        }
    },
    {
        "data": {
            "id": "COMPSCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "An introduction to text mining and natural language processing for business applications. Provides an overview of text data and steps to make it usable and approaches for making text data useful in descriptive and predictive analytics applications. Topics include representation approaches, topic modeling, and an overview of key applications of natural language processing, such as chatbots and recommender systems.",
            "id": "INFOSYS 723",
            "parent": "INFOSYS",
            "title": "TEXT ANALYTICS AND BUSINESS APPLICATION"
        }
    },
    {
        "data": {
            "description": "Exploration of subject areas possibly to be introduced into the business curriculum.",
            "id": "INFOSYS 365",
            "parent": "INFOSYS",
            "title": "CONTEMPORARY TOPICS"
        }
    },
    {
        "data": {
            "description": "Focus on the economic and technical concepts behind emerging information systems. Industry cases covering platforms, online markets, artificial intelligence, and business analytics. Caters to interests in technology consulting.",
            "id": "INFOSYS 352",
            "parent": "INFOSYS",
            "title": "DIGITAL STRATEGY"
        }
    }
]