[
    {
        "data": {
            "description": "Explore important issues in the application of science that cut across all majors in the College of Agricultural and Life Sciences, and that are critical for society in coming decades. Develop academic skills and explore majors and careers.",
            "id": "INTER-AG 155",
            "parent": "INTER-AG",
            "title": "ISSUES IN AGRICULTURE, ENVIRONMENT, AND LIFE SCIENCES"
        }
    },
    {
        "data": {
            "source": "INTER-AG 140",
            "target": "INTER-AG 141"
        }
    },
    {
        "data": {
            "description": "Development and evaluation of undergraduate research proposals, discussion of best practices for gaining admission to graduate programs and identifying effective mentors, exploration of career opportunities for research in the public and private sectors, and interaction with seniors who have successfully completed the CALS Honors in Research program.",
            "id": "INTER-AG 488",
            "parent": "INTER-AG",
            "title": "HONORS RESEARCH SEMINAR"
        }
    },
    {
        "data": {
            "description": "Topics of current interest to undergraduates.",
            "id": "INTER-AG 375",
            "parent": "INTER-AG",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "Participation in research or creative endeavor led by faculty or instructional staff. May include participation in research discussion groups, critiques of readings, and preparation of written or oral reports.",
            "id": "INTER-AG/INTER-LS 250",
            "title": "UNDERGRADUATE RESEARCH EXPERIENCE"
        }
    },
    {
        "data": {
            "source": "INTER-AG 388",
            "target": "INTER-AG 488"
        }
    },
    {
        "data": {
            "id": "INTER-AG",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Explores topics and issues related to a specific theme and region or country of the world, ensuring a foundation of knowledge and understanding for the hands-on experiences as part of an instructor-led study abroad program.",
            "id": "INTER-AG 321",
            "parent": "INTER-AG",
            "title": "STUDY ABROAD PRE-DEPARTURE SEMINAR"
        }
    },
    {
        "data": {
            "description": "Gain exposure to the College of Agricultural and Life Sciences (CALS) and UW-Madison, including resources and opportunities available as well as the foundational skills necessary for a successful transition to campus. Modules focus on your personal, academic, and professional development. Reflect on your goals and engage with peers to develop a roadmap for your own Wisconsin Experience.",
            "id": "INTER-AG 140",
            "parent": "INTER-AG",
            "title": "CALS QUICKSTART: FOUNDATIONS"
        }
    },
    {
        "data": {
            "description": "Introduction and exploration of the fundamentals of research: scientific process, utilization of scientific literature, and preparation of research proposals. Provides an environment external to the student's research experience that will help them grow as researchers.",
            "id": "INTER-AG 388",
            "parent": "INTER-AG",
            "title": "CALS HONORS - FUNDAMENTALS OF RESEARCH SEMINAR"
        }
    },
    {
        "data": {
            "description": "First semester of individual study for undergraduate students in a CALS Honors program completing a thesis, as arranged with a faculty member.",
            "id": "INTER-AG 681",
            "parent": "INTER-AG",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Gain first-hand exposure to the variety academic, co-curricular and professional opportunities available to you in the College of Agricultural and Life Sciences (CALS) and broader UW-Madison campus. Through workshops and dialogue, consider how you will positively contribute to the campus community. Connect with fellow students, faculty, staff, alumni, and industry leaders, and translate these experiences into actionable plans to reach your academic and career goals.",
            "id": "INTER-AG 141",
            "parent": "INTER-AG",
            "title": "QUICKSTART: CONNECT2CAMPUS"
        }
    },
    {
        "data": {
            "description": "Challenges Greenhouse residents to think deeply about themselves and their place in the social and biophysical communities of which they are a part. Reflect on the meaning(s) of \"sustainability\" and consider how lifestyle and career choices impact other people and the environment. Discover the deep history of sustainability in Wisconsin and learn more about current sustainability initiatives on the UW-Madison campus and in the greater Madison Area. Introduces resources, skills, and knowledge that support a successful transition to college.",
            "id": "INTER-AG 117",
            "parent": "INTER-AG",
            "title": "GREENHOUSE ROOTS SEMINAR"
        }
    },
    {
        "data": {
            "description": "Provides an area equivalency for science internship or research taken on UW-Madison approved study abroad programs. Current enrollment in a UW-Madison study abroad program.",
            "id": "INTER-AG 397",
            "parent": "INTER-AG",
            "title": "INTERNATIONAL INTERNSHIP OR RESEARCH IN THE SCIENCES"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Learn the basics of being a researcher: the scientific community (papers, etiquette, grants), ethics, career options, using the scientific literature, and preparation of research proposals.",
            "id": "INTER-AG 288",
            "parent": "INTER-AG",
            "title": "INTRODUCTORY CALS HONORS SEMINAR"
        }
    },
    {
        "data": {
            "description": "Second semester of individual study for undergraduate students in a CALS Honors program completing a thesis, as arranged with a faculty member.INTER-AG 681",
            "id": "INTER-AG 682",
            "parent": "INTER-AG",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Full-time work experience which combines classroom theory with practical knowledge of operations to provide students with a background upon which to base a professional career.",
            "id": "INTER-AG 1",
            "parent": "INTER-AG",
            "title": "COOPERATIVE EDUCATION PROGRAM"
        }
    },
    {
        "data": {
            "description": "Specialized educational experiences that address a broad range of global health topics through interdisciplinary approaches to health and include participation in applied public health activities or service learning projects with communities and partner organizations.",
            "id": "INTER-AG/NUTRSCI 421",
            "title": "GLOBAL HEALTH FIELD EXPERIENCE"
        }
    },
    {
        "data": {
            "source": "INTER-AG 288",
            "target": "INTER-AG 388"
        }
    },
    {
        "data": {
            "description": "Women in Science and Engineering (WISE) learning community seminar, with speakers drawn from all fields of math, science, and engineering on campus.  Learn about research on campus and discuss the impact of research on daily life.",
            "id": "INTER-AG 175",
            "parent": "INTER-AG",
            "title": "WISE SEMINAR"
        }
    },
    {
        "data": {
            "description": "Career development process including: the job search, resume and cover letter writing, networking, inclusive workplaces, and conflict resolution. Synthesize internship experience and peers' internship experiences within the larger context of personal and professional goals, strengths, and values.",
            "id": "INTER-AG 340",
            "parent": "INTER-AG",
            "title": "CAREER AND LEADERSHIP DEVELOPMENT FOR INTERNS"
        }
    }
]