[
    {
        "data": {
            "description": "The residents of The Studio: Creative Arts Community engage in an interdisciplinary, hands-on experience of creative arts and professional practice, including developing and showing their original work in the local community.",
            "id": "INTEGART 112",
            "parent": "INTEGART",
            "title": "THE STUDIO PRESENTS"
        }
    },
    {
        "data": {
            "description": "Become familiar with basic entrepreneurship principles and value proposition design techniques in social entrepreneurship settings with attention to the perspective of arts and cultural organizations. Content includes business model development, customer-driven innovation, lean startup practices, organizational capacity for entrepreneurial action, team performance, the structure of alliances and partnerships and funding mechanisms in the sector.",
            "id": "INTEGART/MHR 636",
            "title": "ENTREPRENEURSHIP IN ARTS & CULTURAL ORGANIZATIONS"
        }
    },
    {
        "data": {
            "id": "INTEGART",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Guest artists will offer interdisciplinary studio courses on topics appropriate to their specializations. See go.wisc.edu/artsresidency for information on specific residencies.",
            "id": "INTEGART 310",
            "parent": "INTEGART",
            "title": "INTERDISCIPLINARY ARTIST IN RESIDENCE STUDIO"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Specialized subject matter in the areas of interdisciplinary or integrated arts.",
            "id": "INTEGART 630",
            "parent": "INTEGART",
            "title": "SPECIAL TOPICS IN INTEGRATED ARTS"
        }
    },
    {
        "data": {
            "description": "Specialized subject matter in the areas of interdisciplinary or integrated arts. Requisite varies according to topic.",
            "id": "INTEGART 330",
            "parent": "INTEGART",
            "title": "SPECIAL TOPICS IN INTEGRATED ARTS"
        }
    },
    {
        "data": {
            "description": "An overview and foundation in preparation for developing, launching, or advancing innovative projects in arts, culture, design, and humanities. Learn the unique contexts and challenges of creative careers. Develop creative project goals while gaining an understanding of the nature and structure of arts entrepreneurship in a variety of sectors - for-profit, nonprofit, government, and hybrid.",
            "id": "INTEGART/MHR 632",
            "title": "INTRODUCTION TO ARTS ENTREPRENEURSHIP"
        }
    },
    {
        "data": {
            "description": "Guest artists will offer interdisciplinary courses on topics appropriate to their specializations. see go.wisc.edu/artsresidency for information on specific residencies. Requisites vary according to topic",
            "id": "INTEGART 312",
            "parent": "INTEGART",
            "title": "INTERDISCIPLINARY ARTIST IN RESIDENCE LECTURE"
        }
    },
    {
        "data": {
            "description": "Guest artists will offer interdisciplinary lecture courses on topics appropriate to their specializations. See go.wisc.edu/artsresidency for information on specific residencies.",
            "id": "INTEGART 612",
            "parent": "INTEGART",
            "title": "INTERDISCIPLINARY ARTIST IN RESIDENCE LECTURE"
        }
    },
    {
        "data": {
            "description": "Guest artists will offer interdisciplinary studio courses on topics appropriate to their specializations. See go.wisc.edu/artsresidency for information on specific residencies.",
            "id": "INTEGART 610",
            "parent": "INTEGART",
            "title": "INTERDISCIPLINARY ARTIST IN RESIDENCE STUDIO"
        }
    },
    {
        "data": {
            "description": "Residents of The Studio: Creative Arts Community engage in an interdisciplinary hands-on approach to the creative arts and gain familiarity with the wide variety of arts disciplines on campus.",
            "id": "INTEGART 110",
            "parent": "INTEGART",
            "title": "THE STUDIO SEMINAR: MAPPING YOUR CREATIVE PRACTICE"
        }
    }
]