[
    {
        "data": {
            "description": "Build on previous work in a particular application area of social science research -- a contemporary issue or problem area related to one's own career or community experiences and goals -- through a series of readings, group discussions, research activities, and writing assignments. Complete a research review project that will summarize and analyze the most promising social science research paths to a solution of this issue or problem.  Key steps include: organization of findings, equity/diversity analysis, and final narrative presentation.",
            "id": "INTER-LS 602",
            "parent": "INTER-LS",
            "title": "APPLIED SOCIAL SCIENCES PROBLEM ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Examine self, community, and the liberal arts education while progressing through a major exploration framework - critically engage with the concepts of belonging and transitions, and explore questions of identity, community, and connectedness; explore UW schools/colleges, departments, majors, opportunities and resources; make connections between coursework and lived experiences outside of class to strengthen strategic exploration. Using readings, discussions, in-class activities, and out-of-class assignments, proceed through a framework with the goal of developing knowledge, confidence, and tools to navigate the University's opportunities and resources.",
            "id": "INTER-LS 139",
            "parent": "INTER-LS",
            "title": "BELONG, EXPLORE, BECOME: DISCOVERING YOUR UW PATHS"
        }
    },
    {
        "data": {
            "description": "Explores multiple dimensions of a liberal arts education and its value in today's world. Introduces University resources and promotes community building inside the residence hall and across campus. Engage directly with faculty from diverse fields on campus and with others in the Chadbourne Residence Hall.",
            "id": "INTER-LS 130",
            "parent": "INTER-LS",
            "title": "CRC FIRST-YEAR SEMINAR: FOUNDATIONS OF A LIBERAL ARTS EDUCATION"
        }
    },
    {
        "data": {
            "description": "Focus on learning to argue and express one's ideas. Learn how to construct a thesis that convinces through evidence. The arts provide an inevitable jumping-off point for critical judgments.",
            "id": "INTER-LS 121",
            "parent": "INTER-LS",
            "title": "APPROACHES TO CRITICAL THINKING AND WRITING"
        }
    },
    {
        "data": {
            "description": "Select a particular application area of social science research -- a contemporary issue or problem area related to one's own career or community experiences and goals-- through a series of readings, group discussions, research activities, and writing assignments. Design a research review project that will summarize and analyze the most promising social science research paths to a solution of this issue or problem.  Key steps include: problem definition, literature review, and thesis development.",
            "id": "INTER-LS 601",
            "parent": "INTER-LS",
            "title": "APPLIED SOCIAL SCIENCES PROBLEM PROPOSAL"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Designed specifically for the research fellow, provides a structure for thinking about research that avoids reducing research to a single mode of thought and practice, and is thus inclusive of the range of approaches to research reflected inINTER-LS/​INTER-AG  250.  Will address specific topics that relate to the day-to-day activities of doing research, and addresses issues of what does it mean to think like a researcher, to act like a researcher, to talk like a researcher?",
            "id": "INTER-LS 315",
            "parent": "INTER-LS",
            "title": "PARADIGMS AND PROCESS IN ACADEMIC INQUIRY"
        }
    },
    {
        "data": {
            "description": "Earn academic credit connected to your work experience with outside internships, regardless of your major. Using online tools, collaboratively analyze and discuss internships with respect to the goals of a liberal arts and sciences education.",
            "id": "INTER-LS 260",
            "parent": "INTER-LS",
            "title": "INTERNSHIP IN THE LIBERAL ARTS AND SCIENCES"
        }
    },
    {
        "data": {
            "description": "Explores the meaning and value of a liberal arts and sciences education for careers in the global, technological, and multicultural workplace of the 21st century. Through a series of individual and collaborative research and communication assignments, learn to critically analyze the career and education implications of a diverse and digital workplace, and to critically reflect on strengths and values to prepare to connect college work with lifelong career success. Practice academic skills of analyzing scholarly articles, constructing written essays, presenting formal speeches, and crafting digital presentations, as well as career skills of building resumes, writing cover letters, using social networking tools, and interviewing.",
            "id": "INTER-LS 215",
            "parent": "INTER-LS",
            "title": "COMMUNICATING ABOUT CAREERS"
        }
    },
    {
        "data": {
            "description": "Gain a broad understanding of the diverse areas of social science research from various disciplinary perspectives, through a series of lectures, readings, and essay assignments. Includes problem definition, evidence gathering, data analysis, and results presentation.",
            "id": "INTER-LS 301",
            "parent": "INTER-LS",
            "title": "METHODS IN THE APPLIED SOCIAL SCIENCES"
        }
    },
    {
        "data": {
            "description": "Gain an in-depth understanding of one particular application area of social science research through a series of lectures, readings, and essay assignments. Includes problem definition, evidence gathering, data analysis, and results presentation.",
            "id": "INTER-LS 302",
            "parent": "INTER-LS",
            "title": "PROBLEMS IN THE APPLIED SOCIAL SCIENCES"
        }
    },
    {
        "data": {
            "description": "Interdisciplinary course in career development that connects the liberal arts and sciences degree to academic and career preparation, practical job skills, goal-setting, critical thinking and reflection. Designed for second year students, but open to all students.",
            "id": "INTER-LS 210",
            "parent": "INTER-LS",
            "title": "L&S CAREER DEVELOPMENT: TAKING INITIATIVE"
        }
    },
    {
        "data": {
            "description": "Interdisciplinary topics in literature for first-year students.",
            "id": "INTER-LS 103",
            "parent": "INTER-LS",
            "title": "FIRST-YEAR SEMINAR IN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Interdisciplinary topics in the biological sciences for first-year students.",
            "id": "INTER-LS 101",
            "parent": "INTER-LS",
            "title": "FIRST-YEAR SEMINAR IN THE BIOLOGICAL SCIENCES"
        }
    },
    {
        "data": {
            "description": "Interdisciplinary topics in the humanities and social sciences for first-year students.",
            "id": "INTER-LS 110",
            "parent": "INTER-LS",
            "title": "FIRST-YEAR SEMINAR IN THE HUMANITIES AND SOCIAL SCIENCES"
        }
    },
    {
        "data": {
            "description": "Interdisciplinary topics in the humanities for first-year students.",
            "id": "INTER-LS 102",
            "parent": "INTER-LS",
            "title": "FIRST-YEAR SEMINAR IN THE HUMANITIES"
        }
    },
    {
        "data": {
            "description": "Interdisciplinary topics in the social and natural sciences for first-year students.",
            "id": "INTER-LS 107",
            "parent": "INTER-LS",
            "title": "FIRST-YEAR SEMINAR IN THE SOCIAL SCIENCES AND NATURAL SCIENCES"
        }
    },
    {
        "data": {
            "description": "Interdisciplinary topics in the social sciences for first-year students.",
            "id": "INTER-LS 106",
            "parent": "INTER-LS",
            "title": "FIRST-YEAR SEMINAR IN THE SOCIAL SCIENCES"
        }
    },
    {
        "data": {
            "description": "Introduction to a range of methods, theories, and cases that represent the emerging field of the public humanities. Explore the range of opportunities that exist outside of academia. Focus on the limits, audiences, and outcomes of research in the humanities, including the possibility of translational research.",
            "id": "INTER-LS 700",
            "parent": "INTER-LS",
            "title": "PUBLIC HUMANITIES: THEORIES, METHODS, CASES"
        }
    },
    {
        "data": {
            "description": "Introduction to current research on learning and guides how to apply that knowledge in your academic experience and course work. Covers research and its practical application in the areas of study skills, time management, academic writing, motivation, and self-direction. Promotes strong foundational skills to succeed at a higher education institution.",
            "id": "INTER-LS 145",
            "parent": "INTER-LS",
            "title": "HOW TO SUCCEED IN COLLEGE"
        }
    },
    {
        "data": {
            "description": "Introduction to research-based best practices for success in college-level math courses.  Practical application in the areas of study skills, goal setting, time management, and notetaking; hands-on practice with problem-solving strategies.",
            "id": "INTER-LS 144",
            "parent": "INTER-LS",
            "title": "SUCCESS IN YOUR MATH COURSE"
        }
    },
    {
        "data": {
            "description": "Participation in research or creative endeavor led by faculty or instructional staff. May include participation in research discussion groups, critiques of readings, and preparation of written or oral reports.",
            "id": "INTER-AG/INTER-LS 250",
            "title": "UNDERGRADUATE RESEARCH EXPERIENCE"
        }
    },
    {
        "data": {
            "description": "Promotes a successful transition from high school to college life, encourages collaborative learning between students, faculty, and staff, and prepares students to become integrative scholars and active participants in the university community and beyond.",
            "id": "INTER-LS 157",
            "parent": "INTER-LS",
            "title": "BRADLEY ROUNDTABLE SEMINAR"
        }
    },
    {
        "data": {
            "description": "Provides training and support for Peer Mentors of the Bradley Learning Community. Helps improve leadership and facilitation skills for Peer Mentors, whose primary service obligations include co-facilitating a section of the Bradley Roundtable seminar and arranging programming for the Bradley Learning Community. Introduces new techniques for working with small groups. Special attention will be paid to the research on the developmental and academic needs of first-year college students Encourages students to develop their professional skills. Serves as an opportunity for guided reflection, as part of the community-based learning model.",
            "id": "INTER-LS 257",
            "parent": "INTER-LS",
            "title": "BRADLEY PEER MENTOR COURSE"
        }
    },
    {
        "data": {
            "description": "Reflect on principles of liberal education, and apply those principles to your own learning experiences.",
            "id": "INTER-LS 300",
            "parent": "INTER-LS",
            "title": "TOPICS IN TEACHING AND LEARNING IN THE LETTERS, ARTS, AND SCIENCES"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "INTER-LS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "INTER-LS 301",
            "target": "INTER-LS 601"
        }
    },
    {
        "data": {
            "source": "INTER-LS 302",
            "target": "INTER-LS 601"
        }
    },
    {
        "data": {
            "source": "INTER-LS 601",
            "target": "INTER-LS 602"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "INTER-LS 144"
        }
    }
]