[
    {
        "data": {
            "description": "Treatment of topics in international studies.",
            "id": "INTLST 620",
            "parent": "INTLST",
            "title": "TOPICS IN INTERNATIONAL STUDIES"
        }
    },
    {
        "data": {
            "description": "From the Boxer Rebellion, to the dropping of the atomic bombs, to the nuclear stand-off with North Korea, American foreign relations with East Asia during the 20th century were as consequential as they were controversial. Survey the issues and questions that alternately made allies and enemies of these nations: How did the quest for markets influence American policy towards China? How did European imperialism shape Japan's rise? Why did communism seem to offer a more compelling economic and political arrangement to China and North Korea? While squarely rooted in East Asia this course will also explore the questions that united and divided Americans over their nation's foreign policy. Through examining these questions, develop answers and construct their own narrative of the relationship between the United States and East Asia.",
            "id": "HISTORY/INTLST 332",
            "title": "EAST ASIA & THE U.S. SINCE 1899"
        }
    },
    {
        "data": {
            "description": "An interdisciplinary survey of the major approaches to the study of globalization. Become familiarized with key theories, issues, and debates, as well as methodological tools. Topics will include global economy, environment, health, culture, media, development, labor, governance, civil society, science, technology, and geography.",
            "id": "INTLST 720",
            "parent": "INTLST",
            "title": "GLOBAL STUDIES SEMINAR"
        }
    },
    {
        "data": {
            "description": "Examines the origins and development of human rights in international politics. The course discusses what human rights are, international human rights movements, the international search for justice after mass crimes, and international humanitarian intervention. Not open to students with credit for POLI SCI 317 prior to fall 2017",
            "id": "INTLST/POLISCI 434",
            "title": "THE POLITICS OF HUMAN RIGHTS"
        }
    },
    {
        "data": {
            "source": "INTLST 101",
            "target": "INTLST/POLISCI 325"
        }
    },
    {
        "data": {
            "description": "Equivalency for study abroad with topics on global culture. Enrollment in a UW-Madison Study Abroad program",
            "id": "INTLST 503",
            "parent": "INTLST",
            "title": "STUDY ABROAD TOPICS IN CULTURE IN THE AGE OF GLOBALIZATION"
        }
    },
    {
        "data": {
            "description": "Mentored individual research and study for students completing a thesis in an Honors program",
            "id": "INTLST 681",
            "parent": "INTLST",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Equivalency for study abroad with topics on global economy. Enrollment in a UW-Madison Study Abroad program",
            "id": "INTLST 502",
            "parent": "INTLST",
            "title": "STUDY ABROAD TOPICS IN POLITICS AND POLICY IN THE GLOBAL ECONOMY"
        }
    },
    {
        "data": {
            "description": "Focuses on language and its culture, example topics include: extinction and revival, language and nationhood, how widely and deeply languages differ, language and worldview, writing systems and literacy, language discrimination and inequality.",
            "id": "ANTHRO/FOLKLORE/INTLST/LINGUIS 211",
            "title": "GLOBAL LANGUAGE ISSUES"
        }
    },
    {
        "data": {
            "description": "This course explores the socio-economic and political outcomes across India. This course will employ the major theories of comparative politics that explain political outcomes such as regime type, economic development and conflict. This course explores why some countries are democracies, while others are dictatorships; why some countries are poor, while others are rich; and why some countries experience high levels of violence, while others are peaceful. The course considers how India comports with standard theories in comparative politics and how standard theories might be revised in light of the Indian case. The course maps variation on the sub-national and regional level. The course will ultimately consider reforms proposed by the Indian state to further democratic and economic development and to reduce conflict. Students will learn about India's politics in a structured manner, and will gain an appreciation of the power and limitations of the political science method.",
            "id": "INTLST/POLISCI 327",
            "title": "INDIAN POLITICS IN COMPARATIVE PERSPECTIVE"
        }
    },
    {
        "data": {
            "source": "POLISCI 140",
            "target": "INTLST/POLISCI 325"
        }
    },
    {
        "data": {
            "description": "Equivalency for study abroad international internships. Enrollment in a UW-Madison Study Abroad program",
            "id": "INTLST 520",
            "parent": "INTLST",
            "title": "STUDY ABROAD TOPICS IN INTERNATIONAL STUDIES"
        }
    },
    {
        "data": {
            "description": "Mentored individual research and study for students completing a senior thesis",
            "id": "INTLST 691",
            "parent": "INTLST",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "An introduction to the most significant topics of contemporary Arabic literature and cinema. Discuss the legacy of colonialism, repressive nature of post-independence regimes, discourses on nationalism, religion vs. secularization, gender relations, representation of cultural otherness, and the Arab Springs. Materials will be drawn from a variety of cultural forms including literature, film, music, and performance; and scholarship, exploring the social, cultural, political, and economic contexts in which texts and films are written and exhibited.",
            "id": "AFRICAN/INTLST 302",
            "title": "ARABIC LITERATURE AND CINEMA"
        }
    },
    {
        "data": {
            "id": "POLISCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Contemporary issues in international studies in global culture.",
            "id": "INTLST 403",
            "parent": "INTLST",
            "title": "TOPICS IN CULTURE IN THE AGE OF GLOBALIZATION"
        }
    },
    {
        "data": {
            "description": "Contemporary issues in international studies in global security.",
            "id": "INTLST 401",
            "parent": "INTLST",
            "title": "TOPICS IN GLOBAL SECURITY"
        }
    },
    {
        "data": {
            "description": "Social movements, revolutions, and riots continually shape and re-shape the world around us. The course will evaluate and apply dominant theoretical approaches to understanding contention through careful attention to empirical cases throughout the world.",
            "id": "INTLST/POLISCI 431",
            "title": "CONTENTIOUS POLITICS"
        }
    },
    {
        "data": {
            "description": "Advanced directed study projects as arranged with a faculty member.",
            "id": "INTLST 699",
            "parent": "INTLST",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Equivalency for study abroad with topics on global commons. Enrollment in a UW-Madison Study Abroad program",
            "id": "INTLST 504",
            "parent": "INTLST",
            "title": "STUDY ABROAD TOPICS IN GLOBAL ENVIRONMENT"
        }
    },
    {
        "data": {
            "description": "Treatment of topics in in culture in the age of globalization.",
            "id": "INTLST 603",
            "parent": "INTLST",
            "title": "TOPICS IN CULTURE IN THE AGE OF GLOBALIZATION"
        }
    },
    {
        "data": {
            "description": "The Cold War was the first event to impact virtually all of humanity and left a lasting legacy that still shapes the current world order. Exploration of its conduct on five continents entails both a diversity of sources (film, fiction, documents, and memoir) and a range of topics (geopolitics, ideology, internationalism, empire, revolution, counterinsurgency, and covert operations). Its half-century history was marked by nuclear-armed stalemate and ideological competition in Europe, cultural politics of repression and generational revolt in America, interplay of anti-colonial nationalism and counterinsurgency in Asia, Africa, and Latin America, and a succession of major wars worldwide in Korea, Vietnam, Angola, and Afghanistan. By adopting an international perspective that carries us beyond the narrow ambit of the Moscow-Washington rivalry, integrate diverse global forces and particular national histories for a fuller understanding of an ever-changing world system.",
            "id": "HISTORY/INTLST 375",
            "title": "THE COLD WAR - FROM WORLD WAR II TO END OF SOVIET EMPIRE"
        }
    },
    {
        "data": {
            "description": "Should all individuals in society receive a regular transfer of cash from the state without any strings attached? If that question had been posed fifteen years ago, it would likely have been dismissed as unrealistic, undesirable, or just plain crazy. In recent years, however, the idea of introducing a universal basic income [UBI] has gained a lot of traction around the world. Growing inequalities, financial crises, fears about jobs being automated, and the COVID-19 pandemic have all helped to put UBI on the political map. But where did the idea come from? How is it traveling to different parts of the world? And on what grounds do different advocates justify their claims? Address these questions and more by exploring the history, philosophy, and political economy of UBI from a range of perspectives. Ongoing UBI experiments from different parts of the world will also be examined.",
            "id": "GEOG/INTLST 315",
            "title": "UNIVERSAL BASIC INCOME: THE POLITICS BEHIND A GLOBAL MOVEMENT"
        }
    },
    {
        "data": {
            "source": "POLISCI 120",
            "target": "POLISCI 182"
        }
    },
    {
        "data": {
            "description": "An introduction to key historical events, movements, and systems that have shaped our present moment.  Examines the relationship  between empire-building and anti-colonial movements from the late 18th century to the current day.  Focuses on the political, economic, and social/cultural dimensions of major global history themes, such as colonialism, capitalism, and revolution.",
            "id": "HISTORY/INTLST 146",
            "title": "A GLOBAL HISTORY OF NOW"
        }
    },
    {
        "data": {
            "description": "Introduces the field of international studies, and performs an interdisciplinary examination of the cultural, political, economic, and social patterns that have defined the modern world.",
            "id": "INTLST 101",
            "parent": "INTLST",
            "title": "INTRODUCTION TO INTERNATIONAL STUDIES"
        }
    },
    {
        "data": {
            "source": "POLISCI 182",
            "target": "POLISCI 120"
        }
    },
    {
        "data": {
            "source": "POLISCI 120",
            "target": "INTLST/POLISCI 325"
        }
    },
    {
        "data": {
            "description": "Promotes understanding of international and cross-cultural issues and related vocabulary in the target language and encourages collaborative learning between students, faculty, and staff of the International Learning Community (ILC).",
            "id": "INTLST 210",
            "parent": "INTLST",
            "title": "INTERNATIONAL LEARNING COMMUNITY LANGUAGE SEMINAR"
        }
    },
    {
        "data": {
            "description": "An interdisciplinary introduction to the diverse cultures, geography, history, modern states, politics, societies, and economies of the Middle East. A special emphasis placed on Islam as a religion and Muslim peoples.",
            "id": "INTLST 266",
            "parent": "INTLST",
            "title": "INTRODUCTION TO THE MIDDLE EAST"
        }
    },
    {
        "data": {
            "source": "POLISCI 140",
            "target": "INTLST/POLISCI 431"
        }
    },
    {
        "data": {
            "description": "Treatment of topics in global security.",
            "id": "INTLST 601",
            "parent": "INTLST",
            "title": "TOPICS IN GLOBAL SECURITY"
        }
    },
    {
        "data": {
            "description": "Discuss the ways education is inextricably linked to global political, economic, and social contexts. Reflect on both scholarly research and popular conceptions of market, society and schools in different geographic and cultural contexts. Approach globalization from a context-sensitive, place-based approach, rather than abstract, predictive method through interdisciplinary analysis. Explore the concept of globalization across disciplinary frameworks including anthropology, geography, and history. Provides critical analysis to understand the challenges facing education in a globalization era, to build stronger commitment to helping address those challenges, and a set of skills for researching and writing about them. Examine the following \"problem-spaces\": globalization and migration; globalization and race; global testing and assessment; marketization of education; global city development and higher education; youth culture and globalization.",
            "id": "EDPOL/INTLST 335",
            "title": "GLOBALIZATION AND EDUCATION"
        }
    },
    {
        "data": {
            "description": "An introduction to the major empirical and theoretical themes in the study of social movements and politics in Latin America. While it is impossible to cover every theoretical approach or Latin American case during the semester, the course should give students the tools to begin to think critically about where and why people engage in collective action. We will develop and hone these tools through thinking about Latin American cases, paying specific attention to revolutions, social movements, and riots. The course is designed in three parts. It begins by exposing students to the dominant theoretical paradigms in the study of contentious politics as well as some prominent critiques. The course then turns to empirical themes in Latin American revolutions, challenging students to use and question the theoretical tools to which they have already been exposed. The final part of the course looks to social movements in Latin America. Cases will focus on challenges to dictatorships, identity-based movements, and resistance to globalization.",
            "id": "INTLST/POLISCI 325",
            "title": "SOCIAL MOVEMENTS AND REVOLUTIONS IN LATIN AMERICA"
        }
    },
    {
        "data": {
            "description": "Addresses various contemporary international, cross-cultural, and interdisciplinary issues.",
            "id": "INTLST 320",
            "parent": "INTLST",
            "title": "CONTEMPORARY ISSUES IN INTERNATIONAL STUDIES"
        }
    },
    {
        "data": {
            "description": "Introduction to Comparative Politics, one of the four sub-fields in Political Science, which involves the comparative analysis of political institutions, processes, and outcomes at the national level. Examines how to usefully compare politics in a variety of countries and makes comparisons explicit and systematic in order to determine how governments work, how power is organized and contested at the national level, and how regular people can participate and pursue their interests in different political settings. Includes key concepts, theories, methods, issues, and language.",
            "id": "POLISCI 120",
            "parent": "POLISCI",
            "title": "INTRODUCTION TO COMPARATIVE POLITICS"
        }
    },
    {
        "data": {
            "description": "What motivates us to try to alleviate the suffering of people in distant parts of the world? Examines the origins of humanitarian ideas and institutions, and how various humanitarian campaigns have been shaped by geopolitical processes, including the abolition of the slave trade, the spread of missionary Christianity, European imperialism, the Cold War, neoliberalism and the emergence of new media forms. Questions include: who has benefited from various humanitarian aid campaigns throughout history? How have various humanitarian campaigns shaped, and been shaped by, patterns of global inequality? Why have some populations, and not others, been deemed worthy of the world's compassion? Explores the worlds, perspectives and visions of humanitarians through a range of primary sources, including diary entries, political propaganda, memoirs, journalistic reportage, photography and documentary film.",
            "id": "HISTORY/INTLST 330",
            "title": "GLOBAL HISTORY OF HUMANITARIANISM"
        }
    },
    {
        "data": {
            "description": "Addresses the process of globalization -- trade, international capital flows, labor migration and remittances, and aid -- from the perspective of developing economies and the development process.",
            "id": "AAE/INTLST 373",
            "title": "GLOBALIZATION, POVERTY AND DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Introduction to economic ways of thinking about a wide range of problems and issues. Topics include consumption, production, prices, markets, finance, trade, pollution, growth, farms, taxes, and development.",
            "id": "AAE 101",
            "parent": "AAE",
            "title": "INTRODUCTION TO AGRICULTURAL AND APPLIED ECONOMICS"
        }
    },
    {
        "data": {
            "id": "AAE",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "AAE 101",
            "target": "AAE/INTLST 374"
        }
    },
    {
        "data": {
            "description": "Explores current issues in international affairs and the ways in which different organizations, businesses, corporations, NGOs and IOS seek to address them. Must be enrolled in UW Wisconsin in Washington, DC Internship Program. Must be a participant in the Washington DC semester in international affairs program",
            "id": "INTLST 622",
            "parent": "INTLST",
            "title": "WASHINGTON DC SEM IN INTERNATIONAL AFFAIRS SEMINAR"
        }
    },
    {
        "data": {
            "description": "Contemporary issues in international studies in politics and policy.",
            "id": "INTLST 402",
            "parent": "INTLST",
            "title": "TOPICS IN POLITICS AND POLICY IN THE GLOBAL ECONOMY"
        }
    },
    {
        "data": {
            "description": "Treatment of topics in international political economy and policy studies.",
            "id": "INTLST 602",
            "parent": "INTLST",
            "title": "TOPICS IN POLITICS AND POLICY IN THE GLOBAL ECONOMY"
        }
    },
    {
        "data": {
            "description": "Explores questions related to human rights and education, from the individual to the global level; from the abstract to the practical: What does it mean to be human? How do we learn to be human? What rights mark a human being? Do all human have rights? If they have a right to education, do they have a right to a particular kind of education? Can one global education and human rights model best meet the needs of our incredibly diverse global population? Can the global human rights framework improve current educational, national, social, and economic inequities? How so? How does education as a human right relate to human rights education? and who should decide the answers to these questions, and how? Investigates the tensions and boundaries of the human rights framework to reduce social inequality through methodological inquires in educational case studies, including: educational inequality; victims of the war on drugs; working children's rights; and climate change.",
            "id": "EDPOL/INTLST 220",
            "title": "HUMAN RIGHTS AND EDUCATION"
        }
    },
    {
        "data": {
            "description": "Covers the major issues in international relations since the end of World War II including: the causes of war; civil wars and ethnic conflict; economic development; international trade; exchange rates and international monetary relations; international capital flows and financial crises; foreign direct investment; globalization and the environment; the UN, the IMF, World Bank, WTO, and other international organizations; and international law and human rights. The focus is on states' relations with each other and the factors determining the nature and outcomes of these international interactions. The course seeks to develop analytical tools for thinking about important questions in world politics regardless of the countries or issues involved, to examine international affairs in a systematic way. Students who have taken POLI SCI 103 prior to Fall 2017 may not enroll in this course.",
            "id": "POLISCI 140",
            "parent": "POLISCI",
            "title": "INTRODUCTION TO INTERNATIONAL RELATIONS"
        }
    },
    {
        "data": {
            "description": "Soccer (or football) is played in almost every part of the world. Soccer will be used as a lens through which to think critically about a range of issues within our own societies and around the world. This includes examining the relationship between European imperialism and the globalization of soccer in the early 20th century; thinking about who gets to play (and who gets paid) across different contexts; and analyzing how soccer is both globally networked and intensely local in its passions and rivalries. Draws from a range of perspectives on soccer, from those who consider it to be an opium for the masses to those who see it as a vehicle for positive social change, in order to illuminate some of the big questions facing the world today.",
            "id": "GEOG/INTLST 311",
            "title": "THE GLOBAL GAME: SOCCER, POLITICS, AND IDENTITY"
        }
    },
    {
        "data": {
            "description": "Promotes understanding of international and cross-cultural issues and encourages collaborative learning between students, faculty, and staff of the International Learning Community (ILC).",
            "id": "INTLST 110",
            "parent": "INTLST",
            "title": "INTERNATIONAL LEARNING COMMUNITY GENERAL SEMINAR"
        }
    },
    {
        "data": {
            "description": "Mentored individual research and study for students completing a thesis in an Honors program",
            "id": "INTLST 682",
            "parent": "INTLST",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Whether you developed your language abilities at home, abroad, or in an educational setting, learn how to leverage your language skills to maximize potential employment opportunities. Develop an understanding of transferable skills unique to language learners and work toward articulating these skills for resume, cover letter, networking, and interviewing exercises. Connect your enthusiasm for learning languages with your personal interests, skills, and abilities to begin exploring career pathways. Learn from peers, alumni, and other guest speakers with language majors and multilingual backgrounds who have succeeded in a variety of careers.",
            "id": "INTLST 275",
            "parent": "INTLST",
            "title": "LEAD WITH LANGUAGES: PUTTING LANGUAGE SKILLS TO WORK"
        }
    },
    {
        "data": {
            "description": "Equivalency for study abroad with topics on global security. Enrollment in a UW-Madison Study Abroad program",
            "id": "INTLST 501",
            "parent": "INTLST",
            "title": "STUDY ABROAD TOPICS IN GLOBAL SECURITY"
        }
    },
    {
        "data": {
            "description": "Introduction to Comparative Politics, one of the four sub-fields in Political Science, which involves the comparative analysis of political institutions, processes, and outcomes at the national level. Examines how to usefully compare politics in a variety of countries and makes comparisons explicit and systematic in order to determine how governments work, how power is organized and contested at the national level, and how people can participate and pursue their interests in different political settings. Includes key concepts, theories, methods, and country case studies.",
            "id": "POLISCI 182",
            "parent": "POLISCI",
            "title": "INTRODUCTION TO COMPARATIVE POLITICS (HONORS)"
        }
    },
    {
        "data": {
            "id": "INTLST",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Addresses professional development through academic work performed concurrently with an internship. Must be enrolled in UW Wisconsin in Washington, DC Internship Program. Must be a participant in the Washington DC semester in international affairs program",
            "id": "INTLST 322",
            "parent": "INTLST",
            "title": "WASHINGTON DC SEMESTER IN INTERNATIONAL AFFAIRS INTERNSHIP SEMINAR"
        }
    },
    {
        "data": {
            "description": "Discussion of international events and topics designed specifically for Wisconsin International Scholars (WISc) Program participants, geared toward fostering leadership skills.",
            "id": "INTLST 212",
            "parent": "INTLST",
            "title": "WISCHOLARS: WISCONSIN INTERNATIONAL SCHOLARS PROGRAM SEMINAR"
        }
    },
    {
        "data": {
            "description": "Mentored individual research and study for students completing a senior thesis.",
            "id": "INTLST 692",
            "parent": "INTLST",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "A broad overview of Latin American history in the modern period, since independence but with a primary focus on the twentieth century. Particular emphasis will be placed on the socioeconomic, cultural, and political structures and processes that shaped and continue to influence life in Latin America. Key issues such as colonialism, nationalism, democracy, and revolution will be examined critically in light of broad comparative themes in Latin American and world history. Among the topics to be explored in detail will be the Mexican and Cuban revolutions, populism and dictatorship, socialism and neoliberalism, and drugs and migration.",
            "id": "HISTORY/INTLST/LACIS 242",
            "title": "MODERN LATIN AMERICA"
        }
    },
    {
        "data": {
            "description": "Equivalency for study abroad with topics on international studies. Enrollment in a UW-Madison Study Abroad program",
            "id": "INTLST 523",
            "parent": "INTLST",
            "title": "INTERNATIONAL INTERNSHIP"
        }
    },
    {
        "data": {
            "source": "AAE 101",
            "target": "AAE/INTLST 373"
        }
    },
    {
        "data": {
            "description": "This course explores the roles of markets, states, and civil institutions, using economic theory, computer simulations, and historical experience to better understand the forces that shape the wealth and well-being of nations and people around the world.",
            "id": "AAE/INTLST 374",
            "title": "THE GROWTH AND DEVELOPMENT OF NATIONS IN THE GLOBAL ECONOMY"
        }
    },
    {
        "data": {
            "description": "A human rights approach to global women's health to provide an overview of health issues within the context of a woman's life cycle. It will pay special attention to the socio-cultural and economic factors that play a role in determining women's access to quality basic health care.",
            "id": "GEN&WS/INTLST 535",
            "title": "WOMEN'S GLOBAL HEALTH AND HUMAN RIGHTS"
        }
    },
    {
        "data": {
            "description": "Examines the phenomenon of genocide in the modern world. The class covers the concept of genocide, theories of why genocide occurs, and particular cases in the 20th and 21st centuries. Not open to students with credit for POLI SCI 318 prior to fall 2017",
            "id": "INTLST/POLISCI 439",
            "title": "THE COMPARATIVE STUDY OF GENOCIDE"
        }
    },
    {
        "data": {
            "source": "INTLST 101",
            "target": "INTLST/POLISCI 431"
        }
    },
    {
        "data": {
            "description": "Addresses various international, cross-cultural and language topics of interest to the residents of the International Learning Community.",
            "id": "INTLST 310",
            "parent": "INTLST",
            "title": "INTERNATIONAL LEARNING COMMUNITY SEMINAR"
        }
    },
    {
        "data": {
            "description": "Investigates how everyday people shaped European history and politics, from World War I through today. Takes a comparative and interdisciplinary approach to analyze a range of major social movements in Europe, thinking in detail about what constitutes a social movement in the first place, and what determines its effectiveness. Key topics include the rise and fall of Fascism; the fate of the Communist and Socialist Left in Europe; the role of youth movements as drivers of change; and the constraints imposed on political organizing by both democratic and authoritarian societies. Drawing on a range of texts, songs, and films, investigates how people power has shaped the European state, and vice-versa, from 1922 through today.",
            "id": "HISTORY/INTLST 366",
            "title": "FROM FASCISM TO TODAY: SOCIAL MOVEMENTS AND POLITICS IN EUROPE"
        }
    }
]