[
    {
        "data": {
            "description": "A rigorous introduction to probability theory at an advanced undergraduate level. Only a minimal amount of measure theory is used, in particular, the theory of Lebesgue integrals is not needed. It is aimed at math majors and Master's degree students, or students in other fields who will need probability in their future careers. Gives an introduction to the basics (Kolmogorov axioms, conditional probability and independence, random variables, expectation) and discusses some classical results with proofs (DeMoivre-Laplace limit theorems, the study of simple random walk on the one dimensional lattice, applications of generating functions).",
            "id": "MATH 531",
            "parent": "MATH",
            "title": "PROBABILITY THEORY"
        }
    },
    {
        "data": {
            "description": "Design of productive organizations and people's roles within them. Issues including boundary location, organizational decision levels, autonomous work groups, implementation and diffusion. Roles of the union. Case studies.",
            "id": "ISYE/PSYCH 653",
            "title": "ORGANIZATION AND JOB DESIGN"
        }
    },
    {
        "data": {
            "description": "Directed Master's-level research projects as arranged with instructor.",
            "id": "ISYE 790",
            "parent": "ISYE",
            "title": "MASTER'S RESEARCH AND THESIS"
        }
    },
    {
        "data": {
            "description": "Mathematical statistical inference aims at providing an understanding of likelihood's central role to statistical inference, using the language of mathematical statistics to analyze statistical procedures, and using the computer as a tool for understanding statistics. Specific topics include: samples and populations, estimation, hypothesis testing, and theoretical properties of statistical inference.",
            "id": "MATH/STAT 310",
            "title": "INTRODUCTION TO PROBABILITY AND MATHEMATICAL STATISTICS II"
        }
    },
    {
        "data": {
            "description": "Topics covered include axioms of probability, random variables, the most important discrete and continuous probability distributions, expectation and variance, moment generating functions, conditional probability and conditional expectations, multivariate distributions, Markov's and Chebyshev's inequalities, laws of large numbers, and the central limit theorem.",
            "id": "MATH/STAT 431",
            "title": "INTRODUCTION TO THE THEORY OF PROBABILITY"
        }
    },
    {
        "data": {
            "description": "",
            "id": "ISYE/PSYCH 854",
            "title": "SPECIAL TOPICS IN ORGANIZATION DESIGN"
        }
    },
    {
        "data": {
            "description": "",
            "id": "ISYE/PSYCH 859",
            "title": "SPECIAL TOPICS IN HUMAN FACTORS ENGINEERING"
        }
    },
    {
        "data": {
            "description": "A cognitive engineering approach to human-computer interaction and data visualization in particular. Includes a four-part description of effective visualization: design intent, data and application domain, representation and interface features, and human limits and capabilities. The philosophical perspective, scientific basis, and practical tools for effective data visualization and visual analytics. Data processing and how to create static graphs as well as web-based interactive visualizations using the statistical language R.",
            "id": "ISYE 649",
            "parent": "ISYE",
            "title": "INTERACTIVE DATA ANALYTICS"
        }
    },
    {
        "data": {
            "description": "A systems view of accident causation, with emphasis on the human performance limitations important in industrial and other accidents. Models of causation, data collection systems, economic evaluation, and safety programs. Small group projects.",
            "id": "ISYE 555",
            "parent": "ISYE",
            "title": "HUMAN PERFORMANCE AND ACCIDENT CAUSATION"
        }
    },
    {
        "data": {
            "description": "Addresses the problems of medication errors and quality in health care, problem resolutions, methods of assessment, and intervention implementation and quality management.",
            "id": "ISYE/PHARMACY 608",
            "title": "SAFETY AND QUALITY IN THE MEDICATION USE SYSTEM"
        }
    },
    {
        "data": {
            "description": "Addresses the role of the industrial engineer as a \"manager\" of continuous improvement in design and production processes. Provides modern tools and techniques for planning and managing team projects, integrating the concepts of total quality, data based decision making, and resource management.",
            "id": "ISYE 515",
            "parent": "ISYE",
            "title": "ENGINEERING MANAGEMENT OF CONTINUOUS PROCESS IMPROVEMENT"
        }
    },
    {
        "data": {
            "description": "An examination of the \"human side\" of data science. Issues of bias, fairness, trust, and understandability. Unique characteristics of behavioral data, such as representative sampling, human adaptation, and grouped data. Practical skills in behavioral data analytics with a focus on important conceptual, design, and ethical issues specific to behavioral data. Survey of machine learning techniques including supervised learning, unsupervised learning, reinforcement learning, deep learning, and text analysis. Methods are contextualized through engineering case studies.",
            "id": "ISYE 562",
            "parent": "ISYE",
            "title": "HUMAN FACTORS OF DATA SCIENCE AND MACHINE LEARNING"
        }
    },
    {
        "data": {
            "description": "An intermediate to advanced course stressing the application of recent operations research techniques to production planning, scheduling and inventory control.",
            "id": "ISYE 615",
            "parent": "ISYE",
            "title": "PRODUCTION SYSTEMS CONTROL"
        }
    },
    {
        "data": {
            "description": "An introduction of skills required for successful research in graduate school. Preparing for graduate thesis writing, applying for graduate school, presenting research in a variety of ways. How to foster mental health and work-life balance.",
            "id": "ISYE 478",
            "parent": "ISYE",
            "title": "RESEARCH AND BEYOND IN INDUSTRIAL ENGINEERING"
        }
    },
    {
        "data": {
            "description": "An introduction to computer-integrated design and manufacturing with a focus on manufacturing process planning. Emphasis on concurrent engineering principles, manufacturing process engineering, computer-aided process planning, NC programming, and CAM integration. Course provides experience with CAM software and NC machines.",
            "id": "ISYE 605",
            "parent": "ISYE",
            "title": "COMPUTER INTEGRATED MANUFACTURING"
        }
    },
    {
        "data": {
            "description": "An introduction to industrial engineering subject matter areas, problem types, and design/analysis approaches, techniques, and methodologies. Special emphasis on formulation and design alternatives for problem solving.",
            "id": "ISYE 191",
            "parent": "ISYE",
            "title": "THE PRACTICE OF INDUSTRIAL ENGINEERING"
        }
    },
    {
        "data": {
            "description": "An introduction to linear algebra and differential equations with emphasis on the relationship between the theory of linear algebra and analytical and numerical techniques for solving differential equations. Linear algebra topics include linear systems, matrices and their algebra, vector spaces and linear transformations, eigenvalues and eigenvectors. Topics from differential equations include first order ODE, homogeneous and nonhomogeneous linear systems, and numerical methods.",
            "id": "MATH 320",
            "parent": "MATH",
            "title": "LINEAR ALGEBRA AND DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "description": "An introduction to linear algebra. Topics include matrix algebra, linear systems of equations, vector spaces, sub-spaces, linear dependence, span, basis, rank of matrices, determinants, linear transformations, coordinate representations, kernel, range, eigenvalues and eigenvectors, diagonalization, inner products and orthogonal vectors, symmetric matrices. Covers linear algebra topics in greater depth and detail thanMATH 320. Formal techniques in mathematical argument [MATH 341] not covered.",
            "id": "MATH 340",
            "parent": "MATH",
            "title": "ELEMENTARY MATRIX AND LINEAR ALGEBRA"
        }
    },
    {
        "data": {
            "description": "An introduction to the mechanical behavior of biological tissues and systems. Specific topics include: structure and function of biological tissues, mechanical properties of biological tissues, and analysis of specific tissues (i.e. bone, muscle, and soft connective tissues).",
            "id": "BME 315",
            "parent": "BME",
            "title": "BIOMECHANICS"
        }
    },
    {
        "data": {
            "description": "An introduction to the practice of conducting research in industrial engineering, literature reviews, identifying gaps in existing work, writing a research proposal.",
            "id": "ISYE 468",
            "parent": "ISYE",
            "title": "INTRODUCTION TO INDUSTRIAL ENGINEERING RESEARCH"
        }
    },
    {
        "data": {
            "description": "Analysis and design of man-machine systems using human performance models and data. Emphasis on systems involving communication and control. Projects using digital and analog computer simulation techniques for system design.",
            "id": "ISYE/PSYCH 549",
            "title": "HUMAN FACTORS ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Analysis of stochastic systems using both analytic methods and computer simulation. Empirical and theoretical models of arrival and service processes. State spaces and state transition probabilities. Simulation of queuing and manufacturing systems. Continuous time Markov analysis of manufacturing systems. Simulation project management, testing and emerging trends.",
            "id": "ISYE 320",
            "parent": "ISYE",
            "title": "SIMULATION AND PROBABILISTIC MODELING"
        }
    },
    {
        "data": {
            "description": "Basic ideas and tools of cost effectiveness analysis as applied in evaluating medical technologies. Addresses special problems and methods in assessing diagnostic technologies, including ROC analysis, and in measuring health for technology assessment. Uses \"classical\" and current journal literature.",
            "id": "ISYE/POPHLTH 875",
            "title": "COST EFFECTIVENESS ANALYSIS IN HEALTH AND HEALTHCARE"
        }
    },
    {
        "data": {
            "description": "Basic techniques for modeling and optimizing deterministic systems with emphasis on linear programming. Computer solution of optimization problems. Applications to production, logistics, and service systems.",
            "id": "ISYE 323",
            "parent": "ISYE",
            "title": "OPERATIONS RESEARCH-DETERMINISTIC MODELING"
        }
    },
    {
        "data": {
            "description": "Communication for engineering, science, and technology; theory and practice in planning, preparing, and critiquing reports, proposals, and workplace correspondence; persuasive argumentation, ethical decision-making strategies, multidisciplinary communication skills, research strategies, collaborative work; oral presentations.",
            "id": "INTEREGR 397",
            "parent": "INTEREGR",
            "title": "ENGINEERING COMMUNICATION"
        }
    },
    {
        "data": {
            "description": "Computer exercises involving generation and analysis of random variables, spreadsheet models of queuing systems, use of simulation software packages. Project.",
            "id": "ISYE 321",
            "parent": "ISYE",
            "title": "SIMULATION MODELING LABORATORY"
        }
    },
    {
        "data": {
            "description": "Continuation ofMATH 171. Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Completion ofMATH 217implies completion ofMATH 221and114.",
            "id": "MATH 217",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY II"
        }
    },
    {
        "data": {
            "description": "Convex sets in finite-dimensional spaces: relative interiors, separation, set operations. Convex functions: conjugacy, subdifferentials and directional derivations, functional operations, Fenchel-Rockafellar duality. Applications to operations research and related areas.  Students taking this course are strongly encouraged to have had a course in basic analysis (e.g.MATH 521) and a course in linear algebra (e.g.,MATH 340).",
            "id": "COMPSCI/ISYE 727",
            "title": "CONVEX ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Conveys the importance of considering human capabilities and limits in system design and operation. This includes understanding human characteristics from the cognitive, physical, and psychosocial perspectives. Implications of these characteristics are explored through understanding the needs of people, designing to support these needs, and evaluating systems to ensure they serve the intended purpose. Case studies are used to identify the human role in accidents and to identify design improvements. Application domains include consumer product design, human-computer interaction, workplace safety, and complex systems such as healthcare delivery.",
            "id": "ISYE/PSYCH 349",
            "title": "INTRODUCTION TO HUMAN FACTORS"
        }
    },
    {
        "data": {
            "description": "Covers a broad range of techniques and tools relevant to the design, analysis, development, implementation, operation and control of modern manufacturing systems. Case studies assignments using industry data will be used to elaborate the practical applications of the theoretical concepts.",
            "id": "ISYE/ME 641",
            "title": "DESIGN AND ANALYSIS OF MANUFACTURING SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Covers material in first and second semester calculus but it is intended to teach math majors to write and understand proofs in mathematics in general and in calculus in particular.",
            "id": "MATH 421",
            "parent": "MATH",
            "title": "THE THEORY OF SINGLE VARIABLE CALCULUS"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Descriptive statistics, probability concepts and distributions, random variables. Hypothesis tests and confidence intervals for one- and two-sample problems. Linear regression, model checking, and inference. Analysis of variance and basic ideas in experimental design. Utilizes the R programming language.",
            "id": "STAT 324",
            "parent": "STAT",
            "title": "INTRODUCTORY APPLIED STATISTICS FOR ENGINEERS"
        }
    },
    {
        "data": {
            "description": "Design of products for persons with physical, sensory or cognitive impairments is covered as well as the design of standard mass market products. Interdisciplinary teams explore specific disabilities, then design a standard mass market product in competition with each other.",
            "id": "BME/ISYE 662",
            "title": "DESIGN AND HUMAN DISABILITY AND AGING"
        }
    },
    {
        "data": {
            "description": "Design, implementation and interpretation of epidemiologic studies; emphasis on methodologic problems in the measurement of disease frequency, natural history and risk factors.",
            "id": "POPHLTH/SOC 797",
            "title": "INTRODUCTION TO EPIDEMIOLOGY"
        }
    },
    {
        "data": {
            "description": "Designed for population health researcher. Topics include descriptive statistics, elementary probability, probability distributions, one- and two-sample normal inference (point estimation, hypothesis testing, confidence intervals), power and sample size calculations, one- and two-sample binomial inference, underlying assumptions and diagnostic work.",
            "id": "BMI/POPHLTH 551",
            "title": "INTRODUCTION TO BIOSTATISTICS FOR POPULATION HEALTH"
        }
    },
    {
        "data": {
            "description": "Directed PhD-level research projects as arranged with faculty advisor.",
            "id": "ISYE 890",
            "parent": "ISYE",
            "title": "PRE-DISSERTATOR'S RESEARCH"
        }
    },
    {
        "data": {
            "description": "Directed PhD-level research projects as arranged with faculty advisor.",
            "id": "ISYE 990",
            "parent": "ISYE",
            "title": "RESEARCH AND THESIS"
        }
    },
    {
        "data": {
            "description": "Elements of probability, important discrete distributions, acceptance sampling by attributes, sample characteristics, probability distributions and population characteristics, the normal distribution, acceptance sampling plans based on sample means and variances, sampling from the normal, the central limit theorem, point and interval estimation.",
            "id": "STAT 311",
            "parent": "STAT",
            "title": "INTRODUCTION TO THEORY AND METHODS OF MATHEMATICAL STATISTICS I"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "Evaluation, analysis, and design recommendations for improving human performance and productivity in applied settings. Collection of instrument-based and user survey data. Emphasis on ergonomics, human factors and sociotechnical systems engineering approaches and problems. Design project required.",
            "id": "ISYE 552",
            "parent": "ISYE",
            "title": "HUMAN FACTORS ENGINEERING DESIGN AND EVALUATION"
        }
    },
    {
        "data": {
            "description": "Examination of behavioral science literature dealing with the processes by which individuals, small groups and organizations make decisions. Understanding decision-making behavior in order to improve managerial performance; modeling decision-making processes for systems design and theory building purposes. Knowledge of statistics strongly encouraged such asSTAT 301.",
            "id": "ISYE/MHR 729",
            "title": "BEHAVIORAL ANALYSIS OF MANAGEMENT DECISION MAKING"
        }
    },
    {
        "data": {
            "description": "Examines the state of the art in the use of stochastic network theory to develop performance models of modern manufacturing systems.",
            "id": "ISYE/ME 643",
            "title": "PERFORMANCE ANALYSIS OF MANUFACTURING SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Financial accounting principles and cost systems, interpretation and use of accounting reports and supplemental information for engineering economic analyses, consideration of cost-volume-profit analyses, use of discounted cash flow techniques, flexible budgeting, transfer pricing, and capital budgeting.",
            "id": "ISYE 313",
            "parent": "ISYE",
            "title": "ENGINEERING ECONOMIC ANALYSIS"
        }
    },
    {
        "data": {
            "description": "First order differential equations, introduction to multivariable calculus and constrained optimization, infinite sequences and series, methods of approximation, and a brief introduction to probability. Models and applications from business and the social sciences.",
            "id": "MATH 213",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 2"
        }
    },
    {
        "data": {
            "description": "Focus is on developing applications and business information systems on the web using a variety of programming languages and tools. Emphasis on deployment as well as design concepts.",
            "id": "INFOSYS 371",
            "parent": "INFOSYS",
            "title": "TECHNOLOGY OF COMPUTER-BASED BUSINESS SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Focuses on optimization problems over discrete structures, such as shortest paths, spanning trees, flows, matchings, and the traveling salesman problem. We will investigate structural properties of these problems, and we will study both exact methods for their solution, and approximation algorithms.",
            "id": "COMPSCI/ISYE/MATH 425",
            "title": "INTRODUCTION TO COMBINATORIAL OPTIMIZATION"
        }
    },
    {
        "data": {
            "description": "Focuses on the sensing and multivariate data modeling and analysis techniques for monitoring, diagnosis, and quality improvement of manufacturing processes. The techniques introduced can find wide applications in health care, financial engineering, service industry applications, human factors, etc.",
            "id": "ISYE 612",
            "parent": "ISYE",
            "title": "INFORMATION SENSING AND ANALYSIS FOR MANUFACTURING PROCESSES"
        }
    },
    {
        "data": {
            "description": "Fundamentals of data management and analysis. Formulating and solving real industrial engineering problems with appropriate data managing and modeling strategies. Fundamental industrial database management strategies, data preprocessing, visualization and modeling techniques; industrial database management and analysis techniques using leading programming software (MySQL and R).",
            "id": "ISYE 312",
            "parent": "ISYE",
            "title": "DATA MANAGEMENT AND ANALYSIS FOR INDUSTRIAL ENGINEERS"
        }
    },
    {
        "data": {
            "description": "General and special techniques of dynamic programming developed by means of examples. Shortest-path algorithms. Deterministic equipment replacement models. Resource allocation problem. Traveling-salesman problem. Knapsack problem. Analysis of inventory systems. General stochastic formulations. Markovian decision processes.  Students are strongly encouraged to have knowledge of mathematical optimization (e.g.,COMP SCI/​I SY E/​MATH/​STAT  525, I SY E 623,COMP SCI/​I SY E/​MATH/​STAT  726), knowledge of analysis (e.g.,MATH/​STAT  431or521) and programming ability (e.g.,COMP SCI 200or 301)",
            "id": "COMPSCI/ISYE 723",
            "title": "DYNAMIC PROGRAMMING AND ASSOCIATED TOPICS"
        }
    },
    {
        "data": {
            "description": "Gives students an introduction to computer and analytical skills to use in their subsequent course work and professional development. Discusses several methods of using computers to solve problems, including elementary programming techniques, symbolic manipulation languages, and software packages. Techniques will be illustrated using sample problems drawn from elementary engineering. Emphasis is on introduction of algorithms with the use of specific tools to illustrate the methods.",
            "id": "COMPSCI 310",
            "parent": "COMPSCI",
            "title": "PROBLEM SOLVING USING COMPUTERS"
        }
    },
    {
        "data": {
            "description": "Gives students hands-on experience in building wearable computing platforms. Designed for students who have a background in textiles and apparel design, computer science, engineering or media arts. By the completion of the course students will have fundamental knowledge of electronic circuitry, programming, and \"maker skills\".",
            "id": "COMPSCI/DS/ISYE 518",
            "title": "WEARABLE TECHNOLOGY"
        }
    },
    {
        "data": {
            "description": "Hands on experience applying concepts discussed inI SY E/​PSYCH  349. Complete a small three-part design project. Learn how to measure light, sound, anthropometric, and psychophysiological data, and then apply these measurements to product and workplace design challenges.",
            "id": "ISYE 348",
            "parent": "ISYE",
            "title": "INTRODUCTION TO HUMAN FACTORS ENGINEERING LABORATORY"
        }
    },
    {
        "data": {
            "description": "Implementation, oversight, and management of quality-oriented activities in health care settings. Overview of current and historical activities, approaches, and issues confronting health care related to quality assessment, assurance, and improvement.",
            "id": "ISYE/POPHLTH 703",
            "title": "QUALITY OF HEALTH CARE: EVALUATION AND ASSURANCE"
        }
    },
    {
        "data": {
            "description": "In various areas. Sample topics: \"Simulation\" and \"Systems Design\".",
            "id": "ISYE 601",
            "parent": "ISYE",
            "title": "SPECIAL TOPICS IN INDUSTRIAL ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Inspection data for quality control; sampling plans for acceptance inspection; charts for process control. Introduction to reliability models and acceptance testing.",
            "id": "ISYE/ME 512",
            "title": "INSPECTION, QUALITY CONTROL AND RELIABILITY"
        }
    },
    {
        "data": {
            "description": "Introduces engineers how to design manufacturing and industrial operations in which people play a significant role, so that human capabilities are maximized, physical stress is minimized, and workload is optimized. Examples and topics emphasize industrial applications.",
            "id": "BME/ISYE 564",
            "title": "OCCUPATIONAL ERGONOMICS AND BIOMECHANICS"
        }
    },
    {
        "data": {
            "description": "Introduces engineers to applications of total quality concepts and tools to develop, implement, and maintain an effective quality assurance system in a manufacturing or service organization. Emphasis is on documentation development, team-based improvement strategies, and international quality standards.",
            "id": "ISYE 520",
            "parent": "ISYE",
            "title": "QUALITY ASSURANCE SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Introduces optimization problems over integers, and surveys the theory behind the algorithms used in state-of-the-art methods for solving such problems. Special attention is given to the polyhedral formulations of these problems, and to their algebraic and geometric properties. Applicability of Integer Optimization is highlighted with applications in combinatorial optimization. Key topics include: formulations, relaxations, polyhedral theory, cutting planes, decomposition, enumeration.  Students are strongly encouraged to have knowledge of Linear Programming  (e.g.,MATH/​COMP SCI/​I SY E/​STAT  525), including algorithms, duality and polyhedral theory.",
            "id": "COMPSCI/ISYE/MATH 728",
            "title": "INTEGER OPTIMIZATION"
        }
    },
    {
        "data": {
            "description": "Introduces optimization problems whose constraints are expressed by linear inequalities. Develops geometric and algebraic insights into the structure of the problem, with an emphasis on formal proofs. Presents the theory behind the simplex method, the main algorithm used to solve linear optimization problems. Explores duality theory and theorems of the alternatives.",
            "id": "COMPSCI/ISYE/MATH/STAT 525",
            "title": "LINEAR OPTIMIZATION"
        }
    },
    {
        "data": {
            "description": "Introduces reproducible data management, modeling, analysis, and statistical inference through a practical, hands-on case studies approach. Topics include the use of an integrated statistical computing environment, data wrangling, the R programming language, data graphics and visualization, random variables and concepts of probability including the binomial and normal distributions, data modeling, statistical inference in one- and two- sample settings for proportions and means, simple linear regression, and report generation using R Markdown with applications to a wide variety of data to address open-ended questions.",
            "id": "STAT 240",
            "parent": "STAT",
            "title": "DATA SCIENCE MODELING I"
        }
    },
    {
        "data": {
            "description": "Introduction to Data Science programming using Python.  No previous programming experience required.  Emphasis on analyzing real datasets in a variety of forms and visual communication.",
            "id": "COMPSCI 220",
            "parent": "COMPSCI",
            "title": "DATA SCIENCE PROGRAMMING I"
        }
    },
    {
        "data": {
            "description": "Introduction to Object-Oriented Programming using classes and objects to solve more complex problems. Introduces array-based and linked data structures: including lists, stacks, and queues. Programming assignments require writing and developing multi-class (file) programs using interfaces, generics, and exception handling to solve challenging real world problems. Topics reviewed include reading/writing data and objects from/to files and exception handling, and command line arguments. Topics introduced: object-oriented design; class vs. object; create and define interfaces and iterators; searching and sorting; abstract data types (List,Stack,Queue,PriorityQueue(Heap),Binary Search Tree); generic interfaces (parametric polymorphism); how to design and write test methods and classes; array based vs. linked node implementations; introduction to complexity analysis; recursion.",
            "id": "COMPSCI 300",
            "parent": "COMPSCI",
            "title": "PROGRAMMING II"
        }
    },
    {
        "data": {
            "description": "Introduction to basic probability and statistical tools and methods from an industrial application perspective. Random variables and probability distributions; descriptive statistics; point estimates. Perform hypothesis testing, construct confidence intervals, and understand design of experiments in the context of motivating case studies. Regression and correlation analysis. Focus on applying statistical methods and tools to solve engineering problems. Use of Microsoft Excel to interpret and analyze data.",
            "id": "ISYE 210",
            "parent": "ISYE",
            "title": "INTRODUCTION TO INDUSTRIAL STATISTICS"
        }
    },
    {
        "data": {
            "description": "Introduction to calculus of functions of several variables; calculus on parameterized curves, derivatives of functions of several variables, multiple integrals, vector calculus.",
            "id": "MATH 234",
            "parent": "MATH",
            "title": "CALCULUS--FUNCTIONS OF SEVERAL VARIABLES"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Introduction to ethical issues in data engineering and principled solutions. Algorithmic fairness (individual fairness, group fairness, counterfactual fairness), differential privacy and its applications, and robustness.",
            "id": "ECE/ISYE 570",
            "title": "ETHICS OF DATA FOR ENGINEERS"
        }
    },
    {
        "data": {
            "description": "Introduction to fundamental geometric computations and algorithms, and their use for solving engineering and scientific problems. Computer representations of simple geometric objects and paradigms for algorithm design. Applications from areas of engineering analysis, design and manufacturing, biology, statistics, and other sciences.",
            "id": "COMPSCI/ISYE/ME 558",
            "title": "INTRODUCTION TO COMPUTATIONAL GEOMETRY"
        }
    },
    {
        "data": {
            "description": "Introduction to mathematical optimization from a modeling and solution perspective. Formulation of applications as discrete and continuous optimization problems and equilibrium models. Survey and appropriate usage of basic algorithms, data and software tools, including modeling languages and subroutine libraries.",
            "id": "COMPSCI/ECE/ISYE 524",
            "title": "INTRODUCTION TO OPTIMIZATION"
        }
    },
    {
        "data": {
            "description": "Introduction to modern statistical practice in the life sciences, using the R programming language. Topics include: exploratory data analysis, probability and random variables; one-sample testing and confidence intervals, role of assumptions, sample size determination, two-sample inference; basic ideas in experimental design, analysis of variance, linear regression, goodness-of fit; biological applications.",
            "id": "STAT 371",
            "parent": "STAT",
            "title": "INTRODUCTORY APPLIED STATISTICS FOR THE LIFE SCIENCES"
        }
    },
    {
        "data": {
            "description": "Introduction to plant location theory and analysis of models of plant location; models for determining plant size and time phasing; line balancing models; techniques for investigating conveyor and other material handling problems; and models of plant layout.",
            "id": "ISYE/ME 510",
            "title": "FACILITIES PLANNING"
        }
    },
    {
        "data": {
            "description": "Introduction to probability, random variables, and random processes. Confidence intervals, introduction to experimental design and hypothesis testing. Statistical averages, correlation, and spectral analysis for wide sense stationary processes. Random signals and noise in linear systems.",
            "id": "ECE 331",
            "parent": "ECE",
            "title": "INTRODUCTION TO RANDOM SIGNAL ANALYSIS AND STATISTICS"
        }
    },
    {
        "data": {
            "description": "Introduction to simulation modeling and analysis techniques with application to production, logistics, service, and other systems. Emphasis on model building, application of basic statistical data analysis, and the use of simulation for design, evaluation, and improvement of such systems. Introduction to available software. Case studies.",
            "id": "ISYE 620",
            "parent": "ISYE",
            "title": "SIMULATION MODELING AND ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Introduction to statistically based quality improvement methods useful in industrial settings; observational methods and design of experiments; experimentation to discover influential factors and to analyze sources of variation; robust products.",
            "id": "ISYE 575",
            "parent": "ISYE",
            "title": "INTRODUCTION TO QUALITY ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Introduction to the application of Human Factors Engineering theory and methods to the analysis and improvement of healthcare delivery systems.",
            "id": "ISYE 557",
            "parent": "ISYE",
            "title": "HUMAN FACTORS ENGINEERING FOR HEALTHCARE SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Introduction to the application of industrial engineering methods to the analysis and improvement of health care delivery. Exploration of common problems of decision making and control in health care. Examination of social, regulatory and economic factors unique to health care.",
            "id": "ISYE 417",
            "parent": "ISYE",
            "title": "HEALTH SYSTEMS ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Introduction to the primary statistical tools used in epidemiology and health services research; multiple linear regression, logistic regression and survival analysis.",
            "id": "BMI/POPHLTH 552",
            "title": "REGRESSION METHODS FOR POPULATION HEALTH"
        }
    },
    {
        "data": {
            "description": "Introduction to the signals, information, and computational techniques in electrical engineering.",
            "id": "ECE 203",
            "parent": "ECE",
            "title": "SIGNALS, INFORMATION, AND COMPUTATION"
        }
    },
    {
        "data": {
            "description": "Introduction to the technologies, processes and systems of modern discrete part manufacturing. Emphasis on development of an understanding of the behavior of integrated systems.",
            "id": "ISYE 415",
            "parent": "ISYE",
            "title": "INTRODUCTION TO MANUFACTURING SYSTEMS, DESIGN AND ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Introduction to the tools needed for advanced design courses through experiential learning and hands-on opportunities to conduct experiments, take relevant measurements, analyze real-world data, design systems, and to make and test prototypes of designs.",
            "id": "ISYE 350",
            "parent": "ISYE",
            "title": "INDUSTRIAL ENGINEERING DESIGN I"
        }
    },
    {
        "data": {
            "description": "Introduction to the use of decision sciences in health-care. Conceptual understanding of medical decision making and its tools including decision trees, sensitivity analysis, Markow (decision) processes, and Monte Carlo simulations with examples from the current medical literature.",
            "id": "ISYE 517",
            "parent": "ISYE",
            "title": "DECISION MAKING IN HEALTH CARE"
        }
    },
    {
        "data": {
            "description": "Issues involved in decision-making regarding technological risks and risk management in areas such as nuclear power, hazardous waste disposal, and pollution control. Risk perception and cognitive biases; risk analysis and decision analysis; political issues in risk management; regulatory mechanisms; and risk communication. Selected case studies.",
            "id": "C&ESOC/ISYE/NE/SOC 708",
            "title": "SOCIETAL RISK MANAGEMENT OF TECHNOLOGICAL HAZARDS"
        }
    },
    {
        "data": {
            "description": "Learn the process of incrementally developing small (200-500 lines) programs along with the fundamental Computer Science topics. These topics include: problem abstraction and decomposition, the edit-compile-run cycle, using variables of primitive and more complex data types, conditional and loop-based flow control, basic testing and debugging techniques, how to define and call functions (methods), and IO processing techniques. Also teaches and reinforces good programming practices including the use of a consistent style, and meaningful documentation. Intended for students who have no prior programming experience.",
            "id": "COMPSCI 200",
            "parent": "COMPSCI",
            "title": "PROGRAMMING I"
        }
    },
    {
        "data": {
            "description": "Logic components built with transistors, rudimentary Boolean algebra, basic combinational logic design, basic synchronous sequential logic design, basic computer organization and design, introductory machine- and assembly-language programming.",
            "id": "COMPSCI/ECE 252",
            "title": "INTRODUCTION TO COMPUTER ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Methods for risk and reliability analysis of engineered systems, particularly as applied in the nuclear power industry. Fault trees and event trees, Bayesian data analysis, probabilistic risk management. Some familiarity with nuclear plant safety systems is helpful, but not required.",
            "id": "ISYE/NE 574",
            "title": "METHODS FOR PROBABILISTIC RISK ANALYSIS OF NUCLEAR POWER PLANTS"
        }
    },
    {
        "data": {
            "description": "Overview of modeling techniques and methods used in decision analysis, including multiattribute utility models, decision trees, and Bayesian models. Psychological components of decision making are discussed. Elicitation techniques for model building are emphasized. Practical applications through real world model building are described and conducted.",
            "id": "ISYE 516",
            "parent": "ISYE",
            "title": "INTRODUCTION TO DECISION ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Practical methods for the planning, design and evaluation of complex logistics and distribution systems. Modeling techniques and solution approaches that reduce cumbersome details of logistics systems into models with a manageable number of parameters and decision variables. It shows how the solutions to these models are interpreted into optimal rules that guide the operation, design or planning process. Practical methods for the planning, design and evaluation of complex logistics and distribution systems. Modeling techniques and solution approaches that reduce cumbersome details of logistics systems into models with a manageable number of parameters and decision variables. It shows how the solutions to these models are interpreted into optimal rules that guide the operation, design or planning process. Builds on knowledge of introductory programming such as Python, Matlab, or R.",
            "id": "ISYE 625",
            "parent": "ISYE",
            "title": "LOGISTICS SYSTEMS DESIGN"
        }
    },
    {
        "data": {
            "description": "Principles of mechanics, force systems, equilibrium, structures, distributed forces, moments of inertia of areas, and friction.",
            "id": "EMA 201",
            "parent": "EMA",
            "title": "STATICS"
        }
    },
    {
        "data": {
            "description": "Principles, algorithms, and industrial engineering applications of machine learning. Predictive analytics, with a focus on combining data and models to improve decision-making. Methods include: statistics, linear regression, logistic regression, regularization, over-fitting, clustering, classification and regression trees, boosting, bagging, deep learning, and neural networks. Applications areas include: healthcare, transportation, and the public sector.",
            "id": "ISYE 521",
            "parent": "ISYE",
            "title": "MACHINE LEARNING IN ACTION FOR INDUSTRIAL ENGINEERS"
        }
    },
    {
        "data": {
            "description": "Probability and combinatorial methods, discrete and continuous, univariate and multivariate distributions, expected values, moments, normal distribution and derived distributions, estimation.",
            "id": "MATH/STAT 309",
            "title": "INTRODUCTION TO PROBABILITY AND MATHEMATICAL STATISTICS I"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Provides an overview of engineering fundamentals behind supply chains. Topics covered will include modeling and design of multi-stage production distribution systems, multi-echelon inventory models, theory of supply chain contracts, value of flexibility and information sharing in supply chains.",
            "id": "ISYE 645",
            "parent": "ISYE",
            "title": "ENGINEERING MODELS FOR SUPPLY CHAINS"
        }
    },
    {
        "data": {
            "description": "Provides an understanding of the fundamentals of using data analytics to make data-driven decisions. Emphasizes applying techniques to industrial engineering problems. Focuses on formulating and solving real industrial problems with the appropriate modeling strategies and analytics principles for better decision making.",
            "id": "ISYE 412",
            "parent": "ISYE",
            "title": "FUNDAMENTALS OF INDUSTRIAL DATA ANALYTICS"
        }
    },
    {
        "data": {
            "description": "Provides grounding in core concepts of health information systems. Major applications include clinical information systems, language and standards, decision support, image technology and digital libraries. Evaluation of IE tools and perspectives designed to improve the quality, efficiency and effectiveness of health information.",
            "id": "BMI/ISYE 617",
            "title": "HEALTH INFORMATION SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Review of linear differential equations; series solution of linear differential equations; boundary value problems; Laplace transforms; possibly numerical methods and two dimensional autonomous systems.",
            "id": "MATH 319",
            "parent": "MATH",
            "title": "TECHNIQUES IN ORDINARY DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "description": "Review of linear programming. Polynomial time methods for linear programming. Quadratic programs and linear complementarity problems and related solution techniques. Solution sets and their continuity properties. Error bounds for linear inequalities and programs. Parallel algorithms for linear and quadratic programs.",
            "id": "COMPSCI/ISYE 526",
            "title": "ADVANCED LINEAR PROGRAMMING"
        }
    },
    {
        "data": {
            "description": "Stochastic programming is concerned with decision making in the presence of uncertainty, where the eventual outcome depends on a future random event. Topics include modeling uncertainty in optimization problems, risk measures, stochastic programming algorithms, approximation and sampling methods, and applications.  Students are strongly encouraged to have knowledge of linear programming (e.g.,MATH/​COMP SCI/​I SY E/​STAT  525) and probability and statistics (e.g.,MATH/​STAT  431). Knowledge of integer optimization (MATH/​COMP SCI/​I SY E  728) is helpful, but not required.",
            "id": "COMPSCI/ISYE 719",
            "title": "STOCHASTIC PROGRAMMING"
        }
    },
    {
        "data": {
            "description": "Strategic quality planning, change management, problem identification and solving, process improvement, and performance evaluation. Business and decision-making skills related to quality systems and process improvement.",
            "id": "ISYE 618",
            "parent": "ISYE",
            "title": "QUALITY ENGINEERING AND QUALITY MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Stress and strain, torsion, bending of beams, shearing stresses in beams, compound stresses, principal stresses, deflections of beams, statically indeterminate members, columns.",
            "id": "ME 306",
            "parent": "ME",
            "title": "MECHANICS OF MATERIALS"
        }
    },
    {
        "data": {
            "description": "Sturm-Liouville theory; Fourier series, including mean convergence; boundary value problems for linear second order partial differential equations, including separation of variables and eigenfunction expansions.",
            "id": "MATH 322",
            "parent": "MATH",
            "title": "APPLIED MATHEMATICAL ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Subjects vary.",
            "id": "ISYE 823",
            "parent": "ISYE",
            "title": "SPECIAL TOPICS IN OPERATIONS RESEARCH"
        }
    },
    {
        "data": {
            "description": "Teaches how to explore, model, and analyze data using R. Topics include basic probability models; the central limit theorem; Monte Carlo simulation; one- and two-sample hypothesis testing; Bayesian inference; linear and logistic regression; ANOVA; the bootstrap; random forests and cross-validation. Features the analysis of real-world data sets and the communication of findings in a clear and reproducible manner within a project setting.",
            "id": "STAT 340",
            "parent": "STAT",
            "title": "DATA SCIENCE MODELING II"
        }
    },
    {
        "data": {
            "description": "Team-based project experience to address a real-world design challenge posed by an external organization. Collaboration with the project client to design a new system or process, or redesign an existing one, by integrating and applying appropriate Industrial and Systems Engineering knowledge, methodologies and tools for problem definition and analysis; idea generation; solution development, evaluation and justification; and implementation planning and impact assessment.",
            "id": "ISYE 450",
            "parent": "ISYE",
            "title": "INDUSTRIAL ENGINEERING DESIGN II"
        }
    },
    {
        "data": {
            "description": "Techniques and applications of control concepts in the design of inventory, production, quality, and project-planning systems; use of the computer as a component in such systems.",
            "id": "ISYE 315",
            "parent": "ISYE",
            "title": "PRODUCTION PLANNING AND CONTROL"
        }
    },
    {
        "data": {
            "description": "Techniques for modeling systems in which uncertainty is an essential factor. Emphasizes why, how and when techniques can or cannot be applied, rather than their mathematical derivation. Case studies and/or examples from such areas as logistics, production, and service industries.",
            "id": "ISYE 624",
            "parent": "ISYE",
            "title": "STOCHASTIC MODELING TECHNIQUES"
        }
    },
    {
        "data": {
            "description": "Techniques of integration, improper integrals, first order ordinary differential equations, sequences and series, Taylor series, vector geometry in two and three dimensions.",
            "id": "MATH 222",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 2"
        }
    },
    {
        "data": {
            "description": "The real numbers, elements of set theory, metric spaces and basic topology, sequences and series, limits, continuity, differentiation, integration, sequences and series of functions, uniform convergence.",
            "id": "MATH 521",
            "parent": "MATH",
            "title": "ANALYSIS I"
        }
    },
    {
        "data": {
            "description": "The theory of linear algebra with an introduction to proofs and proof writing. Topics include vector spaces, linear dependence, span, basis, linear transformations, kernel, image, inner products and inner product spaces, geometry, eigenvalues, eigenvectors, standard matrix factorizations. Other content includes basic set theory, logical operations, quantifiers, direct and indirect arguments, and induction. Differential equations [MATH 320] not covered.",
            "id": "MATH 341",
            "parent": "MATH",
            "title": "LINEAR ALGEBRA"
        }
    },
    {
        "data": {
            "description": "The third course in our programming fundamentals sequence. It presumes that students understand and use functional and object-oriented design and abstract data types as needed. This course introduces balanced search trees, graphs, graph traversal algorithms, hash tables and sets, and complexity analysis and about classes of problems that require each data type. Students are required to design and implement using high quality professional code, a medium sized program, that demonstrates knowledge and use of latest language features, tools, and conventions. Additional topics introduced will include as needed for projects: inheritance and polymorphism; anonymous inner classes, lambda functions, performance analysis to discover and optimize critical code blocks. Students learn about industry standards for code development. Students will design and implement a medium size project with a more advanced user-interface design, such as a web or mobile application with a GUI and event- driven implementation; use of version-control software.",
            "id": "COMPSCI 400",
            "parent": "COMPSCI",
            "title": "PROGRAMMING III"
        }
    },
    {
        "data": {
            "description": "Theory and algorithms for nonlinear optimization, focusing on unconstrained optimization. Line-search and trust-region methods; quasi-Newton methods; conjugate-gradient and limited-memory methods for large-scale problems; derivative-free optimization; algorithms for least-squares problems and nonlinear equations; gradient projection algorithms for bound-constrained problems; and simple penalty methods for nonlinearly constrained optimization. Students are strongly encouraged to have knowledge of linear algebra and familiarity with basic mathematical analysis.",
            "id": "COMPSCI/ISYE/MATH/STAT 726",
            "title": "NONLINEAR OPTIMIZATION I"
        }
    },
    {
        "data": {
            "description": "Theory and algorithms for nonlinearly constrained optimization. Relevant geometric concepts, including tangent and normal cones, theorems of the alternative, and separation results. Constraint qualifications. Geometric and algebraic expression of first-order optimality conditions. Second-order optimality conditions. Duality. Nonlinear  programming algorithms: merit functions and filters; interior-point, augmented Lagrangian, and sequential quadratic programming algorithms.",
            "id": "COMPSCI/ISYE/MATH 730",
            "title": "NONLINEAR OPTIMIZATION II"
        }
    },
    {
        "data": {
            "description": "Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Part of a 2-semester sequence withMATH 217; these two courses together are equivalent toMATH 114and221.",
            "id": "MATH 171",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY I"
        }
    },
    {
        "data": {
            "description": "Topics in multi-variable calculus and introduction to differential equations.",
            "id": "MATH 376",
            "parent": "MATH",
            "title": "TOPICS IN MULTI-VARIABLE CALCULUS AND DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "description": "Topics include discrete-time Markov chains, Poisson point processes, continuous-time Markov chains, and renewal processes. Applications to queueing, branching, and other models in science, engineering and business.",
            "id": "ISYE/MATH/OTM/STAT 632",
            "title": "INTRODUCTION TO STOCHASTIC PROCESSES"
        }
    },
    {
        "data": {
            "description": "Topics vary.",
            "id": "ISYE 961",
            "parent": "ISYE",
            "title": "GRADUATE SEMINAR IN INDUSTRIAL ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Unbiased estimation, maximum likelihood estimation, confidence intervals, tests of hypotheses, Neyman-Pearson lemma, likelihood ratio test, regression, analysis of variance with applications.",
            "id": "STAT 312",
            "parent": "STAT",
            "title": "INTRODUCTION TO THEORY AND METHODS OF MATHEMATICAL STATISTICS II"
        }
    },
    {
        "data": {
            "description": "Under faculty supervision.",
            "id": "ISYE 699",
            "parent": "ISYE",
            "title": "ADVANCED INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Under faculty supervision.",
            "id": "ISYE 999",
            "parent": "ISYE",
            "title": "ADVANCED INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Undergraduate honors research projects supervised by faculty members.",
            "id": "ISYE 389",
            "parent": "ISYE",
            "title": "HONORS IN RESEARCH"
        }
    },
    {
        "data": {
            "description": "Undergraduate honors research projects supervised by faculty members.",
            "id": "ISYE 489",
            "parent": "ISYE",
            "title": "HONORS IN RESEARCH"
        }
    },
    {
        "data": {
            "description": "Use, control and administration of centralized and distributed data bases. Topics include the definition, design, creation, revision, interrogation, update, security and integrity of data bases.",
            "id": "INFOSYS/ISYE 722",
            "title": "COMPUTER-BASED DATA MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Various special topics in engineering analytics and operations research, such as machine learning, data management and analysis, optimization, etc.",
            "id": "ISYE 603",
            "parent": "ISYE",
            "title": "SPECIAL TOPICS IN ENGINEERING ANALYTICS AND OPERATIONS RESEARCH"
        }
    },
    {
        "data": {
            "description": "Various special topics in healthcare systems engineering, such as human factors in healthcare settings, operations research applied to healthcare, etc.",
            "id": "ISYE 606",
            "parent": "ISYE",
            "title": "SPECIAL TOPICS IN HEALTHCARE SYSTEMS ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Various special topics in human factors engineering. Course topic may vary from semester to semester. Different versions of this course may be offered in same semester.",
            "id": "ISYE 602",
            "parent": "ISYE",
            "title": "SPECIAL TOPICS IN HUMAN FACTORS"
        }
    },
    {
        "data": {
            "description": "Various special topics in manufacturing systems and supply chain management, such as digital manufacturing technologies, Internet of Things (IoT), supply chain, etc.",
            "id": "ISYE 604",
            "parent": "ISYE",
            "title": "SPECIAL TOPICS IN MANUFACTURING AND SUPPLY CHAIN MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Vector analysis: algebra and geometry of vectors, vector differential and integral calculus, theorems of Green, Gauss, and Stokes; complex analysis: analytic functions, complex integrals and residues, Taylor and Laurent series.",
            "id": "MATH 321",
            "parent": "MATH",
            "title": "APPLIED MATHEMATICAL ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Vector spaces and linear transformations, differential calculus of scalar and vector fields, determinants, eigenvalues and eigenvectors, multiple integrals, line integrals, and surface integrals. Freshmen students are invited to enroll by the Department of Mathematics.",
            "id": "MATH 375",
            "parent": "MATH",
            "title": "TOPICS IN MULTI-VARIABLE CALCULUS AND LINEAR ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Work experience that combines classroom theory with practical knowledge of operations to provide students with a background on which to develop and enhance a professional career.  The work experience is tailored for MS students from within the U.S. as well as eligible international students.",
            "id": "ISYE 702",
            "parent": "ISYE",
            "title": "GRADUATE COOPERATIVE EDUCATION PROGRAM"
        }
    },
    {
        "data": {
            "description": "Work experience which combines classroom theory with practical knowledge of operations to provide students with a background upon which to base a professional career in industry.",
            "id": "ISYE 1",
            "parent": "ISYE",
            "title": "COOPERATIVE EDUCATION PROGRAM"
        }
    },
    {
        "data": {
            "id": "BME",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "COMPSCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ECE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "EMA",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "INFOSYS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "INTEREGR",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ISYE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ME",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "STAT",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "BME 315",
            "target": "BME/ISYE 564"
        }
    },
    {
        "data": {
            "source": "BMI/POPHLTH 551",
            "target": "BMI/POPHLTH 552"
        }
    },
    {
        "data": {
            "source": "BMI/POPHLTH 552",
            "target": "ISYE/POPHLTH 875"
        }
    },
    {
        "data": {
            "source": "COMPSCI 200",
            "target": "COMPSCI 300"
        }
    },
    {
        "data": {
            "source": "COMPSCI 200",
            "target": "COMPSCI/ECE/ISYE 524"
        }
    },
    {
        "data": {
            "source": "COMPSCI 200",
            "target": "COMPSCI/ISYE 526"
        }
    },
    {
        "data": {
            "source": "COMPSCI 200",
            "target": "ISYE 620"
        }
    },
    {
        "data": {
            "source": "COMPSCI 220",
            "target": "COMPSCI 300"
        }
    },
    {
        "data": {
            "source": "COMPSCI 220",
            "target": "INFOSYS 371"
        }
    },
    {
        "data": {
            "source": "COMPSCI 300",
            "target": "COMPSCI 400"
        }
    },
    {
        "data": {
            "source": "COMPSCI 310",
            "target": "COMPSCI 300"
        }
    },
    {
        "data": {
            "source": "COMPSCI 310",
            "target": "COMPSCI/ECE/ISYE 524"
        }
    },
    {
        "data": {
            "source": "COMPSCI 310",
            "target": "COMPSCI/ISYE 526"
        }
    },
    {
        "data": {
            "source": "COMPSCI 400",
            "target": "COMPSCI/ISYE/ME 558"
        }
    },
    {
        "data": {
            "source": "COMPSCI 400",
            "target": "ISYE/ME 643"
        }
    },
    {
        "data": {
            "source": "COMPSCI/ECE 252",
            "target": "COMPSCI 300"
        }
    },
    {
        "data": {
            "source": "COMPSCI/ECE/ISYE 524",
            "target": "ISYE 517"
        }
    },
    {
        "data": {
            "source": "COMPSCI/ECE/ISYE 524",
            "target": "ISYE 521"
        }
    },
    {
        "data": {
            "source": "COMPSCI/ECE/ISYE 524",
            "target": "ISYE 625"
        }
    },
    {
        "data": {
            "source": "COMPSCI/ECE/ISYE 524",
            "target": "ISYE/ME 510"
        }
    },
    {
        "data": {
            "source": "COMPSCI/ISYE/MATH/STAT 525",
            "target": "COMPSCI/ISYE 526"
        }
    },
    {
        "data": {
            "source": "COMPSCI/ISYE/MATH/STAT 726",
            "target": "COMPSCI/ISYE/MATH 730"
        }
    },
    {
        "data": {
            "source": "ECE 203",
            "target": "ECE 331"
        }
    },
    {
        "data": {
            "source": "ECE 331",
            "target": "ECE/ISYE 570"
        }
    },
    {
        "data": {
            "source": "EMA 201",
            "target": "ME 306"
        }
    },
    {
        "data": {
            "source": "INFOSYS 371",
            "target": "INFOSYS/ISYE 722"
        }
    },
    {
        "data": {
            "source": "INTEREGR 397",
            "target": "ISYE 515"
        }
    },
    {
        "data": {
            "source": "INTEREGR 397",
            "target": "ISYE 552"
        }
    },
    {
        "data": {
            "source": "ISYE 210",
            "target": "ISYE 312"
        }
    },
    {
        "data": {
            "source": "ISYE 210",
            "target": "ISYE 315"
        }
    },
    {
        "data": {
            "source": "ISYE 210",
            "target": "ISYE 320"
        }
    },
    {
        "data": {
            "source": "ISYE 210",
            "target": "ISYE 350"
        }
    },
    {
        "data": {
            "source": "ISYE 210",
            "target": "ISYE 412"
        }
    },
    {
        "data": {
            "source": "ISYE 210",
            "target": "ISYE 521"
        }
    },
    {
        "data": {
            "source": "ISYE 210",
            "target": "ISYE 562"
        }
    },
    {
        "data": {
            "source": "ISYE 210",
            "target": "ISYE 575"
        }
    },
    {
        "data": {
            "source": "ISYE 210",
            "target": "ISYE 625"
        }
    },
    {
        "data": {
            "source": "ISYE 210",
            "target": "ISYE 649"
        }
    },
    {
        "data": {
            "source": "ISYE 210",
            "target": "ISYE/PSYCH 349"
        }
    },
    {
        "data": {
            "source": "ISYE 313",
            "target": "ISYE 450"
        }
    },
    {
        "data": {
            "source": "ISYE 315",
            "target": "ISYE 350"
        }
    },
    {
        "data": {
            "source": "ISYE 315",
            "target": "ISYE 415"
        }
    },
    {
        "data": {
            "source": "ISYE 315",
            "target": "ISYE 520"
        }
    },
    {
        "data": {
            "source": "ISYE 315",
            "target": "ISYE 605"
        }
    },
    {
        "data": {
            "source": "ISYE 315",
            "target": "ISYE 615"
        }
    },
    {
        "data": {
            "source": "ISYE 315",
            "target": "ISYE/ME 510"
        }
    },
    {
        "data": {
            "source": "ISYE 315",
            "target": "ISYE/ME 641"
        }
    },
    {
        "data": {
            "source": "ISYE 320",
            "target": "ISYE 321"
        }
    },
    {
        "data": {
            "source": "ISYE 320",
            "target": "ISYE 417"
        }
    },
    {
        "data": {
            "source": "ISYE 320",
            "target": "ISYE 615"
        }
    },
    {
        "data": {
            "source": "ISYE 323",
            "target": "ISYE 517"
        }
    },
    {
        "data": {
            "source": "ISYE 323",
            "target": "ISYE 521"
        }
    },
    {
        "data": {
            "source": "ISYE 323",
            "target": "ISYE 615"
        }
    },
    {
        "data": {
            "source": "ISYE 323",
            "target": "ISYE 625"
        }
    },
    {
        "data": {
            "source": "ISYE 323",
            "target": "ISYE 645"
        }
    },
    {
        "data": {
            "source": "ISYE 323",
            "target": "ISYE/ME 510"
        }
    },
    {
        "data": {
            "source": "ISYE 350",
            "target": "ISYE 450"
        }
    },
    {
        "data": {
            "source": "ISYE 415",
            "target": "ISYE 645"
        }
    },
    {
        "data": {
            "source": "ISYE 417",
            "target": "BMI/ISYE 617"
        }
    },
    {
        "data": {
            "source": "ISYE 468",
            "target": "ISYE 478"
        }
    },
    {
        "data": {
            "source": "ISYE 521",
            "target": "ECE/ISYE 570"
        }
    },
    {
        "data": {
            "source": "ISYE 562",
            "target": "ECE/ISYE 570"
        }
    },
    {
        "data": {
            "source": "ISYE 624",
            "target": "ISYE/ME 643"
        }
    },
    {
        "data": {
            "source": "ISYE/MATH/OTM/STAT 632",
            "target": "ISYE/ME 643"
        }
    },
    {
        "data": {
            "source": "ISYE/ME 512",
            "target": "ISYE 612"
        }
    },
    {
        "data": {
            "source": "ISYE/PSYCH 349",
            "target": "BME/ISYE 564"
        }
    },
    {
        "data": {
            "source": "ISYE/PSYCH 349",
            "target": "ISYE 348"
        }
    },
    {
        "data": {
            "source": "ISYE/PSYCH 349",
            "target": "ISYE 417"
        }
    },
    {
        "data": {
            "source": "ISYE/PSYCH 349",
            "target": "ISYE 450"
        }
    },
    {
        "data": {
            "source": "ISYE/PSYCH 349",
            "target": "ISYE 552"
        }
    },
    {
        "data": {
            "source": "ISYE/PSYCH 349",
            "target": "ISYE 555"
        }
    },
    {
        "data": {
            "source": "ISYE/PSYCH 349",
            "target": "ISYE 557"
        }
    },
    {
        "data": {
            "source": "ISYE/PSYCH 349",
            "target": "ISYE 649"
        }
    },
    {
        "data": {
            "source": "ISYE/PSYCH 349",
            "target": "ISYE/PSYCH 549"
        }
    },
    {
        "data": {
            "source": "ISYE/PSYCH 349",
            "target": "ISYE/PSYCH 653"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "MATH 217"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "ISYE 210"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 213"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "STAT 340"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "source": "MATH 213",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 217",
            "target": "ECE 203"
        }
    },
    {
        "data": {
            "source": "MATH 217",
            "target": "ISYE 313"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "ISYE 313"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 222"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "COMPSCI 310"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "EMA 201"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 234"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 319"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 320"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 340"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "ME 306"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "COMPSCI/ISYE/ME 558"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "MATH 321"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "MATH 341"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "MATH 421"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "MATH 521"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "MATH/STAT 431"
        }
    },
    {
        "data": {
            "source": "MATH 319",
            "target": "MATH 321"
        }
    },
    {
        "data": {
            "source": "MATH 320",
            "target": "COMPSCI/ECE/ISYE 524"
        }
    },
    {
        "data": {
            "source": "MATH 320",
            "target": "MATH 321"
        }
    },
    {
        "data": {
            "source": "MATH 321",
            "target": "MATH 322"
        }
    },
    {
        "data": {
            "source": "MATH 322",
            "target": "MATH 521"
        }
    },
    {
        "data": {
            "source": "MATH 340",
            "target": "COMPSCI/ISYE/MATH 425"
        }
    },
    {
        "data": {
            "source": "MATH 340",
            "target": "COMPSCI/ISYE/MATH/STAT 525"
        }
    },
    {
        "data": {
            "source": "MATH 340",
            "target": "ISYE 323"
        }
    },
    {
        "data": {
            "source": "MATH 340",
            "target": "MATH 321"
        }
    },
    {
        "data": {
            "source": "MATH 341",
            "target": "COMPSCI/ISYE/MATH 425"
        }
    },
    {
        "data": {
            "source": "MATH 341",
            "target": "COMPSCI/ISYE/MATH/STAT 525"
        }
    },
    {
        "data": {
            "source": "MATH 341",
            "target": "MATH 321"
        }
    },
    {
        "data": {
            "source": "MATH 375",
            "target": "ISYE 323"
        }
    },
    {
        "data": {
            "source": "MATH 375",
            "target": "MATH 321"
        }
    },
    {
        "data": {
            "source": "MATH 375",
            "target": "MATH 376"
        }
    },
    {
        "data": {
            "source": "MATH 376",
            "target": "MATH 321"
        }
    },
    {
        "data": {
            "source": "MATH 376",
            "target": "MATH 322"
        }
    },
    {
        "data": {
            "source": "MATH 376",
            "target": "MATH/STAT 431"
        }
    },
    {
        "data": {
            "source": "MATH 421",
            "target": "MATH 521"
        }
    },
    {
        "data": {
            "source": "MATH 421",
            "target": "MATH 531"
        }
    },
    {
        "data": {
            "source": "MATH 521",
            "target": "MATH 531"
        }
    },
    {
        "data": {
            "source": "MATH 531",
            "target": "ISYE/MATH/OTM/STAT 632"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "MATH/STAT 309",
            "target": "ISYE 320"
        }
    },
    {
        "data": {
            "source": "MATH/STAT 309",
            "target": "ISYE 516"
        }
    },
    {
        "data": {
            "source": "MATH/STAT 309",
            "target": "ISYE 517"
        }
    },
    {
        "data": {
            "source": "MATH/STAT 309",
            "target": "ISYE 624"
        }
    },
    {
        "data": {
            "source": "MATH/STAT 309",
            "target": "ISYE/MATH/OTM/STAT 632"
        }
    },
    {
        "data": {
            "source": "MATH/STAT 309",
            "target": "ISYE/NE 574"
        }
    },
    {
        "data": {
            "source": "MATH/STAT 309",
            "target": "MATH/STAT 310"
        }
    },
    {
        "data": {
            "source": "MATH/STAT 309",
            "target": "STAT 311"
        }
    },
    {
        "data": {
            "source": "MATH/STAT 309",
            "target": "STAT 312"
        }
    },
    {
        "data": {
            "source": "MATH/STAT 310",
            "target": "ISYE 615"
        }
    },
    {
        "data": {
            "source": "MATH/STAT 310",
            "target": "ISYE 620"
        }
    },
    {
        "data": {
            "source": "MATH/STAT 431",
            "target": "ISYE 624"
        }
    },
    {
        "data": {
            "source": "MATH/STAT 431",
            "target": "ISYE/MATH/OTM/STAT 632"
        }
    },
    {
        "data": {
            "source": "MATH/STAT 431",
            "target": "MATH/STAT 309"
        }
    },
    {
        "data": {
            "source": "MATH/STAT 431",
            "target": "MATH/STAT 310"
        }
    },
    {
        "data": {
            "source": "MATH/STAT 431",
            "target": "STAT 311"
        }
    },
    {
        "data": {
            "source": "ME 306",
            "target": "BME 315"
        }
    },
    {
        "data": {
            "source": "POPHLTH/SOC 797",
            "target": "ISYE/POPHLTH 875"
        }
    },
    {
        "data": {
            "source": "STAT 240",
            "target": "STAT 340"
        }
    },
    {
        "data": {
            "source": "STAT 311",
            "target": "ISYE 516"
        }
    },
    {
        "data": {
            "source": "STAT 311",
            "target": "ISYE 624"
        }
    },
    {
        "data": {
            "source": "STAT 311",
            "target": "ISYE/ME 512"
        }
    },
    {
        "data": {
            "source": "STAT 311",
            "target": "MATH/STAT 310"
        }
    },
    {
        "data": {
            "source": "STAT 311",
            "target": "STAT 312"
        }
    },
    {
        "data": {
            "source": "STAT 312",
            "target": "ISYE 575"
        }
    },
    {
        "data": {
            "source": "STAT 324",
            "target": "ISYE 315"
        }
    },
    {
        "data": {
            "source": "STAT 324",
            "target": "ISYE 320"
        }
    },
    {
        "data": {
            "source": "STAT 324",
            "target": "ISYE 412"
        }
    },
    {
        "data": {
            "source": "STAT 324",
            "target": "ISYE 620"
        }
    },
    {
        "data": {
            "source": "STAT 324",
            "target": "ISYE 649"
        }
    },
    {
        "data": {
            "source": "STAT 324",
            "target": "ISYE/ME 512"
        }
    },
    {
        "data": {
            "source": "STAT 324",
            "target": "ISYE/NE 574"
        }
    },
    {
        "data": {
            "source": "STAT 324",
            "target": "ISYE/PSYCH 349"
        }
    },
    {
        "data": {
            "source": "STAT 324",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "source": "STAT 340",
            "target": "ISYE 562"
        }
    },
    {
        "data": {
            "source": "STAT 371",
            "target": "STAT 324"
        }
    }
]