[
    {
        "data": {
            "description": "Advertising and other mass media content from the consumer's viewpoint; consumer's need and opportunities for information, and use of opportunities; consumer evaluation of media performance, guidelines for effective use; alternative means for obtaining information; implications of consumer movement.",
            "id": "JOURN 564",
            "parent": "JOURN",
            "title": "MEDIA AND THE CONSUMER"
        }
    },
    {
        "data": {
            "description": "Children's and adolescents' use of mass media and mass media effects on them. Particular attention is given to changes in comprehension and other cognitive activities that give insights into media use and effects.",
            "id": "COMARTS/HDFS/JOURN 616",
            "title": "MASS MEDIA AND YOUTH"
        }
    },
    {
        "data": {
            "description": "Provides a comprehensive introduction to classical consumer packaged goods brand management by exploring the intersection of marketing, advertising, and strategy to grow sales profitably over time with winning products and effective campaigns. Illuminates the foundational concepts, frameworks, and tools brand management professionals use to drive awareness, consideration, trial and repeat of their offerings to increase market share and establish long-lasting brand equity with target consumer groups. Engages leadership and positioning principles to cultivate and communicate one's professional and personal brand in any career or life path.",
            "id": "JOURN 649",
            "parent": "JOURN",
            "title": "BRAND STRATEGY IN ADVERTISING & INTEGRATED COMMUNICATIONS"
        }
    },
    {
        "data": {
            "description": "Provides advanced, targeted instruction in reporting that pays close attention to neighborhoods or very small communities (subcommunities), also known as hyperlocal reporting. These small communities can be defined by geographic boundaries or boundaries of shared topical interest. Locate community-based reporting's place in the larger media ecology of mainstream media (newspapers, TV, weekly papers, magazines, independent websites, etc.), and investigate how local journalism's place in changing media ecologies helps (or discourages) people from becoming active citizens in a democracy.",
            "id": "JOURN 426",
            "parent": "JOURN",
            "title": "COMMUNITY-BASED REPORTING"
        }
    },
    {
        "data": {
            "description": "Theory and research on individuals' use of mass communication and effects of mass communication. Topics include choice, selection and functions of mass media use, attention and cognitive processing, information effects, persuasion and emotion/involvement, and social and behaviroal effects.",
            "id": "JOURN 801",
            "parent": "JOURN",
            "title": "MASS COMMUNICATION AND THE INDIVIDUAL"
        }
    },
    {
        "data": {
            "description": "A scholarly theory overview on gender and sexuality in communication studies.",
            "id": "GEN&WS/JOURN 828",
            "title": "GENDER AND SEXUALITY IN MASS COMMUNICATION"
        }
    },
    {
        "data": {
            "description": "Addresses the multi-disciplinary theory and research that have contributed to our understanding of both the antecedents and consequences of mediated messages as they impinge upon processes related to social protest. Draws from literature in mass communication, political science, sociology, psychology and other disciplines to examine questions about the role of communication media in the dynamics of social protest.",
            "id": "JOURN 835",
            "parent": "JOURN",
            "title": "NEWS FRAMING AND SOCIAL PROTEST MOVEMENTS"
        }
    },
    {
        "data": {
            "description": "Advanced directed study projects as arranged with a faculty or instructional academic staff member, based on internship experience.",
            "id": "JOURN 697",
            "parent": "JOURN",
            "title": "INTERNSHIP"
        }
    },
    {
        "data": {
            "description": "Advanced directed study projects as arranged with a faculty or instructional academic staff member.",
            "id": "JOURN 698",
            "parent": "JOURN",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Advanced directed study projects as arranged with a faculty or instructional academic staff member.",
            "id": "JOURN 699",
            "parent": "JOURN",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Advanced level mentored reading and research for dissertators.",
            "id": "JOURN 999",
            "parent": "JOURN",
            "title": "INDEPENDENT RESEARCH PROBLEMS"
        }
    },
    {
        "data": {
            "description": "Advanced level mentored reading and research for students with dissertator status.",
            "id": "JOURN 990",
            "parent": "JOURN",
            "title": "THESIS"
        }
    },
    {
        "data": {
            "description": "Advanced reporting with emphasis on critical evaluation of evidence and on recognizing the complex effects of government actions. Explore and develop community context stories that originate in a range of venues from the courts to the schools.",
            "id": "JOURN 401",
            "parent": "JOURN",
            "title": "IN-DEPTH REPORTING"
        }
    },
    {
        "data": {
            "description": "An introduction to digital media and how it influences - and is impacted by - society, culture, politics, and the economy. Create on-trend digital media content and critically examine digital mediums, messages, and audiences.",
            "id": "JOURN 175",
            "parent": "JOURN",
            "title": "MEDIA FLUENCY FOR THE DIGITAL AGE"
        }
    },
    {
        "data": {
            "description": "An introduction to information and data visualization: introduction to major concepts, instruction in specific tools for data analysis and visualization, and application of skills in a final project.",
            "id": "JOURN/LIS 677",
            "title": "CONCEPTS AND TOOLS FOR DATA ANALYSIS AND VISUALIZATION"
        }
    },
    {
        "data": {
            "description": "An introduction to the roles and functions of print, film, electronic and digital media in multicultural America.  International comparisons highlight differences and commonalities in the social and cultural position of mass media in societies with racially and ethnically diverse populations.",
            "id": "JOURN 162",
            "parent": "JOURN",
            "title": "MASS MEDIA IN MULTICULTURAL AMERICA"
        }
    },
    {
        "data": {
            "description": "Analysis of political and legal relationships between mass communication and government with emphasis on current problems and issues.",
            "id": "JOURN 675",
            "parent": "JOURN",
            "title": "TOPICS IN GOVERNMENT AND MASS MEDIA"
        }
    },
    {
        "data": {
            "description": "Application and integration of theory in understanding the effects of mass media, with close attention to health communication campaign messages.",
            "id": "JOURN 821",
            "parent": "JOURN",
            "title": "HEALTH COMMUNICATION"
        }
    },
    {
        "data": {
            "description": "Assists students in turning research questions into substantive research designs with understanding of the concepts involved. For most students, the final product will be a well-developed thesis or dissertation proposal.",
            "id": "JOURN/LSC 811",
            "title": "CONCEPTUALIZATION AND DESIGN OF MASS COMMUNICATION RESEARCH"
        }
    },
    {
        "data": {
            "description": "Audio storytelling as an art form, with a focus on creating a series of episodic long-form audio storytelling segments. Develop interview and writing skills, as well as field recording and editing techniques. Develop personal style and voice, while learning practical skills necessary to write and produce audio content for over the air or online.",
            "id": "JOURN 457",
            "parent": "JOURN",
            "title": "STORYTELLING THROUGH SOUND"
        }
    },
    {
        "data": {
            "description": "Basic reporting for print and electronic media. Bring together technical and conceptual skills by creating a variety of print, audio, and web-based news stories on a current public issue.",
            "id": "JOURN 335",
            "parent": "JOURN",
            "title": "PRINCIPLES AND PRACTICES OF REPORTING"
        }
    },
    {
        "data": {
            "description": "Build increasingly sophisticated communication skills, including writing, editing, gathering information, working with data, and presenting stories through varying media forms. Develop an appreciation of how different media influence message design by communicators and reception by audiences. Develop a complex toolkit of conceptual and practical skills for media work in journalism, strategic communication, and hybrids. Build writing skills and critical thinking abilities, two elements common to success in any field.",
            "id": "JOURN 202",
            "parent": "JOURN",
            "title": "MASS COMMUNICATION PRACTICES"
        }
    },
    {
        "data": {
            "description": "Colloquium series in fields related to communication and information studies. Teaching presentations on various theoretical and practical approaches to teaching and learning in the communication and information fields.",
            "id": "JOURN 902",
            "parent": "JOURN",
            "title": "GRADUATE TEACHING COLLOQUIUM"
        }
    },
    {
        "data": {
            "description": "Considers the effects of new communication technologies on everyday life and political mobilization.",
            "id": "JOURN/LSC 833",
            "title": "TECHNOLOGY AND SOCIETY"
        }
    },
    {
        "data": {
            "description": "Core skills and issues of communicating about sports to a mass audience in a changing media landscape, as well as advice and support in starting a sports communication career including access to professionals in the field. Utilizes professional, historical and theoretical perspectives in helping participants gain proficiency in disseminating information about sports-related events and topics for informative and strategic purposes, while developing a sense of the role of sport in contemporary society.",
            "id": "JOURN 450",
            "parent": "JOURN",
            "title": "SPORTS REPORTING AND WRITING"
        }
    },
    {
        "data": {
            "description": "Covers fundamental thinking skills necessary for the critical evaluation and presentation of arguments in mass communication, especially those based upon quantitative information. Introduces generic logic and quantitative reasoning concepts through analysis and discussion of specific cases drawn from research reported in the mass media (e.g., health and business news, public opinion polls), research on the media (e.g., the impact of media violence), and research for the media (e.g., audience research). Logical and quantitative reasoning skills will be improved through a variety of \"hands on\" projects.",
            "id": "JOURN 657",
            "parent": "JOURN",
            "title": "UNDERSTANDING RESEARCH DESIGN & STATISTICS IN MASS COMMUNICATION"
        }
    },
    {
        "data": {
            "description": "Creative elements of non-fiction story telling to develop skills necessary for writing across the journalistic spectrum, from newspapers to magazines to books.",
            "id": "JOURN 405",
            "parent": "JOURN",
            "title": "CREATIVE NONFICTION"
        }
    },
    {
        "data": {
            "description": "Critical reading of the best reporting and writing.",
            "id": "JOURN 669",
            "parent": "JOURN",
            "title": "LITERARY ASPECTS OF JOURNALISM"
        }
    },
    {
        "data": {
            "description": "Detailed practicum on conducting and publishing empirical research in mass communication.",
            "id": "JOURN 813",
            "parent": "JOURN",
            "title": "PRACTICUM IN COMMUNICATION RESEARCH"
        }
    },
    {
        "data": {
            "description": "Develop information skills - information collection, information verification, information analysis, and information presentation (the CVAP approach) - that are used by professionals in journalism and strategic communication. Includes practical techniques that enhance basic skills related to the collection, evaluation, analysis and presentation of information. These skills will provide a foundation for the major and in journalism and mass communication careers.",
            "id": "JOURN 203",
            "parent": "JOURN",
            "title": "INFORMATION FOR COMMUNICATION"
        }
    },
    {
        "data": {
            "description": "Develop skills needed to conduct professional-level journalism and strategic communication in long-form video. Produce documentary pieces of covering a contemporary topic of local or regional interest and complete other exercises in video analysis, composition and production.",
            "id": "JOURN 456",
            "parent": "JOURN",
            "title": "LONG FORM VIDEO"
        }
    },
    {
        "data": {
            "description": "Evolution of the mass media in the United States in the context of political, social, and economic change.",
            "id": "HISTORY/JOURN 560",
            "title": "HISTORY OF U.S. MEDIA"
        }
    },
    {
        "data": {
            "description": "Examines key concepts in social network theory and develops and applies them to the field of communication. Attention is paid to the differences between social and online networks, as well as their relationships. Explores major concepts and questions in social network theory and analysis, including the elements that make up a network; network relationships (e.g. homophily, knowing others like ourselves); the construction of whole social networks out of dyads (two people) and triads (three); strong and weak ties; roles and positions; groups, cliques, and clusters; as well as small worlds and communities. Emphasis will be on what these concepts mean and how they work. There will be minimal introduction to technical network analysis and hands- on work.",
            "id": "JOURN 664",
            "parent": "JOURN",
            "title": "SOCIAL NETWORKS IN COMMUNICATION"
        }
    },
    {
        "data": {
            "description": "Examines key theoretical and empirical readings in the area of race/ethnicity and media.",
            "id": "JOURN 824",
            "parent": "JOURN",
            "title": "RACE, ETHNICITY AND MEDIA"
        }
    },
    {
        "data": {
            "description": "Examines systematic procedures for theory building and comparison of theories of communication processes between mass media and other societal institutions and their relationships with both individuals and micro-social systems.",
            "id": "JOURN 802",
            "parent": "JOURN",
            "title": "MASS COMMUNICATION AND SOCIETY"
        }
    },
    {
        "data": {
            "description": "Examines the interaction between disability and media in modern society. Explore representations of disability in various forms of mass media, including television and film, social media, advertising, and others. Analyze how these representations affect disabled people directly, including the development of their identities, as well as how they influence disability attitudes and stigma throughout society. Discuss overt and casual ableism within media, as well as how the disability community uses media for activism. Discuss issues of access for disabled people (e.g., assistive technology, captions, audio descriptions), as well as the future of disability representations within media.",
            "id": "COMARTS/JOURN/RP&SE 312",
            "title": "DISABILITY AND THE MEDIA"
        }
    },
    {
        "data": {
            "description": "Examines the legal and ethical questions surrounding digital media and their effects on society and individuals.",
            "id": "JOURN 678",
            "parent": "JOURN",
            "title": "LEGAL & ETHICAL DIMENSIONS OF EMERGING MEDIA"
        }
    },
    {
        "data": {
            "description": "Examines the role of communication in health, how the revolution in information technology has affected health communication, and the assumptions about health information and communication that drive current efforts to use technologies.",
            "id": "COMARTS/JOURN/LSC 617",
            "title": "HEALTH COMMUNICATION IN THE INFORMATION AGE"
        }
    },
    {
        "data": {
            "description": "Expands the toolkit of skills and experiences through direct work with working journalists and communication professionals.",
            "id": "JOURN 903",
            "parent": "JOURN",
            "title": "PROFESSIONAL MASTER'S COLLOQUIUM"
        }
    },
    {
        "data": {
            "description": "Exploration of a particular set of concepts and skills in more depth. Subject will vary.",
            "id": "JOURN 475",
            "parent": "JOURN",
            "title": "SPECIAL TOPICS IN ADVANCED CONCEPTS AND SKILLS"
        }
    },
    {
        "data": {
            "description": "Exploration of prominent controversies that pervade the realm of sports and engage the activities of sports communication professionals (such as sports journalists, broadcasters, marketers, and public relations specialists). Discuss the issues involved in these controversies and pay special attention to the way they impinge upon professional practices.",
            "id": "JOURN 651",
            "parent": "JOURN",
            "title": "COMMUNICATING SPORTS CONTROVERSIES"
        }
    },
    {
        "data": {
            "description": "Exploration of the role that gender and sexuality both play in media representation, production, reception, and activism.",
            "id": "JOURN 163",
            "parent": "JOURN",
            "title": "GENDER AND SEXUALITY IN MASS COMMUNICATION"
        }
    },
    {
        "data": {
            "description": "Explore the central activities and concepts related to various communication professions involved in the realm of sports. These activities include sports journalism, sports broadcasting, sports marketing communications, and sports public relations. Consider major social issues that impinge upon these professions including how sports and media intersect with concerns associated with race and gender. Explore strategies to build careers in sports communications and beyond.",
            "id": "JOURN 150",
            "parent": "JOURN",
            "title": "INTRODUCTION TO SPORTS COMMUNICATION"
        }
    },
    {
        "data": {
            "description": "Explore various activities related to the promotion domain of sports marketing including marketing research, sports branding, image management, advertising promotion, event promotion, sports sponsorships, and public relations. Examine each of these activities, and focus on the marketing communications associated with each of these activities.",
            "id": "JOURN 350",
            "parent": "JOURN",
            "title": "SPORTS MARKETING COMMUNICATIONS"
        }
    },
    {
        "data": {
            "description": "Explores a wide variety of post-undergraduate communication career options available in Journalism. Topics related to job hunting, resume writing, and networking are also covered. Focuses on opportunities and challenges in a wide variety of communication fields, from advertising and public relations to radio, newspapers and TV broadcasting. Guest speakers or panelists will span different sectors (agencies, corporations, nonprofits, higher education, government, etc.).",
            "id": "JOURN 601",
            "parent": "JOURN",
            "title": "COLLOQUIUM IN PROFESSIONAL COMMUNICATION CAREERS"
        }
    },
    {
        "data": {
            "description": "Explores critical questions of media law and ethics within the United States.",
            "id": "JOURN/LSC 825",
            "title": "LAW AND ETHICS OF COMMUNICATION AND MEDIA"
        }
    },
    {
        "data": {
            "description": "Focus on the content and purposes of journalism, explores cultural values associated with journalism, relationships between journalism and other institutions, and current issues facing journalists at a time when the profession faces many challenges.",
            "id": "JOURN/LSC 826",
            "title": "JOURNALISM THEORY"
        }
    },
    {
        "data": {
            "description": "Freedom of speech and press with particular emphasis on major legal issues confronting media practitioners; introduction to such areas of law as censorship, libel, invasion of privacy, access to information, regulation of electronic media and commercial speech.",
            "id": "JOURN 563",
            "parent": "JOURN",
            "title": "LAW OF MASS COMMUNICATION"
        }
    },
    {
        "data": {
            "description": "Historical, political, economic and cultural trends in global mass communication systems.",
            "id": "JOURN 620",
            "parent": "JOURN",
            "title": "INTERNATIONAL COMMUNICATION"
        }
    },
    {
        "data": {
            "description": "History of books and print culture in the West from ancient times to the present. Focus on the influence of reading and writing on social, cultural, and intellectual life. Methodologies, theories, and sources for study  of book and print culture history.",
            "id": "ARTHIST/HISTORY/JOURN/LIS 650",
            "title": "HISTORY OF BOOKS AND PRINT CULTURE IN EUROPE AND NORTH AMERICA"
        }
    },
    {
        "data": {
            "description": "How the mass media are organized and how they function in modern society; their technological basis, economic and political foundations, and social implications.",
            "id": "JOURN 201",
            "parent": "JOURN",
            "title": "INTRODUCTION TO MASS COMMUNICATION"
        }
    },
    {
        "data": {
            "description": "In-depth analysis of a conceptual mass communication issue.",
            "id": "JOURN 676",
            "parent": "JOURN",
            "title": "SPECIAL TOPICS IN MASS COMMUNICATION"
        }
    },
    {
        "data": {
            "description": "In-depth investigation of a specific topic in mass communication.",
            "id": "JOURN 880",
            "parent": "JOURN",
            "title": "TOPICS IN MASS COMMUNICATION"
        }
    },
    {
        "data": {
            "description": "Instruction and practice in strategies for communicating science to the public. Emphases include (1) how to explain difficult concepts and prrocesses; (2) skills for telling interesting and artful stories; and (3) strategies for making reasonable judgments about scientific evidence.",
            "id": "JOURN 415",
            "parent": "JOURN",
            "title": "SCIENCE AND ENVIRONMENTAL JOURNALISM"
        }
    },
    {
        "data": {
            "description": "Integrated, in-depth approach to magazine management, writing, editing and design. Covers the magazine industry from both the editorial and business ends, bringing together journalism and strategic communication students. Includes production of Curb magazine in print, online and mobile formats.",
            "id": "JOURN 417",
            "parent": "JOURN",
            "title": "MAGAZINE PUBLISHING"
        }
    },
    {
        "data": {
            "description": "Intensive reading and discussion designed to introduce literature of mass communication.",
            "id": "HISTORY/JOURN 808",
            "title": "MASS COMMUNICATION HISTORY"
        }
    },
    {
        "data": {
            "description": "Intensive readings focusing on the critical studies and/or cultural studies traditions in mass communication theory and research.",
            "id": "JOURN 803",
            "parent": "JOURN",
            "title": "MASS COMMUNICATION AND CULTURE"
        }
    },
    {
        "data": {
            "description": "Interrelationships of news media, political campaigning, and the electorate. Impact of media coverage and persuasive appeals on image and issue voting, political participation and socialization.",
            "id": "JOURN 618",
            "parent": "JOURN",
            "title": "MASS COMMUNICATION AND POLITICAL BEHAVIOR"
        }
    },
    {
        "data": {
            "description": "Introduces key concepts and issues in mass media and global communication studies. Covers broad trends, key topics, and critical debates in media and communication studies under global contexts and standpoints.",
            "id": "JOURN 567",
            "parent": "JOURN",
            "title": "MASS MEDIA AND GLOBAL COMMUNICATION"
        }
    },
    {
        "data": {
            "description": "Introduction to media planning for students interested in careers in advertising, public relations, or other forms of strategic communication.",
            "id": "JOURN 447",
            "parent": "JOURN",
            "title": "STRATEGIC MEDIA PLANNING"
        }
    },
    {
        "data": {
            "description": "Introduction to strategic communication for students interested in advertising, public relations, health communications, and political campaigns.",
            "id": "JOURN 345",
            "parent": "JOURN",
            "title": "PRINCIPLES AND PRACTICE OF STRATEGIC COMMUNICATION"
        }
    },
    {
        "data": {
            "description": "Introduction to the creative aspects of message development for advertising, public relations, and other strategic communications.",
            "id": "JOURN 445",
            "parent": "JOURN",
            "title": "CREATIVE CAMPAIGN MESSAGES"
        }
    },
    {
        "data": {
            "description": "Investigate the ways in which individuals use, create, and respond to media content in the context of increasingly blurred boundaries between \"mass\" and \"interpersonal\" media. We will consider social scientific theories and research on a wide array of topics, including media uses and effects with regard to social connection, learning, judgments, perceptions, stereotypes, violence, consumption, and political participation.",
            "id": "COMARTS 325",
            "parent": "COMARTS",
            "title": "MEDIA AND HUMAN BEHAVIOR"
        }
    },
    {
        "data": {
            "description": "Mentored individual research and study for students completing Honors in the Major.",
            "id": "JOURN 681",
            "parent": "JOURN",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Mentored individual research and study for students completing Honors in the Major.",
            "id": "JOURN 682",
            "parent": "JOURN",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Mentored individual research and study for students completing a senior thesis.",
            "id": "JOURN 691",
            "parent": "JOURN",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Mentored individual research and study for students completing a senior thesis.",
            "id": "JOURN 692",
            "parent": "JOURN",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Process of planning, implementing, and analyzing strategic communication campaigns.",
            "id": "JOURN 449",
            "parent": "JOURN",
            "title": "ACCOUNT PLANNING AND STRATEGY"
        }
    },
    {
        "data": {
            "description": "Provides an an in-depth look into entertainment media, including its effects on individuals, social groups, and society. The focus on entertainment content is across platforms - from \"mass\" to social media. Emphasis will be paid to psychological, individual-level effects.",
            "id": "COMARTS/JOURN/LSC 831",
            "title": "PSYCHOLOGY OF ENTERTAINMENT MEDIA"
        }
    },
    {
        "data": {
            "description": "Provides an introduction to the literature and research on emerging communication technologies (e.g., blogs, social media, massively multiplayer games, mobile devices) and the effects of these technologies on the individual and societal levels. Illuminates the psychological, social, political, industrial, and policy implications of the use of emerging communication technologies. Become equipped with a basic social and scientific understanding of the interplay between technology, individuals, and society, and recurring issues concerning the adoption and usage of new communication technologies. Emphasizes empirical approaches to understanding these relationships, delving into contexts such as journalism, strategic communication, and the place of digital media in politics and society.",
            "id": "JOURN 622",
            "parent": "JOURN",
            "title": "THE IMPACT OF EMERGING MEDIA"
        }
    },
    {
        "data": {
            "description": "Provides an overview of digital media from an objective, strategy, and tactical planning perspective within strategic communication media and promotion campaigns.",
            "id": "JOURN 463",
            "parent": "JOURN",
            "title": "DIGITAL MEDIA STRATEGIES"
        }
    },
    {
        "data": {
            "description": "Provides an overview of public relations from an objective, strategy, and tactical planning perspective within strategic communication campaigns. Investigates one core element of a strategic communications campaign and provides an in-depth study into the topic area of public relations.",
            "id": "JOURN 464",
            "parent": "JOURN",
            "title": "PUBLIC RELATIONS STRATEGIES"
        }
    },
    {
        "data": {
            "description": "Provides an overview of social media marketing planning and buying from an objective, strategy, and tactical perspective within strategic communication campaigns. Investigate one core element of a strategic communications campaign, and provides an in-depth study into the topic area of digital media.",
            "id": "JOURN 465",
            "parent": "JOURN",
            "title": "SOCIAL MEDIA MARKETING COMMUNICATIONS"
        }
    },
    {
        "data": {
            "description": "Readings and discussion focussing on global media issues. Topics may include news flow, cultural imperialism, representations, history and political economy, globalization trends, new technologies, mass media and nation building, communication and grassroots politics.",
            "id": "JOURN 822",
            "parent": "JOURN",
            "title": "GLOBAL COMMUNICATION"
        }
    },
    {
        "data": {
            "description": "Relationships between mass communications and society; analysis and evaluation of media performance and of suggestions for change.",
            "id": "JOURN 561",
            "parent": "JOURN",
            "title": "MASS COMMUNICATION AND SOCIETY"
        }
    },
    {
        "data": {
            "description": "Representations of minority groups in U.S. news and entertainment mass media. Historical, social, political, economic, and other factors influencing the mass mediated depictions of minorities.",
            "id": "ASIANAM/JOURN 662",
            "title": "MASS MEDIA AND MINORITIES"
        }
    },
    {
        "data": {
            "description": "Research methodology. Design research, analyze and interpret evidence, and develop a deeper appreciation of research strategies.",
            "id": "JOURN 812",
            "parent": "JOURN",
            "title": "QUALITATIVE COMMUNICATION RESEARCH METHODS"
        }
    },
    {
        "data": {
            "description": "Research presentations by mass communication scholars, and is designed to acquaint graduate students with theoretical and methodological approaches to the study of communication.",
            "id": "JOURN 901",
            "parent": "JOURN",
            "title": "COLLOQUIUM IN MASS COMMUNICATION"
        }
    },
    {
        "data": {
            "description": "Special focus on a specific conceptual issue or topic involving mass communication.",
            "id": "JOURN 176",
            "parent": "JOURN",
            "title": "SPECIAL TOPICS IN MASS COMMUNICATION"
        }
    },
    {
        "data": {
            "description": "Survey of methods for investigating mass communication process and effects.",
            "id": "JOURN 658",
            "parent": "JOURN",
            "title": "COMMUNICATION RESEARCH METHODS"
        }
    },
    {
        "data": {
            "description": "Surveys major computational approaches and analytical tools that are promising in advancing communication research and practices in the modern digital information environment.",
            "id": "JOURN 818",
            "parent": "JOURN",
            "title": "COMPUTATIONAL APPROACHES TO COMMUNICATION RESEARCH"
        }
    },
    {
        "data": {
            "description": "Techniques of investigative and long-form enterprise reporting. Includes extensive reporting in the field and a final project.",
            "id": "JOURN 420",
            "parent": "JOURN",
            "title": "INVESTIGATIVE REPORTING"
        }
    },
    {
        "data": {
            "description": "The role of the mass media of communication in the formation of public opinion. Propaganda goals of government, political, economic, and social groups.",
            "id": "JOURN 566",
            "parent": "JOURN",
            "title": "COMMUNICATION AND PUBLIC OPINION"
        }
    },
    {
        "data": {
            "description": "Theory and practice of survey research; questionnaire design, sampling, data visualization, statistical analysis.",
            "id": "JOURN/POLISCI/URBRPL 373",
            "title": "INTRODUCTION TO SURVEY RESEARCH"
        }
    },
    {
        "data": {
            "description": "This course examines the role of communication in American politics. Topics covered include the communication of politics (e.g., communication by politics elites, effects of mass media and interpersonal communication on political attitudes) as well as the politics of communications (regulation of political communication, policy issues, etc.).",
            "id": "JOURN/POLISCI 829",
            "title": "POLITICAL COMMUNICATION"
        }
    },
    {
        "data": {
            "description": "Tools and platforms with which to produce professional content for publication. Examples for course topics will include social media, multimedia and other new technologies that professional communicators must master.",
            "id": "JOURN 455",
            "parent": "JOURN",
            "title": "EMERGING MEDIA AND THE NEWS"
        }
    },
    {
        "data": {
            "description": "Tracks the evolution of mass media coverage of science and the environment. Emphasis on how journalists utilize evidence, the influence of scientific and journalistic norms on stories, and the effects of mass media on science and environment messages to the public.",
            "id": "ENVIRST/JOURN/LSC 823",
            "title": "SCIENCE AND ENVIRONMENT COMMUNICATION"
        }
    },
    {
        "data": {
            "description": "Use and effects of mass communication for individuals and societies. Examines who is affected, what effects occur and how much, what different media content is involved and what situations make effects more or less likely.",
            "id": "JOURN 565",
            "parent": "JOURN",
            "title": "EFFECTS OF MASS COMMUNICATION"
        }
    },
    {
        "data": {
            "description": "Video journalism is widespread, thanks to online news and sources such as YouTube. Create news stories using the techniques of videography, digital editing, writing and producing. Video journalism is unique in its language, requiring engaging material, a fast start, sharp focus, short narrative and natural voices. Focus on capturing stories with strong visuals and ambient sound of the people affected by issues and events.",
            "id": "JOURN 425",
            "parent": "JOURN",
            "title": "VIDEO JOURNALISM"
        }
    },
    {
        "data": {
            "description": "Visual communication and graphic design in multimedia contexts. Build design and production techniques to relay creative messages through print and digital media. Content explores design theory and techniques, as well as the effects and ethics of visual media messages.",
            "id": "JOURN 411",
            "parent": "JOURN",
            "title": "MULTIMEDIA DESIGN"
        }
    },
    {
        "data": {
            "id": "COMARTS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "JOURN",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "COMARTS 325",
            "target": "COMARTS/HDFS/JOURN 616"
        }
    },
    {
        "data": {
            "source": "JOURN 150",
            "target": "JOURN 350"
        }
    },
    {
        "data": {
            "source": "JOURN 150",
            "target": "JOURN 450"
        }
    },
    {
        "data": {
            "source": "JOURN 150",
            "target": "JOURN 651"
        }
    },
    {
        "data": {
            "source": "JOURN 201",
            "target": "JOURN 202"
        }
    },
    {
        "data": {
            "source": "JOURN 201",
            "target": "JOURN 651"
        }
    },
    {
        "data": {
            "source": "JOURN 202",
            "target": "COMARTS/HDFS/JOURN 616"
        }
    },
    {
        "data": {
            "source": "JOURN 202",
            "target": "JOURN 203"
        }
    },
    {
        "data": {
            "source": "JOURN 202",
            "target": "JOURN 335"
        }
    },
    {
        "data": {
            "source": "JOURN 202",
            "target": "JOURN 345"
        }
    },
    {
        "data": {
            "source": "JOURN 203",
            "target": "JOURN 202"
        }
    },
    {
        "data": {
            "source": "JOURN 335",
            "target": "JOURN 401"
        }
    },
    {
        "data": {
            "source": "JOURN 335",
            "target": "JOURN 405"
        }
    },
    {
        "data": {
            "source": "JOURN 335",
            "target": "JOURN 411"
        }
    },
    {
        "data": {
            "source": "JOURN 335",
            "target": "JOURN 415"
        }
    },
    {
        "data": {
            "source": "JOURN 335",
            "target": "JOURN 417"
        }
    },
    {
        "data": {
            "source": "JOURN 335",
            "target": "JOURN 420"
        }
    },
    {
        "data": {
            "source": "JOURN 335",
            "target": "JOURN 425"
        }
    },
    {
        "data": {
            "source": "JOURN 335",
            "target": "JOURN 426"
        }
    },
    {
        "data": {
            "source": "JOURN 335",
            "target": "JOURN 455"
        }
    },
    {
        "data": {
            "source": "JOURN 335",
            "target": "JOURN 456"
        }
    },
    {
        "data": {
            "source": "JOURN 335",
            "target": "JOURN 457"
        }
    },
    {
        "data": {
            "source": "JOURN 335",
            "target": "JOURN 475"
        }
    },
    {
        "data": {
            "source": "JOURN 345",
            "target": "JOURN 411"
        }
    },
    {
        "data": {
            "source": "JOURN 345",
            "target": "JOURN 417"
        }
    },
    {
        "data": {
            "source": "JOURN 345",
            "target": "JOURN 445"
        }
    },
    {
        "data": {
            "source": "JOURN 345",
            "target": "JOURN 447"
        }
    },
    {
        "data": {
            "source": "JOURN 345",
            "target": "JOURN 449"
        }
    },
    {
        "data": {
            "source": "JOURN 345",
            "target": "JOURN 455"
        }
    },
    {
        "data": {
            "source": "JOURN 345",
            "target": "JOURN 456"
        }
    },
    {
        "data": {
            "source": "JOURN 345",
            "target": "JOURN 457"
        }
    },
    {
        "data": {
            "source": "JOURN 345",
            "target": "JOURN 463"
        }
    },
    {
        "data": {
            "source": "JOURN 345",
            "target": "JOURN 464"
        }
    },
    {
        "data": {
            "source": "JOURN 345",
            "target": "JOURN 465"
        }
    },
    {
        "data": {
            "source": "JOURN 345",
            "target": "JOURN 475"
        }
    }
]