[
    {
        "data": {
            "description": "Fitness assessment and exercise prescription principles are applied to the health-related fitness components through discussion and lab activities.",
            "id": "KINES 427",
            "parent": "KINES",
            "title": "FITNESS TESTING AND EXERCISE PRESCRIPTION"
        }
    },
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics and selected topics in Animal Physiology.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Introduces students to the field of kinesiology and the Department of Kinesiology at the University of Wisconsin-Madison. Introductory material about physical activity and health will be provided, and career opportunities in kinesiology will be discussed.",
            "id": "KINES 119",
            "parent": "KINES",
            "title": "INTRODUCTION TO KINESIOLOGY"
        }
    },
    {
        "data": {
            "source": "KINES 622",
            "target": "KINES 623"
        }
    },
    {
        "data": {
            "description": "Student teaching placement in elementary school setting.",
            "id": "CURRIC/KINES 478",
            "title": "ELEMENTARY SCHOOL PHYSICAL EDUCATION STUDENT TEACHING"
        }
    },
    {
        "data": {
            "description": "Entry-level course provides a systematic introduction to the mammalian nervous system, with emphasis on the structure and function of the human brain. Topics include the function of nerve cells, sensory systems, control of movement, learning and memory, and diseases of the nervous system. The foundational knowledge covered in this course serves students interested in health sciences majors, as well as non-science students interested in neuroscience and its relation to human health, wellness, and disease.",
            "id": "KINES 200",
            "parent": "KINES",
            "title": "INTRODUCTORY NEUROSCIENCE"
        }
    },
    {
        "data": {
            "description": "Emphasis on the psychological foundations of exercise with motivational techniques, perception of effort, personality dynamics, and mental health serving as the focal points.",
            "id": "KINES 350",
            "parent": "KINES",
            "title": "INTRODUCTION TO EXERCISE PSYCHOLOGY"
        }
    },
    {
        "data": {
            "source": "KINES 656",
            "target": "KINES 674"
        }
    },
    {
        "data": {
            "source": "KINES 330",
            "target": "KINES 560"
        }
    },
    {
        "data": {
            "description": "Examination of the metabolic and biochemical responses to acute and chronic exercise and environmental stress. Emphasis placed on the mechanisms underlying these responses.",
            "id": "KINES 774",
            "parent": "KINES",
            "title": "METABOLIC RESPONSES TO EXERCISE AND ENVIRONMENTAL STRESS"
        }
    },
    {
        "data": {
            "description": "Designed to introduce the student to major concepts and terminology in the field of human motor development. The content includes a description of how movement changes across the lifespan and the factors that influence and/or correlate with the changes. The Mountain of Motor Development model will help organize understanding of human motor development.",
            "id": "KINES 360",
            "parent": "KINES",
            "title": "LIFESPAN MOTOR DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "An introduction to the philosophy of physical activity/education, history of physical activity/education and sport, and sociology of sport.",
            "id": "KINES 355",
            "parent": "KINES",
            "title": "SOCIO-CULTURAL ASPECTS OF PHYSICAL ACTIVITY"
        }
    },
    {
        "data": {
            "description": "Biomechanics of human movement and skill with emphasis on kinematics and kinetics.",
            "id": "KINES 618",
            "parent": "KINES",
            "title": "BIOMECHANICS"
        }
    },
    {
        "data": {
            "description": "Explores the principles of health informatics and quality improvement for applications in contemporary athletic training practice. Content includes ethical use of data, technology, healthcare information management, fundamentals of quality improvement, measuring improvement, cost and value models, and the history of quality improvement in healthcare.",
            "id": "KINES 673",
            "parent": "KINES",
            "title": "HEALTHCARE INFORMATICS AND QUALITY IMPROVEMENT IN ATHLETIC TRAINING"
        }
    },
    {
        "data": {
            "description": "Humans are capable of achieving astonishing performances in athletics, in work and in other extraordinary situations. These extraordinary performances often provide important insights into physiological processes and their limits. This course integrates information from biology, chemistry, psychology, mechanics, etc., to understand the factors that determine and limit human performance from the molecular level all the way up to whole body movement. The emphasis in the class is on using case studies to investigate physiological processes underlying movement, exercise, and performance.",
            "id": "KINES 115",
            "parent": "KINES",
            "title": "PHYSIOLOGY OF HUMAN PERFORMANCE"
        }
    },
    {
        "data": {
            "description": "Addresses foundational concepts and skills required for contemporary athletic training practice including: an introduction to evidence-based practice, disablement models and patient reported outcomes, team approach to healthcare, legal and ethical considerations, primacy of the patient, effective communication, concepts of professionalism and cultural competence.",
            "id": "KINES 650",
            "parent": "KINES",
            "title": "FOUNDATIONS OF PROFESSIONAL PRACTICE IN ATHLETIC TRAINING"
        }
    },
    {
        "data": {
            "description": "Address methods of instruction in movement concepts, locomotor and nonlocomotor skills, games, and educational dance and gymnastics. Explores curriculum models such as Developmental Movement, Skills-Theme, and Teaching Personal and Social Responsibility (TPSR).  Gain practice in planning, teaching, and assessing teaching skills. Develop teaching competencies (planning, teaching, and assessing) through teaching in a variety of settings.  Apply concepts and skills addressed in previous classes.",
            "id": "KINES 372",
            "parent": "KINES",
            "title": "METHODS AND PRACTICUM OF TEACHING PK-5 PHYSICAL EDUCATION"
        }
    },
    {
        "data": {
            "source": "KINES 623",
            "target": "KINES 657"
        }
    },
    {
        "data": {
            "description": "Provides future athletic training professionals a foundation in advanced athletic training techniques. Sample topics include: injury prevention, emergency care, orthopedic appliance applications, protective equipment, environmental considerations, and computer applications.",
            "id": "KINES 301",
            "parent": "KINES",
            "title": "ADVANCED TECHNIQUES IN ATHLETIC TRAINING"
        }
    },
    {
        "data": {
            "description": "Explore the physiological, biochemical, and molecular mechanisms of the body's response to both acute and chronic exercise. Examine the body's physiological responses to environmental stressors such as heat, cold, and hypoxia. Gain an in-depth understanding of advanced exercise physiology concepts through the analysis of research publications.",
            "id": "KINES 614",
            "parent": "KINES",
            "title": "BIOLOGICAL FACTORS INFLUENCING EXERCISE PERFORMANCE"
        }
    },
    {
        "data": {
            "description": "Clinical field experience that provides practical and skills-oriented instruction under the supervision of a skilled clinical preceptor as a precursor to clinical immersion placement. Provides exposure to a large volume and variety of clinical experiences in authentic clinical settings. Increased patient encounters concurrent with skill acquisition.",
            "id": "KINES 623",
            "parent": "KINES",
            "title": "CLINICAL FIELD EXPERIENCE IN ATHLETIC TRAINING II"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ANAT&PHY 335"
        }
    },
    {
        "data": {
            "description": "Exercise and performance examined from the standpoint of motivation, personality dynamics, psychophysics, mental health, social psychology, and behavioral medicine.",
            "id": "KINES 600",
            "parent": "KINES",
            "title": "ADVANCED EXERCISE PSYCHOLOGY"
        }
    },
    {
        "data": {
            "source": "KINES 620",
            "target": "KINES 621"
        }
    },
    {
        "data": {
            "description": "Provides extensive patient encounters and advanced skills-oriented instruction under the supervision of a skilled clinical preceptor, working towards independent athletic training practice.  Final immersive clinical experience will provide exposure to a large volume and variety of patient encounters in authentic clinical settings. Provides extensive opportunities for supervised autonomy moving to independent clinical decision-making.",
            "id": "KINES 625",
            "parent": "KINES",
            "title": "ATHLETIC TRAINING PRECEPTORSHIP II"
        }
    },
    {
        "data": {
            "source": "KINES 547",
            "target": "KINES 568"
        }
    },
    {
        "data": {
            "description": "Laboratory procedures and skills commonly used in exercise physiology.",
            "id": "KINES 615",
            "parent": "KINES",
            "title": "LABORATORY TECHNIQUES IN EXERCISE PHYSIOLOGY"
        }
    },
    {
        "data": {
            "description": "Designed to explore topics in kinesiology and/or occupational therapy. Topics may change each semester.",
            "id": "KINES 508",
            "parent": "KINES",
            "title": "WORKSHOP IN KINESIOLOGY"
        }
    },
    {
        "data": {
            "description": "A clinical field placement for students in the athletic training professional preparation program. Clinical placements under the direction of an AT Program Clinical Preceptor are offered in a variety of clinical settings including intercollegiate, secondary school, and private clinical settings.",
            "id": "KINES 450",
            "parent": "KINES",
            "title": "CLINICAL FIELD EXPERIENCE IN ATHLETIC TRAINING"
        }
    },
    {
        "data": {
            "description": "Provides opportunities for the physical education student to develop competencies in the teaching skills necessary to provide quality Physical Education to children and youth. Students will receive individualized feedback about their performance from the cooperating teacher and the university supervisor. Provide a forum for students to learn from their peers through discussions, sharing their experiences and knowledge gained from their practicum placement.",
            "id": "KINES 375",
            "parent": "KINES",
            "title": "PRACTICUM IN PHYSICAL EDUCATION"
        }
    },
    {
        "data": {
            "source": "KINES 127",
            "target": "KINES 487"
        }
    },
    {
        "data": {
            "description": "Provides a forum for athletic training students, faculty and staff to present and discuss research and current issues related to the field of athletic training.",
            "id": "KINES 658",
            "parent": "KINES",
            "title": "SEMINAR IN ATHLETIC TRAINING"
        }
    },
    {
        "data": {
            "source": "PSYCH 202",
            "target": "PSYCH 210"
        }
    },
    {
        "data": {
            "description": "Centered on the components (social, emotional, spiritual, environmental, occupational, intellectual, and physical) and skills (influence analysis, interpersonal communication, health-enhancing behaviors, accessing valid information, goal-setting, decision-making and advocacy) of wellness. Gain competence by planning for, learning, and practicing teaching skills in educational settings. Through this approach, highly competent teachers will be developed who can adapt health instruction to a wide variety of audiences and topics.",
            "id": "KINES 547",
            "parent": "KINES",
            "title": "SKILLS FOR HEALTH: METHODS AND PRACTICUM OF TEACHING HEALTH"
        }
    },
    {
        "data": {
            "description": "Provides extensive patient encounters and advanced skills-oriented instruction under the supervision of a skilled clinical preceptor, working towards independent athletic training practice. Immersive experience provides exposure to a large volume and variety of patient encounters in authentic clinical settings. Provides extensive opportunities for supervised autonomy to develop clinical decision-making skills progressing toward independent clinical-decision making.",
            "id": "KINES 624",
            "parent": "KINES",
            "title": "ATHLETIC TRAINING PRECEPTORSHIP I"
        }
    },
    {
        "data": {
            "description": "Introduction to the basic principles and concepts of the biology of plants. an integrative approach stressing evolutionary sequences and the relationship between structure and function at succeeding levels of organization: molecule, cell, organism, population, community. Correlated lectures, laboratories, and discussions.",
            "id": "BIOLOGY/BOTANY 130",
            "title": "GENERAL BOTANY"
        }
    },
    {
        "data": {
            "description": "Descriptive statistics, probability concepts and distributions, random variables. Hypothesis tests and confidence intervals for one- and two-sample problems. Linear regression, model checking, and inference. Analysis of variance and basic ideas in experimental design. Utilizes the R programming language.",
            "id": "STAT 324",
            "parent": "STAT",
            "title": "INTRODUCTORY APPLIED STATISTICS FOR ENGINEERS"
        }
    },
    {
        "data": {
            "description": "Provides students with an overview of the personal, interpersonal and broader social factors that contribute to the health and well-being of individuals and populations in the United States. Examinations of contemporary approaches to health education and health behavior interventions including: Foundations of health education and health behavior programs, health indicators, social and structural determinants of health and health disparities, models of health education/health behavior that support interventions for individuals and communities.",
            "id": "KINES 150",
            "parent": "KINES",
            "title": "FOUNDATIONS OF HEALTH BEHAVIOR AND HEALTH EQUITY"
        }
    },
    {
        "data": {
            "description": "Learn and practice assessment strategies in Adapted Physical Education. Experiences in the gymnasium and pool.",
            "id": "KINES 364",
            "parent": "KINES",
            "title": "ASSESSMENT AND PROGRAMMING IN ADAPTED PHYSICAL EDUCATION"
        }
    },
    {
        "data": {
            "description": "Physiological basis and methods of human exercise testing and training. Topics: clinical exercise physiology, exercise testing protocols, cardiopulmonary monitoring, basic ECG interpretation, exercise prescription.",
            "id": "KINES/NURSING 523",
            "title": "CLINICAL EXERCISE TESTING & TRAINING"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "description": "Seminar topics in field of human biodynamics.",
            "id": "KINES 953",
            "parent": "KINES",
            "title": "HUMAN BIODYNAMICS SEMINAR"
        }
    },
    {
        "data": {
            "source": "ZOOLOGY 153",
            "target": "ANAT&PHY 335"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "ANAT&PHY 335",
            "target": "KINES/NUTRSCI 525"
        }
    },
    {
        "data": {
            "description": "Examines physiological responses and adaptations to exercise and physical activity, with particular focus on the role that both the physical environment (temperature, altitude, etc.) and the cultural environment (cultural history, norms, etc.) play in these exercise responses. Topics include acute responses to exercise in normal environments and then in extreme environmental conditions (heat and cold, high altitude, and space environments). Consider exercise adaptations in athletes. Examine health consequences of low-levels of physical activity and consider the socio-cultural barriers to health promotion activities among the indigenous Maori in New Zealand, and compare them to at risk populations in United States. Requires completion ofANAT&PHY 235or335and a valid passport that does not expire at least 6 months past the travel dates.",
            "id": "KINES 214",
            "parent": "KINES",
            "title": "CULTURE AND ENVIRONMENT IN EXERCISE PHYSIOLOGY ABROAD"
        }
    },
    {
        "data": {
            "source": "KINES 314",
            "target": "KINES 521"
        }
    },
    {
        "data": {
            "description": "Fitness class for developing individualized personal goals. Accommodates persons having temporary or permanent disability. Alternative to dropping from other program classes due to injury or other medical reason.",
            "id": "KINES 125",
            "parent": "KINES",
            "title": "ADAPTED FITNESS AND PERSONAL TRAINING"
        }
    },
    {
        "data": {
            "description": "A basic and up-to-date view of the major processes and mechanisms underlying the performance and learning of motor skills. Principles in motor learning and control are systematically introduced to produce a meaningful conceptual framework.",
            "id": "KINES 361",
            "parent": "KINES",
            "title": "MOTOR LEARNING AND PERFORMANCE"
        }
    },
    {
        "data": {
            "description": "The research process as applied in kinesiology, including hypothesis development, ethical issues, study design, measurement and statistical concepts, and presentation of results. Includes exposure to current research within the Department of Kinesiology.",
            "id": "KINES 330",
            "parent": "KINES",
            "title": "RESEARCH IN KINESIOLOGY"
        }
    },
    {
        "data": {
            "description": "Core concepts in human physiology from cells to organ-systems via online lectures and active learning activities including laboratory experiments. Topics include homeostasis, membrane transport, cellular physiology, regulation of metabolism, and functions of the nervous, endocrine, muscular, reproductive, cardiovascular, respiratory, renal, and gastrointestinal system.",
            "id": "ANAT&PHY 335",
            "parent": "ANAT&PHY",
            "title": "PHYSIOLOGY"
        }
    },
    {
        "data": {
            "description": "Focused and rooted on the application of biological, cultural, social, and research-based practices for professional development in promoting physical activity for everyone, especially those with a variety of disabling conditions.  Work as individuals or teams to plan and implement specified physical activities for individuals with diverse abilities in a variety of settings, including the adapted fitness gym, recreational and competitive endeavors and the home-based exercise.",
            "id": "KINES 225",
            "parent": "KINES",
            "title": "INTRODUCTION TO PHYSICAL ACTIVITY PROGRAMMING FOR DIVERSE ABILITIES"
        }
    },
    {
        "data": {
            "description": "Addresses the intersection of athletic training and public health by exploring population-based approaches to injury prevention and challenges students to explore how population-level problems impact individual health. Introduces and explores specific policies (e.g. concussion, athletic pre-participation, catastrophic injury) that impact the provision of effective patient-centered care and introduces skills required for management of these conditions.",
            "id": "KINES 651",
            "parent": "KINES",
            "title": "PUBLIC HEALTH, POLICY, AND PRACTICE"
        }
    },
    {
        "data": {
            "description": "Multidisciplinary seminar on human muscle function in health and disease. The course is geared toward advanced undergraduate and graduate students in kinesiology, physical and occupational therapy, motor control and behavior, neurophysiology resident in neurology and other related allied health professionals.",
            "id": "KINES 779",
            "parent": "KINES",
            "title": "HUMAN MUSCLE FUNCTION IN HEALTH AND DISEASE"
        }
    },
    {
        "data": {
            "source": "ANAT&PHY 337",
            "target": "KINES 316"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "ANAT&PHY 335"
        }
    },
    {
        "data": {
            "id": "PSYCH",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Will promote physical activity at a level to achieve health benefits, particularly in students who currently are insufficiently active (less than 150 minutes each week of moderate intensity physical activity). Students will apply course materials (e.g., behavior change strategies) to their own lives by completing self-analysis of their physical activity levels and then developing a physical activity plan to increase current physical activity levels, as well as a plan to maintain the activity after the course has ended.",
            "id": "KINES 145",
            "parent": "KINES",
            "title": "CHOOSING TO MOVE: CONSTRUCTING AN ACTIVE LIFESTYLE"
        }
    },
    {
        "data": {
            "description": "Pharmacological and toxicological actions and therapeutic use of medications commonly encountered in the practice of athletic training. Includes categories of drugs, use, effects and precautions for common drugs and drug-interactions.  Implications for physical activity and legal issues are examined.",
            "id": "KINES 672",
            "parent": "KINES",
            "title": "PRINCIPLES OF PHARMACOLOGY FOR ATHLETIC TRAINERS"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "KINES 308"
        }
    },
    {
        "data": {
            "source": "ANAT&PHY 337",
            "target": "ANAT&PHY 338"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "ANAT&PHY 435"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Current research developments in physical activity epidemiology.",
            "id": "KINES/POPHLTH 955",
            "title": "SEMINAR - PHYSICAL ACTIVITY EPIDEMIOLOGY"
        }
    },
    {
        "data": {
            "description": "Provides comprehensive understanding of behavior management strategies for working with diverse populations in schools, including individuals with disabilities. Explore various topics such as preventative strategies, applied behavior analysis principles, behavior management strategies, developing positive behavioral interventions and support (PBIS), and specific approaches for different conditions, including emotional behavioral disabilities, ADHD, autism, and students in crisis. Learn how to assess behaviors and develop effective behavior intervention plans. Incorporates real-life case studies and presentations to enhance practical application.",
            "id": "KINES 363",
            "parent": "KINES",
            "title": "MANAGEMENT STRATEGIES IN ADAPTED PHYSICAL EDUCATION"
        }
    },
    {
        "data": {
            "description": "An understanding of foundations, assessment and pedagogy for individuals with disabilities in a variety of physical activity settings. Emphasis on individual differences, life-span, and self-actualization.",
            "id": "KINES 316",
            "parent": "KINES",
            "title": "ADAPTED PHYSICAL ACTIVITY"
        }
    },
    {
        "data": {
            "source": "KINES 624",
            "target": "KINES 625"
        }
    },
    {
        "data": {
            "description": "Explores concepts related to promoting and implementing specialized programs focused on addressing health and performance in patients. Topics include strength and conditioning, nutrition, and wellness.",
            "id": "KINES 670",
            "parent": "KINES",
            "title": "ENHANCING PERFORMANCE AND WELLNESS"
        }
    },
    {
        "data": {
            "description": "Theories and experimental findings in motor control, acquisition and retention of motor behavior. Topics: attention, models of motor control, kinesthesis, learning, information processing, memory, transfer, feedback, age and gender differences.",
            "id": "KINES 861",
            "parent": "KINES",
            "title": "PRINCIPLES OF MOTOR CONTROL AND LEARNING"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "source": "KINES 314",
            "target": "KINES/NURSING 523"
        }
    },
    {
        "data": {
            "description": "Introduce students to several outdoor activities to enable the teaching of these topics.",
            "id": "KINES 327",
            "parent": "KINES",
            "title": "CURRENT TOPICS IN OUTDOOR PURSUITS"
        }
    },
    {
        "data": {
            "source": "ANAT&PHY 435",
            "target": "ANAT&PHY 335"
        }
    },
    {
        "data": {
            "description": "Introduction to modern statistical practice in the life sciences, using the R programming language. Topics include: exploratory data analysis, probability and random variables; one-sample testing and confidence intervals, role of assumptions, sample size determination, two-sample inference; basic ideas in experimental design, analysis of variance, linear regression, goodness-of fit; biological applications.",
            "id": "STAT 371",
            "parent": "STAT",
            "title": "INTRODUCTORY APPLIED STATISTICS FOR THE LIFE SCIENCES"
        }
    },
    {
        "data": {
            "id": "KINES",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Practice in planning and teaching sport concepts and skills. Builds on the planning for learning and instruction foundation. Centered on the Tactical Games, Sport Education, Fitness Education, and Personalized Instruction models and focuses on students developing teaching competencies rather than learning specialized sports skills. Adapt instruction within tactically similar sports.",
            "id": "KINES 373",
            "parent": "KINES",
            "title": "METHODS AND PRACTICUM OF TEACHING 6-12 PHYSICAL EDUCATION"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ZOOLOGY 153"
        }
    },
    {
        "data": {
            "description": "Designed to provide students with creative technology strategies in the fields of school wellness education, physical activity, and fitness management. Students will build skills for using widely available technology resources to enhance instruction, assessment, motivation, communication, and advocacy in health and fitness settings. Skill-specific units present experiential assignments that increase learner confidence. Each unit produces print or digital materials for practical professional use with an emphasis on innovation.",
            "id": "KINES 312",
            "parent": "KINES",
            "title": "TECHNOLOGY FOR PHYSICAL ACTIVITY AND HEALTH PROFESSIONALS"
        }
    },
    {
        "data": {
            "description": "Lectures and demonstrations on the principles of resistance training and associated physiological effects designed for practitioners who wish to gain a detailed understanding of the science of resistance training.",
            "id": "KINES 140",
            "parent": "KINES",
            "title": "SCIENCE AND PRACTICE OF RESISTANCE TRAINING"
        }
    },
    {
        "data": {
            "description": "Measures of central tendency, variability; probability, sampling distributions; hypothesis testing, confidence intervals; t-tests; Chi-square; regression and correlation (linear) and introduction to analysis of variance (1-way).",
            "id": "PSYCH 210",
            "parent": "PSYCH",
            "title": "BASIC STATISTICS FOR PSYCHOLOGY"
        }
    },
    {
        "data": {
            "description": "Define exercise and physical activity behaviors and how to systematically measure them. Content will encompass the American College of Sports Medicine definition of physical activity and recommendations for exercise across different populations. Students will engage in a service learning opportunity with our adapted fitness program where they will practice measuring and addressing the difficulties in broadly defining physical activity.",
            "id": "KINES 112",
            "parent": "KINES",
            "title": "MAKE IT COUNT: MEASURING PHYSICAL ACTIVITY BEHAVIOR"
        }
    },
    {
        "data": {
            "description": "Provides the opportunity for the student teacher to put theory into practice under the guidance of a licensed teacher and a university supervisor, allowing the gradual induction into the role of a professional teacher. Feedback and assessment are given in terms of growth in the understandings and abilities needed to assume the responsibilities of a beginning teacher. Emphasis is placed on helping the student teacher become a reflective professional. Cooperation among the classroom teacher, university supervisor, and administrators is encouraged.",
            "id": "KINES 568",
            "parent": "KINES",
            "title": "STUDENT TEACHING IN HEALTH EDUCATION"
        }
    },
    {
        "data": {
            "source": "KINES 372",
            "target": "KINES 375"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "ANAT&PHY 435"
        }
    },
    {
        "data": {
            "description": "How the central nervous system organizes skilled human performance. Evolution of neuromuscular mechanisms, subserving skills, and the causes and limitations of movement at high speeds and high levels of force.",
            "id": "KINES 721",
            "parent": "KINES",
            "title": "NEURAL BASIS FOR MOVEMENT"
        }
    },
    {
        "data": {
            "source": "ANAT&PHY 335",
            "target": "KINES 427"
        }
    },
    {
        "data": {
            "source": "KINES 318",
            "target": "KINES 618"
        }
    },
    {
        "data": {
            "description": "Designed to provide students with a foundational knowledge in musculoskeletal anatomy and anatomical considerations related to human movement and physical activity.",
            "id": "KINES 227",
            "parent": "KINES",
            "title": "INTRODUCTION TO CLINICAL ANATOMY OF HUMAN MOVEMENT"
        }
    },
    {
        "data": {
            "description": "Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Part of a 2-semester sequence withMATH 217; these two courses together are equivalent toMATH 114and221.",
            "id": "MATH 171",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY I"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "source": "KINES 623",
            "target": "KINES 624"
        }
    },
    {
        "data": {
            "source": "KINES 314",
            "target": "KINES 614"
        }
    },
    {
        "data": {
            "description": "Explores aspects and perspectives of diversity and culture, the concepts and importance of culturally responsive teaching, health education, and the Act 31 requirement for teacher education students. Perform a cultural self-mapping to become knowledgeable of how cultural background influences personal attitudes and actions, and attend a cross-cultural event to experience life in \"another person's shoes.\" Engage in a multicultural field experience.",
            "id": "KINES 353",
            "parent": "KINES",
            "title": "HEALTH AND PHYSICAL EDUCATION IN A MULTICULTURAL SOCIETY"
        }
    },
    {
        "data": {
            "description": "Provide students with opportunities and experiences to learn and participate in the development of groups. Provide students with strategies and experiences in the management of behaviors and techniques to maintain a safe and productive teaching environment.",
            "id": "KINES 325",
            "parent": "KINES",
            "title": "GROUP DEVELOPMENT AND BEHAVIOR MANAGEMENT"
        }
    },
    {
        "data": {
            "source": "MATH 213",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "description": "Analysis of human action through the application of mechanical principles.",
            "id": "KINES 318",
            "parent": "KINES",
            "title": "BIOMECHANICS OF HUMAN MOVEMENT"
        }
    },
    {
        "data": {
            "description": "Directed study projects for graduate students as arranged with kinesiology faculty member.",
            "id": "KINES 999",
            "parent": "KINES",
            "title": "INDEPENDENT READING"
        }
    },
    {
        "data": {
            "source": "KINES 225",
            "target": "KINES 516"
        }
    },
    {
        "data": {
            "source": "ANAT&PHY 337",
            "target": "KINES 318"
        }
    },
    {
        "data": {
            "description": "Provides Athletic Trainers with the knowledge, physical exam skills, and therapeutic interventions to diagnose and address common injuries and conditions. Scientific rationale for appropriate exercise design, implementation, and progression of care are emphasized.",
            "id": "KINES 653",
            "parent": "KINES",
            "title": "EVALUATION AND THERAPEUTIC INTERVENTIONS II"
        }
    },
    {
        "data": {
            "description": "An applied clinical approach to basic skills commonly used in the field of athletic training. Designed for students interested in athletic training, and an appropriate elective for those who plan to teach or coach.",
            "id": "KINES 197",
            "parent": "KINES",
            "title": "TECHNIQUES IN ATHLETIC TRAINING"
        }
    },
    {
        "data": {
            "description": "Present/discuss the scientific basis and current practices of strength and conditioning for athletic performance. Training program design and training methods, for performance enhancement, related to the areas of strength, power, speed, and endurance.",
            "id": "KINES 527",
            "parent": "KINES",
            "title": "PRINCIPLES OF STRENGTH AND CONDITIONING"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ANAT&PHY 435"
        }
    },
    {
        "data": {
            "source": "KINES 314",
            "target": "KINES 615"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 101"
        }
    },
    {
        "data": {
            "description": "The presentation of materials and depth study of the organization and administration of a sound program of physical education, the knowledge of which is mandatory for all physical education teachers.",
            "id": "KINES 412",
            "parent": "KINES",
            "title": "ORGANIZATION AND ADMINISTRATION OF PHYSICAL EDUCATION"
        }
    },
    {
        "data": {
            "source": "KINES 652",
            "target": "KINES 653"
        }
    },
    {
        "data": {
            "description": "Develop knowledge of diverse populations and the ability to promote physical activity and well-being for a lifetime. Apply knowledge of barriers and the use of inclusive techniques to develop meaningful experiences and programs.",
            "id": "KINES 516",
            "parent": "KINES",
            "title": "PHYSICAL ACTIVITY FOR DIVERSE ABILITIES"
        }
    },
    {
        "data": {
            "description": "Basic principles of scientific inquiry and their application to the study of physical activity.",
            "id": "KINES 991",
            "parent": "KINES",
            "title": "RESEARCH IN PHYSICAL ACTIVITY- THEORY AND DESIGN"
        }
    },
    {
        "data": {
            "description": "Independent research and writing for graduate students under the supervision of kinesiology faculty member.",
            "id": "KINES 990",
            "parent": "KINES",
            "title": "RESEARCH OR THESIS"
        }
    },
    {
        "data": {
            "source": "KINES 527",
            "target": "KINES 528"
        }
    },
    {
        "data": {
            "description": "Provides both scientific knowledge and application of nutrition related to exercise, health, and sports.",
            "id": "KINES/NUTRSCI 525",
            "title": "NUTRITION IN PHYSICAL ACTIVITY AND HEALTH"
        }
    },
    {
        "data": {
            "description": "Examines acute and chronic medical problems encountered by athletic trainers. Includes examination and clinical skills, interventions, and requirements for referral as part of collaborative care. Emphasis on drug testing, illicit drug use, mental and behavioral health, sexual health, dermatology, wound care and closure, diabetes, and infectious disease.",
            "id": "KINES 655",
            "parent": "KINES",
            "title": "CLINICAL MEDICINE IN ATHLETIC TRAINING II"
        }
    },
    {
        "data": {
            "source": "STAT 371",
            "target": "STAT 324"
        }
    },
    {
        "data": {
            "source": "ZOOLOGY 153",
            "target": "ANAT&PHY 435"
        }
    },
    {
        "data": {
            "description": "Addresses the role of evidence in supporting Athletic Training practice. Presents the concepts, methods, and strategies related to evidence-based practice and the development of critical reading and scientific writing skills.",
            "id": "KINES 656",
            "parent": "KINES",
            "title": "SCIENTIFIC INQUIRY IN ATHLETIC TRAINING"
        }
    },
    {
        "data": {
            "description": "In-depth look at how technology is changing the way we assess physical activity, help people return from injury, and increase physical performance. Topics include field-based testing, athlete monitoring, and movement screenings. Exposure to the most popular technologies in the field of human performance. Upper level elective in Kinesiology that builds on concepts acquired in the Kinesiology core curriculum. Offers real-world application of these concepts to students.",
            "id": "KINES 555",
            "parent": "KINES",
            "title": "SPORTS SCIENCE & ATHLETE MONITORING"
        }
    },
    {
        "data": {
            "id": "ZOOLOGY",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "KINES 370",
            "target": "KINES 566"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "KINES 370",
            "target": "KINES 371"
        }
    },
    {
        "data": {
            "description": "Discussion of contemporary issues in Athletic Healthcare including acute and chronic medical issues that may affect athletic performance.",
            "id": "KINES 487",
            "parent": "KINES",
            "title": "ATHLETIC HEALTHCARE: CONTEMPORARY PERSPECTIVES"
        }
    },
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics, and selected topics in Animal Physiology. Designed for engineering majors that do not need a lab component.",
            "id": "ZOOLOGY 153",
            "parent": "ZOOLOGY",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "source": "ANAT&PHY 335",
            "target": "KINES 314"
        }
    },
    {
        "data": {
            "description": "Examination of the effects of acute and chronic exercise and exposure to hypo- and hyperbaric environments on physiological responses; mechanisms underlying these responses.",
            "id": "KINES 773",
            "parent": "KINES",
            "title": "CARDIORESPIRATORY ADAPTIONS TO ENVIRONMENT AND EXERCISE"
        }
    },
    {
        "data": {
            "description": "Attainment and maintenance of a high degree of personal efficiency in swimming strokes and proficiency in fundamental aquatic skills, and an understanding of the fundamental physiological, mechanical and kinesiological principles as they relate to aquatic performance.",
            "id": "KINES 104",
            "parent": "KINES",
            "title": "AQUATICS"
        }
    },
    {
        "data": {
            "source": "STAT 371",
            "target": "KINES 330"
        }
    },
    {
        "data": {
            "description": "Provides future athletic training professionals with knowledge and skills to respond to emergency situations common to the athletic training environment. Emphasis on hands-on applications and interprofessional relationships with other emergency care providers and agencies.",
            "id": "KINES 571",
            "parent": "KINES",
            "title": "EMERGENCY PROCEDURES FOR ATHLETIC TRAINERS"
        }
    },
    {
        "data": {
            "description": "Provides a clinical field experience allowing for practical and skills-oriented instruction under the supervision of a skilled clinical preceptor.  Exposure to a large volume and variety of athletic training clinical experiences to facilitate learning in authentic clinical settings. Increased patient interactions concurrent with skill acquisition and Athletic Training program progression.",
            "id": "KINES 622",
            "parent": "KINES",
            "title": "CLINICAL FIELD EXPERIENCE IN ATHLETIC TRAINING I"
        }
    },
    {
        "data": {
            "description": "Examines acute and chronic medical problems encountered by athletic trainers. Includes examination and clinical skills, interventions, and requirements for referral as part of collaborative care. Emphasis on cardiopulmonary, respiratory, gastrointestinal, genitourinary, gynecological, neurological, and systemic issues.",
            "id": "KINES 654",
            "parent": "KINES",
            "title": "CLINICAL MEDICINE IN ATHLETIC TRAINING I"
        }
    },
    {
        "data": {
            "description": "Provides an overview of the behavioral, social and cultural factors related to individual and population health and health disparities. Social and behavioral science theories and strategies in health promotion/education will be discussed in relation to preventing disease and promoting health. Provides current knowledge and analysis of issues influencing people's health and well-being from a social and behavioral science perspective. Theoretical frameworks that draw on major health behavior theories provide a better understanding of how individuals, families, peers, schools, neighborhoods, and the larger community influence risk and protective factors. Ethical considerations intrinsic to social and behavioral science efforts designed to produce health-related behavior change will be discussed. Promotes intellectual and collaborative learning through course lectures, readings, class discussions, and individual and group work.",
            "id": "KINES 501",
            "parent": "KINES",
            "title": "THEORY-BASED HEALTH EDUCATION AND HEALTH PROMOTION PROGRAMS"
        }
    },
    {
        "data": {
            "description": "Methods of instruction in movement concepts, educational dance and gymnastics. Students will gain practice in planning, teaching, and assessing participants. Students will also observe, practice, and assess the facilitation skills of health and physical activity professionals. In addition, students will apply the concepts presented inKINES 370.",
            "id": "KINES 371",
            "parent": "KINES",
            "title": "METHODS AND PRACTICUM OF TEACHING PK-12 DANCE AND GYMNASTICS"
        }
    },
    {
        "data": {
            "source": "KINES 654",
            "target": "KINES 655"
        }
    },
    {
        "data": {
            "description": "Guidelines and assessment methods for fitness and nutrition. Motivation, adherence and stress-reduction techniques discussed. Lecture-demonstration concerning effects of exercise and nutrition on health and well-being.",
            "id": "KINES 100",
            "parent": "KINES",
            "title": "EXERCISE, NUTRITION, AND HEALTH"
        }
    },
    {
        "data": {
            "description": "Introduces foundational skills used by athletic training professionals in the evaluation and prevention of injuries and conditions common to active populations.",
            "id": "KINES 572",
            "parent": "KINES",
            "title": "FOUNDATIONAL SKILLS IN ATHLETIC TRAINING"
        }
    },
    {
        "data": {
            "source": "KINES 362",
            "target": "KINES 364"
        }
    },
    {
        "data": {
            "description": "Behavior, including its development, motivation, frustrations, emotion, intelligence, learning, forgetting, personality, language, thinking, and social behavior.",
            "id": "PSYCH 202",
            "parent": "PSYCH",
            "title": "INTRODUCTION TO PSYCHOLOGY"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Examines sedentary behavior, physical activity, physical inactivity, and associations with health outcomes in the United States and across the world. Topics include the determinants and consequences of sedentary behavior in children, adults, and special populations. Research examining psychological outcomes of sedentary behavior and barriers to adopting a physically active lifestyle is covered. Emphasis placed on Portuguese socio-cultural context, economic systems, and healthcare structures contributing to health outcomes. Compares the U.S. and European health models and physical activity guidelines. Design a sedentary behavior intervention informed by theories of behavior change.",
            "id": "KINES 250",
            "parent": "KINES",
            "title": "SEDENTARY BEHAVIOR IN THE U.S. AND ABROAD"
        }
    },
    {
        "data": {
            "description": "Develop skills in reading, reporting, and evaluating research in Kinesiology. Discuss and critically analyze peer-reviewed research articles in Kinesiology. Apply knowledge of scientific writing by preparing a scholarly research project such as a scientific literature review, systematic review, senior research thesis, original manuscript, or clinical case report.",
            "id": "KINES 560",
            "parent": "KINES",
            "title": "SENIOR RESEARCH WRITING IN KINESIOLOGY"
        }
    },
    {
        "data": {
            "source": "STAT 324",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "description": "Student teaching placement in secondary school setting.",
            "id": "CURRIC/KINES 479",
            "title": "MIDDLE SCHOOL OR HIGH SCHOOL PHYSICAL EDUCATION STUDENT TEACHING"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "description": "Provides students with knowledge and skills in advanced clinical assessment techniques used in the evaluation of injuries, illnesses, and conditions found in physically active populations.",
            "id": "KINES 417",
            "parent": "KINES",
            "title": "ADVANCED CLINICAL ASSESSMENT TECHNIQUES IN ATHLETIC TRAINING"
        }
    },
    {
        "data": {
            "description": "Builds a repertoire of instructional skills and strategies such as organizing, planning, implementing and assessing developmentally appropriate learning tasks that are aligned with local, state, and national standards to address the diverse needs of participants.",
            "id": "KINES 370",
            "parent": "KINES",
            "title": "PLANNING, FACILITATING & ASSESSMENT IN MOVEMENT AND HEALTH PROFESSIONALS"
        }
    },
    {
        "data": {
            "description": "Intermediate course on neuronal circuits and neurophysiological mechanisms involved in the control of human motor behavior.  Including discussion of: 1) sensorimotor integration, 2) interactions between spinal, brainstem, and cerebral cortical levels of control, and 3) how motor control knowledge is created and evaluated.",
            "id": "KINES 531",
            "parent": "KINES",
            "title": "NEURAL CONTROL OF MOVEMENT"
        }
    },
    {
        "data": {
            "description": "Consequences of involvement in acute and chronic exercise on selected psychological states such as anxiety, depression, hostility, and self-esteem.",
            "id": "KINES 700",
            "parent": "KINES",
            "title": "PSYCHOLOGICAL EFFECTS OF EXERCISE"
        }
    },
    {
        "data": {
            "id": "STAT",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Develops understanding of the athletic trainer as an evidence-guided clinical scholar. Designed as a companion to an immersive clinical experience that allows examination of the elements of clinical scholarship in the practice of athletic training. Emphasis on understanding how patient-centered care is improved through best practices and the utilization of practice-based research tools.",
            "id": "KINES 674",
            "parent": "KINES",
            "title": "CLINICAL SCHOLARSHIP IN ATHLETIC TRAINING"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Independent undergraduate study in beginning to intermediate area of study under direct guidance of kinesiology faculty.",
            "id": "KINES 399",
            "parent": "KINES",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Uses a regional approach to provide a foundation of knowledge in human anatomy. Units cover an introduction to anatomical systems; back and limbs; thorax, abdomen, and pelvis; and head and neck.",
            "id": "ANAT&PHY 337",
            "parent": "ANAT&PHY",
            "title": "HUMAN ANATOMY"
        }
    },
    {
        "data": {
            "description": "Addresses diagnostic imaging tools used in sports medicine and orthopedics, interpretation of results, and implementation into clinical practice as part of a comprehensive evaluation.",
            "id": "KINES 671",
            "parent": "KINES",
            "title": "DIAGNOSTIC IMAGING IN ATHLETIC TRAINING"
        }
    },
    {
        "data": {
            "source": "KINES 316",
            "target": "KINES 362"
        }
    },
    {
        "data": {
            "source": "KINES 316",
            "target": "KINES 363"
        }
    },
    {
        "data": {
            "source": "PSYCH 210",
            "target": "KINES 330"
        }
    },
    {
        "data": {
            "source": "KINES 314",
            "target": "KINES 300"
        }
    },
    {
        "data": {
            "source": "KINES 652",
            "target": "KINES 671"
        }
    },
    {
        "data": {
            "description": "General biological principles. Topics include: evolution, ecology, animal behavior, cell structure and function, genetics and molecular genetics and the physiology of a variety of organ systems emphasizing function in humans.",
            "id": "BIOLOGY/ZOOLOGY 101",
            "title": "ANIMAL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Provides a comprehensive study of biomechanical foundations and principles underlying physical activity. Topics include musculoskeletal determinants of human movement, analysis of sports skills, feedback, and cueing techniques. Includes descriptions and applications of biomechanical concepts related to skillful movement, physical activity, and fitness.",
            "id": "KINES 308",
            "parent": "KINES",
            "title": "BIOMECHANICS OF PHYSICAL ACTIVITY"
        }
    },
    {
        "data": {
            "description": "Focuses on the application of biological, cultural and social theory and research to lifestyle change. There will be lectures by experts, experiential learning, and the application of course knowledge to student's lives through class assignments and activities. The transition to college requires students to construct a new lifestyle, take on new and greater personal responsibilities while at the same time meet rigorous academic challenges. This transition includes a loss of structured daily schedules, decreased family support for the day to day living, and greater responsibility for their finances and life choices. Students may have difficulty managing their time, exercise less, eat less healthy foods, engage in increased drinking of alcohol, and experience greater stress and depression when adjusting to college life. This life transition provides an opportunity for reexamination and an opportunity to make thoughtful choices about lifestyle.",
            "id": "KINES 123",
            "parent": "KINES",
            "title": "LIVING WELL: LIFESTYLE REDESIGN AND HEALTH PROMOTION FOR COLLEGE STUDENTS"
        }
    },
    {
        "data": {
            "description": "Foundational skills to succeed in both academic and applied settings within the field of kinesiology. Search, analyze, and critique scientific literature on exercise and health while developing critical thinking, research methodologies, and evidence-based decision-making. Refine oral and written communication and create professional materials including CV and cover letter for career development.",
            "id": "KINES 950",
            "parent": "KINES",
            "title": "PROFESSIONAL SKILLS AND RESEARCH IN KINESIOLOGY"
        }
    },
    {
        "data": {
            "description": "Current theoretical and methodological issues and problems within the study of human occupation and health.",
            "id": "KINES 885",
            "parent": "KINES",
            "title": "SEMINAR IN OCCUPATION AND HEALTH"
        }
    },
    {
        "data": {
            "description": "A practicum experience for individuals who are emphasizing the area of Physical Education/Special Populations. Six hours per week working with individuals who have disabling conditions.",
            "id": "KINES 365",
            "parent": "KINES",
            "title": "PRACTICUM: ADAPTED PHYSICAL EDUCATION"
        }
    },
    {
        "data": {
            "source": "KINES 650",
            "target": "KINES 656"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 213"
        }
    },
    {
        "data": {
            "source": "KINES 427",
            "target": "KINES 300"
        }
    },
    {
        "data": {
            "description": "Explores the major organ systems including nervous, endocrine, muscular, cardiovascular, renal, and gastrointestinal. The main learning objective is an understanding of the cellular and molecular mechanisms through which homeostasis is integrated and maintained. Not open to students with credit for PHYSIOL 335 or 435 prior to fall 2018 orANAT&PHY 335",
            "id": "ANAT&PHY 435",
            "parent": "ANAT&PHY",
            "title": "FUNDAMENTALS OF HUMAN PHYSIOLOGY"
        }
    },
    {
        "data": {
            "description": "Recommendations for and surveillance of physical activity in the U.S., and associations with health and disease at the population level. Emphasis on measurement techniques, study design and research considerations.",
            "id": "KINES/POPHLTH 791",
            "title": "PHYSICAL ACTIVITY EPIDEMIOLOGY"
        }
    },
    {
        "data": {
            "description": "Focuses on the nature of human occupation (everyday purposeful activity) and its relationship to well-being and health. Theories of occupation and health are critically examined.",
            "id": "KINES 785",
            "parent": "KINES",
            "title": "HUMAN OCCUPATION AND HEALTH"
        }
    },
    {
        "data": {
            "description": "Provides scientific knowledge and opportunity to practice the application of strength and conditioning practices.",
            "id": "KINES 528",
            "parent": "KINES",
            "title": "SEMINAR IN STRENGTH AND CONDITIONING"
        }
    },
    {
        "data": {
            "description": "Issues related to promoting equal learning opportunities in the classroom and other community settings, including effective approaches to encouraging collaboration among colleagues, staff, parents, and students who are culturally, ethnically and socio-economically diverse are examined. In addition, effective instructional and coaching methods for an inclusive sport environment, athletic programs, and health professions as they relate to diverse individuals are addressed. Theoretical and practical paradigm of cultural differences are introduced. The focus is on diversity issues as they relate to race, ethnicity, gender, social class, sexuality, and racial considerations, development and ability differences, variations in learning styles and a variety of physical, mental, and emotional disabilities.",
            "id": "KINES 540",
            "parent": "KINES",
            "title": "DIVERSITY IN HEALTH AND PHYSICAL ACTIVITY SETTINGS"
        }
    },
    {
        "data": {
            "description": "Addresses role transition and professional practice issues facing athletic trainers. Emphasis on identifying gaps in skills and expertise, recognizing communication needs, and role socialization skills for future development during final preceptorship placements and entrance into the healthcare workforce. Board of Certification preparation strategies are explored.",
            "id": "KINES 657",
            "parent": "KINES",
            "title": "ROLE TRANSITION AND PROFESSIONAL PRACTICE IN ATHLETIC TRAINING"
        }
    },
    {
        "data": {
            "description": "Seminar topics in field of biomechanics.",
            "id": "KINES 951",
            "parent": "KINES",
            "title": "SEMINAR-BIOMECHANICS"
        }
    },
    {
        "data": {
            "description": "Issues and basic concepts of athletic healthcare including health care systems, interprofessonal teams, and injuries and conditions common to active populations. Emphasis on the team approach to patient care with exposure to a variety of health science professions.",
            "id": "KINES 127",
            "parent": "KINES",
            "title": "INTRODUCTION TO ATHLETIC HEALTHCARE"
        }
    },
    {
        "data": {
            "description": "Takes a regional approach to cover the gross anatomy of the human body in four units: introduction to anatomical systems; back and limbs; thorax, abdomen, and pelvis; and head and neck. A variety of tools, including interactive software, models, and specimens, will be used.",
            "id": "ANAT&PHY 338",
            "parent": "ANAT&PHY",
            "title": "HUMAN ANATOMY LABORATORY"
        }
    },
    {
        "data": {
            "source": "KINES 621",
            "target": "KINES 622"
        }
    },
    {
        "data": {
            "description": "In-depth look at anatomic, neurophysiological, behavioral, and clinical aspects of motor control under normal and pathological conditions. Movement disorders include sensory neuropathy, cerebral cortical or brain stem stroke, basal ganglia dysfunction, and cerebellar disease.",
            "id": "KINES 713",
            "parent": "KINES",
            "title": "NEURAL BASIS OF NORMAL AND PATHOLOGICAL MOVEMENT"
        }
    },
    {
        "data": {
            "description": "Introduces theories and application of health promotion and health education, specifically, health education specialties and philosophical foundations. Addresses professional issues relating to the history, philosophy, ethics, practice, settings and competence of health education. Includes a focus on skills and techniques in writing, developing health educational materials, public speaking and group dynamics as they relate to community health promotion and health education programs.",
            "id": "KINES 566",
            "parent": "KINES",
            "title": "PROMOTING HEALTH IN THE COMMUNITY"
        }
    },
    {
        "data": {
            "description": "Supervised experience in a specialized area of physical education.",
            "id": "KINES 300",
            "parent": "KINES",
            "title": "PRACTICUM IN KINESIOLOGY"
        }
    },
    {
        "data": {
            "source": "KINES 372",
            "target": "KINES 373"
        }
    },
    {
        "data": {
            "description": "Research evidence regarding how physical activity and fitness are related to health (e.g., during pregnancy and aging) and disease, especially cardiovascular diseases, obesity, diabetes, osteoporosis, and cancer. Application and communication of knowledge in practical situations.",
            "id": "KINES 521",
            "parent": "KINES",
            "title": "PHYSICAL ACTIVITY AND HEALTH"
        }
    },
    {
        "data": {
            "description": "Provides a forum for students, faculty and staff from the department of kinesiology to present and discuss research and current issues related to the field of kinesiology.",
            "id": "KINES 900",
            "parent": "KINES",
            "title": "SEMINAR IN KINESIOLOGY"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "description": "Sports are a great way for children to stay physically active, but adults are changing sports in ways that impact children in negative ways. Focuses on how kids are different than adults in terms of their needs for exercise and physical activity. Topics include physical activity epidemiology, growth, maturation, and sport specialization. Additional focus on common orthopedic injuries in the adolescent and pediatric populations and how injuries in young athletes are treated.",
            "id": "KINES 387",
            "parent": "KINES",
            "title": "THE YOUNG ATHLETE: CONSIDERATIONS FOR EXERCISE, MEDICINE, AND ACTIVITY"
        }
    },
    {
        "data": {
            "description": "First order differential equations, introduction to multivariable calculus and constrained optimization, infinite sequences and series, methods of approximation, and a brief introduction to probability. Models and applications from business and the social sciences.",
            "id": "MATH 213",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 2"
        }
    },
    {
        "data": {
            "description": "Clinical practicum that provides practical and skills-oriented instruction under the supervision of a skilled clinical preceptor. Provides an opportunity for exposure will be to a large volume and variety of clinical experiences to facilitate learning in authentic clinical settings.",
            "id": "KINES 620",
            "parent": "KINES",
            "title": "CLINICAL PRACTICUM IN ATHLETIC TRAINING I"
        }
    },
    {
        "data": {
            "description": "Fundamental knowledge about, and appreciation for, the adaptability of human physiological systems in meeting a range of exercise demands.",
            "id": "KINES 314",
            "parent": "KINES",
            "title": "PHYSIOLOGY OF EXERCISE"
        }
    },
    {
        "data": {
            "description": "Provides evaluation techniques, theory and practice in the use of therapeutic exercise for the rehabilitation of athletic injuries. Provides the appropriate knowledge and skills needed to evaluate and apply therapeutic strategies in the treatment of athletic injuries. Focuses on lower extremity and closed head injuries.",
            "id": "KINES 652",
            "parent": "KINES",
            "title": "EVALUATION AND THERAPEUTIC INTERVENTIONS I"
        }
    },
    {
        "data": {
            "description": "A community-based experience in the Adapted Physical Education. Assist, lead, and teach participants in a physical activity program, community recreation activity, or other events that are specific to individuals with disability. Emphasis placed on the adaptation of physical education and physical activities to the needs of individuals with physical, intellectual, emotional, or sensory disabilities.",
            "id": "KINES 362",
            "parent": "KINES",
            "title": "ADAPTED PHYSICAL EDUCATION COMMUNITY ENGAGEMENT"
        }
    },
    {
        "data": {
            "source": "KINES 654",
            "target": "KINES 672"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "description": "Clinical practicum that provides practical and skills-oriented instruction under the supervision of a skilled clinical preceptor. Exposure to a large volume and variety of clinical experiences to facilitate learning in authentic clinical settings.",
            "id": "KINES 621",
            "parent": "KINES",
            "title": "CLINICAL PRACTICUM IN ATHLETIC TRAINING II"
        }
    },
    {
        "data": {
            "description": "Introduction to the design of individual and group exercise programs utilized in fitness leadership roles. Supervised practical experience will be provided in class to assist the development of student leadership skills.",
            "id": "KINES 390",
            "parent": "KINES",
            "title": "PRINCIPLES OF EXERCISE LEADERSHIP"
        }
    },
    {
        "data": {
            "description": "Seminar topics in field of motor control and learning.",
            "id": "KINES 961",
            "parent": "KINES",
            "title": "SEMINAR IN MOTOR CONTROL AND LEARNING"
        }
    },
    {
        "data": {
            "description": "Topics and laboratory experiences will focus on parameters that are measured in physical activity pedagogy; instruments for measuring physical activity, health related fitness, knowledge, and psychological characteristics; concepts of assessment and research, basic statistical methods; and action research.",
            "id": "KINES 315",
            "parent": "KINES",
            "title": "ASSESSMENT AND RESEARCH IN PHYSICAL ACTIVITY PEDAGOGY"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 151"
        }
    },
    {
        "data": {
            "source": "KINES 427",
            "target": "KINES 527"
        }
    },
    {
        "data": {
            "description": "Independent undergraduate work in advanced area of study under direct guidance of kinesiology faculty.",
            "id": "KINES 699",
            "parent": "KINES",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "description": "Structure, regions and function of the neurological and musculoskeletal systems are presented with the purpose of providing insight into the anatomical foundations of common injuries and conditions.",
            "id": "KINES 570",
            "parent": "KINES",
            "title": "ANATOMICAL FOUNDATIONS IN ATHLETIC TRAINING"
        }
    },
    {
        "data": {
            "description": "Provides an experiential learning experience to integrate theoretical concepts learned in the classroom into field experience. Through supervised practical experiences, gain valuable insights into the diverse applications of exercise science in various settings. Assume responsibilities that are consistent with level of professional development and learning experiences.",
            "id": "KINES 690",
            "parent": "KINES",
            "title": "INTERNSHIP IN KINESIOLOGY"
        }
    },
    {
        "data": {
            "description": "Techniques and procedures to deal effectively with common emergencies. Includes training in airway obstruction, cardiopulmonary resuscitation, automated external defibrillation, injuries, and medical emergencies.",
            "id": "KINES 116",
            "parent": "KINES",
            "title": "FIRST AID AND BASIC LIFE SUPPORT"
        }
    },
    {
        "data": {
            "source": "ANAT&PHY 338",
            "target": "KINES 318"
        }
    },
    {
        "data": {
            "source": "KINES 370",
            "target": "KINES 327"
        }
    },
    {
        "data": {
            "description": "Provides knowledge/skills needed to assess a client's wellness-related priorities and support them through development of wellness goals and the process of behavior change. Discussion of behavior change models and theories will provide a foundational understanding of health coaching. Covers principles and practice of motivational interviewing. Provides didactic and experiential training in mindfulness. Defines health coaching as a profession through discussion of scope of practice, the business of health coaching, professional conduct, and ethical considerations. Introduces lifestyle medicine through discussion of stress management, nutrition, physical activity, and other lifestyle factors, in addition to chronic disease and comorbid conditions. Uses elements of the American Council on Exercise (ACE) Health Coach University Curriculum.",
            "id": "KINES 280",
            "parent": "KINES",
            "title": "HEALTH COACHING PRINCIPLES AND METHODS"
        }
    },
    {
        "data": {
            "description": "Introduction to physical education teaching, movement education, and an operational understanding of the scientific study of human movement. Lecture and lab.",
            "id": "KINES 121",
            "parent": "KINES",
            "title": "FOUNDATIONS OF PHYSICAL EDUCATION"
        }
    },
    {
        "data": {
            "source": "ANAT&PHY 337",
            "target": "KINES 618"
        }
    },
    {
        "data": {
            "description": "Focus on applying models, research, and best practices in motor control and motor learning to inclusive physical activity, sports, and rehabilitation for individuals with disabilities. Participate in training seminars and site visits led by content experts in physical activity, sport, and rehabilitation. Explore and participate in sports, recreation, and physical activities through the lens of a tourist/participant with disabilities. Must have sophomore standing and a valid passport.",
            "id": "KINES 260",
            "parent": "KINES",
            "title": "INCLUSIVE PHYSICAL ACTIVITY, SPORT & REHABILITATION IN IRELAND"
        }
    },
    {
        "data": {
            "source": "KINES 315",
            "target": "KINES 364"
        }
    },
    {
        "data": {
            "id": "ANAT&PHY",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "KINES 373",
            "target": "KINES 375"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    }
]