[
    {
        "data": {
            "description": "Examines educational inequality across the Americas through the lens of imperialism, different forms of colonialism, and capitalism. By exploring the logics and actions of different education stakeholders, critically examine how educational policy across the hemisphere has a shared history of oppression and contestation.",
            "id": "CHICLA/EDPOL/LACIS 342",
            "title": "EDUCATION ACROSS THE AMERICAS: EMPIRE, CAPITALISM, AND RESISTANCE"
        }
    },
    {
        "data": {
            "id": "LACIS",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Explores literature to understand representations and experiences of migration within the United States, and in the Americas more broadly, over time and across cultures. Focusing on literature and employing historical and psychoanalytic interpretive approaches, critically analyze artistic and literary representations of the migrant experience. Topics include: the relationships between literature, art, and migration; the role of migrants in constructing the United States; the role of art and literature in the empowerment of marginalized groups. Analyze literary texts in their contexts using tools of literary analysis and express ideas about literary texts and art from a critical perspective.",
            "id": "ILS/LACIS 367",
            "title": "THE LITERATURE OF MIGRATION AND THE MIGRANT EXPERIENCE IN THE AMERICAS"
        }
    },
    {
        "data": {
            "source": "ANTHRO/LACIS 362",
            "target": "ANTHRO/LACIS 363"
        }
    },
    {
        "data": {
            "description": "Latin American culture and society from an interdisciplinary perspective; historical developments from pre-Columbian times to the present; political movements; economic problems; social change; ecology in tropical Latin America; legal systems; literature and the arts; cultural contrasts involving the US and Latin America; land reform; labor movements; capitalism, socialism, imperialism; mass media.",
            "id": "AFROAMER/ANTHRO/C&ESOC/GEOG/HISTORY/LACIS/POLISCI/SOC/SPANISH 260",
            "title": "LATIN AMERICA: AN INTRODUCTION"
        }
    },
    {
        "data": {
            "description": "Continuation of advanced conversation and composition; cultural background of Quechua-speaking peoples through reading of myths, legends, folktales; problems in dialectology.",
            "id": "ANTHRO/LACIS 364",
            "title": "ADVANCED QUECHUA"
        }
    },
    {
        "data": {
            "description": "An introductory survey of colonial Latin American history, from the late fifteenth to the early nineteenth century. Examines developments in Spanish and Portuguese America by reading both secondary and primary sources.  Beginning with fifteenth-century Europe, the Americas and West Africa, discusses European expansion and invasion, first contacts between the so-called Old and the so-called New Worlds, as well as the role of religion, sexuality, gender, labor and production, trade and exchange, and politics. Each week, a central question will address the topic for that week. Become familiar with and contextualize key processes and events in colonial Latin American history and learn about the nature of colonization. Identify and evaluate historical arguments. Practice interpreting primary sources and building historical arguments about them.",
            "id": "HISTORY/LACIS 243",
            "title": "COLONIAL LATIN AMERICA: INVASION TO INDEPENDENCE"
        }
    },
    {
        "data": {
            "description": "Mentored individual research and study for students completing a thesis in an Honors program.",
            "id": "LACIS 682",
            "parent": "LACIS",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Examine how the experiences of marginalized groups in the U.S. are profoundly intertwined with hemispheric historical processes. Review the categories that emerged to conceptualize human difference as European colonizers dispossessed indigenous peoples of their lands and inaugurated the forced migration and enslavement of peoples from Africa. Focus on how race was transformed after the revolutions of independence, exploring key concepts such as the one drop rule, mestizaje, racial democracy, and color-blindness. Explore how race intersects with gender, class, and migration, as well as with slavery, anti-colonial struggles, and US expansionism. Examine common assumptions in comparisons of race relations -e.g., the idea of a more more \"fluid\" understanding of race in Latin American countries, versus the binary models of the U.S.",
            "id": "LACIS/SPANISH 285",
            "title": "RACE AND CULTURE IN THE AMERICAS"
        }
    },
    {
        "data": {
            "description": "Mentored individual research and study for students completing a thesis in an Honors program.",
            "id": "LACIS 681",
            "parent": "LACIS",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "An examination of specific topics related to the Latin American, Caribbean, and Iberian region. Topics vary each semester, but may include specific themes in history, literature, media, political science, sociology, culture, politics, social work, and agriculture.",
            "id": "LACIS 440",
            "parent": "LACIS",
            "title": "TOPICS IN LATIN AMERICAN, CARIBBEAN, AND IBERIAN STUDIES"
        }
    },
    {
        "data": {
            "source": "ANTHRO/LACIS 361",
            "target": "ANTHRO/LACIS 362"
        }
    },
    {
        "data": {
            "source": "ANTHRO/LACIS 363",
            "target": "ANTHRO/LACIS 364"
        }
    },
    {
        "data": {
            "description": "Continued introduction to phonology and morphology; concentration on the acquisition of conversational skills; reading of texts of graded difficulty.",
            "id": "ANTHRO/LACIS 362",
            "title": "ELEMENTARY QUECHUA"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Continued introduction to Yucatec Maya language. Focus on acquiring  vocabulary and grammar for basic conversational proficiency. Taught through in-class oral and aural exercises, language tapes, and primary texts. Learn about Maya culture, history, folklore, and language politics.",
            "id": "ANTHRO/LACIS 377",
            "title": "SECOND SEMESTER YUCATEC MAYA"
        }
    },
    {
        "data": {
            "description": "Advanced morphology and syntax; advanced conversation and composition; cultural background of Quechua speaking peoples through reading of myths, legends and folktales.",
            "id": "ANTHRO/LACIS 363",
            "title": "INTERMEDIATE QUECHUA"
        }
    },
    {
        "data": {
            "description": "A critical examination of US-Latin American relations from the colonial era to the present, tracing the emergence and evolution of the United States as a hemispheric and global power and its political and economic impact on Latin America. Primary attention will be focused on US relations with Mexico, Central America and the Caribbean, but other Latin American countries will figure prominently during certain episodes.",
            "id": "CHICLA/HISTORY/LACIS/POLISCI 268",
            "title": "THE U.S. & LATIN AMERICA FROM THE COLONIAL ERA TO THE PRESENT: A CRITICAL SURVEY"
        }
    },
    {
        "data": {
            "description": "Advanced directed study projects as arranged with a faculty member.",
            "id": "LACIS 698",
            "parent": "LACIS",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Provides a critical examination of the history of labor and working people in the Americas, from the colonial era to the present. It focuses on the experience of the United States and Mexico, offering a comparative perspective on their distinct but also shared (and increasingly linked) histories. The seminar proceeds chronologically, highlighting major episodes in the evolution of labor systems in the two countries, beginning with the colonial labor systems implemented by the Spanish and British empires following the European conquest of the Western Hemisphere. Among other topics, we will examine the pivotal role of slavery and other forms of forced labor, the impact of the industrial revolution, the emergence and expansion of corporate capitalism and the labor unrest it provoked in the post-civil war U.S., the role of labor in the Mexican Revolution and its aftermath, the impact of the Great Depression and labor incorporation on the post-WWII social and political order of both countries, the breakdown of that order and the move to neo-liberalism in the 1970s and 1980s, and the emergence of an increasingly integrated North American production system and its consequences for labor and working people on both sides of the US-Mexico border.",
            "id": "CHICLA/HISTORY/LACIS/POLISCI 355",
            "title": "LABOR IN THE AMERICAS: US & MEXICO IN COMPARATIVE & HISTORICAL PERSPECTIVE"
        }
    },
    {
        "data": {
            "description": "Interdisciplinary inquiry in Latin American society and culture.",
            "id": "AAE/ANTHRO/C&ESOC/GEOG/HISTORY/LACIS/POLISCI/PORTUG/SOC/SPANISH 982",
            "title": "INTERDEPARTMENTAL SEMINAR IN THE LATIN-AMERICAN AREA"
        }
    },
    {
        "data": {
            "id": "EDPOL",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "EDPOL 300",
            "target": "CHICLA/EDPOL/LACIS 342"
        }
    },
    {
        "data": {
            "description": "Phonology and morphology; concentration on the acquisition of conversational skills; reading of texts of graded difficulty.",
            "id": "ANTHRO/LACIS 361",
            "title": "ELEMENTARY QUECHUA"
        }
    },
    {
        "data": {
            "description": "Focuses on the interplay between schools and society by examining societal and cultural influences on school processes, policies, practices, and pedagogy; or, how society shapes schooling, and conversely, the ways in which schools assist in shaping society. Reflect on the purposes of schools and how these purposes have shifted over time. Examines how assumptions regarding the purposes of schooling interact with debates over how we teach, what we teach, and how we evaluate schools, teachers, and students. Identify the foundations of education in the United States and critically examine the ways in which educational practices and policies impact the lives of students.",
            "id": "EDPOL 300",
            "parent": "EDPOL",
            "title": "SCHOOL AND SOCIETY"
        }
    },
    {
        "data": {
            "description": "Introduction to Yucatec Maya language. Focus on acquiring  vocabulary and grammar for basic conversational proficiency. Taught through in-class oral and aural exercises, language tapes, and primary texts. Learn about Maya culture, history, folklore, and language politics.",
            "id": "ANTHRO/LACIS 376",
            "title": "FIRST SEMESTER YUCATEC MAYA"
        }
    },
    {
        "data": {
            "source": "ANTHRO/LACIS 376",
            "target": "ANTHRO/LACIS 377"
        }
    },
    {
        "data": {
            "description": "A broad overview of Latin American history in the modern period, since independence but with a primary focus on the twentieth century. Particular emphasis will be placed on the socioeconomic, cultural, and political structures and processes that shaped and continue to influence life in Latin America. Key issues such as colonialism, nationalism, democracy, and revolution will be examined critically in light of broad comparative themes in Latin American and world history. Among the topics to be explored in detail will be the Mexican and Cuban revolutions, populism and dictatorship, socialism and neoliberalism, and drugs and migration.",
            "id": "HISTORY/INTLST/LACIS 242",
            "title": "MODERN LATIN AMERICA"
        }
    },
    {
        "data": {
            "description": "Advanced directed study projects as arranged with a faculty member.",
            "id": "LACIS 699",
            "parent": "LACIS",
            "title": "DIRECTED STUDY"
        }
    }
]