[
    {
        "data": {
            "description": "A preparation and introductory math course for students enrolled in the Summer Collegiate Experience program. Includes material from precalculus and calculus and related topics depending on students' results on the math placement exam.",
            "id": "MATH 118",
            "parent": "MATH",
            "title": "SUMMER COLLEGIATE EXPERIENCE MATHEMATICS COURSE"
        }
    },
    {
        "data": {
            "description": "Capstone project proposal development from a regional to site scale. Includes site visits with clients to gain a better understanding of local conditions and the client's expectations. The final proposal document is grounded in research and includes a literature review, precedent studies, programmatic development, and inventory and analysis mappings that address issues from ecology to public/private partnerships.",
            "id": "LANDARC 610",
            "parent": "LANDARC",
            "title": "LANDSCAPE ARCHITECTURE SEMINAR"
        }
    },
    {
        "data": {
            "description": "Covers the graphs, properties and geometric significance of trigonometric functions of a real variable. Other topics include trigonometric equations and identities, application, trigonometric form of complex numbers, DeMoivre's theorem, and polar and parametric equations. The course also has a significant number of applications, especially related to other disciplines.",
            "id": "MATH 113",
            "parent": "MATH",
            "title": "TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "Design studio with an emphasis on the application of design principles aimed at promoting people's health and wellbeing in the built environment.",
            "id": "LANDARC 321",
            "parent": "LANDARC",
            "title": "ENVIRONMENT AND BEHAVIOR STUDIO - DESIGNING HEALTH PROMOTING ENVIRONMENTS"
        }
    },
    {
        "data": {
            "description": "Ecological restoration education utilizes the power of place to work towards social justice and sustainability. Work with Native Nations and community partners to apply Earth Partnership's 10 Step process. This process includes historical, cultural, ecological, and social justice components. Learn about assets-based, culturally relevant approaches to working with community partners. Interact with guest speakers and partners to experience firsthand different perspectives on environment, cultural priorities, protocols for interaction, and opportunities for relationship building.  Work on community-based stewardship projects and reflect upon your epistemological relationship to land and people as global citizens.",
            "id": "LANDARC 363",
            "parent": "LANDARC",
            "title": "EARTH PARTNERSHIP: RESTORATION EDUCATION FOR EQUITY AND RESILIENCE"
        }
    },
    {
        "data": {
            "description": "Problems dealing with the comprehension and modification of the earth's surface including landform design, preparation of grading plans, earthwork calculations.",
            "id": "LANDARC 353",
            "parent": "LANDARC",
            "title": "LANDSCAPE ARCHITECTURAL TECHNOLOGY I"
        }
    },
    {
        "data": {
            "description": "A critical and historical analysis of our design of outdoor space.",
            "id": "LANDARC 260",
            "parent": "LANDARC",
            "title": "HISTORY OF LANDSCAPE ARCHITECTURE"
        }
    },
    {
        "data": {
            "description": "An application of landscape design principles and problem-solving methods to housing and urban issues with attention to physical site design, land-use controls, and the relationship between housing and associated land uses. The built environment is continuously changing through multiple land development-and redevelopment-decisions. Public policies on housing, transportation, mortgage financing, and taxation, in conjunction with changing demographics and lifestyle preferences, are just some of the factors that influence the evolving structure and function of the built environment. Landscape architects can play important roles--through design, civic engagement, and policy advocacy--in making our cities and suburbs healthier and more sustainable. Studio projects focus on the central city and/or suburbs.",
            "id": "LANDARC 561",
            "parent": "LANDARC",
            "title": "HOUSING AND URBAN DESIGN"
        }
    },
    {
        "data": {
            "description": "Basic principles in the design of landscapes to aid in developing individual capacities and approaches to designing. Principles of graphic communication media and development of practical graphic skills.",
            "id": "LANDARC 261",
            "parent": "LANDARC",
            "title": "PRINCIPLES OF LANDSCAPE ARCHITECTURE DESIGN AND GRAPHICS"
        }
    },
    {
        "data": {
            "description": "Basic principles of ecology and interrelations between individuals, populations, communities, ecosystems and their environment; transmission genetics and introduction to population genetics; origin of life, evolutionary mechanisms, ancestral relationships among species, and the diversity of life.",
            "id": "BIOCORE 381",
            "parent": "BIOCORE",
            "title": "EVOLUTION, ECOLOGY, AND GENETICS"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Covers the use of live fire in land management and provides a background in fire ecology, fire behavior, fire effects, and the prediction of fire behavior for wetland, prairie and savanna fuels. Instruction includes field training with live fire exercises and the use of fire management equipment. Participate in prescribed burns outside of scheduled class times. Confers certificates of completion that qualify an individual to participate on prescribed fire crews with public and private sector organizations.",
            "id": "ENVIRST/LANDARC 581",
            "title": "PRESCRIBED FIRE: ECOLOGY AND IMPLEMENTATION"
        }
    },
    {
        "data": {
            "description": "Descriptive statistics, probability concepts and distributions, random variables. Hypothesis tests and confidence intervals for one- and two-sample problems. Linear regression, model checking, and inference. Analysis of variance and basic ideas in experimental design. Utilizes the R programming language.",
            "id": "STAT 324",
            "parent": "STAT",
            "title": "INTRODUCTORY APPLIED STATISTICS FOR ENGINEERS"
        }
    },
    {
        "data": {
            "description": "Design, implementation and use of automated procedures for storage, analysis and display of spatial information. Covers data bases, information manipulation and display techniques, software systems and management issues. Case studies.",
            "id": "CIVENGR/ENVIRST/GEOG 377",
            "title": "AN INTRODUCTION TO GEOGRAPHIC INFORMATION SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Ecology of individual organisms, populations, communities, ecosystems, landscapes, and the biosphere. The interaction of organisms with each other and their physical environment. These relationships are studied, often in quantitative terms, in both field and laboratory settings.",
            "id": "BOTANY/F&WECOL/ZOOLOGY 460",
            "title": "GENERAL ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Effects of building and outdoor spaces on people over the life course.",
            "id": "DS 221",
            "parent": "DS",
            "title": "PERSON AND ENVIRONMENT INTERACTIONS"
        }
    },
    {
        "data": {
            "description": "Emphasizes the importance of spatial patterns at broad scales. Concepts and applications are covered.",
            "id": "F&WECOL/LANDARC/ZOOLOGY 565",
            "title": "PRINCIPLES OF LANDSCAPE ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "Examines the cultural, social and political interactions that occur in urban landscapes including parks, plazas, streets and other public open spaces. An examination of past and present landscapes as sites of the struggle for social justice. The focus is on urban landscapes of the United States.",
            "id": "LANDARC 525",
            "parent": "LANDARC",
            "title": "SOCIAL JUSTICE AND THE URBAN LANDSCAPE"
        }
    },
    {
        "data": {
            "description": "Exploration of broad scale design issues to develop synthesis and design skills. Uses spatial form and bioregional cultural, ecological and environmental concepts to solve land use and conservation problems. Regional design requires advanced techniques for inventory, analysis, and design to help in understanding complex trends, policy and design impacts, hazard mitigation, design intervention suitability, design guidelines, and systems level design. These techniques help us explore the relationships between regions and sites, especially regional implications of site design decisions and site design impacts on regional characteristics and systems.",
            "id": "LANDARC 563",
            "parent": "LANDARC",
            "title": "DESIGNING SUSTAINABLE AND RESILIENT REGIONS"
        }
    },
    {
        "data": {
            "description": "Exploration of special issues or problems in landscape architecture. Topic and faculty vary.",
            "id": "LANDARC 375",
            "parent": "LANDARC",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "Exploration of special issues or problems in landscape architecture.",
            "id": "LANDARC 590",
            "parent": "LANDARC",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "Explore and apply methods and technologies used in the geodesign framework that emphasize collaboration among the design professions, the natural and social sciences, and community stakeholders. Exercises will focus on scenarios within the built and natural environment.",
            "id": "LANDARC 511",
            "parent": "LANDARC",
            "title": "GEODESIGN METHODS AND APPLICATIONS"
        }
    },
    {
        "data": {
            "description": "Explore the intersection of nature-based mindfulness practices and design of restorative outdoor environments that support health and well-being in public places, including school gardens, botanical gardens, and campus natural areas, with a focus on sensory engagement and sense of belonging. Design and co-design restorative environments and features through a participatory planning process with community partners.",
            "id": "LANDARC 373",
            "parent": "LANDARC",
            "title": "MINDFULNESS IN RESTORATIVE ENVIRONMENTS"
        }
    },
    {
        "data": {
            "description": "Explores cultural values embedded in buildings through understanding physical configurations, social organizations, practiced/symbolic/representational aspects of buildings. Covers a wide range of cultures and the built environments they produce including examples from the Americas, the Middle East, as well as those of the many ethnic minorities in the U.S.",
            "id": "DS/LANDARC 639",
            "title": "CULTURE AND BUILT ENVIRONMENT"
        }
    },
    {
        "data": {
            "description": "Explores planning-related Geographic Information System (GIS) data, applications, analytical tools, and implementation issues.",
            "id": "ENVIRST/GEOG/LANDARC/URBRPL 532",
            "title": "APPLICATIONS OF GEOGRAPHIC INFORMATION SYSTEMS IN PLANNING"
        }
    },
    {
        "data": {
            "description": "Explores the process of plant selection and placement in the landscape. The desired landscape will be ecologically appropriate to the setting, sustainable, functional in response to goals, and aesthetically pleasing. Acquire an awareness and understanding of the physical characteristics of plant materials and a sensitivity to their needs based on past and present. Emphasis on the recognition of the philosophy of planting design as a dynamic and changing spatial art and science, the relationship between environment and plants, application of design composition principles to plant selection and placement, and functional and utilitarian uses of plants; i.e., the opportunities and constraints for plants in the designed landscape.",
            "id": "LANDARC 560",
            "parent": "LANDARC",
            "title": "PLANTS AND ECOLOGY IN DESIGN"
        }
    },
    {
        "data": {
            "description": "Field experience in restoration as an adaptive process involving field experimentation; baseline data collection on restoration sites; design of experiments to advance restoration science; quantitative evaluation of restoration outcomes. Includes analysis and interpretation of data.",
            "id": "BOTANY/LANDARC 670",
            "title": "ADAPTIVE RESTORATION LAB"
        }
    },
    {
        "data": {
            "description": "Field identification, landscape characteristics, uses, environmental requirements, adaptability of woody ornamental plants; their autumn and winter character.",
            "id": "HORT/LANDARC 263",
            "title": "LANDSCAPE PLANTS I"
        }
    },
    {
        "data": {
            "description": "Focuses on the symbolic and representational computer graphics that are essential elements of design communication in landscape architecture. Reviews the strengths and weaknesses of hand and digital media and the use of both when appropriate. Topics and assignments include advanced hand sketching and graphics, computer graphic techniques, digital photography, advanced digital color theory and rendering, digital image processing, CAD drafting, 2D/3D modeling, image compositing, media formats, and video.",
            "id": "LANDARC 460",
            "parent": "LANDARC",
            "title": "ADVANCED VISUAL COMMUNICATION IN LANDSCAPE ARCHITECTURE"
        }
    },
    {
        "data": {
            "description": "Formulation of plant community restoration and management plans; including the preparation of planting plans and working drawings for implementation. Classroom and practical exposure to natural areas management tools, including prescription prairie fire.",
            "id": "LANDARC 651",
            "parent": "LANDARC",
            "title": "PLANT COMMUNITY RESTORATION AND MANAGEMENT WORKSHOP"
        }
    },
    {
        "data": {
            "description": "General biological principles. Topics include: evolution, ecology, animal behavior, cell structure and function, genetics and molecular genetics and the physiology of a variety of organ systems emphasizing function in humans.",
            "id": "BIOLOGY/ZOOLOGY 101",
            "title": "ANIMAL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Geodesign considers questions and methods necessary to solve large, complicated, and significant design problems across a range of geographic scales. Introduces methods and technologies related to geodesign problems through interactive lessons, discussions, and laboratory exercises.",
            "id": "LANDARC 311",
            "parent": "LANDARC",
            "title": "INTRODUCTION TO DESIGN FRAMEWORKS AND SPATIAL TECHNOLOGIES"
        }
    },
    {
        "data": {
            "description": "In collaboration with Tribal partners in Wisconsin, emphasize environmental science rooted in land stewardship and land management aligned with cultural values and Indigenous science processes. Experience the culture and ecology of a place while engaging in ecological restoration and stewardship, reflecting on relationships to the land and as global citizens. The intersection of Indigenous knowledge and Western science helps explain the need for a diversity of perspectives to respond to social and environmental justice in our changing world.",
            "id": "AMERIND/LANDARC 106",
            "title": "EARTH PARTNERSHIP INDIGENOUS ARTS AND SCIENCES"
        }
    },
    {
        "data": {
            "description": "Independent study as arranged with a faculty member for Honors in the Major.",
            "id": "LANDARC 289",
            "parent": "LANDARC",
            "title": "HONORS INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Independent study as arranged with a faculty member.",
            "id": "LANDARC 299",
            "parent": "LANDARC",
            "title": "INDEPENDENT STUDIES"
        }
    },
    {
        "data": {
            "description": "Independent study as arranged with a faculty member.",
            "id": "LANDARC 699",
            "parent": "LANDARC",
            "title": "SPECIAL PROBLEMS-LANDSCAPE ARCHITECTURE"
        }
    },
    {
        "data": {
            "description": "Individual mentored research and study for completing theses, as arranged with a faculty member.",
            "id": "LANDARC 990",
            "parent": "LANDARC",
            "title": "RESEARCH"
        }
    },
    {
        "data": {
            "description": "Individual mentored study for seniors completing theses for Honors in the Major as arranged with a faculty member.",
            "id": "LANDARC 681",
            "parent": "LANDARC",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Individual mentored study for seniors completing theses for Honors in the Major as arranged with a faculty member.",
            "id": "LANDARC 682",
            "parent": "LANDARC",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Individual mentored study for seniors completing theses, as arranged with a faculty member.",
            "id": "LANDARC 691",
            "parent": "LANDARC",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Individual mentored study for seniors completing theses, as arranged with a faculty member.",
            "id": "LANDARC 692",
            "parent": "LANDARC",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Individual research, group discussion and workshop covering selected problems relating to the environment and landscape architecture.",
            "id": "LANDARC 940",
            "parent": "LANDARC",
            "title": "GRADUATE SEMINAR"
        }
    },
    {
        "data": {
            "description": "Integrate knowledge and theory learned in the classroom with practical application and skills development in a professional setting. Includes applied experience and making professional connections in the field of landscape architecture. Apply landscape architecture concepts, practice problem solving-skills, explore multidisciplinary approaches, develop team-work and interpersonal skills, access and use information resources, reflect upon or address ethical and professional issues.",
            "id": "LANDARC 397",
            "parent": "LANDARC",
            "title": "INTERNSHIP IN LANDSCAPE ARCHITECTURE"
        }
    },
    {
        "data": {
            "description": "Introduces beginning design students to the interdisciplinary processes used in solving three-dimensional design problems for both exterior and interior spaces. Allows students to understand the integration between architectural design, site design and interior design, and how these design realms create physical and sensory experiences in our everyday lives. Helps students develop fundamental verbal and graphic communication skills used in the professional design world. Questions explored in this course include: How to humans experience their environment? How do we perceive and interact with spaces where we live, work, and play? What makes great interior and exterior spaces? How do designers think to solve creative spatial design problems?",
            "id": "LANDARC 366",
            "parent": "LANDARC",
            "title": "INTRODUCTION TO ARCHITECTURAL AND ENVIRONMENTAL DESIGN"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Introduction to modern statistical practice in the life sciences, using the R programming language. Topics include: exploratory data analysis, probability and random variables; one-sample testing and confidence intervals, role of assumptions, sample size determination, two-sample inference; basic ideas in experimental design, analysis of variance, linear regression, goodness-of fit; biological applications.",
            "id": "STAT 371",
            "parent": "STAT",
            "title": "INTRODUCTORY APPLIED STATISTICS FOR THE LIFE SCIENCES"
        }
    },
    {
        "data": {
            "description": "Introduction to operational procedures used in professional offices ranging from private landscape architectural design firms to public agencies.",
            "id": "LANDARC 550",
            "parent": "LANDARC",
            "title": "PROFESSIONAL PRACTICE IN LANDSCAPE ARCHITECTURE"
        }
    },
    {
        "data": {
            "description": "Introduction to the Earth as viewed from above, focusing on use of aerial photography and satellite imagery to study the environment. Includes physical processes of electromagnetic radiation, data types and sensing capabilities, methods for interpretation, analysis and mapping, and applications.",
            "id": "ENVIRST/F&WECOL/GEOG/GEOSCI/GLE/LANDARC 371",
            "title": "INTRODUCTION TO ENVIRONMENTAL REMOTE SENSING"
        }
    },
    {
        "data": {
            "description": "Introduction to the basic principles and concepts of the biology of plants. an integrative approach stressing evolutionary sequences and the relationship between structure and function at succeeding levels of organization: molecule, cell, organism, population, community. Correlated lectures, laboratories, and discussions.",
            "id": "BIOLOGY/BOTANY 130",
            "title": "GENERAL BOTANY"
        }
    },
    {
        "data": {
            "description": "Introduction to the techniques and processes used in solving three-dimensional design problems in the urban and natural environment through studio exercises. Understand how design process and design principles create physical and sensory experiences in our everyday lives. Develop fundamental verbal and graphic communication skills used in the professional design world. Gives attention to the basics of design theory and philosophy.",
            "id": "LANDARC 210",
            "parent": "LANDARC",
            "title": "INTRODUCTION TO LANDSCAPE ARCHITECTURE DESIGN STUDIO"
        }
    },
    {
        "data": {
            "description": "Major emphasis on the roles of plants and microbes in past and present global ecology, and the past and present uses of plants and microbes by humans, including emerging applications of biotechnology.",
            "id": "BOTANY 100",
            "parent": "BOTANY",
            "title": "SURVEY OF BOTANY"
        }
    },
    {
        "data": {
            "description": "Modern GIS desktop and web-based workflows, analyses, and visualizations related to natural resource and environmental planning issues and communication. Guest lectures from agency and industry professionals.",
            "id": "ENVIRST/LANDARC/SOILSCI 695",
            "title": "APPLICATIONS OF GEOGRAPHIC INFORMATION SYSTEMS IN NATURAL RESOURCES"
        }
    },
    {
        "data": {
            "description": "Normative design theory as it relates to historical and contemporary aesthetic expression in landscape design. Review of critical theory and meaning associated with a broad landscape architecture typology.",
            "id": "LANDARC 720",
            "parent": "LANDARC",
            "title": "CRITICAL INQUIRY INTO LANDSCAPE DESIGN EXPRESSION"
        }
    },
    {
        "data": {
            "description": "Opportunity to explore concepts or issues of interest.",
            "id": "LANDARC 999",
            "parent": "LANDARC",
            "title": "INDEPENDENT STUDIES"
        }
    },
    {
        "data": {
            "description": "Overview of research: Logic and language of the process, substantive issues, criticism of research literature, developments of detailed proposals.",
            "id": "LANDARC 740",
            "parent": "LANDARC",
            "title": "RESEARCH IN LANDSCAPE ARCHITECTURE"
        }
    },
    {
        "data": {
            "description": "Participate in a one-week community-based, intergenerational Institute focused on ecological restoration and water stewardship rooted in Indigenous knowledge while working with Native Nations in Wisconsin. An emphasis is on environmental science aligned with cultural values and indigenous science processes and address environmental, education and health issues through restoration and stewardship action. Learn culturally accurate and authentic resources about tribal sovereignty, history, and culture and contemporary issues relevant to each community. Through hands-on stewardship action, a greater sense of self and diversity of perspectives related to impacts of climate change and preserving biodiversity will be gained.",
            "id": "LANDARC 360",
            "parent": "LANDARC",
            "title": "EARTH PARTNERSHIP RESTORATION EDUCATION: INDIGENOUS ARTS & SCIENCES"
        }
    },
    {
        "data": {
            "description": "Plants as the basis for ecological landscape design in urban and rural settings in late summer, fall, and early winter and their role in creating beautiful, resilient, and high performing outdoor spaces that enhance human health and well-being and provide a number of global ecosystem services.  Study plants in their native and designed habitats to understand the relationships between and among plants and their environment. Identify the aesthetic, structural, functional, and cultural characteristics of key Wisconsin native plants and a variety of non-invasive horticultural species as well as the composition, structure, and functions of  forest, wetland, and grassland communities. Express the essence and cultural meaning of plants and plant communities through hand and digital graphics and writing.",
            "id": "LANDARC 380",
            "parent": "LANDARC",
            "title": "PLANTS FOR ECOLOGICAL DESIGN I"
        }
    },
    {
        "data": {
            "description": "Plants as the basis for ecological landscape design in urban and rural settings.   Study plants in their native and designed habitats to understand the relationships between and among plants and their environment in late winter and early spring. Identify the aesthetic, functional, and cultural characteristics of key Wisconsin native plants and plant communities as well as a variety of non-invasive horticultural species.  Discuss how to use plants together in settings with environmental conditions to which they are adapted in order to create resilient and high-performing outdoor spaces that enhance human health and well-being and provide a number of global ecosystem services.",
            "id": "LANDARC 381",
            "parent": "LANDARC",
            "title": "PLANTS FOR ECOLOGICAL DESIGN II"
        }
    },
    {
        "data": {
            "description": "Presentations on topics related to plant community management and restoration.",
            "id": "LANDARC 866",
            "parent": "LANDARC",
            "title": "SEMINAR IN NATURAL PLANT COMMUNITY RESTORATION AND MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Principles of landscape and environmental design; incorporates elements of landscape planning and management. Provides background to the ideas and personalities shaping landscape architecture in America. Establishes design basics with a focus on the processes used by landscape architects to create meaningful site and context-sensitive designs in the built and natural environment.",
            "id": "LANDARC 250",
            "parent": "LANDARC",
            "title": "SURVEY OF LANDSCAPE ARCHITECTURE DESIGN"
        }
    },
    {
        "data": {
            "description": "Problems dealing with construction detailing, including roadways, drainage structures, construction materials, cost estimating, specifications and working drawings.",
            "id": "LANDARC 354",
            "parent": "LANDARC",
            "title": "LANDSCAPE ARCHITECTURAL TECHNOLOGY II"
        }
    },
    {
        "data": {
            "description": "Problems in landscape design, planning, and management of projects from a regional to site scale. Provides an opportunity for synthesis of the knowledge, skills, and approaches learned in previous course work.",
            "id": "LANDARC 611",
            "parent": "LANDARC",
            "title": "LANDSCAPE ARCHITECTURE CAPSTONE II"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Provides an area equivalency for courses taken on Madison Study Abroad Programs that do not equate to existing UW courses. Current enrollment in a UW-Madison study abroad program",
            "id": "LANDARC 400",
            "parent": "LANDARC",
            "title": "STUDY ABROAD IN LANDSCAPE ARCHITECTURE"
        }
    },
    {
        "data": {
            "description": "Provides an introduction to cultural landscape studies as a corollary to cultural conservation in public folklore, environmental planning, natural and cultural resource management, landscape architecture, and the history of landscape architecture. Includes varied concepts of cultural landscape, key historical and cultural landscape research methodologies, and a range of preservation and conservation types involving cultural landscapes, traditional cultural properties, and intangible and tangible cultural heritage. Observe, research, and write about cultural landscapes, gain an understanding of cultural, historical, and natural dynamics of the (built) environment, and become acquainted with aspects of cultural conservation and landscape preservation nationally and internationally.",
            "id": "LANDARC 677",
            "parent": "LANDARC",
            "title": "CULTURAL RESOURCE PRESERVATION AND LANDSCAPE HISTORY"
        }
    },
    {
        "data": {
            "description": "Restoration is an approach to the conservation of native species, plant communities, and ecosystems. It is an interdisciplinary global enterprise practiced by private and public sector professionals and dedicated volunteers of all ages. Covers both the theory and practice of restoration ecology and examine the current opportunities, challenges, and controversies that underlie the field. The goal may be to preserve nature, but restoration is a fundamentally human enterprise-it is accomplished for and by people. Therefore we cover information from ecology, sociology, and the humanities.",
            "id": "LANDARC 668",
            "parent": "LANDARC",
            "title": "RESTORATION ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Sustainable community planning and design principles aimed at promoting human health and wellbeing as it relates to the quality of the physical environment. Special topics include access to settings that promote physical activity, social interaction and mental restoration; walk- and bikeability; access healthy food, complete streets, place-making, and biophilic design, active living assessment tools, and architectural sustainability certification systems focusing on the health benefits of good community design.",
            "id": "LANDARC 621",
            "parent": "LANDARC",
            "title": "DESIGNING HEALTHY COMMUNITIES SEMINAR"
        }
    },
    {
        "data": {
            "description": "Techniques of enhancement and quantification of remote sensing imagery. Emphasis on processing and analyzing data gathered by airborne and satellite sensors. Techniques to quantitatively analyze data from photography, electro-optical scanners, satellite systems, and radar and passive microwave systems. Applications to: agriculture and forestry, geology and soils, water quality, and urban and regional planning.",
            "id": "CIVENGR/ENVIRST/LANDARC 556",
            "title": "REMOTE SENSING DIGITAL IMAGE PROCESSING"
        }
    },
    {
        "data": {
            "description": "The nature and cultural significance of contemporary methods for the systematic formulation of public policies for community, metropolitan, and state development through comprehensive planning. Historic roots, recent trends and new directions in American planning concepts, institutions and professional specializations.",
            "id": "LANDARC/URBRPL 463",
            "title": "EVOLUTION OF AMERICAN PLANNING"
        }
    },
    {
        "data": {
            "description": "Theories of landscape change in the arts and sciences. Contributions of the scientific method and humanistic frameworks to major issues in landscape architecture.",
            "id": "LANDARC 710",
            "parent": "LANDARC",
            "title": "THEORIES OF LANDSCAPE CHANGE"
        }
    },
    {
        "data": {
            "description": "This course introduces students to the interdisciplinary field of material culture studies. It is intended for students interested in any professional endeavor related to material culture, including careers in museums, galleries, historical societies, historic preservation organizations, and academic institutions. During the semester, students have varied opportunities to engage with and contemplate the material world to which people give meaning and which, in turn, influences their lives. Sessions combine in some way the following: presentations from faculty members and professionals who lecture on a phase of material culture related to his/her own scholarship or other professional work; discussion of foundational readings in the field; visits to collections and sites on campus and around Madison; discussion of readings assigned by visiting presenters or the professors; and exams and short papers that engage material culture topics.",
            "id": "ANTHRO/ARTHIST/DS/HISTORY/LANDARC 264",
            "title": "DIMENSIONS OF MATERIAL CULTURE"
        }
    },
    {
        "data": {
            "description": "This course introduces students to the interdisciplinary field of material culture studies. It is intended for students interested in any professional endeavor related to material culture, including careers in museums, galleries, historical societies, historic preservation organizations, and academic institutions. During the semester, students have varied opportunities to engage with and contemplate the material world to which people give meaning and which, in turn, influences their lives. Sessions combine in some way the following: presentations from faculty members and professionals who lecture on a phase of material culture related to his/her own scholarship or other professional work; discussion of foundational readings in the field; visits to collections and sites on campus and around Madison; discussion of readings assigned by visiting presenters or the professors; and exams and short papers that engage material culture topics.",
            "id": "ANTHRO/ARTHIST/DS/HISTORY/LANDARC 764",
            "title": "DIMENSIONS OF MATERIAL CULTURE"
        }
    },
    {
        "data": {
            "description": "Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Part of a 2-semester sequence withMATH 217; these two courses together are equivalent toMATH 114and221.",
            "id": "MATH 171",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY I"
        }
    },
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics and selected topics in Animal Physiology.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Topics include: selected topics in plant physiology, a survey of the five major kingdoms of organisms, speciation and evolutionary theory, and ecology at multiple levels of the biological hierarchy.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Traces the history and evolution of the American cultural landscape from precolonial times to present. Explores how class, ethnic, and racial inequality have shaped the appearance of the American landscape over time, and how that landscape in turn has affected relationships between people and groups through the present day. Examines extraordinary things (civic structures (like our State Capitol), National Parks, War Memorials) and more ordinary kinds of places (mining towns, cotton plantations, sites of recreation and leisure, and suburban tract housing) to stimulate critical thinking about how these places have served people and groups unequally and disproportionately over time and across space. Considers complex meanings of American spaces and places to different people and groups, stimulating empathy and encouraging participation in a multicultural society.",
            "id": "ARTHIST/ENVIRST/GEOG/HISTORY/LANDARC 239",
            "title": "MAKING THE AMERICAN LANDSCAPE"
        }
    },
    {
        "data": {
            "description": "Types, origins, settings, and structure of wetlands. Physical, biological, and cultural values, uses and assessments. Physical and biological characteristics and dynamics. Protection, management and restoration.",
            "id": "ENVIRST/LANDARC 361",
            "title": "WETLANDS ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Urban design in the 21st century American city explores a new understanding of urban placemaking and development. Explores the intersections of culture, place, and design to critically address how the socioeconomic dynamics that underlie demographic shifts in the U.S. are influencing urban change in the American landscape. Focuses on the evolution and ways by which Latinos shape the built environment, both in the public realm and in the home.",
            "id": "CHICLA/LANDARC 475",
            "title": "LATINO URBANISM: DESIGN AND ENGAGEMENT IN THE AMERICAN CITY"
        }
    },
    {
        "data": {
            "description": "Urban, suburban, and rural environments intersect with the natural environment in important yet complex ways. Cultural as well as biophysical systems influence the structure and function of these environments at both local and regional scales. Exploration of these relationships by analyzing built environments and simulating future design and planning scenarios offer a transdisciplinary foundation for subsequent coursework.",
            "id": "LANDARC 211",
            "parent": "LANDARC",
            "title": "SHAPING THE BUILT ENVIRONMENT"
        }
    },
    {
        "data": {
            "description": "With a focus on public open spaces as shared social places, emphasizes the social dimensions and connectedness of urban design and open space systems through perspectives from allied disciplines, such as landscape architecture, architecture, urban planning, real estate development, urban ecology, civil engineering, and the visual arts. Integrates human activity requirements and experiences with physical (or built) and natural site features. Builds upon technical design skills developed in prior studio work, paying close attention to form-giving, place-making, and sustainability at the site and neighborhood scale.",
            "id": "LANDARC 562",
            "parent": "LANDARC",
            "title": "URBAN DESIGN AND OPEN SPACE SYSTEMS"
        }
    },
    {
        "data": {
            "id": "BIOCORE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "BOTANY",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "DS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "LANDARC",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "STAT",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "LANDARC 668"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "HORT/LANDARC 263"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 152"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 101"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "target": "BOTANY/F&WECOL/ZOOLOGY 460"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "target": "ENVIRST/LANDARC 361"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 151"
        }
    },
    {
        "data": {
            "source": "BOTANY 100",
            "target": "LANDARC 380"
        }
    },
    {
        "data": {
            "source": "BOTANY/F&WECOL/ZOOLOGY 460",
            "target": "F&WECOL/LANDARC/ZOOLOGY 565"
        }
    },
    {
        "data": {
            "source": "CIVENGR/ENVIRST/GEOG 377",
            "target": "ENVIRST/GEOG/LANDARC/URBRPL 532"
        }
    },
    {
        "data": {
            "source": "CIVENGR/ENVIRST/GEOG 377",
            "target": "ENVIRST/LANDARC/SOILSCI 695"
        }
    },
    {
        "data": {
            "source": "DS 221",
            "target": "LANDARC 321"
        }
    },
    {
        "data": {
            "source": "ENVIRST/F&WECOL/GEOG/GEOSCI/GLE/LANDARC 371",
            "target": "CIVENGR/ENVIRST/LANDARC 556"
        }
    },
    {
        "data": {
            "source": "HORT/LANDARC 263",
            "target": "LANDARC 560"
        }
    },
    {
        "data": {
            "source": "LANDARC 211",
            "target": "LANDARC 651"
        }
    },
    {
        "data": {
            "source": "LANDARC 250",
            "target": "LANDARC 380"
        }
    },
    {
        "data": {
            "source": "LANDARC 261",
            "target": "LANDARC 321"
        }
    },
    {
        "data": {
            "source": "LANDARC 261",
            "target": "LANDARC 460"
        }
    },
    {
        "data": {
            "source": "LANDARC 311",
            "target": "LANDARC 511"
        }
    },
    {
        "data": {
            "source": "LANDARC 321",
            "target": "LANDARC 561"
        }
    },
    {
        "data": {
            "source": "LANDARC 321",
            "target": "LANDARC 562"
        }
    },
    {
        "data": {
            "source": "LANDARC 380",
            "target": "LANDARC 381"
        }
    },
    {
        "data": {
            "source": "LANDARC 560",
            "target": "LANDARC 562"
        }
    },
    {
        "data": {
            "source": "LANDARC 562",
            "target": "LANDARC 563"
        }
    },
    {
        "data": {
            "source": "LANDARC 610",
            "target": "LANDARC 611"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 113"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 113",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "ENVIRST/F&WECOL/GEOG/GEOSCI/GLE/LANDARC 371"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "STAT 324"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "STAT 324",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "source": "STAT 371",
            "target": "F&WECOL/LANDARC/ZOOLOGY 565"
        }
    },
    {
        "data": {
            "source": "STAT 371",
            "target": "STAT 324"
        }
    }
]