[
    {
        "data": {
            "description": "Practical introduction to a neglected but socially and economically important field. Interaction of a developing common and federal law with the behavior and interests of businesspersons and consumers.",
            "id": "LAW 749",
            "parent": "LAW",
            "title": "TRADEMARKS"
        }
    },
    {
        "data": {
            "description": "Legislation and regulation play the dominant role in shaping law in the modern American legal system. All lawyers, irrespective of the area of law must understand statutes and regulations. An introduction providing a deeper understanding of these forms of law and the institutions that make this law, and to help them better appreciate the role that lawyers play in the American legal system as it operates in practice. To think like a lawyer, and hence to represent or advise clients, requires an ability to do so in the context of the regulatory state.",
            "id": "LAW 750",
            "parent": "LAW",
            "title": "LEGISLATION AND REGULATION"
        }
    },
    {
        "data": {
            "description": "Overview of the federal income taxation of partnerships, LLCs, and corporations, with a focus on issues of real property ownership and transfers.",
            "id": "LAW 840",
            "parent": "LAW",
            "title": "TAXATION II"
        }
    },
    {
        "data": {
            "description": "Problems in private and governmental practice affected by international relations; the law applicable to questions of recognition and non-recognition of governments and nations; interpretation of treaties and other international agreements; jurisdiction of nations; effect of peace and war; formation, operation and function of various international agreements, and matters of international claims.",
            "id": "LAW 827",
            "parent": "LAW",
            "title": "INTERNATIONAL LAW"
        }
    },
    {
        "data": {
            "description": "Examine the laws that structure the U.S. democratic system, including voting rights, electoral districting, the regulation of political parties, and campaign finance. Addresses the key constitutional principles and federal statutory provisions that govern these areas, with special emphasis on recent legal developments. In addition to covering doctrine, consider the theoretical underpinnings of the electoral system, the role of courts in overseeing the system, and proposals for reform.",
            "id": "LAW 790",
            "parent": "LAW",
            "title": "LAW OF DEMOCRACY"
        }
    },
    {
        "data": {
            "description": "Focuses on Article 9 of the Uniform Commercial Code, Secured Transactions; with some additional emphasis on Article 6, Bulk Sales; and Article 7, Documents of Title.",
            "id": "LAW 736",
            "parent": "LAW",
            "title": "SECURED TRANSACTIONS"
        }
    },
    {
        "data": {
            "description": "Acquisition and nature of private rights in water comparing the riparian and appropriation legal systems; public rights as limitations on private rights, the firming up of rights by grant, contract, compulsory purchase and prescription and the administrative systems for water quality management.",
            "id": "LAW 845",
            "parent": "LAW",
            "title": "WATER RIGHTS LAW"
        }
    },
    {
        "data": {
            "description": "Consumer credit regulation, enforcement of judgments, attachments, garnishments, fraudulent conveyances, assignments for the benefit of creditors, and bankruptcy.",
            "id": "LAW 821",
            "parent": "LAW",
            "title": "BANKRUPTCY LAW"
        }
    },
    {
        "data": {
            "description": "Introduces basic federal estate and gift tax policy, statutes, and planning concepts relevant to estate and trust planning and administration.",
            "id": "LAW 738",
            "parent": "LAW",
            "title": "ESTATE AND GIFT TAXATION"
        }
    },
    {
        "data": {
            "source": "LAW 742",
            "target": "LAW 870"
        }
    },
    {
        "data": {
            "description": "Learn to formulate precise legal issues; analyze complex facts; find relevant law; identify, evaluate, and apply legal rules in creative and nuanced ways; and effectively communicate answers in writing.",
            "id": "LAW 722",
            "parent": "LAW",
            "title": "LEGAL ANALYSIS, ADVOCACY, & WRITING I"
        }
    },
    {
        "data": {
            "id": "LAW",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Learn the basics of the federal legislative process and develop an understanding of the fundamentals of how courts interpret statutes in a variety of areas of law. Focus on applying the courts' techniques, learning to make arguments in favor of or against particular interpretations of a given statute based on the specific techniques courts use, and recognizing the relative strength of different arguments.",
            "id": "LAW 805",
            "parent": "LAW",
            "title": "STATUTORY INTERPRETATION"
        }
    },
    {
        "data": {
            "description": "An introduction to the constitutional law of the United States covering the basic structure of government in the United States, with emphasis on the federal government. Includes the role of the federal courts and the doctrine of judicial review; the rise of federal power, as reflected particularly in shifting definitions of \"interstate commerce,\" the doctrine of separation of powers, with emphasis on current issues of legislative and executive branch authority; and judicial and other limitations on the exercise of authority by the states as well as selected rights protected in the Amendments to the Constitution.",
            "id": "LAW 731",
            "parent": "LAW",
            "title": "CONSTITUTIONAL LAW"
        }
    },
    {
        "data": {
            "description": "Law as a system of social engineering in the economic and social modernization of developing countries. Problems of developing rules with a high probability of inducing behavior likely to lead to modernization.",
            "id": "LAW 981",
            "parent": "LAW",
            "title": "LAW AND MODERNIZATION IN THE DEVELOPING WORLD SEMINAR"
        }
    },
    {
        "data": {
            "description": "Topics reflect interests of instructor and students.",
            "id": "LAW 918",
            "parent": "LAW",
            "title": "SELECTED PROBLEMS IN INTERNATIONAL LAW-SEMINAR"
        }
    },
    {
        "data": {
            "description": "Discussion of the root causes of global environmental problems, the international legal framework and principles, and the role of sustainable development in addressing these environmental issues. Discussion of specific international environmental legal regimes such as biodiversity, movement of hazardous waste, climate change and international trade as well as governance mechanisms, the role of non-state actors and dispute resolution.",
            "id": "LAW 921",
            "parent": "LAW",
            "title": "INTERNATIONAL ENVIRONMENTAL LAW AND POLICY"
        }
    },
    {
        "data": {
            "description": "Introduction to federal appellate practice and procedure. Learn the fundamentals of appellate argument and brief writing, with multiple opportunities to practice and improve these skills.",
            "id": "LAW 814",
            "parent": "LAW",
            "title": "APPELLATE ADVOCACY"
        }
    },
    {
        "data": {
            "description": "Legal and economic aspects of current issues in collective bargaining.",
            "id": "LAW 858",
            "parent": "LAW",
            "title": "COLLECTIVE BARGAINING: THE ARBITRATION PROCESS"
        }
    },
    {
        "data": {
            "description": "Basic legal elements of real estate transfer and finance; options, binder contracts, requirements as to writing, rights and duties between vendor and vendee, basic land contract and mortgage law and remedies, and the real estate recording system.",
            "id": "LAW 732",
            "parent": "LAW",
            "title": "REAL ESTATE TRANSACTIONS I"
        }
    },
    {
        "data": {
            "description": "An introduction to, and skills training in, a number of areas of general law practice. Hone skills in interviewing, counseling, negotiation, and legal writing.",
            "id": "LAW 950",
            "parent": "LAW",
            "title": "LAWYERING SKILLS"
        }
    },
    {
        "data": {
            "description": "Role of the administrative process in society; emphasizes common powers and procedures; relationships among the legislative, judicial, executive and administrative agencies in the development of public policy.",
            "id": "LAW 744",
            "parent": "LAW",
            "title": "ADMINISTRATIVE LAW"
        }
    },
    {
        "data": {
            "description": "Examines the structure and authority of the federal courts and the relationship between those courts and other governmental institutions.",
            "id": "LAW 824",
            "parent": "LAW",
            "title": "FEDERAL JURISDICTION"
        }
    },
    {
        "data": {
            "description": "Topics reflect interests of instructor and students.",
            "id": "LAW 988",
            "parent": "LAW",
            "title": "SELECTED PROBLEMS IN ENVIRONMENTAL LAW-SEMINAR"
        }
    },
    {
        "data": {
            "source": "LAW 722",
            "target": "LAW 723"
        }
    },
    {
        "data": {
            "description": "Intermediate and advanced topics in estate planning; topics reflect interests of available faculty and students.",
            "id": "LAW 771",
            "parent": "LAW",
            "title": "SELECTED TOPICS IN ESTATE PLANNING"
        }
    },
    {
        "data": {
            "description": "Survey of state and local tax law, principally income taxes, sales and use taxes, and property taxes. Explores the typical statutory structures under which these taxes are imposed. Significant emphasis will be given to policy issues faced by state and local governmental bodies.",
            "id": "LAW 868",
            "parent": "LAW",
            "title": "STATE AND LOCAL TAXATION"
        }
    },
    {
        "data": {
            "description": "Regulation of organization and representation of employees; collective bargaining, and employer and union practices; proceedings under the National Labor Relations Act and related federal statutes and analogous state acts.",
            "id": "LAW 745",
            "parent": "LAW",
            "title": "LABOR RELATIONS LAW"
        }
    },
    {
        "data": {
            "description": "Overview of the institutions and entities that create legal documents in the U.S.; how these documents are organized and found in a law library; introduction to common law case analysis. Open only to Law LLM students or Visiting International students in the Law LLM Pathway.",
            "id": "LAW 602",
            "parent": "LAW",
            "title": "LEGAL SOURCES"
        }
    },
    {
        "data": {
            "description": "Law relating to trade regulation and competitive practices; anti-trust and comparable laws dealing with monopoly, restraint of trade, and unfair methods of competition.",
            "id": "LAW 748",
            "parent": "LAW",
            "title": "ANTITRUST"
        }
    },
    {
        "data": {
            "description": "A student-published journal devoted to the intersection of law and gender with issues of race, ethnicity, socioeconomic status, and sexual orientation.",
            "id": "LAW 896",
            "parent": "LAW",
            "title": "WISCONSIN JOURNAL OF LAW, GENDER, AND SOCIETY"
        }
    },
    {
        "data": {
            "description": "Preparation for the Public Defender Project summer externship with the Wisconsin State Public Defender. Covers basic lawyering skills like client interviewing and counseling, investigation and negotiation, and various aspects of criminal defense practice in Wisconsin including initial appearances, preliminary hearings, discovery, sentencing and revocation hearings.",
            "id": "LAW 796",
            "parent": "LAW",
            "title": "CRIMINAL DEFENSE PRACTICE"
        }
    },
    {
        "data": {
            "description": "Marriage and less formal spousal relationships, husband-wife relationships in on-going marriage; divorce and its economic and custody consequences; post-divorce relationships.",
            "id": "LAW/SOCWORK 822",
            "title": "FAMILY LAW: MARRIAGE AND DIVORCE"
        }
    },
    {
        "data": {
            "description": "Remedies of quasi-contract, constructive trust, equitable lien, reformation, etc., to redress enrichment obtained by tort, part performance of contract, duress, or mistake, or under other circumstances making its retention without such redress unfair.",
            "id": "LAW 839",
            "parent": "LAW",
            "title": "REMEDIES"
        }
    },
    {
        "data": {
            "description": "In business planning and business organizations including proprietorships, partnerships, corporations and trusts.",
            "id": "LAW 953",
            "parent": "LAW",
            "title": "SELECTED PROBLEMS IN BUSINESS ORGANIZATION-SEMINAR"
        }
    },
    {
        "data": {
            "source": "LAW 742",
            "target": "LAW 868"
        }
    },
    {
        "data": {
            "description": "Problems under the Securities and Exchange Act and other federal and state regulatory measures; operation of the S.E.C.",
            "id": "LAW 914",
            "parent": "LAW",
            "title": "SECURITIES REGULATION"
        }
    },
    {
        "data": {
            "description": "Law of business corporations; problems of control, management, and procurement and maintenance of capital; an introduction to securities regulation.",
            "id": "LAW 741",
            "parent": "LAW",
            "title": "BUSINESS ORGANIZATIONS: PUBLIC CORPORATIONS"
        }
    },
    {
        "data": {
            "description": "Topics reflect interests of the instructor and students.",
            "id": "LAW 932",
            "parent": "LAW",
            "title": "SELECTED PROBLEMS OF ADMINISTRATIVE LAW-SEMINAR"
        }
    },
    {
        "data": {
            "description": "A journal of legal analysis and commentary. Review select and edit the articles and participate in every stage of the publication process.",
            "id": "LAW 899",
            "parent": "LAW",
            "title": "LAW REVIEW"
        }
    },
    {
        "data": {
            "description": "Introduction to the legal, ethical and public policy dimensions of modern medicine and biomedical research. Informed consent, human experimentation, death and dying, organ transplantation, allocation of scarce resources. May cover reproductive and genetic issues.",
            "id": "LAW 905",
            "parent": "LAW",
            "title": "BIOETHICS AND THE LAW"
        }
    },
    {
        "data": {
            "description": "Topics reflect current issues relevant to the practice of law.",
            "id": "LAW 940",
            "parent": "LAW",
            "title": "LAW AND CONTEMPORARY PROBLEMS"
        }
    },
    {
        "data": {
            "description": "Jurisdiction of courts, state and federal; joinder of claims and parties in civil action, and effect of judgments.",
            "id": "LAW 802",
            "parent": "LAW",
            "title": "CIVIL PROCEDURE II"
        }
    },
    {
        "data": {
            "source": "LAW 742",
            "target": "LAW 840"
        }
    },
    {
        "data": {
            "description": "Survey of state and federal laws affecting a variety of intellectual and creative products.",
            "id": "LAW 752",
            "parent": "LAW",
            "title": "COPYRIGHT LAW"
        }
    },
    {
        "data": {
            "description": "Learn persuasive legal writing and oral presentation skills and the ethics and strategies of effective written and oral advocacy on behalf of a client. Prepare a trial-level brief and an appellate brief and work on legal correspondence and basic transactional drafting skills. Explore advanced legal research sources and refine research skills with projects in a variety of different subject areas and procedural contexts.",
            "id": "LAW 723",
            "parent": "LAW",
            "title": "LEGAL ANALYSIS, ADVOCACY, & WRITING II"
        }
    },
    {
        "data": {
            "description": "Addresses the issues faced by elderly clients and their families and caregivers in the context of legal, medical, social and regulatory concerns.",
            "id": "LAW 773",
            "parent": "LAW",
            "title": "LAW AND THE ELDERLY"
        }
    },
    {
        "data": {
            "description": "Introduction to European Union (EU) law, including the relationship between EU and Member State law, EU institutions, the law of the common market (i.e., free movement of goods, persons, services and capital) and environmental law and social policy.",
            "id": "LAW 942",
            "parent": "LAW",
            "title": "EUROPEAN UNION LAW"
        }
    },
    {
        "data": {
            "description": "The ethical and professional responsibility of practicing lawyers.",
            "id": "LAW 850",
            "parent": "LAW",
            "title": "PROFESSIONAL RESPONSIBILITIES"
        }
    },
    {
        "data": {
            "description": "The relationship of parent and child; the rights of unmarried mothers and fathers and their children; parental rights to custody vis a vis third parties; parents' rights to make decisions affecting children; neglect; termination of parental rights; the foster care system and adoption.",
            "id": "LAW/SOCWORK 823",
            "title": "FAMILY LAW: PARENT AND CHILD"
        }
    },
    {
        "data": {
            "description": "Covers the Wisconsin Rules of Professional Conduct as specifically applied to criminal defense practice. Topics covered include perjured testimony, confidentiality, client counseling, witness interviewing, handling evidence, hard bargaining, statements regarding judicial qualifications and contempt of court.",
            "id": "LAW 798",
            "parent": "LAW",
            "title": "PROFESSIONAL RESPONSIBILITY AND CRIMINAL PRACTICE"
        }
    },
    {
        "data": {
            "description": "Various important procedural problems arising in federal and state criminal proceedings.",
            "id": "LAW 860",
            "parent": "LAW",
            "title": "ADVANCED CRIMINAL PROCEDURE"
        }
    },
    {
        "data": {
            "description": "Topics reflect interests of instructor and students.",
            "id": "ECON/LAW 961",
            "title": "SELECTED PROBLEMS IN TRADE REGULATION-SEMINAR"
        }
    },
    {
        "data": {
            "source": "LAW 732",
            "target": "LAW 838"
        }
    },
    {
        "data": {
            "description": "Overview of major environmental statutes, regulations and cases, and their implementation by regulatory agencies, as well as currently applicable common-law doctrine.",
            "id": "LAW 848",
            "parent": "LAW",
            "title": "INTRODUCTION TO ENVIRONMENTAL LAW"
        }
    },
    {
        "data": {
            "description": "Presents environmental statutes, cases, and regulations, and discusses their implementation. Focuses on both law and practice. Provides a survey of substantive environmental law and their application in permitting, commercial transactions and enforcement.",
            "id": "LAW 989",
            "parent": "LAW",
            "title": "ENVIRONMENTAL LAW AND PRACTICE"
        }
    },
    {
        "data": {
            "description": "An introduction to the American common law tradition and to the American legal system. Open only to Law LLM students or Visiting International students in the Law LLM Pathway.",
            "id": "LAW 601",
            "parent": "LAW",
            "title": "INTRODUCTION TO AMERICAN LAW"
        }
    },
    {
        "data": {
            "description": "Rights of citizens against state and federal governments; the nature of due process and the equal protection of the law; the protection of freedom from invidious discrimination; the Civil Rights Acts; freedoms of expression, association, and religion.",
            "id": "LAW 740",
            "parent": "LAW",
            "title": "CONSTITUTIONAL LAW II"
        }
    },
    {
        "data": {
            "description": "Development of the modern civil action including pleading, discovery, and the pretrial conference; the trial; motions after verdict and judgment; appeals; state and federal procedures.",
            "id": "LAW 714",
            "parent": "LAW",
            "title": "CIVIL PROCEDURE"
        }
    },
    {
        "data": {
            "description": "Law of agency, partnership, limited liability companies, and closely held corporations.",
            "id": "LAW 817",
            "parent": "LAW",
            "title": "BUSINESS ORGANIZATIONS: PARTNERSHIP, LLC, AND CLOSELY HELD CORPORATIONS"
        }
    },
    {
        "data": {
            "description": "Develop a strong understanding of Wisconsin Marital Property law and how its principles impact ownership of property. Compare marital property law to common law ownership and review the differences between marital property and division in divorce.",
            "id": "LAW 737",
            "parent": "LAW",
            "title": "MARITAL PROPERTY"
        }
    },
    {
        "data": {
            "description": "The skills that lawyers use up until the time of trial.",
            "id": "LAW 849",
            "parent": "LAW",
            "title": "PRE-TRIAL ADVOCACY"
        }
    },
    {
        "data": {
            "description": "Survey of the laws of patents, copyrights, trade secrets, trademarks. Discussion of relationship of these laws to the laws of property, trade regulation, and privacy. Exploration of competing or complementary policy rationales for each intellectual property area.",
            "id": "LAW 753",
            "parent": "LAW",
            "title": "INTRODUCTION TO INTELLECTUAL PROPERTY LAW"
        }
    },
    {
        "data": {
            "description": "International taxation concepts and issues including jurisdiction rules, tax avoidance and evasion, fiscal relations between industrialized countries and less developed countries; host country taxation of foreign persons and home country taxation of foreign income.",
            "id": "LAW 870",
            "parent": "LAW",
            "title": "INTERNATIONAL TAX"
        }
    },
    {
        "data": {
            "description": "Survey of the immigration law of the United States.",
            "id": "LAW 873",
            "parent": "LAW",
            "title": "IMMIGRATION LAW"
        }
    },
    {
        "data": {
            "description": "Substantive law of property, life and liability insurance, including study of the fire and automobile forms; regulation of insurance companies, policies and practices.",
            "id": "LAW 825",
            "parent": "LAW",
            "title": "INSURANCE LAW"
        }
    },
    {
        "data": {
            "description": "Provides an overview of the complex laws governing the health care industry and the practical realities of lawyers specializing in this practice area. Covers the key laws and regulations that comprise the practice of health care law.",
            "id": "LAW 935",
            "parent": "LAW",
            "title": "HEALTH LAW"
        }
    },
    {
        "data": {
            "description": "The growth, development, and implementation of equal employment opportunity law.",
            "id": "LAW 765",
            "parent": "LAW",
            "title": "EQUAL EMPLOYMENT LAW"
        }
    },
    {
        "data": {
            "description": "Interdisciplinary health advocacy clinic providing broad individual and system advocacy for patients facing life changing health events. Advocacy topics include: medical decision-making, insurance, medical debt, disability and related policies and laws.",
            "id": "LAW/NURSING 768",
            "title": "HEALTH JUSTICE CLINIC"
        }
    },
    {
        "data": {
            "description": "Theory and research on the social origins, processes and effects of law; examination of law-related behavior, legal institutions, law and social structure, and law and social change; linkage to contemporary theoretical and political debates.",
            "id": "LAW/LEGALST/SOC 641",
            "title": "SOCIOLOGY OF LAW"
        }
    },
    {
        "data": {
            "description": "Presents the basics of finance for business lawyers, and the law and legal strategy surrounding the creation of debt instruments.",
            "id": "LAW 954",
            "parent": "LAW",
            "title": "CORPORATE FINANCE LAW"
        }
    },
    {
        "data": {
            "description": "Introduction to torts. Roughly defined as civil wrong, independent of contract. Liability for physical and emotional harms inflicted by intentional misconduct or negligence, or without fault, and development of concepts and techniques in analyzing and solving tort problems.",
            "id": "LAW 715",
            "parent": "LAW",
            "title": "TORTS"
        }
    },
    {
        "data": {
            "description": "Legal institutions affecting international transactions with a focus on U.S. laws and the principal treaties involved.",
            "id": "LAW 871",
            "parent": "LAW",
            "title": "INTERNATIONAL TRADE LAW"
        }
    },
    {
        "data": {
            "description": "Exploration of a number of different legal traditions and an investigation of how societal expectations of law change depending on its historical legal tradition.",
            "id": "LAW 818",
            "parent": "LAW",
            "title": "COMPARATIVE LAW"
        }
    },
    {
        "data": {
            "description": "Provides introduction to international commercial arbitration, arguably the most important means of resolving international commercial disputes. Learn and apply the rules governing international commercial arbitration, research and write a professional-quality claimant's memorandum based on a current problem.",
            "id": "LAW 917",
            "parent": "LAW",
            "title": "INTERNATIONAL COMMERCIAL ARBITRATION"
        }
    },
    {
        "data": {
            "description": "Examines the link between climate change and human rights, the pros and cons of using a human rights approach and the specific challenges that climate change poses to the international legal system such as the disappearance of states, displacement and mass movement of people, and adjudication. Discuss the plight of vulnerable populations especially, indigenous peoples, women, and climate \"refugees\" within a human rights framework.",
            "id": "LAW 920",
            "parent": "LAW",
            "title": "CLIMATE CHANGE, HUMAN RIGHTS, AND THE ENVIRONMENT"
        }
    },
    {
        "data": {
            "description": "Acquire an understanding of legal agreements associated with real estate investing, legal aspects of real estate financing, the zoning process, and documentation of real estate entitlements.",
            "id": "LAW 838",
            "parent": "LAW",
            "title": "REAL ESTATE TRANSACTIONS II"
        }
    },
    {
        "data": {
            "description": "Explores American constitutional law governing speech, association, the press, and religion.  It focuses on the leading First Amendment cases that have created the most expansive protection for expression anywhere in the world. Consider not only the reasons for protecting these rights, but also countervailing interests - such as public safety, national security, and equality - that may justify restrictions on expression. Consider arguments that the U.S. Supreme Court has gone too far in protecting some forms of speech and association, such as false statements, sexually explicit materials, hate speech, and corporate political spending.",
            "id": "LAW 901",
            "parent": "LAW",
            "title": "FIRST AMENDMENT"
        }
    },
    {
        "data": {
            "description": "Examines a range of processes encountered by lawyers, including negotiation of, inter alia, injury claims, criminal charges, family disputes, and commercial disputes, as well as participation of their parties (mediators, judges).",
            "id": "LAW 743",
            "parent": "LAW",
            "title": "NEGOTIATIONS"
        }
    },
    {
        "data": {
            "description": "Independent readings from a list prepared by instructor. Subject matter determined by agreement between instructor and student.",
            "id": "LAW 991",
            "parent": "LAW",
            "title": "DIRECTED READING"
        }
    },
    {
        "data": {
            "description": "Problems inherent in international commercial transactions; risks, benefits, and assumptions underlying business with or in a foreign country; international commercial transactions, investments and claims.",
            "id": "LAW 828",
            "parent": "LAW",
            "title": "INTERNATIONAL BUSINESS TRANSACTIONS"
        }
    },
    {
        "data": {
            "description": "Topics reflect interests of instructor and students.",
            "id": "LAW 926",
            "parent": "LAW",
            "title": "SELECTED PROBLEMS OF TORT LAW-SEMINAR"
        }
    },
    {
        "data": {
            "description": "Survey of common uses of trusts in estate planning, with a focus on drafting of appropriate provisions to accomplish estate planning objectives.",
            "id": "LAW 772",
            "parent": "LAW",
            "title": "THE USE OF TRUSTS IN ESTATE PLANNING"
        }
    },
    {
        "data": {
            "description": "Legal, ethical, social and public policy questions raised by modern scientific and technological developments, with a particular focus on biotechnology.",
            "id": "LAW 906",
            "parent": "LAW",
            "title": "LAW, SCIENCE AND BIOTECHNOLOGY SEMINAR"
        }
    },
    {
        "data": {
            "description": "Techniques involved in the examination of witnesses, including the lawyer's preparation, the preparation conference with the witness, direct examination, cross examination, objections, and the introduction of exhibits. Teaching methods include demonstrations by trial lawyers and practice sessions by the students under the supervision of trial lawyers.",
            "id": "LAW 852",
            "parent": "LAW",
            "title": "TRIAL ADVOCACY"
        }
    },
    {
        "data": {
            "description": "Provides hands-on lawyering experiences with real people - clients, victims, witnesses, family members, lawyers, and judges - enhancing understanding of the roles and responsibilities of practicing attorneys.",
            "id": "LAW 854",
            "parent": "LAW",
            "title": "CLINICAL PROGRAM"
        }
    },
    {
        "data": {
            "description": "Public and private laws affecting international trade and investment flows between North America and East Asia as well as other issues that affect relations between the countries.",
            "id": "LAW 872",
            "parent": "LAW",
            "title": "LEGAL ISSUES INVOLVING NORTH AMERICA AND EAST ASIA"
        }
    },
    {
        "data": {
            "description": "Faculty supervision on research; scope and subject arranged between student and faculty.",
            "id": "LAW 990",
            "parent": "LAW",
            "title": "DIRECTED RESEARCH"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Creation of promissory liability; interpretation of words and conduct; exchange, reliance or formality as necessary for creation of promissory liability; remedies for breach of contract; unfairness as a reason for avoiding contractual liability.",
            "id": "LAW 711",
            "parent": "LAW",
            "title": "CONTRACTS"
        }
    },
    {
        "data": {
            "description": "Problems in defining what conduct should be subject to criminal penalties; the limitations of criminal law as a means for prevention and control of undesirable conduct.",
            "id": "LAW 726",
            "parent": "LAW",
            "title": "CRIMINAL LAW AND PROCEDURE"
        }
    },
    {
        "data": {
            "description": "Limitations imposed upon the use of privately owned land by the court-made law of nuisance, by private covenant, and by public action; master plan, official map, subdivision regulation, zoning, and urban redevelopment.",
            "id": "LAW/URBRPL 830",
            "title": "LAND USE CONTROLS"
        }
    },
    {
        "data": {
            "description": "Focus on understanding the role of the prosecutor in the criminal justice system; developing skills related to making informed charging decisions, drafting charging instruments, effective motion practice, and representation of the state in various court proceedings such as initial appearances, guilty pleas, sentencing, and post-conviction motions.",
            "id": "LAW 797",
            "parent": "LAW",
            "title": "PROSECUTION FUNCTION"
        }
    },
    {
        "data": {
            "description": "Use of statutes and legislative materials in litigation and decision; problems of the lawyer in the interpretation of statutes, in representation of the client before legislative bodies, and in the presentation and argument of statutory authorities to a court.",
            "id": "LAW 746",
            "parent": "LAW",
            "title": "LEGISLATION"
        }
    },
    {
        "data": {
            "description": "Foundation for advanced courses. Personal property and real property (land law); concepts of ownership and transfer of chattels (personal property), such as bailments, liens, pledges and gifts; historical introduction to law of real property precedes detailed study of nature of various ownership interests in land, called estates; landlord-tenant law; some preliminary treatment of land transfer (conveyancing).",
            "id": "LAW 724",
            "parent": "LAW",
            "title": "PROPERTY"
        }
    },
    {
        "data": {
            "description": "Study the allocation of authority within and between state and local governments. Begin with analysis of state constitutions and the three branches of state government. Study how state and local governments interact, covering home rule and intrastate preemption as well as conflicts between localities. Analyze how local governments are financed. Consider the practical, normative, and theoretical implications of current doctrines and policies and explore how state and local government law plays out in the context of contemporary disputes, including over housing, education, and more.",
            "id": "LAW 795",
            "parent": "LAW",
            "title": "STATE AND LOCAL GOVERNMENT LAW"
        }
    },
    {
        "data": {
            "description": "Topics reflect interests of instructor and students.",
            "id": "LAW 939",
            "parent": "LAW",
            "title": "SELECTED PROBLEMS IN FAMILY LAW-SEMINAR"
        }
    },
    {
        "data": {
            "description": "Practice of criminal corrections and the law governing it; probation, parole, rehabilitative efforts, prison administration, and legal and administrative procedures for testing the propriety of restrictions.",
            "id": "LAW 945",
            "parent": "LAW",
            "title": "LAW AND CORRECTIONAL INSTITUTIONS-SEMINAR"
        }
    },
    {
        "data": {
            "source": "LAW 731",
            "target": "LAW 739"
        }
    },
    {
        "data": {
            "description": "Principles of accounting for lawyers.",
            "id": "LAW 811",
            "parent": "LAW",
            "title": "ACCOUNTING FOR LAWYERS"
        }
    },
    {
        "data": {
            "description": "Legal and public policy issues relating to public sector unionism in a multiplicity of jurisdictions, including representation questions, scope of bargaining, limitations on the right to strike, impasse procedures, and grievance arbitration.",
            "id": "LAW 955",
            "parent": "LAW",
            "title": "PUBLIC SECTOR LABOR RELATIONS LAW SEMINAR"
        }
    },
    {
        "data": {
            "description": "Basic trial skills and competition practice that vary by topic; may include combination of traditional lectures, classroom demonstrations, and weekly sessions where you work closely with faculty members, lawyers, and judges. Prepare for mock trial competition.",
            "id": "LAW 853",
            "parent": "LAW",
            "title": "MOCK TRIAL"
        }
    },
    {
        "data": {
            "description": "Issues related to estate planning; including function of the lawyer, ethical issues, estates not subject to tax, basic elements of tax-oriented planning, living trusts, health care issues, gift strategies.",
            "id": "LAW 957",
            "parent": "LAW",
            "title": "INTRODUCTION TO ESTATE PLANNING"
        }
    },
    {
        "data": {
            "description": "Rules applied by courts in recognizing and enforcing rights involving elements which occurred in a sister state or foreign country.",
            "id": "LAW 820",
            "parent": "LAW",
            "title": "CONFLICT OF LAWS"
        }
    },
    {
        "data": {
            "description": "Topics reflect interests of instructor and students.",
            "id": "LAW 915",
            "parent": "LAW",
            "title": "SELECTED PROBLEMS IN CRIMINAL JUSTICE ADMINISTRATION SEMINAR"
        }
    },
    {
        "data": {
            "description": "Provides an introduction to international human law. Examines its history, evolution, structure, remedies and effectiveness and the relationship with other areas of international law. Discussion of legal and institutional framework at international and regional levels-UN human rights institutions (Charter-based and treaty-based) and regional systems of human rights.",
            "id": "LAW 919",
            "parent": "LAW",
            "title": "INTERNATIONAL HUMAN RIGHTS LAW"
        }
    },
    {
        "data": {
            "description": "Federal income taxation; basic rules, theory and policy.",
            "id": "LAW 742",
            "parent": "LAW",
            "title": "TAXATION I"
        }
    },
    {
        "data": {
            "description": "A student published law journal dealing with legal issues having significant international aspects. Each volume is comprised of student case notes and comments as well as articles by legal scholars and practitioners.",
            "id": "LAW 895",
            "parent": "LAW",
            "title": "WISCONSIN INTERNATIONAL LAW JOURNAL"
        }
    },
    {
        "data": {
            "description": "Represent people in prison in Wisconsin seeking relief from excessive sentences; may include people suffering from severe mental illness. Interview clients at correctional institutions, conduct legal and factual research, draft letters and motions, and possibly deliver oral argument in court; work on motions for sentence modification, petitions for sentence adjustment, and parole advocacy; reflect on the lawyer's role in the criminal legal system, explore the causes of the disparate impact of criminal punishment on marginalized populations.",
            "id": "LAW 862",
            "parent": "LAW",
            "title": "LEGAL ASSISTANCE TO INCARCERATED PEOPLE"
        }
    },
    {
        "data": {
            "description": "Survey of the law of industrial property, including the law of patents and trade secrets.",
            "id": "LAW 751",
            "parent": "LAW",
            "title": "PATENT LAW"
        }
    },
    {
        "data": {
            "description": "Examination of legal and real-world aspects of transmission of property, usually at death. Covers such topics as intestate succession (dying without a will), wills, trusts and will substitutes, limitations on the disposition of assets and the impact of the Marital Property Act, powers of attorney and end-of-life decision making, and basic issues in the taxation of gifts and transfers at death. In addition to legal fundamentals, strong focus on legal practice-i.e., on how the law plays out on the ground.",
            "id": "LAW 734",
            "parent": "LAW",
            "title": "TRUSTS AND ESTATES"
        }
    },
    {
        "data": {
            "description": "Various aspects of criminal procedure and criminal justice administration. Constitutional limitations upon criminal justice practices.",
            "id": "LAW 725",
            "parent": "LAW",
            "title": "INTRODUCTION TO CRIMINAL PROCEDURE"
        }
    },
    {
        "data": {
            "description": "Select topics relating to the study of local, state, or federal constitutional law.",
            "id": "LAW 904",
            "parent": "LAW",
            "title": "SELECTED PROBLEMS IN CONSTITUTIONAL LAW"
        }
    },
    {
        "data": {
            "description": "Provides an understanding of the internal workings of Islamic law at its theoretical roots. Analyzes the various methodologies that are represented in Islamic legal literature, identify modern manifestations of these methodologies in contemporary Muslim discourses. Attention to the specific doctrinal areas of Islamic family law and criminal law. Contextualizes the subject of Islamic law within various governmental and constitutional structures, beginning with the classical period, continuing through colonialism and reaching into the present day.",
            "id": "LAW 785",
            "parent": "LAW",
            "title": "INTRODUCTION TO ISLAMIC LAW & JURISPRUDENCE"
        }
    },
    {
        "data": {
            "description": "Concepts of relevancy and policy in admission of evidence; hearsay, opinions, and other exclusionary rules; examination of witnesses, judicial notice, and procedural considerations.",
            "id": "LAW 801",
            "parent": "LAW",
            "title": "EVIDENCE"
        }
    },
    {
        "data": {
            "description": "Topics reflect interests of instructor and students.",
            "id": "LAW 928",
            "parent": "LAW",
            "title": "SELECTED PROBLEMS IN LAND LAW-SEMINAR"
        }
    },
    {
        "data": {
            "description": "Topics reflect interests of instructor and students.",
            "id": "LAW 922",
            "parent": "LAW",
            "title": "SELECTED PROBLEMS IN JURISPRUDENCE-SEMINAR"
        }
    },
    {
        "data": {
            "description": "Nature of the obligations assumed by entering a contract; the power of parties to control this obligation; rights of those not a party to a contract.",
            "id": "LAW 721",
            "parent": "LAW",
            "title": "ADVANCED CONTRACTS"
        }
    },
    {
        "data": {
            "description": "A unique, hands-on opportunity to participate in the many facets of legal practice, including (but not limited to) litigation, drafting, policy creation and implementation, and the regulatory process. Under the supervision of on-site externship supervisory attorneys, and through reflection led by Law School faculty, gain first-hand understanding of working in the legal community.",
            "id": "LAW 855",
            "parent": "LAW",
            "title": "FIELD PLACEMENT"
        }
    },
    {
        "data": {
            "description": "Major problems especially in large urban areas. Specific aspects of the police function, such as their role in responding to serious deviant conduct, to self-destructive behaviour, to community conflict, and to the need for protecting constitutional rights and democratic processes. Problems that arise in defining police authority, in reviewing and controlling police discretion, and in seeking to achieve accountability of the police to the citizenry.",
            "id": "LAW 760",
            "parent": "LAW",
            "title": "ROLE OF THE POLICE IN A FREE SOCIETY"
        }
    },
    {
        "data": {
            "source": "LAW 731",
            "target": "LAW 740"
        }
    },
    {
        "data": {
            "description": "The study of the relationships between Federal, state, and tribal governments, the source and scope of their respective sovereignties, and time.",
            "id": "LAW 730",
            "parent": "LAW",
            "title": "FEDERAL LAW AND INDIAN TRIBES"
        }
    },
    {
        "data": {
            "description": "Practice and refine research, writing, and revision specific to the appeal process. Participate in simulated appellate oral arguments and receive feedback and coaching.",
            "id": "LAW 815",
            "parent": "LAW",
            "title": "MOOT COURT"
        }
    },
    {
        "data": {
            "description": "Covers the Free Exercise Clause and the Establishment Clause of the First Amendment to the U.S. Constitution.",
            "id": "LAW 739",
            "parent": "LAW",
            "title": "RELIGION AND THE CONSTITUTION"
        }
    },
    {
        "data": {
            "description": "Uses simulated practice scenarios to teach students how to analyze the law and convey that legal analysis in a manner that is precise, accurate, clear, and concise.",
            "id": "LAW 808",
            "parent": "LAW",
            "title": "ADVANCED LEGAL WRITING"
        }
    }
]