[
    {
        "data": {
            "description": "An examination of intellectual freedom in the United States including censorship, minors' rights, the Internet, privacy, and copyright with focus on theoretical questions related to the First Amendment to the U.S. Constitution, and historical developments.",
            "id": "LEGALST/LIS 645",
            "title": "INTELLECTUAL FREEDOM"
        }
    },
    {
        "data": {
            "description": "Engage in service learning through direct work with patients in the Community Resource Navigator Program. Develop a better understanding of how social determinants of health equity affect peoples' lives. Partner with patients to identify social and legal services, assist patients in connecting to needed resources, follow up with patients to be sure that the connection was made and evaluate the quality of the resources provided. Reflect on experiences in the clinic and further explore how social location impacts health, legal and social service delivery. Working directly in local primary care clinics will provide the opportunity to communicate directly with the health care team to problem solve barriers patients are facing in accessing resources for their social needs.",
            "id": "LEGALST 473",
            "parent": "LEGALST",
            "title": "HEALTH IMPACTS OF UNMET SOCIAL NEEDS"
        }
    },
    {
        "data": {
            "description": "Examines fundamental questions about the nature and content of law, addressing both analytic and normative jurisprudence. Questions in analytic jurisprudence include: What does it mean for something to be the law? Why are some things a matter of law, while others are not? What is the relationship between law and morality? Is the law exhausted by the meaning of words in constitutions and statutes? Questions of normative jurisprudence concern the proper content of law, such as, what should the law permit, prohibit, and promote? These questions are examined by looking at a number of topics that are at issue in U.S. (and other nations') laws. These will include interpreting criminal law statutes, policies promoting public welfare, and the justifications for property, especially intellectual property rights.",
            "id": "LEGALST 407",
            "parent": "LEGALST",
            "title": "JURISPRUDENCE AND SOCIAL ISSUES"
        }
    },
    {
        "data": {
            "description": "Examines the development of prisons from the ancient Mediterranean world to the present in the US and Europe. Pays particular attention to the way in which imprisonment has been used against marginalized populations. Examines the development of carceral tactics across a number of registers, including the prison as an ancient political tactic, the economic logic of early modern debtors' prisons, the relationship of prisons and workhouses to forms of capitalism, prisons and colonial expansion, the relationship between mass incarceration and democratic forms of government, as well as the connections between the abolition of slavery and modern carceral practices. Also looks at the legal and constitutional limitations that have been put on imprisonment by the American legal system. Relies on interdisciplinary approaches to the study of prisons, including History, law, literature, and political theory.",
            "id": "HISTORY/LEGALST 235",
            "title": "PRISONS: FROM ANTIQUITY TO SUPERMAX"
        }
    },
    {
        "data": {
            "description": "Examines the legal and social development and implications of laws governing sexual behavior, human reproduction, media, privacy, and topics related to sexuality, sex and gender. Includes historical analyses of laws connected to present day regulations of sexuality, demonstrating the origins of many of the world's most frequently debated civil rights issues. Chief focus on the United States legal system, with some content including examinations of institutions around the world. Investigates taken-for-granted knowledge and assumptions about sexuality and look at legal, cultural and social constructions of sex in society. Covers intersectional social implications, including race, (dis)ability, class, etc. Topics include: obscenity, pornography, sex work, sexual surrogacy, birth control, abortion, sex education, sexual violence, sex offenders, sexual citizenship rights, trans and intersex legal topics.",
            "id": "GEN&WS/LEGALST/SOC 406",
            "title": "LAW, SEXUALITY, & SOCIETY"
        }
    },
    {
        "data": {
            "description": "Investigates how the systems of incarceration and education operate alongside, within, around and through one another. Provides a historical examination of how education and incarceration have interacted. Examines how prisons operate as 'teaching institutions,' what it teaches all of us impacted by it, and what interventions have been designed to facilitate particular kinds of learning. Presents firsthand accounts of those who work and live in the carceral system currently.",
            "id": "CURRIC/EDPOL/LEGALST 250",
            "title": "INCARCERATION AND EDUCATION"
        }
    },
    {
        "data": {
            "description": "Study of evidentiary causes of wrongful convictions, including eyewitness misidentifications, false confessions, the use of jailhouse informants, and flaws in forensic science. Procedural and institutional causes of wrongful convictions, and within this context, question whether constitutional rights adequately protect against illegitimate outcomes. Explore potential ways to broaden conceptions of wrongful convictions, looking at mass surveillance, mass prosecution, mass conviction, sentencing severity, and the system's racially disproportionate impact at all intercept points.",
            "id": "LEGALST 325",
            "parent": "LEGALST",
            "title": "WRONGFUL CONVICTIONS"
        }
    },
    {
        "data": {
            "description": "Surveys the development of American law from the Civil War to the early Twenty-First Century. After a review of the U.S. Constitution and its modification by the Civil War amendments, examine the legal dimensions of such topics as race relations and the Civil Rights movement, the growth of modern business, the New Deal, labor rights, the women's movement, the individual rights revolution of the postwar period, and the contemporary conservative reaction. Emphasis on how law interacts with political, social, and cultural change.",
            "id": "HISTORY/LEGALST 262",
            "title": "AMERICAN LEGAL HISTORY, 1860 TO THE PRESENT"
        }
    },
    {
        "data": {
            "description": "A review of the interaction of law (judicial decisions, legislation, administrative actions) with public policy by studying the approaches used to resolve a number of significant issues by use of law and examining the actual impact of such efforts.",
            "id": "LEGALST 444",
            "parent": "LEGALST",
            "title": "LAW IN ACTION"
        }
    },
    {
        "data": {
            "description": "A study of immigration, crime, and border enforcement, engaging both historical and present-day debates, focusing on Latino immigration and the U.S.-Mexico border.",
            "id": "CHICLA/LEGALST/SOC 443",
            "title": "IMMIGRATION, CRIME, AND ENFORCEMENT"
        }
    },
    {
        "data": {
            "description": "Addresses a variety of issues linking various humanities perspectives to the central themes of law and legal institutions.",
            "id": "LEGALST 450",
            "parent": "LEGALST",
            "title": "TOPICS IN LEGAL STUDIES AND THE HUMANITIES"
        }
    },
    {
        "data": {
            "description": "Addresses a variety of issues linking various social sciences perspectives to the central themes of law and legal institutions.",
            "id": "LEGALST 400",
            "parent": "LEGALST",
            "title": "TOPICS IN LEGAL STUDIES AND THE SOCIAL SCIENCES"
        }
    },
    {
        "data": {
            "description": "An examination of ethnicity, race, and justice, with a specific emphasis on US Latinos, the largest minority group in the United States.",
            "id": "CHICLA/LEGALST/SOC 440",
            "title": "ETHNICITY, RACE, AND JUSTICE"
        }
    },
    {
        "data": {
            "description": "Day-to-day functioning of the elements of the criminal justice system in the U.S. Nature of crime in the U.S., ideas about causes and solutions. Emphasis on the sociology of the components of criminal justice system--organization and roles of police, lawyers, court and correctional personnel.",
            "id": "LEGALST/SOC 131",
            "title": "CRIMINAL JUSTICE IN AMERICA"
        }
    },
    {
        "data": {
            "description": "Directed study in legal studies.",
            "id": "LEGALST 699",
            "parent": "LEGALST",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Examines both physiological and social processes relating to gender and health across the lifespan among cisgender, transgender, and non-binary individuals. Examples of topics include hormonal processes, reproductive anatomy  physiology, sexuality, sexual pleasure, chronic illness, depression, and sexual violence. A primary course objective is for students to connect information about their bodies and personal health to larger social and political contexts. In particular, considers how health and health disparities are shaped by multiple kind of social inequalities, particularly inequalities based on gender.",
            "id": "GEN&WS 103",
            "parent": "GEN&WS",
            "title": "GENDER, WOMEN, BODIES, AND HEALTH"
        }
    },
    {
        "data": {
            "description": "Examines individual privacy and government information collection in law enforcement, security, public health, administrative law, and other contexts from a variety of disciplinary perspectives.",
            "id": "LEGALST/LIS 460",
            "title": "SURVEILLANCE, PRIVACY, AND POLICE POWERS"
        }
    },
    {
        "data": {
            "description": "Examines punishment across a vast range of historical traditions, examining how wrongdoing and punishment have been figured in law, literature, art and philosophy. Examines ancient, medieval and modern traditions.",
            "id": "HISTORY/LEGALST 426",
            "title": "THE HISTORY OF PUNISHMENT"
        }
    },
    {
        "data": {
            "description": "Examines several legal issues confronting students and educators within the U.S. education system with a particular focus on race discrimination. Examines how civil rights laws and constitutional provisions can help create more equitable schooling experiences for students and educators from historically marginalized populations. Identifies pragmatic approaches to the law, and explores issues of the democratic underpinnings of education.",
            "id": "ELPA/LEGALST 442",
            "title": "CIVIL RIGHTS LAWS, THE COURTS, AND PUBLIC EDUCATION"
        }
    },
    {
        "data": {
            "description": "Examines the development, scope, and effects of the \"True Crime\" genre in the United States. Using literary analysis and legal studies methods, explore various areas of the genre (written, podcasts, documentaries, etc.) and try to find answer as to why we are so compelled by true crime narratives and what true crime's \"truth\" is. Untangle the complex relationship between law and narrative (background on each will be provided) and the various epistemological systems it combines, including the role of science and technology. Gain a detailed understanding of what our culture's relationship to \"real life\" crime narratives tells us about the fundamental and complex role criminality plays in defining us as a society.",
            "id": "ENGL/LEGALST 160",
            "title": "TRUTH AND CRIME"
        }
    },
    {
        "data": {
            "description": "Examines the diverse paths followed by forensic science (including medical jurisprudence or forensic medicine) in various times and places, focusing on the English-speaking world from the nineteenth century until the present. Explore the many ways that law and science have worked together--or at cross-purposes--to generate and assess evidence at the crime scene, in the lab, in the courtroom, and beyond.",
            "id": "HISTORY/LEGALST 477",
            "title": "HISTORY OF FORENSIC SCIENCE"
        }
    },
    {
        "data": {
            "description": "Examines the legal issues related to the policy decisions and delivery of public education (elementary and secondary) in the United States. Learn how law impacts both curriculum development and curricular delivery, explore current legal controversies, constitutional issues, and learn about legal reasoning and analysis. Examines how both legislation and litigation affects public education. Particular attention is paid to law as public policy and the analysis of the same.",
            "id": "EDPOL/ELPA/LEGALST 542",
            "title": "LAW AND PUBLIC EDUCATION"
        }
    },
    {
        "data": {
            "description": "Exploration of civil rights. Question what it means to discriminate (on the basis of race, sex, national origin, religion, and disability), how we might investigate and detect acts of discrimination, and the legal constraints on governmental efforts to remedy discrimination in employment, housing, and voting. Explore the intersection of government power and civil rights. Examine how the government targets groups during times of national crisis. Consider what constitutes acceptable conditions of incarceration for prisoners. Finally, learn police use-of-force doctrine, and discuss the challenge of protecting both officer and civilian safety.",
            "id": "AFROAMER/LEGALST 435",
            "title": "CIVIL RIGHTS: POLICING, PRISONS, VOTING, HOUSING, EMPLOYMENT"
        }
    },
    {
        "data": {
            "description": "Explores environmental studies through a focus on law and legal history. Although its main concentration is on U.S. environmental law, the course will begin and end with broader historical and global perspectives. Topics include a survey of English, European, and early American legal approaches to land use, natural resources, and pollution through World War II as well as an examination of the development and practice of contemporary U.S. environmental law and consideration of the recent emergence of international environmental law.",
            "id": "ENVIRST/HISTORY/LEGALST 430",
            "title": "LAW AND ENVIRONMENT: HISTORICAL AND CONTEMPORARY PERSPECTIVES"
        }
    },
    {
        "data": {
            "description": "Explores the development of Jewish law from antiquity to modernity, with a focus on legal questions related to business practices and ethics. Consider issues ranging from ethical practices in agriculture to how to run a modern multi billion-dollar kosher industry; from the ethics of Jews celebrating Thanksgiving to regulations governing the preparation, consumption, and sale of coffee.",
            "id": "JEWISH/LEGALST/RELIGST 203",
            "title": "JEWISH LAW, BUSINESS, AND ETHICS"
        }
    },
    {
        "data": {
            "description": "Explores the interaction between the criminal justice system and disability. Explores common experiences of persons with disability such as limited access to community services, poverty, and homelessness and the connection of these experiences to mass incarceration. Explores federal disability rights laws and the implementation of these laws in education, legal, and incarceration settings. Introduction to criminal justice reform to address the experiences of persons with disabilities in this system.",
            "id": "LEGALST/RP&SE 135",
            "title": "DISABILITY AND THE CRIMINAL JUSTICE SYSTEM"
        }
    },
    {
        "data": {
            "description": "Field placements and seminar sessions to develop sociological understanding of criminal justice processes. Placement in criminal justice agencies and lectures and discussions applying concepts and theories to field experience.",
            "id": "LEGALST/SOC 694",
            "title": "CRIMINAL JUSTICE FIELD OBSERVATION"
        }
    },
    {
        "data": {
            "description": "Focuses on the intersection between gender, crime and justice from a cross-cultural perspective. The gendered nature of the criminal justice system, female experiences of crime, prosecution and incarceration as well as the extent to which women are victims, offenders, and participants in the criminal justice system will be explored. Special emphasis will be placed on the theoretical implications of offending behavior and the intersection of gender with sexuality, race, ethnicity and class. The goal of this course is to provide a foundation for critically assessing the often controversial issues surrounding race, gender, crime, and criminal justice in society.",
            "id": "GEN&WS/LEGALST/SOC 425",
            "title": "CRIME, GENDER AND JUSTICE"
        }
    },
    {
        "data": {
            "description": "From the perspectives of history and political theory, examines the multiple meanings of the idea of the rule of idea, and its uses in American history. Explore prominent critiques of the rule of law ideal.",
            "id": "HISTORY/LEGALST 459",
            "title": "RULE OF LAW: PHILOSOPHICAL AND HISTORICAL MODELS"
        }
    },
    {
        "data": {
            "description": "Global, interdisciplinary, social science-oriented analysis of gender, race, class and sexuality in relationship to social institutions and movements for social change. Focus on gender and women in institutions such as education, the economy, the family, law, media, medicine, and politics.",
            "id": "GEN&WS 102",
            "parent": "GEN&WS",
            "title": "GENDER, WOMEN, AND SOCIETY IN GLOBAL PERSPECTIVE"
        }
    },
    {
        "data": {
            "description": "Historical and anthropological perspectives on non-state \"law,\" or systems of rules generated by normative orders that lay beyond the state; case studies include the mafia, Tokyo tuna traders' court, orthodox Jewish diamond merchants, California gold miners' courts, Inuit song dueling.",
            "id": "HISTORY/LEGALST 510",
            "title": "LEGAL PLURALISM"
        }
    },
    {
        "data": {
            "description": "Individual study for majors writing senior thesis (nonhonors).",
            "id": "LEGALST 691",
            "parent": "LEGALST",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Individual study for majors writing senior thesis (nonhonors).",
            "id": "LEGALST 692",
            "parent": "LEGALST",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Individual study for majors writing theses for honors degree.",
            "id": "LEGALST 681",
            "parent": "LEGALST",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Individual study for majors writing theses for honors degree.",
            "id": "LEGALST 682",
            "parent": "LEGALST",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Introduction to legal reasoning, writing, and research. Draft memos and briefs based on fictional case files and independent legal research, simulating the practice of law. Topics include precedent, sources of law, reading and interpreting legal texts, objective legal analysis, persuasion, and oral argument.",
            "id": "LEGALST/POLISCI 445",
            "title": "LEGAL WRITING, FROM COUNSELOR TO ADVOCATE"
        }
    },
    {
        "data": {
            "description": "Introduction to the central historical developments of law and legal institutions in the European middle ages (400-1500).",
            "id": "HISTORY/LEGALST 476",
            "title": "MEDIEVAL LAW AND SOCIETY"
        }
    },
    {
        "data": {
            "description": "Introduction to the interdisciplinary study of Chicanas/os in the United States. Become acquainted with recent scholarly literature, paradigms, theories, and debates within Chicana/o studies pertaining to the historical, economic, cultural, and sociopolitical dimensions of the Chicana/o experience in the United States.",
            "id": "CHICLA 201",
            "parent": "CHICLA",
            "title": "INTRODUCTION TO CHICANA/O AND LATINA/O STUDIES"
        }
    },
    {
        "data": {
            "description": "Introduction to the legal process. Examination of the various concepts of law, the perennial problems of the law, legal reasoning, and the nature and function of law and the courts.",
            "id": "LEGALST/POLISCI 217",
            "title": "LAW, POLITICS AND SOCIETY"
        }
    },
    {
        "data": {
            "description": "Introduction to the theory, the politics and the sociology of human rights. Main themes: international human rights legal regime, questions of why human rights have become \"legalized,\" and what the consequences of this legalization are on the ground.",
            "id": "LEGALST 409",
            "parent": "LEGALST",
            "title": "HUMAN RIGHTS IN LAW AND SOCIETY"
        }
    },
    {
        "data": {
            "description": "Legal system, laws, and proposed legislation that have specific impact on the lives of women. Topics investigated in both the social and legal contexts.",
            "id": "GEN&WS/LEGALST 422",
            "title": "WOMEN AND THE LAW"
        }
    },
    {
        "data": {
            "description": "Special seminars are designed for opportunities such as short international seminar courses, the summer forum, and other special opportunities.",
            "id": "LEGALST 600",
            "parent": "LEGALST",
            "title": "SPECIAL TOPICS IN LEGAL STUDIES"
        }
    },
    {
        "data": {
            "description": "Surveys the development of American law down to the U.S. Civil War. Reviews the English historical background, and examines how law changed in colonial America, culminating in the framing of the U.S. Constitution. Explores how territorial expansion, democracy, and slavery shaped nineteenth-century American law. Emphasis is on how law interacts with political, social, and cultural change, with a focus on the origins of modern civil and constitutional rights.",
            "id": "HISTORY/LEGALST 261",
            "title": "AMERICAN LEGAL HISTORY TO 1860"
        }
    },
    {
        "data": {
            "description": "The emphasis is on critical thinking about a broad variety of legal and policy problems that arise because of ever-changing information and communication technologies.",
            "id": "LEGALST/LIS 663",
            "title": "INTRODUCTION TO CYBERLAW"
        }
    },
    {
        "data": {
            "description": "Theory and research on the social origins, processes and effects of law; examination of law-related behavior, legal institutions, law and social structure, and law and social change; linkage to contemporary theoretical and political debates.",
            "id": "LAW/LEGALST/SOC 641",
            "title": "SOCIOLOGY OF LAW"
        }
    },
    {
        "data": {
            "id": "CHICLA",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "GEN&WS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "LEGALST",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "CHICLA 201",
            "target": "CHICLA/LEGALST/SOC 440"
        }
    },
    {
        "data": {
            "source": "CHICLA 201",
            "target": "CHICLA/LEGALST/SOC 443"
        }
    },
    {
        "data": {
            "source": "GEN&WS 102",
            "target": "GEN&WS/LEGALST/SOC 406"
        }
    },
    {
        "data": {
            "source": "GEN&WS 102",
            "target": "GEN&WS/LEGALST/SOC 425"
        }
    },
    {
        "data": {
            "source": "GEN&WS 103",
            "target": "GEN&WS/LEGALST/SOC 425"
        }
    },
    {
        "data": {
            "source": "HISTORY/LEGALST 261",
            "target": "HISTORY/LEGALST 477"
        }
    },
    {
        "data": {
            "source": "HISTORY/LEGALST 261",
            "target": "HISTORY/LEGALST 510"
        }
    },
    {
        "data": {
            "source": "LEGALST/POLISCI 217",
            "target": "HISTORY/LEGALST 477"
        }
    },
    {
        "data": {
            "source": "LEGALST/POLISCI 217",
            "target": "HISTORY/LEGALST 510"
        }
    },
    {
        "data": {
            "source": "LEGALST/POLISCI 217",
            "target": "LEGALST 407"
        }
    },
    {
        "data": {
            "source": "LEGALST/POLISCI 217",
            "target": "LEGALST 409"
        }
    },
    {
        "data": {
            "source": "LEGALST/SOC 131",
            "target": "HISTORY/LEGALST 477"
        }
    },
    {
        "data": {
            "source": "LEGALST/SOC 131",
            "target": "HISTORY/LEGALST 510"
        }
    },
    {
        "data": {
            "source": "LEGALST/SOC 131",
            "target": "LEGALST 325"
        }
    },
    {
        "data": {
            "source": "LEGALST/SOC 131",
            "target": "LEGALST 407"
        }
    },
    {
        "data": {
            "source": "LEGALST/SOC 131",
            "target": "LEGALST 409"
        }
    },
    {
        "data": {
            "source": "LEGALST/SOC 131",
            "target": "LEGALST/SOC 694"
        }
    }
]