[
    {
        "data": {
            "description": "Develop skills in critical reading, logical thinking, use of evidence, and use of library resources. Emphasis on writing in the conventions of specific fields.",
            "id": "LITTRANS 236",
            "parent": "LITTRANS",
            "title": "BASCOM COURSE-IN TRANSLATION"
        }
    },
    {
        "data": {
            "description": "How do we define adventure? Who gets to experience it and on what terms? What role has it played in ancient and modern cultures? What do its ever-changing definitions, heroes, and genres tell us about our evolving values? Address these and similar questions on our intellectual journey through some of the most iconic adventures in Western cultural tradition, from Homer's The Odyssey to Spielberg's Raiders of the Lost Ark, and beyond.",
            "id": "LITTRANS/SLAVIC 259",
            "title": "ADVENTURE IN LITERATURE AND FILM"
        }
    },
    {
        "data": {
            "source": "LITTRANS/SLAVIC 215",
            "target": "LITTRANS/SLAVIC 361"
        }
    },
    {
        "data": {
            "description": "The major novels of Vladimir Nabokov studied in the context of Russian and American literatures. Nabokov as a quintessential artist in exile, whose work explores loss of language, country and home.",
            "id": "ENGL/LITTRANS 223",
            "title": "VLADIMIR NABOKOV: RUSSIAN AND AMERICAN WRITINGS"
        }
    },
    {
        "data": {
            "source": "LITTRANS 204",
            "target": "LITTRANS 202"
        }
    },
    {
        "data": {
            "description": "Survey of Japanese Literature from 1868 to present, including novels and short stories by significant authors.",
            "id": "LITTRANS 264",
            "parent": "LITTRANS",
            "title": "SURVEY OF JAPANESE LITERATURE IN TRANSLATION"
        }
    },
    {
        "data": {
            "description": "Explores the development of the vampire legend in folklore, rumor, literature, cinema, television, and popular culture and in relation to topics such as colonization, race, gender, sexuality, and class.",
            "id": "FOLKLORE/LITTRANS 327",
            "title": "VAMPIRES"
        }
    },
    {
        "data": {
            "description": "Treatment of a specific perific period, genre, theme or movement in Italian literature.",
            "id": "LITTRANS 410",
            "parent": "LITTRANS",
            "title": "IN TRANSLATION: SPECIAL TOPICS IN ITALIAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Introduces students to the major works of Machiavelli through the close reading of his writings in cultural and historical contexts. Discussion and targeted writing assignments will aim at cultivating in students 1) a broad understanding of Machiavelli's principal intellectual attitudes, 2) a deeper understanding of his literary sensibility, and 3) the ability to articulate controversies and complexities surrounding his thought.",
            "id": "ILS/ITALIAN/LITTRANS/POLISCI 365",
            "title": "MACHIAVELLI AND HIS WORLD"
        }
    },
    {
        "data": {
            "source": "LITTRANS 203",
            "target": "LITTRANS 201"
        }
    },
    {
        "data": {
            "description": "Read a series of extraordinary narrative texts from nineteenth-and early twentieth-century France.",
            "id": "LITTRANS 249",
            "parent": "LITTRANS",
            "title": "LITERATURE IN TRANSLATION: NINETEENTH-CENTURY FRENCH MASTERPIECES"
        }
    },
    {
        "data": {
            "description": "Provides in-depth knowledge of the artistic career of the influential Swedish playwright, August Strindberg (1849-1912), and a general knowledge of the literary, artistic, and intellectual history that shaped his artistic production.",
            "id": "LITTRANS/THEATRE 336",
            "title": "IN TRANSLATION: THE DRAMA OF AUGUST STRINDBERG"
        }
    },
    {
        "data": {
            "description": "Special topics in Slavic and Central and Eastern European Languages and Literatures.",
            "id": "LITTRANS/SLAVIC 467",
            "title": "ADVANCED SPECIAL TOPICS IN SLAVIC LANGUAGES AND LITERATURES"
        }
    },
    {
        "data": {
            "description": "Through the exploration of landmark and popular French (and few international) texts, seeks to narrow the perceived gap between low/high art and contextualizes historically and aesthetically French pop culture (as literature, film, graphic novel, music etc.).",
            "id": "LITTRANS 272",
            "parent": "LITTRANS",
            "title": "FRENCH POP CULTURE"
        }
    },
    {
        "data": {
            "description": "An introduction to Scandinavian literary and intellectual history, placed in a European context, from 1900 to present day.",
            "id": "LITTRANS 274",
            "parent": "LITTRANS",
            "title": "IN TRANSLATION: MASTERPIECES OF SCANDINAVIAN LITERATURE-THE 20TH CENTURY"
        }
    },
    {
        "data": {
            "description": "Major writers, trends and themes in Israeli fiction from pre-State period to present.",
            "id": "JEWISH/LITTRANS 367",
            "title": "ISRAELI FICTION IN TRANSLATION"
        }
    },
    {
        "data": {
            "description": "Examines Russian prose fiction, Anton Chekhov to the end of the 20th century. More writing intensive thanLITTRANS 202.",
            "id": "LITTRANS 204",
            "parent": "LITTRANS",
            "title": "SURVEY OF 19TH AND 20TH CENTURY RUSSIAN LITERATURE IN TRANSLATION II"
        }
    },
    {
        "data": {
            "description": "Explore the rich tradition of Slavic contributions to Science Fiction (SF). Survey early and contemporary works in the Czech, Polish, and Russian contexts, most of which are little known in the US but are nonetheless fundamental to SF as a world genre. Alongside reading these works, discuss and analyze film adaptations that have, in some cases, become more famous than written texts themselves.",
            "id": "LITTRANS 207",
            "parent": "LITTRANS",
            "title": "SLAVIC SCIENCE FICTION THROUGH LITERATURE AND FILM"
        }
    },
    {
        "data": {
            "description": "Surveys the classical literatures of South Asia, from ancient origins to adaptations in the modern world. Includes poetry, prose, and drama translated into English from Persian, Prakrit, Sanskrit, Tamil, Telugu, Hindi/Urdu, and other languages. Examines the relationship between literature in theory, in practice, and politics.",
            "id": "ASIAN/LITTRANS 212",
            "title": "CLASSICAL SOUTH ASIAN LITERATURES"
        }
    },
    {
        "data": {
            "description": "Intensive study of major writers such as Kochanowski, Krasicki, and Mickiewicz.",
            "id": "LITTRANS 471",
            "parent": "LITTRANS",
            "title": "POLISH LITERATURE (IN TRANSLATION), MIDDLE AGES TO 1863"
        }
    },
    {
        "data": {
            "description": "A critical survey of premodern Chinese literature spanning from the earliest times to the 18th century. Covers representative works of prose, fiction, drama and poetry.",
            "id": "LITTRANS 261",
            "parent": "LITTRANS",
            "title": "SURVEY OF CHINESE LITERATURE IN TRANSLATION"
        }
    },
    {
        "data": {
            "description": "Dostoevsky's works are direct encounters with the \"accursed questions\" of life, love, evil, violence, sex, death and the other usual suspects; main focus will be on the individual reader's close encounter with the aesthetics and ethics of these works.",
            "id": "LITTRANS 222",
            "parent": "LITTRANS",
            "title": "DOSTOEVSKY IN TRANSLATION"
        }
    },
    {
        "data": {
            "description": "Explore Italian comedy and dramatic literature across the centuries through close reading and discussion of selected plays, from its Roman origins to contemporary examples. Read and discuss texts representative of the major comedic modes (e.g. erudite, improvised, etc.), paying close attention to language and structure, genre debates, character typologies, performance history, and the cultural-historical contexts that informed playwrights. Aims are cultivating a deeper understanding of Italian sensibilities and cultural attitudes regarding humor and satire, love and sex, tragedy within comedy, history, gender politics, public/private space, social customs, class, and other issues.",
            "id": "LITTRANS 213",
            "parent": "LITTRANS",
            "title": "LOVE AND SEX IN ITALIAN COMEDY"
        }
    },
    {
        "data": {
            "description": "Postrevolutionary Russian and Soviet visual arts, architecture, music and cinema; provides an inside view of life under socialism with the help of selected readings in Soviet literature.",
            "id": "LITTRANS 234",
            "parent": "LITTRANS",
            "title": "SOVIET LIFE AND CULTURE THROUGH LITERATURE AND ART (FROM 1917)"
        }
    },
    {
        "data": {
            "description": "An examination of selected topics in Scandinavian literature.",
            "id": "LITTRANS 324",
            "parent": "LITTRANS",
            "title": "TOPICS IN SCANDINAVIAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Russian culture is one where literature has always played a central role in the nation's self-definitions, but Chekhov's enduring popularity around the globe is evidence of his universal appeal and relevance.",
            "id": "LITTRANS 220",
            "parent": "LITTRANS",
            "title": "CHEKHOV: THE DRAMA OF MODERN LIFE"
        }
    },
    {
        "data": {
            "description": "Examines the era of 19th-century Russian prose fiction, roughly 1830-1900, from Aleksandr Pushkin to Anton Chekhov.",
            "id": "LITTRANS 201",
            "parent": "LITTRANS",
            "title": "SURVEY OF 19TH AND 20TH CENTURY RUSSIAN LITERATURE IN TRANSLATION I"
        }
    },
    {
        "data": {
            "description": "Twentieth-century literary traditions and experiments, with attention to major movements, genres, and authors.",
            "id": "LITTRANS 340",
            "parent": "LITTRANS",
            "title": "CONTEMPORARY SCANDINAVIAN LITERATURE IN TRANSLATION"
        }
    },
    {
        "data": {
            "description": "Major works of Spanish Peninsular literature in prose, drama and poetry.",
            "id": "LITTRANS 252",
            "parent": "LITTRANS",
            "title": "SPANISH LITERARY MASTERPIECES IN TRANSLATION"
        }
    },
    {
        "data": {
            "description": "Surveys anime (Japanese animation) from 1930s shorts through contemporary feature-length, experimental, and televised serial-form productions. Draws on critical writings on postmodernism, digital cinema, and visual culture.",
            "id": "LITTRANS 232",
            "parent": "LITTRANS",
            "title": "ANIME"
        }
    },
    {
        "data": {
            "source": "CLASSICS/JEWISH/LITTRANS/RELIGST 227",
            "target": "CLASSICS/HEBR-BIB/JEWISH/LITTRANS/RELIGST 332"
        }
    },
    {
        "data": {
            "description": "From Rumpelstiltskin to Rapunzel, the rich fairy-tale tradition of the German-speaking world is filled with familiar themes and subversive morals. With an eye to depictions of gender, gender roles, sexuality, and race, we critically engage with these tales and contextualize them within the social and political landscapes that shaped them.",
            "id": "GERMAN/LITTRANS 280",
            "title": "FROM GRIMM TO GRYFFINDOR: GERMAN FAIRYTALES (RE)IMAGINED"
        }
    },
    {
        "data": {
            "description": "Examines the era of 19th-century Russian prose fiction, roughly 1830-1900, from Aleksandr Pushkin to Anton Chekhov. More writing intensive thanLITTRANS 201.",
            "id": "LITTRANS 203",
            "parent": "LITTRANS",
            "title": "SURVEY OF 19TH AND 20TH CENTURY RUSSIAN LITERATURE IN TRANSLATION I"
        }
    },
    {
        "data": {
            "description": "Exploration of diverse world literary traditions with an emphasis on German and German speaking cultures.",
            "id": "GERMAN/LITTRANS 276",
            "title": "SPECIAL TOPICS IN GERMAN AND WORLD LITERATURE/S"
        }
    },
    {
        "data": {
            "description": "What were Tolstoy's objections to sexuality and political reform? What is moral and beautiful? How does civilization and education relate to nature?  What does death say about life? Discussion of Tolstoy's  masterpieces alongside some of his nonfictional manifestoes.",
            "id": "LITTRANS 224",
            "parent": "LITTRANS",
            "title": "TOLSTOY IN TRANSLATION"
        }
    },
    {
        "data": {
            "description": "A virtual journey through Renaissance Italian and French cities; study main literary texts and cultural documents associated with the city or region.",
            "id": "LITTRANS 360",
            "parent": "LITTRANS",
            "title": "FRENCH AND ITALIAN RENAISSANCE LITERATURE ONLINE"
        }
    },
    {
        "data": {
            "description": "Examines Russian prose fiction, Anton Chekhov to the end of the 20th century.",
            "id": "LITTRANS 202",
            "parent": "LITTRANS",
            "title": "SURVEY OF 19TH AND 20TH CENTURY RUSSIAN LITERATURE IN TRANSLATION II"
        }
    },
    {
        "data": {
            "description": "Slavic playwrights and the European tradition of theatre and drama.",
            "id": "LITTRANS/THEATRE 423",
            "title": "IN TRANSLATION: SLAVIC DRAMA IN CONTEXT"
        }
    },
    {
        "data": {
            "description": "Prerevolutionary Russian visual arts, architecture, music and cinema; provides an inside view of life in prerevolutionary Russia with the help of selected readings in Russian literature.",
            "id": "LITTRANS 233",
            "parent": "LITTRANS",
            "title": "RUSSIAN LIFE AND CULTURE THROUGH LITERATURE AND ART (TO 1917)"
        }
    },
    {
        "data": {
            "description": "Beginning with the arrival of Spanish colonists in the fifteenth century, Spanish American literature has a rich history of over five centuries, and Spanish American authors were awarded six Nobel prizes between 1945 and 2010. An introduction to key problems, topics, authors, genres, and periods in the history of Spanish American literary practice providing insight into the vast diversity of Spanish American cultures and societies through readings offered in English translation, as well as familiarity with the current critical and theoretical debates on Spanish American literature.",
            "id": "LITTRANS 245",
            "parent": "LITTRANS",
            "title": "TOPICS IN SPANISH AMERICAN LITERATURE IN TRANSLATION"
        }
    },
    {
        "data": {
            "description": "Read and discuss works by Scandinavian writers of the nineteenth and twentieth century reflecting sexual politics and the roles of women in literature. Course taught in English.",
            "id": "GEN&WS/LITTRANS/SCANDST 438",
            "title": "SEXUAL POLITICS IN SCANDINAVIA"
        }
    },
    {
        "data": {
            "description": "Introduction to the literature, culture, and art of Eastern Europe.",
            "id": "LITTRANS 241",
            "parent": "LITTRANS",
            "title": "LITERATURES AND CULTURES OF EASTERN EUROPE"
        }
    },
    {
        "data": {
            "description": "Survey and critical analysis of the writings of Vaclav Havel from the 1960's through the 1990's: plays, philosophical and dissident essays, selected speeches as president.",
            "id": "LITTRANS 208",
            "parent": "LITTRANS",
            "title": "THE WRITINGS OF VACLAV HAVEL: CRTITIQUE OF MODERN SOCIETY"
        }
    },
    {
        "data": {
            "description": "Explores representations of biological life in literature, scientific discourse, film, and art. The symbolic representations (metaphors and similes used by scientists, fictions narrated by writers, and pictorial forms imagined by artists) allow students to analyze diverse conceptualizations of biological life: life as mechanism, rhythmic movement, balance of energy, inherent force, resistance to death, death's complementary cycle. The exploration of biological life's attributes, such as plasticity, limitedness, and self-consciousness, fosters interdisciplinary thinking bridging the humanities and life sciences. The symbolic representations of life are studied through different genres of texts and different media, and at different moments of cultural history. The texts and media will be from around the world (with a particular emphasis on French, francophone and Italian sources), but studied in English translation.",
            "id": "LITTRANS 302",
            "parent": "LITTRANS",
            "title": "WHAT IS LIFE? BIOLOGICAL LIFE IN LITERATURE AND CULTURE"
        }
    },
    {
        "data": {
            "description": "Penetrating study of an important Scandinavian literary or cultural topic.",
            "id": "LITTRANS 331",
            "parent": "LITTRANS",
            "title": "IN TRANSLATION: SCANDINAVIAN TOPICS IN DEPTH"
        }
    },
    {
        "data": {
            "description": "Exploration of periods, genres, individual writers, themes, problems, ect. in Russian and Eastern European literature.",
            "id": "LITTRANS 247",
            "parent": "LITTRANS",
            "title": "TOPICS IN SLAVIC LITERATURES IN TRANSLATION"
        }
    },
    {
        "data": {
            "description": "Covers Italian history and culture from the Unification (1860) to the 21st century.",
            "id": "LITTRANS 254",
            "parent": "LITTRANS",
            "title": "IN TRANSLATION: LIT OF MODERN ITALY-EXISTENTIALISM, FASCISM, RESISTANCE"
        }
    },
    {
        "data": {
            "description": "The works of Hans Christian Andersen, with an emphasis on his best-known fairytales, but also texts from some of the other genres he mastered, focusing on the biographical traits of his stories and his mastery of the genre and complex narrative method.",
            "id": "LITTRANS 275",
            "parent": "LITTRANS",
            "title": "IN TRANSLATION: THE TALES OF HANS CHRISTIAN ANDERSEN"
        }
    },
    {
        "data": {
            "description": "A historical introduction to the important literary works of Japan. Focus on literary tradition before the restoration of 1868.",
            "id": "LITTRANS 263",
            "parent": "LITTRANS",
            "title": "SURVEY OF JAPANESE LITERATURE IN TRANSLATION"
        }
    },
    {
        "data": {
            "description": "A comprehensive survey of Polish literature and its historical background from 1863 to the present.",
            "id": "LITTRANS 473",
            "parent": "LITTRANS",
            "title": "POLISH LITERATURE (IN TRANSLATION) SINCE 1863"
        }
    },
    {
        "data": {
            "description": "An introduction to Scandinavian literary and intellectual history, placed in a European context, from Old Norse sagas to end of 19th century.",
            "id": "LITTRANS 271",
            "parent": "LITTRANS",
            "title": "IN TRANSLATION:MASTERPIECES OF SCANDINAVIAN LITERATURE, MIDDLE AGES-1900"
        }
    },
    {
        "data": {
            "description": "An introduction to the thought, literature, and history of the prophets of ancient Israel (in English).",
            "id": "CLASSICS/HEBR-BIB/JEWISH/LITTRANS/RELIGST 332",
            "title": "PROPHETS OF THE BIBLE"
        }
    },
    {
        "data": {
            "description": "Explores topics in French and Francophone cultures by examining their conceptualizations throughout history as well as their representations in literature and different media such as film and graphic novels. Understand the specificity of French and Francophone cultures and literatures, their contributions to the world's multicultural heritage, and ponder the cultural traditions they claim their own. Possible topics: gender relations, race and ethnicity, social justice, institutional forms of power, human emotions, immigration, colonization and its literary heritage, aesthetic ideals, everyday forms of human interaction, historical memory and its repression, education and acculturation, social rituals, the cultural and political role of language, etc.",
            "id": "LITTRANS 303",
            "parent": "LITTRANS",
            "title": "TOPICS IN FRENCH LITERATURE AND CULTURE"
        }
    },
    {
        "data": {
            "description": "Focuses on a specific theme in Japanese literary history for in-depth study, such as Contemporary Japanese Novels or Japanese Women Writers.",
            "id": "LITTRANS 373",
            "parent": "LITTRANS",
            "title": "TOPICS IN JAPANESE LITERATURE"
        }
    },
    {
        "data": {
            "description": "Major literary movements of Serbian and Croatian literature from the medieval period until the formation of the Yugoslav state in 1919.",
            "id": "LITTRANS 454",
            "parent": "LITTRANS",
            "title": "HISTORY OF SERBIAN AND CROATIAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Exploration of European Yiddish fiction, poetry, folklore, and cinema, with a focus on works of the 19th and 20th centuries.",
            "id": "GERMAN/JEWISH/LITTRANS 269",
            "title": "YIDDISH LITERATURE AND CULTURE IN EUROPE"
        }
    },
    {
        "data": {
            "description": "Astrid Lindgren's Pippi Longstocking is an icon of childhood in the Nordic countries and beyond. Pippi has come to symbolize the Nordic \"autonomous\" child par excellence. Takes up a diverse selection of books and films that represent both the common ideas of the Nordic Child, as well as various elaborations of and exceptions to the idealized norm. Examines a number of the prevalent forms and themes in Nordic children's culture, such as nature, play, school, sexuality, death, loss, and storytelling.",
            "id": "LITTRANS/SCANDST 320",
            "title": "THE NORDIC CHILD"
        }
    },
    {
        "data": {
            "description": "",
            "id": "GEN&WS/LITTRANS 270",
            "title": "GERMAN WOMEN WRITERS IN TRANSLATION"
        }
    },
    {
        "data": {
            "description": "Often considered \"the father of modern drama,\" the Norwegian playwright Henrik Ibsen (1828-1906) is a major figure of world literature whose dramatic works remain fascinating and globally influential, both as texts and through performance and adaptation. Read and discuss Ibsen in English translation, with a focus on Ibsen's historical contexts, dramatic techniques, social and political thought, and the reception and adaptation of his work in modern culture.",
            "id": "LITTRANS/THEATRE 335",
            "title": "IN TRANSLATION: THE DRAMA OF HENRIK IBSEN"
        }
    },
    {
        "data": {
            "description": "Surveys the manga (Japanese comicbook) from precursors in premodern woodblock-printed booklets to contemporary manifestations in subgenres like gekiga, mecha, shonen, and shojo. Draws on critical writings on literature, popular culture, and visual culture.",
            "id": "LITTRANS 231",
            "parent": "LITTRANS",
            "title": "MANGA"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Take a literary journey from St. Petersburg to Moscow, following the shifting cultural and political currents in Russia from the years preceding the 1917 Revolution to the rise of Stalinism in the 1930s. Topics in translation will include: revolutionary violence and terror, civil war and emigration, Futurism and the birth of Russian avant-garde art, Soviet feminism and the engineering of the \"New Man,\" technological utopias and totalitarian dystopias, literature and early Soviet economic policy.",
            "id": "LITTRANS/SLAVIC 238",
            "title": "LITERATURE AND REVOLUTION"
        }
    },
    {
        "data": {
            "description": "What is a national identity in the context of the fluid globalized world in which we live? How are identities affected by big migratory waves within the same country and, more importantly, from one country or continent to another? The Italian case is one of the many in the so-called Western world that can help us to monitor the possible answers to these questions. Through readings and discussions of novels, avant-garde manifestoes, poems, two main tasks will be accomplished. The first task of analyzing literary texts in a variety of genres (epistolary novel, historical novel, avant-garde rhetoric, poetry) to familiarize ourselves with textual analysis and some theoretical tools supporting the interpretative tasks of literary criticism. And the second task of appreciating the rhetorical devices that those texts adopt at different times of Italian modern and contemporary history.",
            "id": "LITTRANS 248",
            "parent": "LITTRANS",
            "title": "NATIONAL IDENTITY IN THE GLOBAL WORLD: THE ITALIAN CASE"
        }
    },
    {
        "data": {
            "description": "Special topics in Slavic and Central and Eastern European Languages and Literatures.",
            "id": "LITTRANS/SLAVIC 357",
            "title": "INTERMEDIATE SPECIAL TOPICS IN SLAVIC LANGUAGES AND LITERATURES"
        }
    },
    {
        "data": {
            "description": "",
            "id": "GEN&WS/LITTRANS 205",
            "title": "WOMEN IN RUSSIAN LITERATURE IN TRANSLATION"
        }
    },
    {
        "data": {
            "description": "Begins with Romanticism and looks at Norwegian folktales and Hans Christian Andersen's world-famous stories, moving to the Modern Breakthrough, perhaps the most important period in Scandinavian literary history.",
            "id": "LITTRANS 337",
            "parent": "LITTRANS",
            "title": "IN TRANSLATION: 19TH CENTURY SCANDINAVIAN FICTION"
        }
    },
    {
        "data": {
            "source": "LITTRANS 202",
            "target": "LITTRANS 204"
        }
    },
    {
        "data": {
            "description": "Introduction to the text, development, history, and social context of the Hebrew Bible/Old Testament. Covers the Torah (Pentateuch), Neviim (Former and Latter Prophets), and Ketuvim (Writings), and provides a brief introduction to early Jewish literature (Pseudepigrapha/Apocrypha). Discusses various methods of analysis and theories of composition. Addresses major theological claims made of the text by Jewish and Christian communities. Explores contextualized interpretations in the ancient and modern day.",
            "id": "CLASSICS/JEWISH/LITTRANS/RELIGST 227",
            "title": "INTRODUCTION TO BIBLICAL LITERATURE (IN ENGLISH)"
        }
    },
    {
        "data": {
            "source": "LITTRANS 201",
            "target": "LITTRANS 203"
        }
    },
    {
        "data": {
            "description": "Study of an author or theme in modern Dutch/Flemish literature, presented by the current Dutch/Flemish writer in residence.",
            "id": "LITTRANS 326",
            "parent": "LITTRANS",
            "title": "TOPICS IN DUTCH LITERATURE IN TRANSLATION"
        }
    },
    {
        "data": {
            "description": "A study of representative masterpieces of French and Francophone literature drawn from at least four different centuries. Emphasis on the interpretation of texts, important themes, and the ways literature expresses psychological and sociocultural realities. May cover topics such as: tragedies by Jean Racine, comedies by Moliere, novels by Pierre Choderlos de Laclos, Honore de Balzac, Guy de Maupassant and Maryse Conde, and stories by Gustave Flaubert and Albert Camus.",
            "id": "LITTRANS 209",
            "parent": "LITTRANS",
            "title": "MASTERPIECES OF FRENCH LITERATURE AND CULTURE"
        }
    },
    {
        "data": {
            "description": "The image and representation of the \"Jew\" and Jews in the literatures and cultures of the Slavic countries of Eastern Europe, including Russia, Poland, Serbia, Croatia, and Bosnia. Both pre- and post-Holocaust texts will be read and critically examined.",
            "id": "LITTRANS 229",
            "parent": "LITTRANS",
            "title": "REPRESENTATION OF THE JEW IN EASTERN EUROPEAN CULTURES"
        }
    },
    {
        "data": {
            "id": "LITTRANS",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Focuses on the central role played by Italy in the European vision of America between Columbus's voyages and the Second World War.",
            "id": "LITTRANS 260",
            "parent": "LITTRANS",
            "title": "ITALY AND THE INVENTION OF AMERICA: FROM COLUMBUS TO WORLD WAR II"
        }
    },
    {
        "data": {
            "description": "Exploring the oral nature and performance traditions of folklore, ethnography, tales and ballads, literature and culture from Nordic areas and Scandinavia.",
            "id": "FOLKLORE/LITTRANS/MEDIEVAL/SCANDST 345",
            "title": "THE NORDIC STORYTELLER"
        }
    },
    {
        "data": {
            "description": "Representative texts of French women writers from Marie de France, the women troubadours, and Christine de Pizan to Madame de Stael and George Sand, in historical, social, and cultural context.",
            "id": "LITTRANS 268",
            "parent": "LITTRANS",
            "title": "FRENCH WOMEN WRITERS FROM THE MIDDLE AGES TO THE NINETEENTH CENTURY"
        }
    },
    {
        "data": {
            "description": "Introduction to the cultural and literary practices of the Portuguese-speaking world. Readings include novels, short stories, and poetry from Portugal, Brazil, and Lusophone Africa.",
            "id": "LITTRANS 226",
            "parent": "LITTRANS",
            "title": "INTRODUCTION TO LUSO-AFRO-BRAZILIAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Despite the comparisons to Poe and Kafka or Gogol's undeniable influence on Dostoevsky and Bulgakov, one thing is certain - his world of laughter and tears is unlike that of any other writer.",
            "id": "LITTRANS 221",
            "parent": "LITTRANS",
            "title": "RUSSIA'S GREATEST ENIGMA: NIKOLAI GOGOL"
        }
    },
    {
        "data": {
            "description": "Exploration of American Yiddish poetry, fiction, theater, and cinema created by European Jews in the United States.",
            "id": "GERMAN/JEWISH/LITTRANS 279",
            "title": "YIDDISH LITERATURE AND CULTURE IN AMERICA"
        }
    },
    {
        "data": {
            "description": "Examines major traditions, narratives, and ideas that have shaped Polish literature and culture from their beginnings to World War II. Gain broad and contextualized knowledge of Polish civilization by closely reading and analyzing literary and cultural texts in their historical context. Course contents are organized into four major paradigms: Christianity, Sarmatism, Romanticism, and Modernity.",
            "id": "LITTRANS/SLAVIC 215",
            "title": "LOVE AND DEATH: INTRODUCTION TO POLISH LITERATURE & CULTURE"
        }
    },
    {
        "data": {
            "description": "A survey of the main currents in Polish literature since 1863.",
            "id": "LITTRANS 218",
            "parent": "LITTRANS",
            "title": "POLISH LITERATURE IN TRANSLATION: LATE 19TH AND 20TH CENTURIES"
        }
    },
    {
        "data": {
            "description": "Discussion of major twentieth-century literary texts from Germany, Switzerland, and Austria by such authors as Franz Kafka, Bertolt Brecht, Anna Seghers, Friedrich Durrenmatt, Gunter Grass, Christa Wolf. Possible areas of emphasis: identity formation; technology and culture; literary representations of fascism.",
            "id": "LITTRANS 277",
            "parent": "LITTRANS",
            "title": "TOPICS IN TWENTIETH-CENTURY GERMAN LITERATURE (IN TRANSLATION)"
        }
    },
    {
        "data": {
            "description": "A look at the Kalevala, the Finnish creation myth and national epic of Finland, and how it affected Finnish national identity and the eventual Finnish independence from Russia.",
            "id": "FOLKLORE/LITTRANS 347",
            "title": "IN TRANSLATION: KALEVALA AND FINNISH FOLK-LORE"
        }
    },
    {
        "data": {
            "description": "Have you ever wondered about human nature? What is our place in this world? Through readings, videos, and original images, explore and discuss Dante's answers from one of the greatest world literary classics, his Divine Comedy. From Hell, through Purgatory to Paradise, we will travel together with Dante in a universal tale of the journey of the human soul. Along the way, learn about Dante, his life and his works, development of literary history, historical and socio-political context of medieval Europe, the Mediterranean and the Middle East. Make connections that cross today's geographic and cultural lines in an exploration of literary topics, the history of ideas, and shared history, pondering universal concepts and patterns in the development of civilization that can still be observed today.",
            "id": "LITTRANS/MEDIEVAL/RELIGST 253",
            "title": "OF DEMONS AND ANGELS. DANTE'S DIVINE COMEDY"
        }
    },
    {
        "data": {
            "description": "Introduction to the literature of the Classical Rabbinic or Talmudic period of Judaism (2nd to 7th centuries CE). Historical and intellectual background; the interrelation of liturgy, legal and non-legal literature.",
            "id": "JEWISH/LITTRANS/RELIGST 328",
            "title": "CLASSICAL RABBINIC LITERATURE IN TRANSLATION"
        }
    },
    {
        "data": {
            "description": "Blixen's tales and biographical fiction.",
            "id": "LITTRANS 334",
            "parent": "LITTRANS",
            "title": "IN TRANSLATION: THE ART OF ISAK DINESEN/KAREN BLIXEN"
        }
    },
    {
        "data": {
            "description": "The prose narratives of medieval Iceland. Gain an understanding of saga literature as a genre and of the cultural history of Iceland in the Viking Era and the Middle Ages, based on the interplay between pagan codes of honor and Christian ethics. In addition, gain an understanding of the methodological problems involved in studying sagas as historical documents.",
            "id": "LITTRANS/SCANDST 435",
            "title": "THE SAGAS OF ICELANDERS IN ENGLISH TRANSLATION"
        }
    },
    {
        "data": {
            "description": "Investigate the representation of food in Italian literature from the 19th Century to the present and the connection between food and identity in Italy and Italophone culture. Covers novels, short stories and poems and work on methods of literary analysis by focusing on questions of genre, narrative structure, characters, metaphorical and allegorical interpretation, etc. The theme of food (in relation to hunger, class, gender, identity, diaspora, sustainability, etc.) is central in the literary material included.",
            "id": "LITTRANS 200",
            "parent": "LITTRANS",
            "title": "FOOD CULTURES IN ITALIAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Pre-modern Jewish society's breakdown, immigration, the challenges of integration and exclusion, and the establishment of new communities will serve as a backdrop for the analysis and comparison of Jewish literary texts written in Hebrew, Yiddish, German, Russian, and English.",
            "id": "JEWISH/LITTRANS 318",
            "title": "MODERN JEWISH LITERATURE"
        }
    },
    {
        "data": {
            "description": "Investigates the relations between theories of memory, both individual and collective, and modern literary representations of remembering. Survey seminal conceptions of memory in the interdisciplinary field of memory studies, investigating topics such as nostalgia, trauma, personal and cultural identity, war and Holocaust, sites of memory, and autobiographical narrative. Through the avenues opened up by these theoretical frameworks, consider the narrative forms as well as the ethical and political dimensions of remembering in major novels by Marcel Proust, W. G. Sebald, and Karl Ove Knausgard.",
            "id": "LITTRANS/SCANDST 428",
            "title": "MEMORY AND LITERATURE FROM PROUST TO KNAUSGARD"
        }
    },
    {
        "data": {
            "description": "Examines the European context of literary decadence (Baudelaire, Huysmans, Wilde) and how it inspired some of Scandinavia's most important writers (Strindberg, Hamsun, Jacobsen).",
            "id": "LITTRANS 350",
            "parent": "LITTRANS",
            "title": "SCANDINAVIAN DECADENCE IN ITS EUROPEAN CONTEXT"
        }
    },
    {
        "data": {
            "description": "The collapse of communism and the posthumous triumph of the Solidarity movement started a new era in Polish culture. However, living in \"posthistory\" comes with its own set of problems. Examine contemporary Polish literature, film, and other cultural forms as they struggle with the country's turbulent past while trying to forge new collective identities for the future. How does culture mediate our relationship with the past? How does it help us understand the present and prepare for the future?",
            "id": "LITTRANS/SLAVIC 361",
            "title": "LIVING AT THE END OF TIMES: CONTEMPORARY POLISH LITERATURE AND CULTURE"
        }
    },
    {
        "data": {
            "description": "Exploration of various topics - periods, genres, individual writers, themes, problems, etc. in Russian and Eastern European literature at the intermediate level.",
            "id": "LITTRANS/SLAVIC 366",
            "title": "INTERMEDIATE SPECIAL TOPICS IN RUSSIAN LITERATURE & CULTURE"
        }
    },
    {
        "data": {
            "description": "Have you ever wondered what it was like to live during the Black Death? Were our medieval and early-modern ancestors different from us, or are we challenged with similar problems? What can we learn from their lives? And, if we could, what could we teach each other? Discuss these topics while reading one of the world's greatest literary classics, Giovanni Boccaccio's Decameron, a text that will make us both laugh and cry. Through reading the Decameron, investigate medicine, art, culture, music, politics, religion, interpersonal and transcultural relations, warfare, fashion, gender and gender roles, as well as everyday life in the Middle Ages and early modernity. Also examines medieval written documents, twentieth-century feminist responses to the Decameron and filmic renditions of it, medieval frescoes, historical descriptions of the plague, and modern descriptions of, and reactions to, the COVID-19 pandemic.",
            "id": "LITTRANS/MEDIEVAL 255",
            "title": "BLACK DEATH AND MEDIEVAL LIFE THROUGH BOCCACCIO'S DECAMERON"
        }
    },
    {
        "data": {
            "description": "Exploration of various topics - periods, genres, individual writers, themes, problems, etc. in Russian and Eastern European literature.",
            "id": "LITTRANS/SLAVIC 266",
            "title": "ELEMENTARY SPECIAL TOPICS IN RUSSIAN LITERATURE & CULTURE"
        }
    }
]