[
    {
        "data": {
            "description": "Expose to emerging and current topics in the industry of marketing through applied learning experiences - case studies, industry meetings, and exercises or workshops.",
            "id": "MARKETNG 840",
            "parent": "MARKETNG",
            "title": "CURRENT TOPICS IN MARKETING"
        }
    },
    {
        "data": {
            "source": "MARKETNG 700",
            "target": "MARKETNG 745"
        }
    },
    {
        "data": {
            "description": "Analyses from social and psychological perspectives. Motivation, perception, learning and attitude formation. Effects of social class, family structure, cultural backgrounds and reference groups.",
            "id": "CNSRSCI 657",
            "parent": "CNSRSCI",
            "title": "CONSUMER BEHAVIOR"
        }
    },
    {
        "data": {
            "description": "An overview of marketing's role within an organization, the key elements of a marketing plan, and how the plan is implemented. Students will learn about buyer demographic, psychographic and purchasing decision behavior. A thorough understanding of the customer enables students to develop a coordinated marketing mix (product, price promotion and place) that will satisfy the customer better than the competition and at the required margin. Students will leave the course understanding the degree to which all company functions must be coordinated and focused on the customer. This course will not apply toward fulfilling the MBA degree requirements.",
            "id": "EPD/GENBUS/MARKETNG 782",
            "title": "MARKETING FOR NON-MARKETING PROFESSIONALS"
        }
    },
    {
        "data": {
            "description": "A foundation in transportation, order fulfillment, warehousing, materials planning including MRP, demand planning, import/export fundamentals, ERP systems, supply chain metrics, and leading supply chain technologies such as RFID.",
            "id": "MARKETNG/OTM 722",
            "title": "LOGISTICS MANAGEMENT"
        }
    },
    {
        "data": {
            "source": "GENBUS 317",
            "target": "GENBUS 656"
        }
    },
    {
        "data": {
            "description": "Supply chain capital management refers to the set of activities and solutions available to finance an organization's supply chain infrastructure.  As supply chains become more extended and complicated a need has developed to both manage and fund the supply network.  Define and study the various influencers on the supply chain capital structure.  Investigate risks, mitigation techniques, metrics and themes relating to the topic.",
            "id": "MARKETNG/OTM 728",
            "title": "SUPPLY CHAIN CAPITAL MANAGEMENT"
        }
    },
    {
        "data": {
            "source": "OTM 700",
            "target": "MARKETNG/OTM 724"
        }
    },
    {
        "data": {
            "description": "Introduces business analytic techniques applied in the context of digital marketing.  Includes approaches to design, run, evaluate, and improve online marketing tactics in order to meet specific business objectives such as customer acquisition. Covers digital analytics methods and execution of marketing tactics with data-driven techniques. Emphasizes the implementation of analytic skills on practical problems.",
            "id": "MARKETNG 745",
            "parent": "MARKETNG",
            "title": "DIGITAL MARKETING ANALYTICS"
        }
    },
    {
        "data": {
            "description": "Introduction to calculus of functions of several variables; calculus on parameterized curves, derivatives of functions of several variables, multiple integrals, vector calculus.",
            "id": "MATH 234",
            "parent": "MATH",
            "title": "CALCULUS--FUNCTIONS OF SEVERAL VARIABLES"
        }
    },
    {
        "data": {
            "source": "OTM 300",
            "target": "MARKETNG/OTM 726"
        }
    },
    {
        "data": {
            "description": "Systematic and objective search for and analysis of information relevant to the identification and solution of problems in marketing.",
            "id": "MARKETNG 310",
            "parent": "MARKETNG",
            "title": "MARKETING RESEARCH"
        }
    },
    {
        "data": {
            "source": "GENBUS 311",
            "target": "MARKETNG 745"
        }
    },
    {
        "data": {
            "source": "GENBUS 311",
            "target": "MARKETNG 815"
        }
    },
    {
        "data": {
            "description": "Provides a framework for evaluating marketing problems and developing a marketing strategy. Customer, competitor, and collaborator factors are emphasized as foundations for marketing decision-making. Examines the key aspects of product, pricing, distribution, and promotion strategy.",
            "id": "MARKETNG 700",
            "parent": "MARKETNG",
            "title": "MARKETING MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Econometric methods, theory, and applications. Matrix algebra will be used. Topics include linear regression, least-squares estimation, inference, and hypothesis testing. Primarily for Master's level students. It is expected that students will have completed three semesters calculus (such asMATH 234) and linear algebra (such asMATH 340).",
            "id": "ECON 704",
            "parent": "ECON",
            "title": "ECONOMETRICS I"
        }
    },
    {
        "data": {
            "description": "Learn about brands, how they work, and apply that knowledge to managerial situations. Covers brand history, societies, and cultures; critical mental processes; marketing imperatives; and the economies that underlie them.",
            "id": "MARKETNG 335",
            "parent": "MARKETNG",
            "title": "BRAND MANAGEMENT & STRATEGY"
        }
    },
    {
        "data": {
            "source": "MARKETNG 300",
            "target": "MARKETNG 460"
        }
    },
    {
        "data": {
            "source": "MARKETNG 300",
            "target": "MARKETNG 437"
        }
    },
    {
        "data": {
            "source": "MARKETNG 700",
            "target": "MARKETNG 705"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 234"
        }
    },
    {
        "data": {
            "source": "GENBUS 106",
            "target": "GENBUS 306"
        }
    },
    {
        "data": {
            "source": "MARKETNG 300",
            "target": "MARKETNG/OTM 421"
        }
    },
    {
        "data": {
            "description": "An overview of the issues and trends in sports marketing. Attention will be given to the issues facing sport organizations and to the use of marketing techniques to solve business-related problems. It will also focus on the challenges of organizations that use sports properties to enhance their marketing efforts. We will examine the world of sports as a business with a focus on attracting the customer in a competitive, fragmented and global market and consider how sports marketers develop and apply strategies to meet their objectives.",
            "id": "MARKETNG 410",
            "parent": "MARKETNG",
            "title": "SPORTS MARKETING"
        }
    },
    {
        "data": {
            "source": "MARKETNG 300",
            "target": "MARKETNG 415"
        }
    },
    {
        "data": {
            "description": "Managing operations and supply chains is about people, information, equipment, and materials and how these are combined to produce and/or deliver goods and services to customers. Emphasis is on how systems and processes can be designed, managed, and improved to achieve operations excellence and competitive advantage.",
            "id": "OTM 300",
            "parent": "OTM",
            "title": "OPERATIONS AND SUPPLY CHAIN MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Introduction to marketing strategy for technology companies and products. Learn how traditional marketing tools can be adopted to help technology products succeed, and what new frameworks beyond the traditional 5C's and 4P's are needed for the marketing of technology products. Topics covered include technology development and adoption, managing disruptive technologies, economics of IT products, AI, and platform strategy.",
            "id": "MARKETNG 340",
            "parent": "MARKETNG",
            "title": "TECHNOLOGY PRODUCT MARKETING"
        }
    },
    {
        "data": {
            "source": "MARKETNG 300",
            "target": "MARKETNG 755"
        }
    },
    {
        "data": {
            "source": "MATH 375",
            "target": "MATH 376"
        }
    },
    {
        "data": {
            "description": "A course for the exploration of subject areas possibly to be introduced into the business curriculum.",
            "id": "MARKETNG 365",
            "parent": "MARKETNG",
            "title": "CONTEMPORARY TOPICS"
        }
    },
    {
        "data": {
            "source": "MARKETNG 300",
            "target": "MARKETNG 737"
        }
    },
    {
        "data": {
            "source": "ECON 709",
            "target": "MARKETNG 779"
        }
    },
    {
        "data": {
            "source": "MARKETNG 700",
            "target": "MARKETNG 805"
        }
    },
    {
        "data": {
            "source": "MARKETNG 700",
            "target": "MARKETNG 730"
        }
    },
    {
        "data": {
            "description": "Build fundamental skills and processes to develop a strong foundation in business analysis utilizing Excel. Learn the fundamentals of data construction, manipulation, summarization, analysis and presentation.",
            "id": "GENBUS 106",
            "parent": "GENBUS",
            "title": "FOUNDATIONAL SKILLS FOR BUSINESS ANALYSIS"
        }
    },
    {
        "data": {
            "source": "MATH 376",
            "target": "MATH/STAT 431"
        }
    },
    {
        "data": {
            "description": "Planning and controlling the elements of the marketing program; marketing organization, product and service, packaging, pricing, promotion and physical distribution.",
            "id": "MARKETNG 300",
            "parent": "MARKETNG",
            "title": "MARKETING MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Management of operations throughout an organization or supply chain. Emphasizes the coordination of resources to improve cost, quality, and customer service. Topics include capacity and materials management, operations strategy, and process improvement.",
            "id": "OTM 700",
            "parent": "OTM",
            "title": "OPERATIONS AND SUPPLY CHAIN MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "In preparation for a global immersion experience in marketing, explore topics such as social innovation, globalization, cultural studies, religion, history, and technology in relation to the travel destination.  Delve into personal and leadership qualities that facilitate a successful experience in a global setting. Travel requirements, such as a valid passport, may apply to the immersion experience component.",
            "id": "MARKETNG 350",
            "parent": "MARKETNG",
            "title": "GLOBAL IMMERSION IN MARKETING"
        }
    },
    {
        "data": {
            "description": "Topics in multi-variable calculus and introduction to differential equations.",
            "id": "MATH 376",
            "parent": "MATH",
            "title": "TOPICS IN MULTI-VARIABLE CALCULUS AND DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "OTM 300",
            "target": "MARKETNG/OTM 427"
        }
    },
    {
        "data": {
            "source": "MARKETNG 300",
            "target": "MARKETNG 745"
        }
    },
    {
        "data": {
            "description": "Provides an overview of the different types of retailers and the channels they use, the retailing environment, the functions retailers perform, the decision-making processes of consumers with respect to retailers and their offerings, and various issues in retailing strategy, merchandise management and store management.",
            "id": "MARKETNG 426",
            "parent": "MARKETNG",
            "title": "STRATEGIC RETAILING"
        }
    },
    {
        "data": {
            "description": "Explores the concepts and practices of using information technology to effectively manage and operate supply chains of businesses and other organizations. Topics include supply chain processes, enterprise resource planning (ERP) system implementation, and supply chain simulations using SAP software.",
            "id": "MARKETNG/OTM 427",
            "title": "INFORMATION TECHNOLOGY IN SUPPLY CHAINS"
        }
    },
    {
        "data": {
            "description": "Learn to resolve common marketing tasks such as consumer choice prediction, market analysis, and product development by using Bayesian statistical learning methods. A broad range of methods are covered, from standard approaches such as hierarchical modeling to more advanced techniques, including Bayesian Optimization and Bayesian Deep Learning.",
            "id": "MARKETNG 779",
            "parent": "MARKETNG",
            "title": "BAYESIAN MACHINE LEARNING FOR MARKETING"
        }
    },
    {
        "data": {
            "description": "Explores strategies and processes by which organizations effectively discover, develop, and launch impactful new products. Includes design thinking methods and the stage-gate approach to generate and evaluate new product ideas.",
            "id": "MARKETNG 737",
            "parent": "MARKETNG",
            "title": "NEW PRODUCT INNOVATION"
        }
    },
    {
        "data": {
            "description": "Individual work suited to the needs of undergraduate students may be arranged with a faculty member.",
            "id": "MARKETNG 399",
            "parent": "MARKETNG",
            "title": "READING AND RESEARCH-MARKETING"
        }
    },
    {
        "data": {
            "description": "Introduces business analytic techniques applied in the context of digital marketing.  Includes approaches to design, run, evaluate, and improve online marketing tactics in order to meet specific business objectives such as customer acquisition. Covers digital analytics methods and execution of marketing tactics with data-driven techniques. Emphasizes the implementation of analytic skills on practical problems.",
            "id": "MARKETNG 445",
            "parent": "MARKETNG",
            "title": "DIGITAL MARKETING ANALYTICS"
        }
    },
    {
        "data": {
            "description": "Participation in a global immersion experience (short term study abroad) in Marketing. Enrollment in a UW-Madison resident study abroad program.",
            "id": "MARKETNG 349",
            "parent": "MARKETNG",
            "title": "GLOBAL IMMERSION EXPERIENCE IN MARKETING"
        }
    },
    {
        "data": {
            "source": "MARKETNG 300",
            "target": "MARKETNG 305"
        }
    },
    {
        "data": {
            "source": "GENBUS 311",
            "target": "MARKETNG 805"
        }
    },
    {
        "data": {
            "source": "MARKETNG 300",
            "target": "MARKETNG/OTM 724"
        }
    },
    {
        "data": {
            "description": "Pricing is one of the most important but least understood of marketing decisions. This course aims to equip you with key concepts and techniques for evaluating and formulating pricing strategies. We will use a combination of analytical and experiential learning methods to accomplish this objective.",
            "id": "MARKETNG 430",
            "parent": "MARKETNG",
            "title": "STRATEGIC PRICING"
        }
    },
    {
        "data": {
            "source": "MARKETNG 700",
            "target": "MARKETNG 775"
        }
    },
    {
        "data": {
            "source": "MARKETNG 300",
            "target": "MARKETNG 445"
        }
    },
    {
        "data": {
            "description": "High-level introduction to concepts and practices in business. Overview of management, marketing, strategy, entrepreneurship, ethics, supply chain, and international business.",
            "id": "GENBUS 311",
            "parent": "GENBUS",
            "title": "FUNDAMENTALS OF MANAGEMENT AND MARKETING FOR NON-BUSINESS MAJORS"
        }
    },
    {
        "data": {
            "source": "OTM 300",
            "target": "MARKETNG/OTM 423"
        }
    },
    {
        "data": {
            "description": "Social Media (Facebook, Twitter, Instagram etc.) has changed the way brands communicate with their consumers and vice versa. In this digital age, marketers and entrepreneurs can create competitive advantage for their brand by mastering the science and art of social media strategy. The goal is to understand how brands can leverage social for competitive advantage, consumer listening and innovation. Provides a strong theoretical foundation coupled with practical experience of developing and managing social media strategies for brands.",
            "id": "MARKETNG 375",
            "parent": "MARKETNG",
            "title": "SOCIAL MEDIA MARKETING"
        }
    },
    {
        "data": {
            "description": "Impact of analytics on successful marketing decisions. Topics include marketing metrics, digital analytics, marketing response models, segmentation, product design, experimentation and big data. It is designed for students with some background in quantitative methods and an exposure to basic marketing research concepts. A combination of lectures, cases and hands-on model building focused on marketing analytics.",
            "id": "MARKETNG 450",
            "parent": "MARKETNG",
            "title": "MARKETING ANALYTICS"
        }
    },
    {
        "data": {
            "source": "MARKETNG 300",
            "target": "INTLBUS/MARKETNG 420"
        }
    },
    {
        "data": {
            "description": "Apply and synthesize acquired knowledge through an applied consulting project. Provides the opportunity to explore/apply concepts like identifying and understanding the business challenge; applying marketing research and analytics methods to discover consumer insight to help answer the business challenge; developing recommendations based on the discovered findings; and communicating findings and recommendation(s).",
            "id": "MARKETNG 770",
            "parent": "MARKETNG",
            "title": "MARKETING CONSULTING PRACTICUM"
        }
    },
    {
        "data": {
            "source": "MATH/STAT 431",
            "target": "MATH/STAT 309"
        }
    },
    {
        "data": {
            "source": "MARKETNG 300",
            "target": "MARKETNG 710"
        }
    },
    {
        "data": {
            "source": "MARKETNG 700",
            "target": "MARKETNG 737"
        }
    },
    {
        "data": {
            "description": "Focuses on strategic issues and current theory and practice in supply chain management. Effective design and management of supply chain resources is a key source of competitive advantage for organizations. Supply chain management is a cross-functional discipline that concentrates on the management of goods, services, and information among all links in the value chain.",
            "id": "MARKETNG/OTM 726",
            "title": "SUPPLY CHAIN STRATEGY"
        }
    },
    {
        "data": {
            "description": "An overview of the marketing research process from a methodological perspective. Topics: Research design, data collection procedures, sampling and data analysis.",
            "id": "MARKETNG 710",
            "parent": "MARKETNG",
            "title": "MARKETING RESEARCH"
        }
    },
    {
        "data": {
            "source": "MARKETNG 300",
            "target": "MARKETNG/OTM 428"
        }
    },
    {
        "data": {
            "source": "MARKETNG 300",
            "target": "MARKETNG 375"
        }
    },
    {
        "data": {
            "source": "MARKETNG 700",
            "target": "MARKETNG 755"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 222"
        }
    },
    {
        "data": {
            "source": "MARKETNG 300",
            "target": "MARKETNG 815"
        }
    },
    {
        "data": {
            "description": "Consumer behavior is a broad field that studies how individuals, families and groups acquire, consume, and dispose of goods, services, ideas and experiences. Provides an integrated view of consumer behavior that draws on psychological, economic, anthropological and sociological perspectives to enhance understanding of consumer acquisition processes.",
            "id": "MARKETNG 305",
            "parent": "MARKETNG",
            "title": "CONSUMER BEHAVIOR"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "MARKETNG 300"
        }
    },
    {
        "data": {
            "source": "MARKETNG 300",
            "target": "MARKETNG 424"
        }
    },
    {
        "data": {
            "source": "MARKETNG 300",
            "target": "MARKETNG 765"
        }
    },
    {
        "data": {
            "source": "GENBUS 311",
            "target": "MARKETNG 730"
        }
    },
    {
        "data": {
            "source": "OTM 300",
            "target": "MARKETNG/OTM 422"
        }
    },
    {
        "data": {
            "source": "MARKETNG 305",
            "target": "MARKETNG 460"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "Supply chain management (SCM) is a dynamic, cross-functional discipline that encompasses the areas of strategy, product development/innovation, marketing, finance, sourcing, production, logistics, and technology in both product and service industries. The supply chain is responsible for the sustainable and efficient movement of products, services, funds, and data along the value chain. Companies must effectively coordinate these functions not only within the firm, but with business partners and customers around the world. SCM is a critical, strategic component of any business or organization, from high-tech to healthcare, and it is a fundamental knowledge base for any student of business.",
            "id": "MARKETNG/OTM 421",
            "title": "FUNDAMENTALS OF SUPPLY CHAIN MANAGEMENT"
        }
    },
    {
        "data": {
            "source": "MATH 213",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "description": "Vector spaces and linear transformations, differential calculus of scalar and vector fields, determinants, eigenvalues and eigenvectors, multiple integrals, line integrals, and surface integrals. Freshmen students are invited to enroll by the Department of Mathematics.",
            "id": "MATH 375",
            "parent": "MATH",
            "title": "TOPICS IN MULTI-VARIABLE CALCULUS AND LINEAR ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Analysis and discussion of contemporary issues in marketing.",
            "id": "MARKETNG 971",
            "parent": "MARKETNG",
            "title": "SEMINAR-MARKETING PHD, CONTEMPORARY TOPICS IN MARKETING"
        }
    },
    {
        "data": {
            "description": "Specialized subject matter of current interest to doctoral students.",
            "id": "MARKETNG 972",
            "parent": "MARKETNG",
            "title": "SEMINAR-MARKETING PHD, RESEARCH METHODS IN MARKETING"
        }
    },
    {
        "data": {
            "description": "Development and effective implementation of planned growth marketing strategies is a pre-requisite to enhancing business performance but is difficult to do. Explore the following topics utilizing an evidence-based approach: growth marketing strategy frameworks; resources and capability for marketing strategy formulation and execution; market orientation, customer orientation, and competitor orientation; key strategy decision points (market selection, value proposition, timing); common implementation problems; organizing for execution; and metrics and performance assessment.",
            "id": "MARKETNG 760",
            "parent": "MARKETNG",
            "title": "GROWTH MARKETING STRATEGIES"
        }
    },
    {
        "data": {
            "source": "MARKETNG 300",
            "target": "MARKETNG 775"
        }
    },
    {
        "data": {
            "description": "Statistical inference and analyses based on models will be introduced and applied in a business context using a calculus-based focus. Topics covered include point estimation, confidence intervals, hypothesis testing, regression models, and time series models. Various methods for fitting a model to data will be explored, and uncertainty about parameter estimates will be quantified so decision makers have information about the quality of the estimates. Regression and time series models are commonly used in business analytics applications and will be used to analyze business data and make inferences and predictions.",
            "id": "GENBUS 317",
            "parent": "GENBUS",
            "title": "MATHEMATICAL FOUNDATIONS OF BUSINESS ANALYTICS"
        }
    },
    {
        "data": {
            "source": "MARKETNG 300",
            "target": "MARKETNG 340"
        }
    },
    {
        "data": {
            "source": "GENBUS 311",
            "target": "MARKETNG 775"
        }
    },
    {
        "data": {
            "source": "MARKETNG 300",
            "target": "MARKETNG/OTM 422"
        }
    },
    {
        "data": {
            "description": "A foundational understanding of digital marketing channels and how successful marketing campaigns use the numerous online and mobile platforms. Fundamentals of digital marketing including internet marketing strategies, user-generated content, search engine optimization, website design and management, inbound marketing, email marketing, social media campaigns, mobile apps, content strategy and paid search advertising.",
            "id": "MARKETNG 755",
            "parent": "MARKETNG",
            "title": "MARKETING IN A DIGITAL AGE"
        }
    },
    {
        "data": {
            "description": "Individual work to complete dissertation requirement of Ph.D. program.",
            "id": "MARKETNG 990",
            "parent": "MARKETNG",
            "title": "MARKETING INDEPENDENT RESEARCH PHD THESIS"
        }
    },
    {
        "data": {
            "source": "GENBUS 311",
            "target": "MARKETNG 755"
        }
    },
    {
        "data": {
            "description": "A foundational understanding of digital marketing channels and how successful marketing campaigns use the numerous online and mobile platforms. Fundamentals of digital marketing including internet marketing strategies, user-generated content, search engine optimization, website design and management, inbound marketing, email marketing, social media campaigns, mobile apps, content strategy and paid search advertising.",
            "id": "MARKETNG 355",
            "parent": "MARKETNG",
            "title": "MARKETING IN A DIGITAL AGE"
        }
    },
    {
        "data": {
            "source": "MARKETNG 300",
            "target": "MARKETNG 310"
        }
    },
    {
        "data": {
            "description": "Understanding and application of in-depth qualitative market research methods, with an emphasis on the interpretation of qualitative data. Provides hands-on experience with different methodological techniques and immersion in a cultural perspective for systematically analyzing data from a marketing perspective.",
            "id": "MARKETNG 805",
            "parent": "MARKETNG",
            "title": "QUALITATIVELY-BASED MARKETING INSIGHTS"
        }
    },
    {
        "data": {
            "description": "Explores the concepts and practices of using information technology to effectively manage and operate supply chains of businesses and other organizations. Topics include supply chain processes, enterprise resource planning (ERP) system implementation, and supply chain simulations using SAP software.",
            "id": "MARKETNG/OTM 727",
            "title": "INFORMATION TECHNOLOGY IN SUPPLY CHAINS"
        }
    },
    {
        "data": {
            "source": "GENBUS 311",
            "target": "MARKETNG 735"
        }
    },
    {
        "data": {
            "source": "MARKETNG 300",
            "target": "MARKETNG 705"
        }
    },
    {
        "data": {
            "source": "ECON 704",
            "target": "MARKETNG 779"
        }
    },
    {
        "data": {
            "source": "OTM 300",
            "target": "MARKETNG/OTM 428"
        }
    },
    {
        "data": {
            "source": "OTM 300",
            "target": "MARKETNG/OTM 421"
        }
    },
    {
        "data": {
            "source": "MARKETNG 310",
            "target": "MARKETNG 450"
        }
    },
    {
        "data": {
            "source": "GENBUS 306",
            "target": "MARKETNG 310"
        }
    },
    {
        "data": {
            "description": "Probability and combinatorial methods, discrete and continuous, univariate and multivariate distributions, expected values, moments, normal distribution and derived distributions, estimation.",
            "id": "MATH/STAT 309",
            "title": "INTRODUCTION TO PROBABILITY AND MATHEMATICAL STATISTICS I"
        }
    },
    {
        "data": {
            "description": "Introduction to machine learning techniques in business. Focus on applications for solving business problems, including hands-on practice in the context of various real-world data sets. Materials covered include machine learning foundations, different methodological approaches, and implementation tools for machine learning for business applications. Methods include both supervised learning techniques (linear regression and classification, non-linear regression, CARTs, random forests, SVMs, artificial neural nets, etc.) as well as unsupervised learning techniques (clustering, principal components, etc.).",
            "id": "GENBUS 656",
            "parent": "GENBUS",
            "title": "MACHINE LEARNING FOR BUSINESS ANALYTICS"
        }
    },
    {
        "data": {
            "description": "Individual work suited to the needs of graduate students may be arranged both during regular sessions and the intersession periods.",
            "id": "MARKETNG 799",
            "parent": "MARKETNG",
            "title": "READING AND RESEARCH-MARKETING"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "GENBUS 306"
        }
    },
    {
        "data": {
            "source": "MATH/STAT 309",
            "target": "GENBUS 317"
        }
    },
    {
        "data": {
            "description": "Exploration of advanced subject areas possibly to be introduced into the business curriculum.",
            "id": "MARKETNG 765",
            "parent": "MARKETNG",
            "title": "CONTEMPORARY TOPICS"
        }
    },
    {
        "data": {
            "description": "Provides a comprehensive and up-to-date treatment of the subjects of brand, brand equity, and strategic brand management. Examines the concepts and techniques to improve the long-term performance of brand strategies.",
            "id": "MARKETNG 735",
            "parent": "MARKETNG",
            "title": "BRAND STRATEGY"
        }
    },
    {
        "data": {
            "source": "MARKETNG 700",
            "target": "MARKETNG 710"
        }
    },
    {
        "data": {
            "description": "Analysis of theories and models of behavior which underlie the process of consumer decision-making. Marketing applications of psychological, sociological and social-psychological factors.",
            "id": "MARKETNG 705",
            "parent": "MARKETNG",
            "title": "CONSUMER BEHAVIOR"
        }
    },
    {
        "data": {
            "source": "MARKETNG 700",
            "target": "MARKETNG/OTM 724"
        }
    },
    {
        "data": {
            "source": "MARKETNG 700",
            "target": "MARKETNG 815"
        }
    },
    {
        "data": {
            "source": "GENBUS 311",
            "target": "MARKETNG 737"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "MATH/STAT 431"
        }
    },
    {
        "data": {
            "id": "MARKETNG",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Introduction to marketing strategy for technology companies and products. Learn how traditional marketing tools can be adopted to help technology products succeed, and what new frameworks beyond the traditional 5C's and 4P's are needed for the marketing of technology products. Topics covered include technology development and adoption, managing disruptive technologies, economics of IT products, AI, and platform strategy.",
            "id": "MARKETNG 740",
            "parent": "MARKETNG",
            "title": "TECHNOLOGY PRODUCT MARKETING"
        }
    },
    {
        "data": {
            "id": "ECON",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "MARKETNG 300",
            "target": "MARKETNG 355"
        }
    },
    {
        "data": {
            "description": "Economic problems of individuals, firms and industries with emphasis on value, price, and distribution of income.",
            "id": "ECON 101",
            "parent": "ECON",
            "title": "PRINCIPLES OF MICROECONOMICS"
        }
    },
    {
        "data": {
            "description": "Emphasis on business and organizational selling and covers professional selling techniques, business development and relationship building, integrating sales and marketing, utilizing sales technology and analytics, as well as building and managing an effective sales force.",
            "id": "MARKETNG 424",
            "parent": "MARKETNG",
            "title": "SALES STRATEGY AND MANAGEMENT"
        }
    },
    {
        "data": {
            "source": "GENBUS 306",
            "target": "MARKETNG 445"
        }
    },
    {
        "data": {
            "description": "Topics covered include axioms of probability, random variables, the most important discrete and continuous probability distributions, expectation and variance, moment generating functions, conditional probability and conditional expectations, multivariate distributions, Markov's and Chebyshev's inequalities, laws of large numbers, and the central limit theorem.",
            "id": "MATH/STAT 431",
            "title": "INTRODUCTION TO THE THEORY OF PROBABILITY"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "MARKETNG 300",
            "target": "MARKETNG 735"
        }
    },
    {
        "data": {
            "description": "Exposure to emerging and current topics in the marketing insights and analytics industry through applied learning experiences including case studies, industry meetings, exercises, and/or workshops.",
            "id": "MARKETNG 842",
            "parent": "MARKETNG",
            "title": "CURRENT TOPICS IN MARKETING ANALYTICS & INSIGHTS"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON 101"
        }
    },
    {
        "data": {
            "id": "GENBUS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "MARKETNG 310",
            "target": "MARKETNG 460"
        }
    },
    {
        "data": {
            "description": "Procurement and supply management is the business function concerned with an organization's acquisition of required materials, services, and equipment. Explores the key aspects of modern supply management including the purchasing process, cost management, negotiation, sourcing strategies, supplier management, category management, acquisition methods for materials and services, and outsourcing.",
            "id": "MARKETNG/OTM 423",
            "title": "PROCUREMENT AND SUPPLY MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Social Media (Facebook, Twitter, Instagram etc.) has changed the way brands communicate with their consumers and vice versa. In this digital age, marketers and entrepreneurs can create competitive advantage for their brand by mastering the science and art of social media strategy. The goal is to understand how brands can leverage social for competitive advantage, consumer listening and innovation. Provides a strong theoretical foundation coupled with practical experience of developing and managing social media strategies for brands.",
            "id": "MARKETNG 775",
            "parent": "MARKETNG",
            "title": "SOCIAL MEDIA MARKETING"
        }
    },
    {
        "data": {
            "source": "MARKETNG 300",
            "target": "MARKETNG 442"
        }
    },
    {
        "data": {
            "source": "MARKETNG 300",
            "target": "MARKETNG/OTM 427"
        }
    },
    {
        "data": {
            "source": "GENBUS 656",
            "target": "MARKETNG 779"
        }
    },
    {
        "data": {
            "description": "Covers multiple approaches to marketing communications. Identifies unique opportunities for creatively solving problems. Develops skills to approach marketing solutions from creative ethical perspectives. Builds and refines marketing skills required to identify, articulate, and resolve marketing and policy problems. Leverages marketing communications to improve society and well-being.",
            "id": "MARKETNG 715",
            "parent": "MARKETNG",
            "title": "SOCIAL CREATIVE MARKETING"
        }
    },
    {
        "data": {
            "id": "CNSRSCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "MARKETNG 300",
            "target": "MARKETNG/OTM 726"
        }
    },
    {
        "data": {
            "description": "Study of the impact of analytics on successful marketing decisions. A spectrum of topics include Marketing Metrics, Digital Analytics, Marketing Response Models, Segmentation, Product Design, Experimentation and Big Data. Applicable to careers in marketing analytics, product management and consulting.",
            "id": "MARKETNG 815",
            "parent": "MARKETNG",
            "title": "MARKETING ANALYTICS"
        }
    },
    {
        "data": {
            "description": "Supply management (procurement) is widely recognized as one of the most critical elements in global supply chain management. The function plays a major role in maximizing the value and the integration of supply chain operations. Explores the key aspects of modern supply management including functional responsibilities and exemplary practices for major industry sectors.",
            "id": "MARKETNG/OTM 724",
            "title": "STRATEGIC GLOBAL SOURCING"
        }
    },
    {
        "data": {
            "source": "OTM 300",
            "target": "MARKETNG/OTM 724"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 213"
        }
    },
    {
        "data": {
            "description": "Capstone marketing decision-making course emphasizing analysis of the external environment. The coordination of tactical and strategic marketing plans with the goals and objectives of the firm.",
            "id": "MARKETNG 460",
            "parent": "MARKETNG",
            "title": "MARKETING STRATEGY"
        }
    },
    {
        "data": {
            "description": "Introduce the set of activities and solutions available to finance an organization's supply chain infrastructure. Define and study the related influencers. Investigate risks and mitigation techniques relative to associated metrics and strategies.  Analyze multiple cases in group study work.  Identify and recommend improvement opportunities.",
            "id": "MARKETNG/OTM 428",
            "title": "SUPPLY CHAIN CAPITAL MANAGEMENT"
        }
    },
    {
        "data": {
            "id": "OTM",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Exposure to emerging and current topics in the marketing insights and analytics industry through applied learning experiences including case studies, industry meetings, exercises, and/or workshops.",
            "id": "MARKETNG 442",
            "parent": "MARKETNG",
            "title": "CURRENT TOPICS IN MARKETING ANALYTICS & INSIGHTS"
        }
    },
    {
        "data": {
            "source": "MARKETNG 300",
            "target": "MARKETNG 410"
        }
    },
    {
        "data": {
            "description": "Techniques of integration, improper integrals, first order ordinary differential equations, sequences and series, Taylor series, vector geometry in two and three dimensions.",
            "id": "MATH 222",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 2"
        }
    },
    {
        "data": {
            "source": "MARKETNG 700",
            "target": "MARKETNG/OTM 726"
        }
    },
    {
        "data": {
            "description": "First order differential equations, introduction to multivariable calculus and constrained optimization, infinite sequences and series, methods of approximation, and a brief introduction to probability. Models and applications from business and the social sciences.",
            "id": "MATH 213",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 2"
        }
    },
    {
        "data": {
            "source": "MARKETNG 300",
            "target": "MARKETNG 425"
        }
    },
    {
        "data": {
            "source": "MARKETNG 300",
            "target": "MARKETNG 335"
        }
    },
    {
        "data": {
            "description": "Development of quantitative intuition through practical applications and use of analysis tools. Specifically, emphasis will be on how to manage, summarize, explore, and visualize databases. The essentials of probability will be introduced and applied to decision problems where there is uncertainty. Emphasis on hypothesis testing and regression analysis and include an introduction to simulation methods. Throughout, attention will be paid to effective communication of data analysis. The use of business cases will connect the course material to both real world settings and recent advances in data analysis, including big data and data mining.",
            "id": "GENBUS 306",
            "parent": "GENBUS",
            "title": "BUSINESS ANALYTICS I"
        }
    },
    {
        "data": {
            "source": "MARKETNG 300",
            "target": "MARKETNG/OTM 423"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "GENBUS 311",
            "target": "MARKETNG 705"
        }
    },
    {
        "data": {
            "description": "Provides a management perspective on the fundamental activities, concepts, and current practices in logistics. Transportation management, order fulfillment, warehousing, global logistics, key performance indicators, outsourcing, and introduction to radio frequency identification and barcoding. Use of case studies and industry speakers.",
            "id": "MARKETNG/OTM 422",
            "title": "LOGISTICS MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Pricing is one of the most important but least understood of marketing decisions. Focus on key concepts and techniques for evaluating and formulating pricing strategies through analytical and experiential learning methods.",
            "id": "MARKETNG 730",
            "parent": "MARKETNG",
            "title": "STRATEGIC PRICING"
        }
    },
    {
        "data": {
            "source": "MARKETNG 300",
            "target": "MARKETNG 365"
        }
    },
    {
        "data": {
            "description": "Integrated treatment of macroeconomics and microeconomics (seeECON 101andECON 102). Accelerated approach to economics training, especially for Economics: Math Emphasis majors.",
            "id": "ECON 111",
            "parent": "ECON",
            "title": "PRINCIPLES OF ECONOMICS-ACCELERATED TREATMENT"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON 111"
        }
    },
    {
        "data": {
            "description": "Probability distributions, statistical inference; multiple linear regression; introduction to econometric methods. It is expected that students will have completed three semesters calculus (such asMATH 234) and linear algebra (such asMATH 340).",
            "id": "ECON 709",
            "parent": "ECON",
            "title": "ECONOMIC STATISTICS AND ECONOMETRICS I"
        }
    },
    {
        "data": {
            "source": "MARKETNG 300",
            "target": "MARKETNG 450"
        }
    },
    {
        "data": {
            "source": "MARKETNG 700",
            "target": "MARKETNG 735"
        }
    },
    {
        "data": {
            "description": "Individual work suited to the needs of Ph.D. students may be arranged both during regular sessions and during the intersession periods.",
            "id": "MARKETNG 999",
            "parent": "MARKETNG",
            "title": "READING AND RESEARCH-MARKETING PHD"
        }
    },
    {
        "data": {
            "description": "Explore strategies and processes by which organizations effectively discover, develop, and launch impactful new products. Includes design thinking methods and the stage-gate approach to generate and evaluate new product ideas.",
            "id": "MARKETNG 437",
            "parent": "MARKETNG",
            "title": "NEW PRODUCT INNOVATION"
        }
    },
    {
        "data": {
            "description": "Explores the critical role of 'Place' within the marketing mix, focusing on how to effectively design, implement, and manage the marketing channels that make products and services available at the right place, time, and value proposition. Covers identifying customer needs, aligning them with the strengths of various market intermediaries, addressing conflicts associated with direct-to-consumer strategies, and understanding incentivization, power dynamics, and control. Delves into managing relationships, the role of brands, and the transition to an omnichannel environment.",
            "id": "MARKETNG 425",
            "parent": "MARKETNG",
            "title": "ROUTE TO MARKET STRATEGIES"
        }
    },
    {
        "data": {
            "description": "Explores the critical role of 'Place' within the marketing mix, focusing on how to effectively design, implement, and manage the marketing channels that make products and services available at the right place, time, and value proposition. Covers identifying customer needs, aligning them with the strengths of various market intermediaries, addressing conflicts associated with direct-to-consumer strategies, and understanding incentivization, power dynamics, and control. Delves into managing relationships, the role of brands, and the transition to an omnichannel environment.",
            "id": "MARKETNG 725",
            "parent": "MARKETNG",
            "title": "ROUTE TO MARKET STRATEGIES"
        }
    },
    {
        "data": {
            "source": "MARKETNG 700",
            "target": "MARKETNG 765"
        }
    },
    {
        "data": {
            "source": "MARKETNG 300",
            "target": "MARKETNG 730"
        }
    },
    {
        "data": {
            "source": "GENBUS 311",
            "target": "MARKETNG 710"
        }
    },
    {
        "data": {
            "description": "Structure of foreign trading; commercial facilities available to exporters and importers; application of economic analysis in marketing decisions; contemporary trends in international economy affecting foreign trade policies and practices.",
            "id": "INTLBUS/MARKETNG 420",
            "title": "GLOBAL MARKETING STRATEGY"
        }
    },
    {
        "data": {
            "description": "Covers multiple approaches to marketing communications. Identifies unique opportunities for creatively solving problems. Develops skills to approach marketing solutions from creative ethical perspectives. Builds and refines marketing skills required to identify, articulate, and resolve marketing and policy problems. Leverages marketing communications to improve society and well-being.",
            "id": "MARKETNG 415",
            "parent": "MARKETNG",
            "title": "SOCIAL CREATIVE MARKETING"
        }
    },
    {
        "data": {
            "source": "MARKETNG 300",
            "target": "MARKETNG 805"
        }
    },
    {
        "data": {
            "source": "CNSRSCI 657",
            "target": "MARKETNG 305"
        }
    },
    {
        "data": {
            "description": "Companies and organizations operate globally - sourcing, producing, and distributing to/from markets around the world. For business leaders in this environment, political, economic, historical, and cultural frameworks are critical to understand and navigate. Learn and explore these themes via classroom and applied experiences in global supply chain management.",
            "id": "MARKETNG/OTM 429",
            "title": "GLOBAL EXPERIENCE: SUPPLY CHAIN MANAGEMENT"
        }
    },
    {
        "data": {
            "source": "MARKETNG 300",
            "target": "MARKETNG 430"
        }
    },
    {
        "data": {
            "source": "OTM 700",
            "target": "MARKETNG/OTM 726"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    }
]