[
    {
        "data": {
            "description": "A preparation and introductory math course for students enrolled in the Summer Collegiate Experience program. Includes material from precalculus and calculus and related topics depending on students' results on the math placement exam.",
            "id": "MATH 118",
            "parent": "MATH",
            "title": "SUMMER COLLEGIATE EXPERIENCE MATHEMATICS COURSE"
        }
    },
    {
        "data": {
            "description": "Covers the graphs, properties and geometric significance of trigonometric functions of a real variable. Other topics include trigonometric equations and identities, application, trigonometric form of complex numbers, DeMoivre's theorem, and polar and parametric equations. The course also has a significant number of applications, especially related to other disciplines.",
            "id": "MATH 113",
            "parent": "MATH",
            "title": "TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "Develop clinical knowledge and skills necessary to care for patients in Pediatrics and Obstetrics and Gynecology, with emphasis on unique skills such as taking care of vulnerable populations as identified in women's and child health and working with caregivers in addition to the patient themselves. Increase knowledge of fundamental science concepts introduced in Human Family Tree during Phase 1 of the curriculum, such as embryology and teratology, genetic testing, and neurodevelopment. Clinical experiences will occur in a range of representative inpatient, outpatient and surgical settings. In structured educational sessions, compare and contrast selected topics in pediatric, obstetric, and gynecologic patient populations, highlighting the relevant physiology, pathophysiology, basic science, and public health topics.",
            "id": "MEDSC-M 810",
            "parent": "MEDSC-M",
            "title": "SPECIALIZED CARE OF OBSTETRIC, GYNECOLOGIC, AND PEDIATRIC PATIENTS (SCOPE)"
        }
    },
    {
        "data": {
            "description": "Focus on assessing patients with urgent medical conditions, providing acute inpatient care, and transitioning patients to other care settings or home under the care of other professionals. Provide acute care in inpatient and outpatient urgent care settings as well as on the inpatient wards, and develop acute management plans and subsequent transition of care plans. Clinical experiences in acute care settings such as the emergency department and inpatient medicine (both general and subspecialty), psychiatry, and neurology. Builds upon fundamental science concepts introduced in Body in Balance and Mind and Motion, including Ohm's Law, acid-base balance, and volume regulation. Organ system-based approach employing varied modalities. Complete an integrated patient-centered experience by participating in the care of a patient from an urgent admission through inpatient treatment and discharge.",
            "id": "MEDSC-M 812",
            "parent": "MEDSC-M",
            "title": "ACUTE CARE"
        }
    },
    {
        "data": {
            "description": "A research-level analysis of the current status of the investigation of processes controlling differential gene activity and cellular behavior. The major emphasis is genetic. In successive years, the focus moves from the gene to the cell to the organism.",
            "id": "GENETICS/MDGENET 707",
            "title": "GENETICS OF DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Accelerated coverage of topics in general chemistry, including introduction to laboratory techniques. Topics include atomic and molecular structure, chemical equilibrium, acid-base chemistry, thermodynamics, kinetics, and electrochemistry.",
            "id": "CHEM 109",
            "parent": "CHEM",
            "title": "ADVANCED GENERAL CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Basic principles of ecology and interrelations between individuals, populations, communities, ecosystems and their environment; transmission genetics and introduction to population genetics; origin of life, evolutionary mechanisms, ancestral relationships among species, and the diversity of life.",
            "id": "BIOCORE 381",
            "parent": "BIOCORE",
            "title": "EVOLUTION, ECOLOGY, AND GENETICS"
        }
    },
    {
        "data": {
            "description": "Biosynthesis of biological molecules, signal transduction mechanisms, chemistry and metabolism of nucleic acids, protein synthesis, and molecular and cellular biology.",
            "id": "BIOCHEM 508",
            "parent": "BIOCHEM",
            "title": "GENERAL BIOCHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Care of adults and children undergoing an operation or procedure, including perioperative preparation, operative care, and post-operative cares for core clinical conditions in the specialties of anesthesia, neurosurgery, ophthalmology, general surgery, otolaryngology, urology, cardiothoracic surgery, peripheral vascular surgery, orthopedics, plastic and reconstructive surgery, and gynecology, as well as interventional radiology, procedural cardiology and gastroenterology. Basic science concepts include cerebral spinal fluid production and flow, fluids and electrolytes, consciousness, inflammation and wound healing, and cancer biology. Anatomic approach using case discussions, podcasts, curated independent reading, online nationally supported modules, and simulation skills. Longitudinal patient care experience integrating communication, evidence based medicine, health information technology, quality improvement  patient safety, professionalism, scientific inquiry, and public health.",
            "id": "MEDSC-M 813",
            "parent": "MEDSC-M",
            "title": "SURGICAL AND PROCEDURAL CARE"
        }
    },
    {
        "data": {
            "description": "Chemistry of biological materials, intermediary metabolism and protein structure.",
            "id": "BIOCHEM 507",
            "parent": "BIOCHEM",
            "title": "GENERAL BIOCHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Contemporary issues in genetic, developmental, cell, and molecular biology are addressed in a discussion format. Invited speakers give research lectures and reading material is taken from the primary literature. The discussion focuses on evaluating genetic approaches to biological problems.",
            "id": "GENETICS/MDGENET 708",
            "title": "METHODS AND LOGIC IN GENETIC ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Contents vary; consideration of subjects not included in the curriculum.",
            "id": "GENETICS/MDGENET 677",
            "title": "ADVANCED TOPICS IN GENETICS"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Directed study projects as arranged with instructor.",
            "id": "MDGENET 699",
            "parent": "MDGENET",
            "title": "INDEPENDENT READING"
        }
    },
    {
        "data": {
            "description": "Directed study projects as arranged with instructor.",
            "id": "MDGENET 999",
            "parent": "MDGENET",
            "title": "INDEPENDENT WORK"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "Explores a detailed atomic and molecular view of matter and its interactions, with a specific focus on quantum theory, molecular structure, and chemical bonding. Application required for enrollment.",
            "id": "CHEM 115",
            "parent": "CHEM",
            "title": "CHEMICAL PRINCIPLES I"
        }
    },
    {
        "data": {
            "description": "Focuses on molecular, genetic, embryologic, hormonal, anatomical and physiological factors that govern fertility, cell growth, fetal development, and pregnancy as well as the congenital anomalies that can occur when those processes are aberrant. Encompasses the full life-cycle spectrum including childhood growth and development, young adulthood/puberty, issues affecting adolescents and young adults, genetic basis of human disease, reproductive health, menopause, aging, unregulated cell growth (cancer) and end of life issues. Significant content from other competency domains, or \"longitudinal threads\", such as public health, advocacy, ethics, patient care/communication and clinical skills.",
            "id": "MEDSC-M 773",
            "parent": "MEDSC-M",
            "title": "HUMAN FAMILY TREE"
        }
    },
    {
        "data": {
            "description": "Focuses on the basic molecular mechanisms that regulate DNA, RNA, and protein metabolism in eukaryotic organisms.",
            "id": "BIOCHEM/GENETICS/MDGENET 620",
            "title": "EUKARYOTIC MOLECULAR BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Focuses on the genetic basis by which cancer manifests. Provides a comprehensive overview of how cancer is generated as a result of abnormalities at the DNA level, paying special attention to oncogenes, tumor suppressors, DNA mutations, DNA repair mechanisms, chromosomal instability, and tumor heterogeneity. Stresses the role of the immune system in combating cancer, the phenomenon of cancer resistance, anti-tumor strategies, and epigenetic influences on tumorigenesis. Highlights connections between course material and clinical relevance.",
            "id": "GENETICS/MDGENET 662",
            "title": "CANCER GENETICS"
        }
    },
    {
        "data": {
            "description": "General biological principles. Topics include: evolution, ecology, animal behavior, cell structure and function, genetics and molecular genetics and the physiology of a variety of organ systems emphasizing function in humans.",
            "id": "BIOLOGY/ZOOLOGY 101",
            "title": "ANIMAL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Genetic analysis, population genetics, evolution and quantitative genetics. Includes mutant screens, pathway analysis, mosaic analysis, reverse genetics, genomics, Hardy-Weinberg  linkage equilibrium, inbreeding, genetic drift, natural selection, population structure, inheritance of complex traits, domestication and human evolution.",
            "id": "GENETICS 468",
            "parent": "GENETICS",
            "title": "GENERAL GENETICS 2"
        }
    },
    {
        "data": {
            "description": "Genetics and genomics are rapidly evolving fields. In modern clinical care settings, clinicians will be exposed to genetic and genomic data, including that brought by patients, and knowing how to read genetic and genomic data is increasingly necessary in clinical practice. Genetics and genomics in a clinical setting spans a wide range of topics including diagnosis and treatment of genetic diseases. Familiarity with clinical genetic analysis, and the genetic approaches used in basic science, helps medical students better understand genetic disease background. Learn how to bridge basic concepts of human genetics and clinical genetics (actual diseases). Emphases will include research into human genetic diseases, including designing genetic testing, using model organisms and/or cell culture systems, and the development of genetic testing technologies.",
            "id": "MDGENET 911",
            "parent": "MDGENET",
            "title": "MODERN CLINICAL GENETICS: HOW TO APPROACH A RAPIDLY CHANGING FIELD"
        }
    },
    {
        "data": {
            "description": "Genetics in eukaryotes and prokaryotes.  Includes transmission genetics, molecular genetics, evolutionary genetics, genetic engineering, and societal issues associated with genetics.  Illustrative material includes bacteria, plants, insects, and vertebrates.",
            "id": "GENETICS 466",
            "parent": "GENETICS",
            "title": "PRINCIPLES OF GENETICS"
        }
    },
    {
        "data": {
            "description": "Genetics of eukaryotes and prokaryotes. Includes transmission genetics, probability and hypothesis testing, genetic mapping, molecular genetics, gene expression, and genetic engineering. Illustrative material includes viruses, bacteria, plants, fungi, insects, and humans.",
            "id": "GENETICS 467",
            "parent": "GENETICS",
            "title": "GENERAL GENETICS 1"
        }
    },
    {
        "data": {
            "description": "Identify the roles of physicians, interdisciplinary providers, health care systems, and communities in screening, treating, and preventing common, chronic conditions. Activities are centered on health promotion, outpatient-based chronic disease management, and community health. Clinical experiences will occur in primary care, behavioral health, and other ambulatory and community-based settings that focus on chronic disease management.",
            "id": "MEDSC-M 811",
            "parent": "MEDSC-M",
            "title": "CHRONIC AND PREVENTIVE CARE"
        }
    },
    {
        "data": {
            "description": "Integrated examination of how the immune system interacts with foreign microbes, the normal micro biome, and self tissues, both normal and malignant. Examines inflammation and the impacts of this type of response on normal cells, in wound healing, infectious disease, and inflammatory diseases including autoimmune disease and dermatologic conditions, including neoplasia of the skin. Covers the development of adaptive immune responses from vaccination, infectious processes, and organ transplantation. Covers the basic biology and pathophysiology of \"invaders\" of the human body, including viruses, fungi, and bacteria, along with their clinical diagnosis and therapy. Addresses malignant transformation of the immune effector cells themselves, including cancers of mature lymphoid cells and bone marrow derived malignancies.",
            "id": "MEDSC-M 774",
            "parent": "MEDSC-M",
            "title": "INVADERS AND DEFENSE"
        }
    },
    {
        "data": {
            "description": "Introduction to concepts of health and disease, which vary from patient to patient and through time. View health from a population standpoint, with an introduction to basic public health concepts as well as how physicians may positively impact both individual and population level health. Woven within that framework are introductions to key aspects of professionalism, patient-centered history- taking, and core communication skills.",
            "id": "MEDSC-M 770",
            "parent": "MEDSC-M",
            "title": "PATIENTS, PROFESSIONALISM AND PUBLIC HEALTH"
        }
    },
    {
        "data": {
            "description": "Introduction to core basic science, pathophysiologic, and diagnostic principles requisite for the care and treatment of patients with musculoskeletal, neurologic, and psychiatric presentations and disorders. Basic science concepts include those from the traditional disciplines of cell biology, histology, biochemistry, anatomy, embryology, neuroscience, and behavioral science. Regular integration of these topics with their pathologic and pathophysiologic counterparts. Integration of content related to other competency domains, or \"longitudinal threads\", that include patient care  communication, evidence based medicine, health information technology, quality improvement  patient safety, professionalism, scientific inquiry and public health.",
            "id": "MEDSC-M 775",
            "parent": "MEDSC-M",
            "title": "MIND & MOTION"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Organized around biomedical themes including nutrients, the digestive system, the biochemistry and endocrine control of metabolism, exercise and fitness and the removal of waste products and toxins to present an integrated picture of how these systems function together to maintain homeostasis. Integrates developmental content from competency domains, or \"longitudinal threads\", including communication, patient care, ethics, health information technology, public health, professionalism, quality improvement, patient safety, and scientific inquiry.",
            "id": "MEDSC-M 772",
            "parent": "MEDSC-M",
            "title": "FOOD, FASTING & FITNESS"
        }
    },
    {
        "data": {
            "description": "Organized around physiological themes, the course includes material related to the cardiovascular system, hematology, nephrology, and pulmonology to present an integrated picture of how these systems function together to maintain homeostasis. In addition, there is significant content from other competency domains such as public health, ethics, evidence-based medicine, patient care/communication and clinical skills.",
            "id": "MEDSC-M 771",
            "parent": "MEDSC-M",
            "title": "BODY IN BALANCE"
        }
    },
    {
        "data": {
            "description": "Principles and application of chemical equilibrium, coordination chemistry, oxidation-reduction and electrochemistry, kinetics, nuclear chemistry, introduction to organic chemistry, and chemistry laboratory skills.",
            "id": "CHEM 104",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Principles of molecular structure and bonding applied to predict and explain the reactivity of alkanes, alkenes, alkynes, alkyl halides, alcohols, and thiols. Emphasis placed on rationalizing the stereochemical and regiochemical outcome of chemical processes.",
            "id": "CHEM 343",
            "parent": "CHEM",
            "title": "ORGANIC CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Principles of molecular structure and bonding applied to predict and explain the reactivity of aromatic systems, benzylic and allylic systems, aryl and vinyl halides, and carbonyl-containing compounds (e.g., ketones, carboxylic acids, esters, acid chlorides, amides). Emphasis placed on rationalizing the stereochemical and regiochemical outcome of chemical processes as well as arguing reaction outcomes from spectroscopic evidence.",
            "id": "CHEM 345",
            "parent": "CHEM",
            "title": "ORGANIC CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Principles, problems, and methods of modern human genetics. Focuses on how researchers discover the genetics of diseases and how those discoveries are used to improve clinical practice. Surveys aspects of (i) the molecular function of the human genome, (ii) the basic principles of human genetics including statistical genetics, quantitative genetics, and genomic variation in human populations, (iii) the genetics of rare disorders and common diseases, and genomic analysis approaches, including genome-wide association studies and sequencing, and (iv) how genetics are used in medicine and discussions covering ethical considerations of human genomic data.",
            "id": "GENETICS/MDGENET 565",
            "title": "HUMAN GENETICS"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Provides an introduction to public health genomics through a review of fundamental principles of genetics, the use of genetic information in clinical and research settings, and its implications for disease management and prevention, and health promotion.  Explores policies that guide public health and discusses current ethical, legal, and social implications of these policies.",
            "id": "GENETICS/MDGENET/POPHLTH 636",
            "title": "PUBLIC HEALTH GENOMICS"
        }
    },
    {
        "data": {
            "description": "Stoichiometry and the mole concept, the behavior of gases, liquids and solids, thermochemistry, electronic structure of atoms and chemical bonding, descriptive chemistry of selected elements and compounds, intermolecular forces, and chemistry laboratory skills.",
            "id": "CHEM 103",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "The two semester sequenceMATH 112-MATH 113covers similar material asMATH 114, but in a slower pace. Not recommended for students with less than an AB inMATH 96.",
            "id": "MATH 114",
            "parent": "MATH",
            "title": "ALGEBRA AND TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Part of a 2-semester sequence withMATH 217; these two courses together are equivalent toMATH 114and221.",
            "id": "MATH 171",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY I"
        }
    },
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics and selected topics in Animal Physiology.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "id": "BIOCHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "BIOCORE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "GENETICS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MDGENET",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MEDSC-M",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 507",
            "target": "BIOCHEM 508"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 508",
            "target": "BIOCHEM/GENETICS/MDGENET 620"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "GENETICS 466"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 101"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "GENETICS 467"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "GENETICS/MDGENET/POPHLTH 636"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 151"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 109"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 343"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "GENETICS 467"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 115",
            "target": "GENETICS 466"
        }
    },
    {
        "data": {
            "source": "CHEM 343",
            "target": "CHEM 345"
        }
    },
    {
        "data": {
            "source": "CHEM 345",
            "target": "BIOCHEM 507"
        }
    },
    {
        "data": {
            "source": "GENETICS 466",
            "target": "GENETICS 467"
        }
    },
    {
        "data": {
            "source": "GENETICS 466",
            "target": "GENETICS/MDGENET 662"
        }
    },
    {
        "data": {
            "source": "GENETICS 466",
            "target": "GENETICS/MDGENET 677"
        }
    },
    {
        "data": {
            "source": "GENETICS 467",
            "target": "GENETICS 466"
        }
    },
    {
        "data": {
            "source": "GENETICS 467",
            "target": "GENETICS 468"
        }
    },
    {
        "data": {
            "source": "GENETICS 468",
            "target": "GENETICS/MDGENET 565"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 113"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 113",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 114",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 114"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "CHEM 109"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 114"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 770",
            "target": "MEDSC-M 810"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 771",
            "target": "MEDSC-M 810"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 772",
            "target": "MEDSC-M 810"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 773",
            "target": "MEDSC-M 810"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 774",
            "target": "MEDSC-M 810"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 775",
            "target": "MEDSC-M 810"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 810",
            "target": "MDGENET 911"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 811",
            "target": "MDGENET 911"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 812",
            "target": "MDGENET 911"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "MDGENET 911"
        }
    }
]