[
    {
        "data": {
            "description": "Develop clinical knowledge and skills necessary to care for patients in Pediatrics and Obstetrics and Gynecology, with emphasis on unique skills such as taking care of vulnerable populations as identified in women's and child health and working with caregivers in addition to the patient themselves. Increase knowledge of fundamental science concepts introduced in Human Family Tree during Phase 1 of the curriculum, such as embryology and teratology, genetic testing, and neurodevelopment. Clinical experiences will occur in a range of representative inpatient, outpatient and surgical settings. In structured educational sessions, compare and contrast selected topics in pediatric, obstetric, and gynecologic patient populations, highlighting the relevant physiology, pathophysiology, basic science, and public health topics.",
            "id": "MEDSC-M 810",
            "parent": "MEDSC-M",
            "title": "SPECIALIZED CARE OF OBSTETRIC, GYNECOLOGIC, AND PEDIATRIC PATIENTS (SCOPE)"
        }
    },
    {
        "data": {
            "description": "Focus on assessing patients with urgent medical conditions, providing acute inpatient care, and transitioning patients to other care settings or home under the care of other professionals. Provide acute care in inpatient and outpatient urgent care settings as well as on the inpatient wards, and develop acute management plans and subsequent transition of care plans. Clinical experiences in acute care settings such as the emergency department and inpatient medicine (both general and subspecialty), psychiatry, and neurology. Builds upon fundamental science concepts introduced in Body in Balance and Mind and Motion, including Ohm's Law, acid-base balance, and volume regulation. Organ system-based approach employing varied modalities. Complete an integrated patient-centered experience by participating in the care of a patient from an urgent admission through inpatient treatment and discharge.",
            "id": "MEDSC-M 812",
            "parent": "MEDSC-M",
            "title": "ACUTE CARE"
        }
    },
    {
        "data": {
            "description": "Introduction to the medical humanities and their application to clinical practice, utilizing a variety of humanistic approaches, drawing from history, philosophy, anthropology, literary studies, and religious studies. Engage with a variety of forms of expression, including essays, poetry, film, podcasts, music, and visual art. These humanistic approaches complement the science-focused approach of contemporary medical education by enhancing students' ability to offer more compassionate and culturally competent care, and helping students build resiliency through using artistic forms of expression to process their experiences. Engage with the medical humanities through a different theme, such as the doctor-patient relationship, death and dying, or healing and wholeness.",
            "id": "MEDHIST 744",
            "parent": "MEDHIST",
            "title": "INTRODUCTION TO THE MEDICAL HUMANITIES"
        }
    },
    {
        "data": {
            "description": "Narrative medicine is the practice of using stories to understand health and illness in the context of people's lives. Whether through fiction or nonfiction, poetry or prose, text or graphics, giving voice to the stories of patients and caregivers allows their experiences to be heard, made sense of, and valued. Learning to listen to others and to express one's own vulnerabilities are valuable tools for all health practitioners, but they are especially valuable in the context of public health. The scope of public health interventions encourages practitioners to think in terms of populations, but efforts to improve quality of life through prevention must ultimately be grounded in individual lives. Explore how narrative medicine techniques can enrich the practice of public health, both through the power of listening to stories to understand how individuals experience health and through the power of telling stories to mobilize communities.",
            "id": "MEDHIST 740",
            "parent": "MEDHIST",
            "title": "NARRATIVE MEDICINE AND PUBLIC HEALTH"
        }
    },
    {
        "data": {
            "description": "A survey of different conceptions of how the body as a site of sickness has been understood from Antiquity to contemporary medicine. Includes consideration of the origins and evolution of public health, the changing social role of healers, and the emergence of the modern \"standardized\" body in health and illness.",
            "id": "HISTSCI/MEDHIST 212",
            "title": "BODIES, DISEASES, AND HEALERS: AN INTRODUCTION TO THE HISTORY OF MEDICINE"
        }
    },
    {
        "data": {
            "description": "A survey of ethical and social issues in medical ethics and history of medicine. Cooperating faculty may be drawn from philosophy, law, medical ethics, history, political science, public health, economics, education, and communication, as well as medicine and the biological sciences.",
            "id": "MEDHIST 559",
            "parent": "MEDHIST",
            "title": "TOPICS IN ETHICS AND HISTORY OF MEDICINE"
        }
    },
    {
        "data": {
            "description": "Addresses the science, ethics, history, and communication strategies associated with the use of animals in research. Seeks to identify and employ common ground among those with different perspectives to enable students to make good decisions about this contentious topic.",
            "id": "MEDHIST/PATH-BIO 370",
            "title": "ADDRESSING CONTROVERSY: THE SCIENCE, ETHICS, AND PUBLIC DISCUSSION OF ANIMAL RESEARCH"
        }
    },
    {
        "data": {
            "description": "Advanced readings in primary and secondary literature concerning medicine in Europe from the 18th century to mid-20th century, investigating changes in disease and demography, state interest in health care, and medical professions, and both scientific and alternative medical ideas.",
            "id": "MEDHIST 708",
            "parent": "MEDHIST",
            "title": "HEALTH, DISEASE AND HEALING II"
        }
    },
    {
        "data": {
            "description": "Advanced readings in primary and secondary literature concerning public health issues and problems in America from the eighteenth to the twentieth century, and efforts made toward their solutions.",
            "id": "MEDHIST 709",
            "parent": "MEDHIST",
            "title": "DEVELOPMENT OF PUBLIC HEALTH IN AMERICA"
        }
    },
    {
        "data": {
            "description": "Advanced readings that examine major problems in modern international health. Focus on epidemiology and disease ecology; political economy of health; migration; quarantine; international health research; cross-cultural healing; mental and maternal health; growth of international health organizations.",
            "id": "MEDHIST 753",
            "parent": "MEDHIST",
            "title": "INTERNATIONAL HEALTH AND GLOBAL SOCIETY"
        }
    },
    {
        "data": {
            "description": "An in-depth study of a selection of ethical issues arising from the application of modern biotechnology to microorganisms, plants, non-human animals, and human beings. We will aim at a discussion that is informed by empirical research and by work done in ethical theory, political philosophy, and other relevant disciplines, and whose character is rigorous, clear, nuanced, and unbiased.",
            "id": "AGRONOMY/C&ESOC/MEDHIST/PHILOS 565",
            "title": "THE ETHICS OF MODERN BIOTECHNOLOGY"
        }
    },
    {
        "data": {
            "description": "Analyze ethical dimensions of population-level efforts to protect and promote health. Gain understanding of different ethical frameworks, their theoretical underpinnings, and their prospects for resolving real-world policy dilemmas in the context of medicine and public health. Hone the craft of constructing ethical arguments, and foreseeing and responding to potential objections.",
            "id": "MEDHIST 741",
            "parent": "MEDHIST",
            "title": "ETHICAL ISSUES IN PUBLIC HEALTH"
        }
    },
    {
        "data": {
            "description": "Analyzes the scientific and social aspects of the development of modern medicine and public health in Europe and America.",
            "id": "HISTSCI/MEDHIST 919",
            "title": "GRADUATE STUDIES IN MEDICAL HISTORY"
        }
    },
    {
        "data": {
            "description": "Care of adults and children undergoing an operation or procedure, including perioperative preparation, operative care, and post-operative cares for core clinical conditions in the specialties of anesthesia, neurosurgery, ophthalmology, general surgery, otolaryngology, urology, cardiothoracic surgery, peripheral vascular surgery, orthopedics, plastic and reconstructive surgery, and gynecology, as well as interventional radiology, procedural cardiology and gastroenterology. Basic science concepts include cerebral spinal fluid production and flow, fluids and electrolytes, consciousness, inflammation and wound healing, and cancer biology. Anatomic approach using case discussions, podcasts, curated independent reading, online nationally supported modules, and simulation skills. Longitudinal patient care experience integrating communication, evidence based medicine, health information technology, quality improvement  patient safety, professionalism, scientific inquiry, and public health.",
            "id": "MEDSC-M 813",
            "parent": "MEDSC-M",
            "title": "SURGICAL AND PROCEDURAL CARE"
        }
    },
    {
        "data": {
            "description": "Directed study projects as arranged with instructor.",
            "id": "MEDHIST 699",
            "parent": "MEDHIST",
            "title": "INDEPENDENT STUDY IN MEDICAL HISTORY"
        }
    },
    {
        "data": {
            "description": "Ethical issues apparently created by new biomedical technologies, such as genetic screening, prenatal diagnosis, prolongation of life, treatment of severe birth defects, in vitro fertilization, behavior modification, psychosurgery, and transplantation.",
            "id": "MEDHIST/PHILOS 558",
            "title": "ETHICAL ISSUES IN HEALTH CARE"
        }
    },
    {
        "data": {
            "description": "Examine how ethical issues in clinical practice affect public health outcomes. Gain an understanding of the ethical frameworks and practices that are employed in medicine, in order to understand the complex interplay between public health and clinical care. Develop the ability to identify the ethically salient features of a patient case and to employ ethical analysis to generate recommendations that improve public health outcomes.",
            "id": "MEDHIST 745",
            "parent": "MEDHIST",
            "title": "CLINICAL ETHICS - INDIVIDUAL AND POPULATION CONSIDERATIONS"
        }
    },
    {
        "data": {
            "description": "Examine ideas about race and ethnicity and their relationship to the history of \"Western\" medicine and science. Analyze the role of social, economic, cultural, and political developments in the shaping of scientific and medical notions of race and bodily difference. Study how skin color (and other elements of \"racial identity\") has influenced the experiences of patients and populations, physicians and nurses, and medical researchers. Discuss how conceptions of race have shaped both the health concerns and health outcomes of Americans in the past three hundred years, and the structure of medical institutions in the United States. Topics include the origins of racial classification, race and colonialism, the health and medical care of the enslaved, the use of enslaved people as research subjects, the history of racial disparities in medicine, structural racism of the medical establishment, race and reproduction, and the struggle for justice in health care during the past few decades.",
            "id": "MEDHIST 746",
            "parent": "MEDHIST",
            "title": "RACE, SCIENCE, AND MEDICINE: PAST AND PRESENT"
        }
    },
    {
        "data": {
            "description": "Examines ethical issues in the distribution, financing, and delivery of health care (primarily in the United States). Explores key issues in U.S. health policy and forms the empirical foundation for the rest of the class. Engages is ongoing debates in moral and political philosophy over putative entitlements to health and health care. Investigates the nature, justifiability, and methods of health care rationing (including bedside rationing by doctors) and the myriad issues implicated by the near-universally shared goal of health care cost containment.",
            "id": "MEDHIST/PHILOS 505",
            "title": "JUSTICE AND HEALTH CARE"
        }
    },
    {
        "data": {
            "description": "Examines the history of illness and medical practice in Latin America and the Caribbean from the colonial era until the present. Using an interdisciplinary set of sources, students will explore the different meanings of disease, body normativity, medical practice, and ideas about public health across different historical circumstances in the region.",
            "id": "HISTORY/HISTSCI/MEDHIST 564",
            "title": "DISEASE, MEDICINE AND PUBLIC HEALTH IN THE HISTORY OF LATIN AMERICA AND THE CARIBBEAN"
        }
    },
    {
        "data": {
            "description": "Explore national and international health projects aimed to address infectious disease epidemics in the context of changing ideas about human difference, the shifting economic and socio-political dimensions of international health, and the history of migration. Using a range of sources from historical documents, social science, films, and biomedical research, explore circumstances linking ideas about \"alien\" people (a term historically used to talk about enslaved people, Native Americans, minorities, and immigrants), and \"plagues.\" Examine the relationship between ideas about disease and migration, risk factors and disease patterns related to migration, migrant populations' access to health-care resources, perceived threats of infectious diseases related to migrant populations and the ways such threats have shaped medical theories, and the institutional landscape of global health.",
            "id": "MEDHIST 750",
            "parent": "MEDHIST",
            "title": "OUTBREAK!: EPIDEMICS, MIGRATION, AND THE CHANGING CONTOURS OF GLOBAL HEALTH"
        }
    },
    {
        "data": {
            "description": "Explores and examines the ethical issues central to clinical research, regulations governing clinical investigation, and the role of good clinical practice for clinical trials.",
            "id": "MEDHIST 545",
            "parent": "MEDHIST",
            "title": "ETHICAL AND REGULATORY ISSUES IN CLINICAL INVESTIGATION"
        }
    },
    {
        "data": {
            "description": "Explores how a humanistic perspective can broaden our understanding of health and medicine. Specifically, we will examine the role of language and culture in the creation and circulation of biomedical knowledge; our lived experiences with illness (physical and mental); the intricate intersections of race, gender, sexuality, disability and medicine; the political dimensions of diagnosis, disease, and epidemics, and the role that fiction, creative non-fiction, comics, and film play in shaping our experiences with health and medicine as health care providers and as patients. The course does not assume any background in science or medicine. One of our recurrent topics, in fact, will be to consider how non-experts interact with medicine and its technical vocabularies. Although the primary objective of the course is to understand the cultural, social, and political dimensions of health and medicine, a secondary objective is for students to become more savvy patients and, for the few students who might emerge on the other side of the stethoscope one day, more well rounded health care professionals.",
            "id": "ENGL/HISTSCI/MEDHIST 525",
            "title": "HEALTH AND THE HUMANITIES"
        }
    },
    {
        "data": {
            "description": "Focuses on ethical issues implicated in a population-level approach to disease prevention and health promotion.  Explores prominent theoretical approaches to public health ethics and engages with several ethical tensions.  Example issues include: the use of coercive or intrusive public health; the justification of patemalistic measures in societies; the extent to which societies should hold individuals responsible for their health conditions; the need to decide who receives life-saving treatment or vaccination; and climate changes and intergenerational justice; ethical issues in international pharmaceutical research.",
            "id": "MEDHIST/PHILOS 515",
            "title": "PUBLIC HEALTH ETHICS"
        }
    },
    {
        "data": {
            "description": "Focuses on molecular, genetic, embryologic, hormonal, anatomical and physiological factors that govern fertility, cell growth, fetal development, and pregnancy as well as the congenital anomalies that can occur when those processes are aberrant. Encompasses the full life-cycle spectrum including childhood growth and development, young adulthood/puberty, issues affecting adolescents and young adults, genetic basis of human disease, reproductive health, menopause, aging, unregulated cell growth (cancer) and end of life issues. Significant content from other competency domains, or \"longitudinal threads\", such as public health, advocacy, ethics, patient care/communication and clinical skills.",
            "id": "MEDSC-M 773",
            "parent": "MEDSC-M",
            "title": "HUMAN FAMILY TREE"
        }
    },
    {
        "data": {
            "description": "Graduate level special topics course in medical ethics or bioethics more broadly.",
            "id": "MEDHIST 734",
            "parent": "MEDHIST",
            "title": "GRADUATE STUDIES IN MEDICAL ETHICS"
        }
    },
    {
        "data": {
            "description": "Health problems in the U.S. from the colonial period to the twentieth century; efforts made toward their solutions.",
            "id": "HISTSCI/MEDHIST 509",
            "title": "THE DEVELOPMENT OF PUBLIC HEALTH IN AMERICA"
        }
    },
    {
        "data": {
            "description": "How did today's biology emerge out of the diverse traditions of agriculture and natural history (bees and trees), biomedicine and molecular biology (germs and genes), which stretch back into the eighteenth century? Examines classic texts and \"game-changers\" in the history of biology, putting them into broader scientific and social contexts to see how these different ways of knowing intertwined, competed, and yielded novel approaches to the study of life that still shape today's life sciences.",
            "id": "HISTORY/HISTSCI/MEDHIST 132",
            "title": "BEES, TREES, GERMS, AND GENES: A HISTORY OF BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Identify the roles of physicians, interdisciplinary providers, health care systems, and communities in screening, treating, and preventing common, chronic conditions. Activities are centered on health promotion, outpatient-based chronic disease management, and community health. Clinical experiences will occur in primary care, behavioral health, and other ambulatory and community-based settings that focus on chronic disease management.",
            "id": "MEDSC-M 811",
            "parent": "MEDSC-M",
            "title": "CHRONIC AND PREVENTIVE CARE"
        }
    },
    {
        "data": {
            "description": "In-depth analysis of ethical issues arising from the practices and advances of brain science in clinical, research, legal, and consumer contexts. Includes a foundation in ethical theory and philosophical methodology.",
            "id": "MEDHIST/PHILOS 534",
            "title": "ETHICS AND THE BRAIN"
        }
    },
    {
        "data": {
            "description": "Independent reading, research and writing for medical professional students under the supervision of a faculty member.",
            "id": "MEDHIST 890",
            "parent": "MEDHIST",
            "title": "READING AND RESEARCH"
        }
    },
    {
        "data": {
            "description": "Independent research and writing for graduate students under the supervision of a faculty member.",
            "id": "MEDHIST 999",
            "parent": "MEDHIST",
            "title": "ADVANCED INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Introduction to the study of religion, science, and medicine. Focus on how religion, science, and medicine have shaped practices of knowledge production and meaning making with respect to human life, by considering theories of human history and racial progress; how logics of contagion structure human relationships and communal boundaries; the variety of ways of understanding and caring for bodies; and the place of humans within broader ecologies.",
            "id": "HISTSCI/MEDHIST/RELIGST 331",
            "title": "SCIENCE, MEDICINE AND RELIGION"
        }
    },
    {
        "data": {
            "description": "Major problems in international health from 1750 to the present. Focus on disease epidemiology and ecology; political economy of health; migration; quarantine; race, ethnicity, and health care; international health research; cross-cultural healing; mental and maternal health; growth of international health organizations.",
            "id": "HISTSCI/MEDHIST/POPHLTH 553",
            "title": "INTERNATIONAL HEALTH AND GLOBAL SOCIETY"
        }
    },
    {
        "data": {
            "description": "Medicine in Europe from the 18th century to mid-20th century, investigating changes in disease and demography, state interest in health care, the medical professions, and both scientific and alternative medical ideas.",
            "id": "HISTORY/HISTSCI/MEDHIST 508",
            "title": "HEALTH, DISEASE AND HEALING II"
        }
    },
    {
        "data": {
            "description": "Offers students enrolled in the Health and the Humanities certificate an opportunity to conduct independent research under the guidance of a faculty member. It allows students who have enrolled in or completed  a Health and the Humanities Capstone an opportunity to go into greater depth on a topic covered in the capstone course. In consultation with a faculty member, students will design a project that builds on lessons learned or work completed as part of their capstone experience.",
            "id": "ENGL/HISTSCI/MEDHIST 599",
            "title": "DIRECTED STUDY IN HEALTH AND THE HUMANITIES"
        }
    },
    {
        "data": {
            "description": "Opportunity to learn and employ foundational methods and principles of bioethics. Gain an understanding of modes of argument in bioethics and hone the craft of analyzing and constructing ethical arguments, and foreseeing and responding to potential objections.",
            "id": "MEDHIST 729",
            "parent": "MEDHIST",
            "title": "INTRODUCTION TO BIOETHICS"
        }
    },
    {
        "data": {
            "description": "Organized around physiological themes, the course includes material related to the cardiovascular system, hematology, nephrology, and pulmonology to present an integrated picture of how these systems function together to maintain homeostasis. In addition, there is significant content from other competency domains such as public health, ethics, evidence-based medicine, patient care/communication and clinical skills.",
            "id": "MEDSC-M 771",
            "parent": "MEDSC-M",
            "title": "BODY IN BALANCE"
        }
    },
    {
        "data": {
            "description": "Provides analytical tools for the critical examination of the social, cultural, political and economic determinants of health conditions and medical practice. Pays special attention to how these factors determine how patients and providers experience and ideate disease and treatment, and how they respond to specific health care policies. Emphasizes the important role that conditions of structural violence and inequality play as determinants of health conditions in a globalized world.",
            "id": "ANTHRO/MEDHIST 231",
            "title": "INTRODUCTION TO SOCIAL MEDICINE"
        }
    },
    {
        "data": {
            "description": "Provides historical perspectives on current dilemmas facing black patients and health care professionals.",
            "id": "AFROAMER/HISTSCI/MEDHIST 523",
            "title": "RACE, AMERICAN MEDICINE AND PUBLIC HEALTH"
        }
    },
    {
        "data": {
            "description": "Study of regenerative medicine and stem cell research within social, ethical and political contexts.",
            "id": "CRB/MEDHIST 615",
            "title": "REGENERATIVE MEDICINE ETHICS AND SOCIETY"
        }
    },
    {
        "data": {
            "description": "Survey in bioethics aimed at students in the health sciences. Topics to include a mix of important perennial issues and emerging problems.",
            "id": "MEDHIST 730",
            "parent": "MEDHIST",
            "title": "TOPICS IN BIOETHICS"
        }
    },
    {
        "data": {
            "description": "There are many ethical issues related to food production, distribution, consumption, and policy, including animal welfare, animal rights, vegetarianism and veganism, environmental impact, treatment of workers, prospects for agricultural reform, ethical responsibilities of corporate and industry actors, and labeling issues surrounding the use of genetically engineered foods. Some are more theoretical, such as which individuals affected by agriculture deserve direct moral consideration. Other are more practical, such as how to feed a growing global population. We will begin with a brief survey of ethical theories and methods of ethical reasoning, and then explore, from both personal and policy perspectives, several food ethics issues. Among the aims of the course are the goals of helping you think critically about the ethically relevant impacts of your own food choices and improving your understanding of ethical issues implicated in food systems.",
            "id": "MEDHIST/PHILOS 344",
            "title": "FOOD ETHICS"
        }
    },
    {
        "data": {
            "description": "This course demonstrates that human bodies have social and cultural histories. It will highlight the social values placed on different bodies, the changing social expectations bodies create, and the role of science and medicine in creating the cultural meanings of bodies.",
            "id": "GEN&WS/HISTSCI/MEDHIST 532",
            "title": "THE HISTORY OF THE (AMERICAN) BODY"
        }
    },
    {
        "data": {
            "description": "Understand and analyze the U.S. health care system through the lens of ethical criticisms made by and on behalf of the diverse populations it serves. Gain understanding of philosophical debates over universal health insurance coverage, fair health care financing, effective cost-containment, and rationing. Hone the craft of constructing ethical arguments, and foreseeing and responding to potential objections.",
            "id": "MEDHIST 742",
            "parent": "MEDHIST",
            "title": "ETHICS AND U.S. HEALTH CARE POLICY"
        }
    },
    {
        "data": {
            "description": "Upper-level special topics course in the history of medicine.",
            "id": "HISTSCI/MEDHIST 668",
            "title": "TOPICS IN HISTORY OF MEDICINE"
        }
    },
    {
        "data": {
            "description": "Women as patients and as health professionals in America from the colonial period to the present.",
            "id": "GEN&WS/HISTSCI/MEDHIST 531",
            "title": "WOMEN AND HEALTH IN AMERICAN HISTORY"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MEDHIST",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MEDSC-M",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "HISTORY/HISTSCI/MEDHIST 508",
            "target": "MEDHIST 708"
        }
    },
    {
        "data": {
            "source": "HISTSCI/MEDHIST 509",
            "target": "MEDHIST 709"
        }
    },
    {
        "data": {
            "source": "HISTSCI/MEDHIST/POPHLTH 553",
            "target": "MEDHIST 753"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 771",
            "target": "MEDSC-M 810"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 773",
            "target": "MEDSC-M 810"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 810",
            "target": "MEDHIST 740"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 810",
            "target": "MEDHIST 741"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 810",
            "target": "MEDHIST 742"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 810",
            "target": "MEDHIST 745"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 810",
            "target": "MEDHIST 746"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 810",
            "target": "MEDHIST 750"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 811",
            "target": "MEDHIST 740"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 811",
            "target": "MEDHIST 741"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 811",
            "target": "MEDHIST 742"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 811",
            "target": "MEDHIST 745"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 811",
            "target": "MEDHIST 746"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 811",
            "target": "MEDHIST 750"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 812",
            "target": "MEDHIST 744"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "MEDHIST 744"
        }
    }
]