[
    {
        "data": {
            "description": "Eddic and skaldic poetry; homilies and saints' lives, kings' sagas, sagas of the Icelanders; mythical-heroic sagas and romances; rimur.",
            "id": "MEDIEVAL/SCANDST 409",
            "title": "SURVEY OF OLD NORSE-ICELANDIC LITERATURE"
        }
    },
    {
        "data": {
            "description": "Focuses on masterworks of Italian literature in Medieval and Renaissance Italy, and on the ways in which this period laid a foundation of today's Italian society and culture. Includes historical, social, and cultural contexts of the Medieval and Renaissance periods.",
            "id": "ITALIAN 321",
            "parent": "ITALIAN",
            "title": "STUDIES IN ITALIAN LITERATURE AND CULTURE I"
        }
    },
    {
        "data": {
            "description": "Have you ever wondered about human nature? What is our place in this world? Through readings, videos, and original images, explore and discuss Dante's answers from one of the greatest world literary classics, his Divine Comedy. From Hell, through Purgatory to Paradise, we will travel together with Dante in a universal tale of the journey of the human soul. Along the way, learn about Dante, his life and his works, development of literary history, historical and socio-political context of medieval Europe, the Mediterranean and the Middle East. Make connections that cross today's geographic and cultural lines in an exploration of literary topics, the history of ideas, and shared history, pondering universal concepts and patterns in the development of civilization that can still be observed today.",
            "id": "LITTRANS/MEDIEVAL/RELIGST 253",
            "title": "OF DEMONS AND ANGELS. DANTE'S DIVINE COMEDY"
        }
    },
    {
        "data": {
            "description": "Have you ever wondered what it was like to live during the Black Death? Were our medieval and early-modern ancestors different from us, or are we challenged with similar problems? What can we learn from their lives? And, if we could, what could we teach each other? Discuss these topics while reading one of the world's greatest literary classics, Giovanni Boccaccio's Decameron, a text that will make us both laugh and cry. Through reading the Decameron, investigate medicine, art, culture, music, politics, religion, interpersonal and transcultural relations, warfare, fashion, gender and gender roles, as well as everyday life in the Middle Ages and early modernity. Also examines medieval written documents, twentieth-century feminist responses to the Decameron and filmic renditions of it, medieval frescoes, historical descriptions of the plague, and modern descriptions of, and reactions to, the COVID-19 pandemic.",
            "id": "LITTRANS/MEDIEVAL 255",
            "title": "BLACK DEATH AND MEDIEVAL LIFE THROUGH BOCCACCIO'S DECAMERON"
        }
    },
    {
        "data": {
            "description": "Lectures on Dante's life and times, reading Divine Comedy.",
            "id": "ITALIAN/MEDIEVAL 659",
            "title": "DANTE'S DIVINA COMMEDIA"
        }
    },
    {
        "data": {
            "description": "Systematic study of the earliest literary texts in Italy; the rise of the love lyric among the Sicilian poets; representative narrative works. The development of the lyric from Guittoe d'Arezzo to the poets of the Dolce Stil Nuovo.",
            "id": "ITALIAN/MEDIEVAL 671",
            "title": "THE 13TH CENTURY"
        }
    },
    {
        "data": {
            "description": "Advanced directed study projects as arranged with a faculty member.",
            "id": "MEDIEVAL 699",
            "parent": "MEDIEVAL",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Advanced language practice, including intensive writing and work in pertinent areas of grammar and stylistics.",
            "id": "SPANISH 311",
            "parent": "SPANISH",
            "title": "ADVANCED LANGUAGE PRACTICE"
        }
    },
    {
        "data": {
            "description": "Advanced topics in Medieval art. Topics may include: \"Death and the Afterlife in Medieval Art\"; \"Civic Art and Architecture and Public Space in Medieval Italy\"; \"Rome in the Middle Ages\"; \"Pilgrimage  the Cult of the Saints in Medieval  Byzantine Art.\"",
            "id": "ARTHIST/MEDIEVAL 415",
            "title": "TOPICS IN MEDIEVAL ART"
        }
    },
    {
        "data": {
            "description": "An advanced topics course focusing on themes, particular authors, individual works, or literary genres in medieval Spanish literature.",
            "id": "MEDIEVAL/SPANISH 718",
            "title": "TOPICS IN MEDIEVAL SPANISH LITERATURE"
        }
    },
    {
        "data": {
            "description": "An examination of the Crusades from both Christian and Islamic perspectives; the historical, social, and religious context and significance of the Crusades for both Christians and Muslims.",
            "id": "HISTORY/MEDIEVAL/RELIGST 309",
            "title": "THE CRUSADES: CHRISTIANITY AND ISLAM"
        }
    },
    {
        "data": {
            "description": "An intensive introduction to the grammar and vocabulary of Classical Latin, the language of ancient Rome. Complete the equivalent ofLATIN 103104 in a single semester. Gain skills in preparation for reading Latin authors in the original. While focus is primarily on written grammar and translation, also touches on aspects of Roman culture, history and literature.",
            "id": "LATIN 391",
            "parent": "LATIN",
            "title": "ELEMENTARY INTENSIVE LATIN"
        }
    },
    {
        "data": {
            "description": "An intensive study of a major work or works of Old English, usually focusing on either Beowulf or the poems of a single manuscript. Line-by-line translation of the text will be supplemented by discussion of related issues (whether linguistic, thematic, or contextual) as well as by readings from relevant critical literature. Primary texts will be read in Old English.",
            "id": "ENGL/MEDIEVAL 521",
            "title": "ADVANCED OLD ENGLISH LITERATURE"
        }
    },
    {
        "data": {
            "description": "An introduction to reading and analyzing literary works, with special emphasis on development of oral and written skills for the discussion of literature. Concentration on methods of analyzing basic literary forms, conventions, genres, and representative short texts in Spanish.",
            "id": "SPANISH 224",
            "parent": "SPANISH",
            "title": "INTRODUCTION TO HISPANIC LITERATURES"
        }
    },
    {
        "data": {
            "description": "Brief review of Latin grammar and vocabulary. Extensive reading from several authors.",
            "id": "LATIN 305",
            "parent": "LATIN",
            "title": "THIRD SEMESTER LATIN"
        }
    },
    {
        "data": {
            "description": "Close literary analysis of the structure, style, and language of several Roman poets and prose writers. A critical rather than a purely historical approach to these authors.",
            "id": "LATIN 306",
            "parent": "LATIN",
            "title": "FOURTH SEMESTER LATIN"
        }
    },
    {
        "data": {
            "description": "Conversation and writing practice, review of grammar, and class reading of a modern Italian novel.",
            "id": "ITALIAN 204",
            "parent": "ITALIAN",
            "title": "FOURTH SEMESTER ITALIAN"
        }
    },
    {
        "data": {
            "description": "Conversational practice, review of grammar, viewing and discussion of Italian films, and class reading of short stories.",
            "id": "ITALIAN 203",
            "parent": "ITALIAN",
            "title": "THIRD SEMESTER ITALIAN"
        }
    },
    {
        "data": {
            "description": "Designed with a linguistic purpose: to obtain a reading knowledge of Old Norse-Icelandic through the study of Old Icelandic grammar and selections of Old Norse-Icelandic texts.",
            "id": "MEDIEVAL/SCANDST 407",
            "title": "INTRODUCTORY OLD NORSE"
        }
    },
    {
        "data": {
            "description": "Designed with a linguistic purpose: to obtain a reading knowledge of Old Norse-Icelandic through the study of Old Icelandic grammar and selections of Old Norse-Icelandic texts.",
            "id": "MEDIEVAL/SCANDST 408",
            "title": "INTERMEDIATE OLD NORSE"
        }
    },
    {
        "data": {
            "description": "Develop reading skills by working with literary and cultural texts from 1800 to the present. Emphasizes close reading, textual analysis, historical context, and the use of appropriate reading strategies.",
            "id": "GERMAN 258",
            "parent": "GERMAN",
            "title": "INTERMEDIATE GERMAN-READING"
        }
    },
    {
        "data": {
            "description": "Dramatic traditions of medieval England, from early church rituals performed inside quiet monasteries in the tenth century to the elaborate and often raucous urban guild cycles and morality plays of the fifteenth, and with special attention to the significance of spirituality, work, and play in medieval culture.",
            "id": "ENGL/MEDIEVAL 424",
            "title": "MEDIEVAL DRAMA"
        }
    },
    {
        "data": {
            "description": "Drawing mainly on contemporary audio and video materials from German-speaking countries, deepen understanding of German as a spoken language by learning how native speakers vary their use of sound structures, vocabulary, and grammar according to speech situation.",
            "id": "GERMAN 249",
            "parent": "GERMAN",
            "title": "INTERMEDIATE GERMAN - SPEAKING AND LISTENING"
        }
    },
    {
        "data": {
            "description": "Emphasis on proficiency in German through speaking, listening, reading, and writing, and on communication in cultural context.",
            "id": "GERMAN 101",
            "parent": "GERMAN",
            "title": "FIRST SEMESTER GERMAN"
        }
    },
    {
        "data": {
            "description": "Emphasis on proficiency in German through speaking, listening, reading, and writing, and on communication in cultural context.",
            "id": "GERMAN 102",
            "parent": "GERMAN",
            "title": "SECOND SEMESTER GERMAN"
        }
    },
    {
        "data": {
            "description": "Examination of shared traditions and historical connections between the North and Northwest of Europe. Readings of medieval and pre-modern Scandinavian, Scottish, Welsh and Irish sagas, histories, talkes. Discussion of the role of folklore in modern Celtic and Scandinavian societies.",
            "id": "FOLKLORE/MEDIEVAL/SCANDST 446",
            "title": "CELTIC-SCANDINAVIAN CULTURAL INTERRELATIONS"
        }
    },
    {
        "data": {
            "description": "Explores the historical relationship between Muslims and Jews in a variety of contexts from the seventh century to the present. Surveys literary and cultural exchanges against the background of shifting political and social conditions across the Middle East, Europe, and the United States. Considers also the parallel legacies of anti-Semitism, Orientalism, and Islamophobia. Major themes include comparative religion, secularization, migration, and colonialism, as well as the politics of history and cultural memory. Introduces readings in English translation of medieval and modern texts originally written across languages, and especially in Hebrew and Arabic.",
            "id": "AFRICAN/JEWISH/MEDIEVAL/RELIGST 462",
            "title": "MUSLIMS AND JEWS"
        }
    },
    {
        "data": {
            "description": "Exploring the oral nature and performance traditions of folklore, ethnography, tales and ballads, literature and culture from Nordic areas and Scandinavia.",
            "id": "FOLKLORE/LITTRANS/MEDIEVAL/SCANDST 345",
            "title": "THE NORDIC STORYTELLER"
        }
    },
    {
        "data": {
            "description": "Focuses on a variety of genres and media (poetry, drama, novel, short story, cinema, television) and authors, with emphasis on the cultural and historical contexts from 1600 to the present.",
            "id": "ITALIAN 322",
            "parent": "ITALIAN",
            "title": "STUDIES IN ITALIAN LITERATURE AND CULTURE II"
        }
    },
    {
        "data": {
            "description": "Focuses on literature about Francis of Assisi, from medieval accounts to contemporary literature, and related artistic portrayals of St. Francis as a religious symbol and model for economic, political and environmental justice.",
            "id": "ITALIAN/MEDIEVAL/RELIGST 440",
            "title": "POVERTY, ECOLOGY AND THE ARTS: ST. FRANCIS OF ASSISI"
        }
    },
    {
        "data": {
            "description": "Forms and syntax, with simple translation.",
            "id": "LATIN 103",
            "parent": "LATIN",
            "title": "FIRST SEMESTER LATIN"
        }
    },
    {
        "data": {
            "description": "Forms and syntax, with translation of easy prose.",
            "id": "LATIN 104",
            "parent": "LATIN",
            "title": "SECOND SEMESTER LATIN"
        }
    },
    {
        "data": {
            "description": "Four-skills approach (speaking, listening, writing, reading) centered around authentic texts, recordings, and images. Grammar review, concerted vocabulary expansion, and intensive practice.",
            "id": "GERMAN 203",
            "parent": "GERMAN",
            "title": "THIRD SEMESTER GERMAN"
        }
    },
    {
        "data": {
            "description": "Four-skills approach (speaking, listening, writing, reading) centered around authentic texts, recordings, and images. Grammar review, concerted vocabulary expansion, and intensive practice.",
            "id": "GERMAN 204",
            "parent": "GERMAN",
            "title": "FOURTH SEMESTER GERMAN"
        }
    },
    {
        "data": {
            "description": "Historical Spanish phonology, morphology, and syntax, with application to theories of language variation and change.",
            "id": "MEDIEVAL/SPANISH 541",
            "title": "OLD SPANISH"
        }
    },
    {
        "data": {
            "description": "Important early form of narrative fiction, covering tales of adventure, magic, courtly love, and King Arthur from the twelfth through the fifteenth century.",
            "id": "ENGL/MEDIEVAL 425",
            "title": "MEDIEVAL ROMANCE"
        }
    },
    {
        "data": {
            "description": "Individual and collaborative writing as well as teacher- and student-guided writing activities. Writings rely on authentic text models, many with German-specific cultural connotations.",
            "id": "GERMAN 262",
            "parent": "GERMAN",
            "title": "INTERMEDIATE GERMAN-WRITING"
        }
    },
    {
        "data": {
            "description": "Intensive introduction to German-language culture and texts of varying length and genre, emphasizing reading, writing, and discussion skills. Equivalent toGERMAN 258and262.",
            "id": "GERMAN 285",
            "parent": "GERMAN",
            "title": "INTERMEDIATE INTENSIVE (HONORS) GERMAN: LANGUAGE, CULTURE, TEXTS"
        }
    },
    {
        "data": {
            "description": "Intensive practice in reading, writing, and grammar.",
            "id": "SPANISH 226",
            "parent": "SPANISH",
            "title": "INTERMEDIATE LANGUAGE PRACTICE WITH EMPHASIS ON WRITING AND GRAMMAR"
        }
    },
    {
        "data": {
            "description": "Introduction to chronological, geographical, and generic range of post-classical Latin, including not only the \"medieval\" period but the late antique, Renaissance, and beyond.",
            "id": "LATIN/MEDIEVAL 563",
            "title": "MEDIAEVAL LATIN"
        }
    },
    {
        "data": {
            "description": "Introduction to major 13th and 14th-century Castilian works.",
            "id": "MEDIEVAL/SPANISH 503",
            "title": "SURVEY OF MEDIEVAL LITERATURE"
        }
    },
    {
        "data": {
            "description": "Introduction to the issues which shape the national cultures and the cultural practices of the Hispanic world. Emphasis on diversity, emergence of new imagined communities, cultural hybridity, and social movements within a historical framework.",
            "id": "SPANISH 223",
            "parent": "SPANISH",
            "title": "INTRODUCTION TO HISPANIC CULTURES"
        }
    },
    {
        "data": {
            "description": "Kalevala - the national epic of Finaland - and the oral literature of Finland.",
            "id": "MEDIEVAL/SCANDST 444",
            "title": "KALEVALA AND FINNISH FOLK-LORE"
        }
    },
    {
        "data": {
            "description": "Middle High German grammar and vocabulary with the goals of fluency and accuracy in reading medieval texts. Covers topics in phonology, morphology, syntax, and lexicon.",
            "id": "GERMAN/MEDIEVAL 651",
            "title": "INTRODUCTION TO MIDDLE HIGH GERMAN"
        }
    },
    {
        "data": {
            "description": "Mythology, literature, ritual, traditions, medieval folklore, and religion from Nordic areas and Scandinavia.",
            "id": "FOLKLORE/MEDIEVAL/RELIGST/SCANDST 342",
            "title": "NORDIC MYTHOLOGY"
        }
    },
    {
        "data": {
            "description": "Old High German, Old Saxon, and Gothic on a rotating basis.",
            "id": "GERMAN/MEDIEVAL 755",
            "title": "OLD GERMANIC LANGUAGES"
        }
    },
    {
        "data": {
            "description": "Oral practice and conversation, grammar, reading, vocabulary building, and study of Italian cultures.",
            "id": "ITALIAN 101",
            "parent": "ITALIAN",
            "title": "FIRST SEMESTER ITALIAN"
        }
    },
    {
        "data": {
            "description": "Oral practice and conversation, grammar, reading, vocabulary building, and study of Italian cultures.",
            "id": "ITALIAN 102",
            "parent": "ITALIAN",
            "title": "SECOND SEMESTER ITALIAN"
        }
    },
    {
        "data": {
            "description": "Poetry of the most famous and influential medieval English poet, from his short lyrics on love through his dream visions of talking birds and castles built on ice to the historical romance Troilus and Criseyde. Readings will be in the original Middle English; no prior experience with the language is required.",
            "id": "ENGL/MEDIEVAL 426",
            "title": "CHAUCERS COURTLY POETRY"
        }
    },
    {
        "data": {
            "description": "Seminar focusing on literary, textual criticism or theoretical topics relevant to Medieval Spanish literature.",
            "id": "MEDIEVAL/SPANISH 842",
            "title": "SEMINAR-MEDIEVAL LITERATURE"
        }
    },
    {
        "data": {
            "description": "Study of a topic in Medieval literature.",
            "id": "ENGL/MEDIEVAL 803",
            "title": "TOPICS IN MEDIEVAL LITERATURE"
        }
    },
    {
        "data": {
            "description": "Study of a topic in medieval literature.",
            "id": "ENGL/MEDIEVAL 423",
            "title": "TOPIC IN MEDIEVAL LITERATURE AND CULTURE"
        }
    },
    {
        "data": {
            "description": "Study of important literary works of the 14th and 15th centuries. Taught in French.",
            "id": "FRENCH/MEDIEVAL 704",
            "title": "LA LITTERATURE FRANCAISE DU XIV ET DU XV SIECLE"
        }
    },
    {
        "data": {
            "description": "Study of the most famous and influential medieval English poet through his best-known work and its playful and profound responses to some of the most pressing literary, social, political, and spiritual issues of his time. Readings will be in the original Middle English; no prior experience with the language is required.",
            "id": "ENGL/MEDIEVAL 427",
            "title": "CHAUCER'S CANTERBURY TALES"
        }
    },
    {
        "data": {
            "description": "The Icelandic sagas viewed in their social, cultural, and literary contexts. An introduction to one of the greatest bodies of vernacular literature of the early Middle Ages.",
            "id": "FOLKLORE/MEDIEVAL/SCANDST 235",
            "title": "THE WORLD OF SAGAS"
        }
    },
    {
        "data": {
            "description": "The elements of Old English grammar with selected readings.",
            "id": "ENGL/MEDIEVAL 520",
            "title": "OLD ENGLISH"
        }
    },
    {
        "data": {
            "description": "The study of a particular author, work, topic, or literary genre of the Middle Ages and/or Early Renaissance (through15th century): Poema de mio Cid, mester de juglaria, Libro de buen amor, mester de clerecia, El conde Lucanor, La Celestina, etc.",
            "id": "MEDIEVAL/SPANISH 414",
            "title": "LITERATURA DE LA EDAD MEDIA CASTELLANA (SS. XII-XV)"
        }
    },
    {
        "data": {
            "description": "Within a historical framework, a thorough introduction to the culture, literature, and religion of the Vikings.",
            "id": "MEDIEVAL/SCANDST 430",
            "title": "THE VIKINGS"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "GERMAN",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ITALIAN",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "LATIN",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MEDIEVAL",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "SPANISH",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ENGL/MEDIEVAL 520",
            "target": "ENGL/MEDIEVAL 521"
        }
    },
    {
        "data": {
            "source": "GERMAN 101",
            "target": "GERMAN 102"
        }
    },
    {
        "data": {
            "source": "GERMAN 102",
            "target": "GERMAN 203"
        }
    },
    {
        "data": {
            "source": "GERMAN 203",
            "target": "GERMAN 204"
        }
    },
    {
        "data": {
            "source": "GERMAN 204",
            "target": "GERMAN 249"
        }
    },
    {
        "data": {
            "source": "GERMAN 204",
            "target": "GERMAN 258"
        }
    },
    {
        "data": {
            "source": "GERMAN 204",
            "target": "GERMAN 262"
        }
    },
    {
        "data": {
            "source": "GERMAN 249",
            "target": "GERMAN/MEDIEVAL 651"
        }
    },
    {
        "data": {
            "source": "GERMAN 258",
            "target": "GERMAN 285"
        }
    },
    {
        "data": {
            "source": "GERMAN 258",
            "target": "GERMAN/MEDIEVAL 651"
        }
    },
    {
        "data": {
            "source": "GERMAN 262",
            "target": "GERMAN/MEDIEVAL 651"
        }
    },
    {
        "data": {
            "source": "GERMAN 285",
            "target": "GERMAN/MEDIEVAL 651"
        }
    },
    {
        "data": {
            "source": "ITALIAN 101",
            "target": "ITALIAN 102"
        }
    },
    {
        "data": {
            "source": "ITALIAN 102",
            "target": "ITALIAN 203"
        }
    },
    {
        "data": {
            "source": "ITALIAN 203",
            "target": "ITALIAN 204"
        }
    },
    {
        "data": {
            "source": "ITALIAN 204",
            "target": "ITALIAN 321"
        }
    },
    {
        "data": {
            "source": "ITALIAN 204",
            "target": "ITALIAN 322"
        }
    },
    {
        "data": {
            "source": "ITALIAN 321",
            "target": "ITALIAN/MEDIEVAL 659"
        }
    },
    {
        "data": {
            "source": "ITALIAN 321",
            "target": "ITALIAN/MEDIEVAL 671"
        }
    },
    {
        "data": {
            "source": "ITALIAN 322",
            "target": "ITALIAN/MEDIEVAL 659"
        }
    },
    {
        "data": {
            "source": "ITALIAN 322",
            "target": "ITALIAN/MEDIEVAL 671"
        }
    },
    {
        "data": {
            "source": "LATIN 103",
            "target": "LATIN 104"
        }
    },
    {
        "data": {
            "source": "LATIN 103",
            "target": "LATIN 391"
        }
    },
    {
        "data": {
            "source": "LATIN 104",
            "target": "LATIN 305"
        }
    },
    {
        "data": {
            "source": "LATIN 305",
            "target": "LATIN 306"
        }
    },
    {
        "data": {
            "source": "LATIN 306",
            "target": "LATIN/MEDIEVAL 563"
        }
    },
    {
        "data": {
            "source": "LATIN 391",
            "target": "LATIN 305"
        }
    },
    {
        "data": {
            "source": "MEDIEVAL/SCANDST 407",
            "target": "MEDIEVAL/SCANDST 408"
        }
    },
    {
        "data": {
            "source": "MEDIEVAL/SCANDST 407",
            "target": "MEDIEVAL/SCANDST 409"
        }
    },
    {
        "data": {
            "source": "SPANISH 223",
            "target": "MEDIEVAL/SPANISH 414"
        }
    },
    {
        "data": {
            "source": "SPANISH 224",
            "target": "MEDIEVAL/SPANISH 414"
        }
    },
    {
        "data": {
            "source": "SPANISH 226",
            "target": "SPANISH 223"
        }
    },
    {
        "data": {
            "source": "SPANISH 226",
            "target": "SPANISH 224"
        }
    },
    {
        "data": {
            "source": "SPANISH 226",
            "target": "SPANISH 311"
        }
    },
    {
        "data": {
            "source": "SPANISH 311",
            "target": "SPANISH 226"
        }
    }
]