[
    {
        "data": {
            "description": "A preparation and introductory math course for students enrolled in the Summer Collegiate Experience program. Includes material from precalculus and calculus and related topics depending on students' results on the math placement exam.",
            "id": "MATH 118",
            "parent": "MATH",
            "title": "SUMMER COLLEGIATE EXPERIENCE MATHEMATICS COURSE"
        }
    },
    {
        "data": {
            "description": "Covers the graphs, properties and geometric significance of trigonometric functions of a real variable. Other topics include trigonometric equations and identities, application, trigonometric form of complex numbers, DeMoivre's theorem, and polar and parametric equations. The course also has a significant number of applications, especially related to other disciplines.",
            "id": "MATH 113",
            "parent": "MATH",
            "title": "TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "Electrostatic fields, capacitance, multi-pole expansion, dielectric theory; magnetostatics; electromagnetic induction; magnetic properties of matter; Maxwell's equations and electromagnetic waves; relativity and electromagmetism. Experiments for this course are covered in PHYSICS 308.",
            "id": "PHYSICS 322",
            "parent": "PHYSICS",
            "title": "ELECTROMAGNETIC FIELDS"
        }
    },
    {
        "data": {
            "description": "Multiple professional and scientific groups have identified the underrepresentation and lack of advancement of women in academia as a national workforce problem. Review evolving perspectives of leadership and how unconscious assumptions about the behaviors and traits of men, women, and leaders impede women's advancement. Emphasizes the implications for women in the fields of science, health and engineering and explore the potential impact on the advancement of knowledge and improvements in health. Provides the opportunity to apply evidence-based perspectives using experiential methods.",
            "id": "MEDPHYS/PEDIAT 705",
            "title": "WOMEN AND LEADERSHIP: SCIENCE, HEALTH AND ENGINEERING"
        }
    },
    {
        "data": {
            "description": "A general interest survey that introduces the principles and applications of medical physics. Topics include biomechanics, energy usage and temperature regulation, pressure, sound and hearing, ultrasound, electricity in the body, optics and the eye, ionizing radiation in diagnosis and therapy, radiobiology, and nuclear medicine.",
            "id": "MEDPHYS/PHYSICS 265",
            "title": "INTRODUCTION TO MEDICAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Addresses the concepts of ethics in the daily practice of medical physics and other scientific disciplines and provide tools for identifying resources. Special emphasis will be placed in how these principles have to be applied to ensure the confidentiality of the patients, the safety of the research subjects (human and animals), differentiation between ethical and legal issues, as well as the understanding of the principles that deal with authorships, intellectual property in the academic- and industry- based environment.",
            "id": "MEDPHYS 701",
            "parent": "MEDPHYS",
            "title": "ETHICS AND THE RESPONSIBLE CONDUCT OF RESEARCH AND PRACTICE OF MEDICAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Addresses the theory and applications of magnetic resonance (MR) in medicine, by providing the necessary theoretical background to understand advanced MR techniques including magnetic resonance imaging (MRI).",
            "id": "BME/MEDPHYS 710",
            "title": "ADVANCES IN MEDICAL MAGNETIC RESONANCE"
        }
    },
    {
        "data": {
            "description": "An introduction to linear algebra and differential equations with emphasis on the relationship between the theory of linear algebra and analytical and numerical techniques for solving differential equations. Linear algebra topics include linear systems, matrices and their algebra, vector spaces and linear transformations, eigenvalues and eigenvectors. Topics from differential equations include first order ODE, homogeneous and nonhomogeneous linear systems, and numerical methods.",
            "id": "MATH 320",
            "parent": "MATH",
            "title": "LINEAR ALGEBRA AND DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for Physics, AMEP, and Astronomy-Physics majors. Mechanics, waves, thermodynamics and statistical mechanics, topics in modern physics; with computation.  A more mathematically rigorous and in-depth introduction to physics than the other introductory physics sequences.",
            "id": "PHYSICS 247",
            "parent": "PHYSICS",
            "title": "A MODERN INTRODUCTION TO PHYSICS"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for engineering students. Electricity, magnetism, light, and sound.",
            "id": "PHYSICS 202",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for engineering students. Mechanics: kinematics, statics, dynamics; energy and momentum.",
            "id": "PHYSICS 201",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for students majoring in biological sciences. Mechanics: kinematics, statics, dynamics; energy and momentum. Heat and sound.",
            "id": "PHYSICS 207",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Cellular, molecular, and radiation biology principles and their common application in medical physics.",
            "id": "MEDPHYS 510",
            "parent": "MEDPHYS",
            "title": "FUNDAMENTALS OF CELLULAR, MOLECULAR, AND RADIATION BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Computational imaging includes all imaging methods that produce images as a result of computation on collected signals. Learn the tools to design new computational imaging methods to solve specific imaging problems. Provides an understanding of the physics of light propagation and measurement, and the computational tools to model it, including wave propagation, ray tracing, the radon transform, and linear algebra using matrix and integral operators and the computational tools to reconstruct an image, including linear inverse problems, neural networks, convex optimization, and filtered back-projection. Covers a variety of example computational imaging techniques and their applications including coded apertures, structured illumination, digital holography, computed tomography, imaging through scattering media, compressed sensing, and non-line-of-sight imaging.",
            "id": "BMI/COMPSCI/ECE/MEDPHYS 722",
            "title": "COMPUTATIONAL OPTICS AND IMAGING"
        }
    },
    {
        "data": {
            "description": "Concepts and machine learning techniques for ultrasound beamforming for image formation and reconstruction to image analysis and interpretation will be presented. Key machine learning and deep learning concepts applied to beamforming, compressed sampling, speckle reduction, segmentation, photoacoustics, and elasticity imaging will be evaluated utilizing current peer-reviewed publications.",
            "id": "BME/ECE/MEDPHYS 778",
            "title": "MACHINE LEARNING IN ULTRASOUND IMAGING"
        }
    },
    {
        "data": {
            "description": "Concepts and principles of statistics and machine learning for medical physics-related research problems. Topics covered include probability and independence, discrete and continuous random variables and statistical distributions, random sampling and central limit theorem, inference for means, variances, proportions, moment generating functions, maximum likelihood, hypothesis testing, ANOVA, linear regression, correlation and basic design of experiments with application to quality assurance, reliability, and reproducibility.",
            "id": "BME/MEDPHYS 574",
            "title": "DATA SCIENCE IN MEDICAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Concepts and principles on the physics of medical imaging systems that form images using high energy photons are presented. Such systems are divided into two categories: (1) those based on the transmission of x-rays through the human body, including radiography, mammography, fluoroscopy, and computed tomography (CT), and (2) those based on the emission of gamma rays or annihilation radiation following radioactive decay of an internal radiolabeled molecule, including the gamma camera, single photon emission tomography (SPECT), and positron emission tomography (PET) and PET hybrid imaging systems. Emphasis is placed on understanding how physics, system design, and imaging technique determine image performance metrics such as contrast, signal-to-noise ratio, and spatial resolution. Clinical applications and radiation safety concepts are detailed for the different types of imaging systems.",
            "id": "BME/MEDPHYS 580",
            "title": "THE PHYSICS OF MEDICAL IMAGING WITH IONIZING RADIATION"
        }
    },
    {
        "data": {
            "description": "Concepts and techniques of pharmacokinetic modeling will be presented in the context of biomedical imaging. Examine applications in various specialties, e.g. neurology and oncology, using different imaging tools, e.g. positron emission tomography (PET) and magnetic resonance imaging (MRI).",
            "id": "MEDPHYS 780",
            "parent": "MEDPHYS",
            "title": "PHARMACOKINETIC MODELING IN BIOMEDICAL IMAGING"
        }
    },
    {
        "data": {
            "description": "Continuation ofPHYSICS 207: calculus-based introduction to physics intended for students majoring in biological sciences. Electricity, magnetism, light, and modern physics.",
            "id": "PHYSICS 208",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Continuation ofPHYSICS 247. Electromagnetism, circuits, optics, additional topics in modern physics; with computation.",
            "id": "PHYSICS 248",
            "parent": "PHYSICS",
            "title": "A MODERN INTRODUCTION TO PHYSICS"
        }
    },
    {
        "data": {
            "description": "Continuation ofPHYSICS 448. Review of atomic and other quantum phenomena and special relativity; introduction to quantum mechanics treating the more advanced topics of atomic physics and applications to molecular, solid state, nuclear, and elementary particle physics and quantum statistics.",
            "id": "PHYSICS 449",
            "parent": "PHYSICS",
            "title": "ATOMIC AND QUANTUM PHYSICS"
        }
    },
    {
        "data": {
            "description": "Core course covering the physics associated with magnetic resonance imaging emphasizing techniques employed in medical diagnostic imaging. Major MRI topics include: physics of MR, pulse sequences, hardware, imaging techniques, artifacts, and clinical applications. At the completion of this course, students should have an understanding of the technical and scientific details of modern magnetic resonance imaging and its use in diagnosing disease. Graduate students who have not takenMATH 222andPHYSICS 202at UW-Madison must have the equivalent coursework in order to be successful in this course.",
            "id": "BME/MEDPHYS 568",
            "title": "MAGNETIC RESONANCE IMAGING (MRI)"
        }
    },
    {
        "data": {
            "description": "Covers several aspects of state-of-the-art biological and biophysical imaging with an emphasis on instrumentation, beginning with an overview of geometrical optics and optical and fluorescence microscopy. The bulk of the course will focus on advanced imaging techniques including nonlinear optical processes (multi-photon excitation, second harmonic generation, and stimulated Raman processes) and emerging super-resolution methods. Special emphasis will be given to current imaging literature and experimental design. Knowledge of physics-based optics [such asPHYSICS 202] strongly recommended.",
            "id": "BME/CHEM/MEDPHYS 750",
            "title": "BIOLOGICAL OPTICAL MICROSCOPY"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Covers the physics associated with magnetic resonance imaging and diagnostic ultrasound emphasizing techniques employed in medical diagnostic imaging. Major MRI topics include: physics of MR, pulse sequences, hardware, imaging techniques, artifacts, and spectroscopic localization. Ultrasound based topics covered include: propagation of ultrasonic waves in biological tissues, principles of ultrasonic measuring and imaging instrumentation, design and use of currently available tools for performance evaluation of diagnostic instrumentation, and biological effects of ultrasound. Gain an understanding of the technical and scientific details of modern non-ionizing medical magnetic resonance and ultrasound devices and their use in diagnosing disease.",
            "id": "BME/MEDPHYS 578",
            "title": "NON-IONIZING DIAGNOSTIC IMAGING"
        }
    },
    {
        "data": {
            "description": "Effects of ionizing radiations of living cells and organisms, including physical, chemical, and physiological bases of radiation cytotoxicity, mutagenicity, and carcinogenesis; lecture and lab.",
            "id": "HONCOL/MEDPHYS 410",
            "title": "RADIOBIOLOGY"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "Explore physical interactions between thermal, electromagnetic and acoustic energies and biological tissues with emphasis on therapeutic medical applications.",
            "id": "BME/MEDPHYS 535",
            "title": "INTRODUCTION TO ENERGY-TISSUE INTERACTIONS"
        }
    },
    {
        "data": {
            "description": "First order differential equations, introduction to multivariable calculus and constrained optimization, infinite sequences and series, methods of approximation, and a brief introduction to probability. Models and applications from business and the social sciences.",
            "id": "MATH 213",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 2"
        }
    },
    {
        "data": {
            "description": "Fundamental physics of ionizing radiation production and detection applied to medical science. Topics: scintillator/semiconductor detectors, ionizing radiation detectors, charged and neutral particles for external beam radiotherapy, production of radionuclides with cyclotron and linear accelerators for diagnostic and therapeutic applications, radiochemistry, and X-ray tube physics.",
            "id": "MEDPHYS/PHYSICS 588",
            "title": "RADIATION PRODUCTION AND DETECTION"
        }
    },
    {
        "data": {
            "description": "General biological principles. Topics include: evolution, ecology, animal behavior, cell structure and function, genetics and molecular genetics and the physiology of a variety of organ systems emphasizing function in humans.",
            "id": "BIOLOGY/ZOOLOGY 101",
            "title": "ANIMAL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "In-depth examination of current and newly discovered modalities and/or phenomenons in medical physics. Critical reading of literature, hands-on lab work and exploration of medical issues related to discoveries will be included.",
            "id": "MEDPHYS 671",
            "parent": "MEDPHYS",
            "title": "SELECTED TOPICS IN MEDICAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Interactions and energy deposition by ionizing radiation in matter; concepts, quantities and units in radiological physics; principles and methods of radiation dosimetry.",
            "id": "BME/HONCOL/MEDPHYS/PHYSICS 501",
            "title": "RADIATION PHYSICS AND DOSIMETRY"
        }
    },
    {
        "data": {
            "description": "Introduces concepts and methodology for measuring acoustic properties of materials and for operating and performing physics tests of state of the art clinical ultrasound scanners.  Set up and operate a laboratory apparatus employing single element ultrasound transducers. This is followed by hands on experiments that challenge students to explain physical and engineering characteristics of clinical scanners, details of operator controls, features of Doppler and color flow modes, and resolution limitations. Practical scanning exercises provide familiarity with selected applications of clinical ultrasound equipment, both for diagnosis and for guiding interventions.  Routine quality assurance tests done by medical physicists are also performed.",
            "id": "MEDPHYS 666",
            "parent": "MEDPHYS",
            "title": "RAD LAB - MEDICAL ULTRASOUND PHYSICS"
        }
    },
    {
        "data": {
            "description": "Introduction to atomic, solid state, and nuclear physics.",
            "id": "PHYSICS 205",
            "parent": "PHYSICS",
            "title": "MODERN PHYSICS FOR ENGINEERS"
        }
    },
    {
        "data": {
            "description": "Introduction to calculus of functions of several variables; calculus on parameterized curves, derivatives of functions of several variables, multiple integrals, vector calculus.",
            "id": "MATH 234",
            "parent": "MATH",
            "title": "CALCULUS--FUNCTIONS OF SEVERAL VARIABLES"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Ionizing radiation use in radiation therapy to cause controlled biological effects in cancer patients. Physics of the interaction of the various radiation modalities with body-equivalent materials, and physical aspects of clinical applications.",
            "id": "BME/MEDPHYS 566",
            "title": "PHYSICS OF RADIOTHERAPY"
        }
    },
    {
        "data": {
            "description": "Kinetic theory; relativity; experimental origin of quantum theory; atomic structure and spectral lines; topics in solid state, nuclear and particle physics.",
            "id": "PHYSICS 241",
            "parent": "PHYSICS",
            "title": "INTRODUCTION TO MODERN PHYSICS"
        }
    },
    {
        "data": {
            "description": "Mathematical and physical foundations of the application of acoustics in diagnostic ultrasound. Derivation of wave equations for mechanical waves in fluids and solids from a continuum mechanics perspective. Diffraction theory and methods for acoustic field calculation (analytic, angular spectrum, simulations). Review of interactions of acoustic waves with biological tissue and methods to measure their acoustic properties. In-depth discussion of methods for structural image formation including ray-line scanning, plane wave compounding, synthetic aperture, coded excitation, and spatial coherent imaging. Introduction to novel functional imaging approach, including ultrafast Doppler, molecular ultrasound, functional ultrasound, and super-resolution imaging. Application of the acquired knowledge to perform a systematic literature review of the state-of-the-art of the field for the solution of a relevant clinical problem.",
            "id": "MEDPHYS 775",
            "parent": "MEDPHYS",
            "title": "ADVANCED ULTRASOUND PHYSICS"
        }
    },
    {
        "data": {
            "description": "Mathematical fundamentals required for medical physics and biomedical applications, including signal analysis and mathematical optimization.",
            "id": "BME/MEDPHYS 573",
            "title": "MATHEMATICAL METHODS IN MEDICAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Metrology, the science of measurement, is a critical component of medical physics. Topics covered: measurement statistics, determination of uncertainty, characteristics of ionization chambers, electrometers and other ionizing radiation measurement devices. Effects of instrumentation on clinical measurements.",
            "id": "MEDPHYS 679",
            "parent": "MEDPHYS",
            "title": "RADIATION PHYSICS METROLOGY"
        }
    },
    {
        "data": {
            "description": "Origin and development of classical mechanics; mathematical techniques, especially vector analysis; conservation laws and their relation to symmetry principles; brief introduction to orbit theory and rigid-body dynamics; accelerated coordinate systems; introduction to the generalized-coordinate formalisms of Lagrange and Hamilton.",
            "id": "PHYSICS 311",
            "parent": "PHYSICS",
            "title": "MECHANICS"
        }
    },
    {
        "data": {
            "description": "Physical and biological aspects of the use of ionizing radiation in industrial and academic institutions; physical principles underlying shielding instrumentation, waste disposal; biological effects of low levels of ionizing radiation.",
            "id": "MEDPHYS/NE 569",
            "title": "HEALTH PHYSICS AND BIOLOGICAL EFFECTS"
        }
    },
    {
        "data": {
            "description": "Physical principles of radioisotopes used in medicine and biology and operation of related equipment; lecture and lab.",
            "id": "MEDPHYS 563",
            "parent": "MEDPHYS",
            "title": "RADIONUCLIDES IN MEDICINE AND BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Physics of clinical, computer-based radiotherapy planning is taught. Topics include dose algorithms, measurement data, commissioning, contouring and volume definition, beam placement, modifiers and apertures and plan evaluation. Forward based and inverse planning (including IMRT optimization) are taught.",
            "id": "MEDPHYS 772",
            "parent": "MEDPHYS",
            "title": "ADVANCED RADIATION TREATMENT PLANNING"
        }
    },
    {
        "data": {
            "description": "Physics of x-ray diagnostic procedures and equipment, radiation safety, general imaging considerations; lecture and lab.",
            "id": "BME/MEDPHYS 567",
            "title": "THE PHYSICS OF DIAGNOSTIC RADIOLOGY"
        }
    },
    {
        "data": {
            "description": "Presents concepts and principles on the physics of medical radiographic imaging systems, based on the transmission of x-rays.  Emphasis is placed on understanding the operation of imaging equipment and how it is used in clinical applications. Evaluation of imaging systems, optimization of their use and design and the solution of image quality problems is investigated.",
            "id": "MEDPHYS 581",
            "parent": "MEDPHYS",
            "title": "LABORATORY FOR MEDICAL IMAGING WITH IONIZING RADIATION"
        }
    },
    {
        "data": {
            "description": "Propagation of ultrasonic waves in biological tissues; principles of ultrasonic measuring and imaging instrumentation; design and use of currently available tools for performance evaluation of diagnostic instrumentation; biological effects of ultrasound.",
            "id": "BME/MEDPHYS 575",
            "title": "DIAGNOSTIC ULTRASOUND IMAGING"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Properties of nuclei, nuclear structure, radioactivity, nuclear reactions, fission, resonance reactions, moderation of neutrons.",
            "id": "NE 305",
            "parent": "NE",
            "title": "FUNDAMENTALS OF NUCLEAR ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Provides a practical foundation for neuroimaging research studies with statistical image analysis. Specific imaging methods include functional BOLD MRI, structural MRI morphometry, and diffusion tensor imaging. Lectures and associated in-class computer exercises will cover the physics and methods of image acquisition, steps and tools for image analyses, the basis for statistical image analyses and interpretation of the results.",
            "id": "MEDPHYS/NTP 651",
            "title": "METHODS FOR NEUROIMAGING RESEARCH"
        }
    },
    {
        "data": {
            "description": "Provides an introduction to the technical skills required in nuclear medicine physics.  This includes laboratory rotations in basic radiopharmaceutical production and quality control, basic operation and quality control testing on PET and SPECT scanners, time series image analysis of radiotracer studies and nuclear medicine dosimetry and radiation safety training.  Gain a firsthand understanding of the professional duties performed by a nuclear medicine medical physicist.",
            "id": "MEDPHYS 663",
            "parent": "MEDPHYS",
            "title": "RAD LAB - NUCLEAR MEDICINE PHYSICS"
        }
    },
    {
        "data": {
            "description": "Provides graduate students with mentorship to support their development of independent research goals and methods needed to address specific scientific problems that will result in a comprehensive dissertation.",
            "id": "MEDPHYS 990",
            "parent": "MEDPHYS",
            "title": "RESEARCH"
        }
    },
    {
        "data": {
            "description": "Provides hands on experience using and testing computerized tomography (CT), magnetic resonance imaging (MRI), and digital subtraction angiography (DSA) systems.  Image quality, MRI and radiation safety, accreditation, and regulatory compliance issues with these modalities are also covered.",
            "id": "MEDPHYS 665",
            "parent": "MEDPHYS",
            "title": "RAD LAB - CT, MRI, AND DSA PHYSICS"
        }
    },
    {
        "data": {
            "description": "Provides hands on experience using and testing radiographic, fluoroscopic and mammographic x-ray systems.  Imaging requirements, image quality, and radiation dose aspects of each modality are covered, along with practical methods for evaluating the performance of clinical units.",
            "id": "MEDPHYS 662",
            "parent": "MEDPHYS",
            "title": "RAD LAB - DIAGNOSTIC RADIOLOGICAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Provides medical physics graduate students with the opportunity to critically evaluate and report on published research and/or research seminar presentations by speakers, from both within the university and from the larger scientific community.",
            "id": "MEDPHYS 900",
            "parent": "MEDPHYS",
            "title": "JOURNAL CLUB AND SEMINAR"
        }
    },
    {
        "data": {
            "description": "Provides opportunities for graduate students to gain experience using the scientific method to address specific scientific problems. This includes selection of a research topic, performing literature reviews to evaluate peer-reviewed and other publications, developing a research design, identifying possible pitfalls, and performing and reporting on experiments performed. Communication of the research findings within and outside the university is encouraged.",
            "id": "MEDPHYS 699",
            "parent": "MEDPHYS",
            "title": "INDEPENDENT READING OR RESEARCH"
        }
    },
    {
        "data": {
            "description": "Review of atomic and other quantum phenomena and special relativity; introduction to quantum mechanics treating the more advanced topics of atomic physics and applications to molecular, solid state, nuclear, and elementary particle physics and quantum statistics.",
            "id": "PHYSICS 448",
            "parent": "PHYSICS",
            "title": "ATOMIC AND QUANTUM PHYSICS"
        }
    },
    {
        "data": {
            "description": "Review of linear differential equations; series solution of linear differential equations; boundary value problems; Laplace transforms; possibly numerical methods and two dimensional autonomous systems.",
            "id": "MATH 319",
            "parent": "MATH",
            "title": "TECHNIQUES IN ORDINARY DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "description": "Special relativity, electromagnetic momentum, electromagnetic waves: propagation, interference, scattering, reflection and refraction at a dielectric interface, waves in a conductor. Wave packets and group velocity, dispersion. Waveguides and transmission lines. Retarded potentials. Radiation.",
            "id": "PHYSICS 323",
            "parent": "PHYSICS",
            "title": "ELECTROMAGNETIC FIELDS"
        }
    },
    {
        "data": {
            "description": "Survey of state of the art microscopic, cellular and molecular imaging techniques, beginning with subcellular microscopy and finishing with whole animal imaging.",
            "id": "BME/MEDPHYS/PHMCOL-M/PHYSICS/RADIOL 619",
            "title": "MICROSCOPY OF LIFE"
        }
    },
    {
        "data": {
            "description": "Techniques of integration, improper integrals, first order ordinary differential equations, sequences and series, Taylor series, vector geometry in two and three dimensions.",
            "id": "MATH 222",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 2"
        }
    },
    {
        "data": {
            "description": "The use of radioactive sources for radiotherapy including: materials used, source construction dosimetry theory and practical application, dosimetric systems, localization and reconstruction. Covers low dose rate, high dose rate and permanently placed applications.",
            "id": "MEDPHYS 770",
            "parent": "MEDPHYS",
            "title": "ADVANCED BRACHYTHERAPY PHYSICS"
        }
    },
    {
        "data": {
            "description": "Topics in multi-variable calculus and introduction to differential equations.",
            "id": "MATH 376",
            "parent": "MATH",
            "title": "TOPICS IN MULTI-VARIABLE CALCULUS AND DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics and selected topics in Animal Physiology.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Topics include: selected topics in plant physiology, a survey of the five major kingdoms of organisms, speciation and evolutionary theory, and ecology at multiple levels of the biological hierarchy.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Understand the basic principles of x-ray computed tomography (CT), and how to think when a technical problem arises in CT. Accomplished through a review of the history of CT developments and key components of CT systems, lectures on various CT reconstruction algorithms, image quality, and radiation dose, origin and correction methods of various CT artifacts.",
            "id": "MEDPHYS 777",
            "parent": "MEDPHYS",
            "title": "PRINCIPLES OF X-RAY COMPUTED TOMOGRAPHY"
        }
    },
    {
        "data": {
            "description": "Use of Monte Carlo technique for applications in nuclear engineering and medical physics. Major theory of Monte Carlo neutral particle transport is discussed. Standard Monte Carlo transport software is used for exercises and projects. Major emphasis is on analysis of real-world problems.",
            "id": "MEDPHYS/NE 506",
            "title": "MONTE CARLO RADIATION TRANSPORT"
        }
    },
    {
        "data": {
            "description": "Uses project-based learning (PBL) as a powerful teaching method to address common challenges and solutions addressed by medical health physicists.  Each semester, students work on a different project that addresses concepts that are important in the current health physics environment.",
            "id": "MEDPHYS 664",
            "parent": "MEDPHYS",
            "title": "RAD LAB - HEALTH PHYSICS"
        }
    },
    {
        "data": {
            "description": "Vector analysis: algebra and geometry of vectors, vector differential and integral calculus, theorems of Green, Gauss, and Stokes; complex analysis: analytic functions, complex integrals and residues, Taylor and Laurent series.",
            "id": "MATH 321",
            "parent": "MATH",
            "title": "APPLIED MATHEMATICAL ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Vector spaces and linear transformations, differential calculus of scalar and vector fields, determinants, eigenvalues and eigenvectors, multiple integrals, line integrals, and surface integrals. Freshmen students are invited to enroll by the Department of Mathematics.",
            "id": "MATH 375",
            "parent": "MATH",
            "title": "TOPICS IN MULTI-VARIABLE CALCULUS AND LINEAR ALGEBRA"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MEDPHYS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "NE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "PHYSICS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 152"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 101"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "target": "HONCOL/MEDPHYS 410"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 151"
        }
    },
    {
        "data": {
            "source": "BME/HONCOL/MEDPHYS/PHYSICS 501",
            "target": "BME/MEDPHYS 566"
        }
    },
    {
        "data": {
            "source": "BME/HONCOL/MEDPHYS/PHYSICS 501",
            "target": "BME/MEDPHYS 574"
        }
    },
    {
        "data": {
            "source": "BME/HONCOL/MEDPHYS/PHYSICS 501",
            "target": "BME/MEDPHYS 580"
        }
    },
    {
        "data": {
            "source": "BME/HONCOL/MEDPHYS/PHYSICS 501",
            "target": "MEDPHYS 679"
        }
    },
    {
        "data": {
            "source": "BME/HONCOL/MEDPHYS/PHYSICS 501",
            "target": "MEDPHYS/NE 506"
        }
    },
    {
        "data": {
            "source": "BME/HONCOL/MEDPHYS/PHYSICS 501",
            "target": "MEDPHYS/PHYSICS 588"
        }
    },
    {
        "data": {
            "source": "BME/MEDPHYS 566",
            "target": "MEDPHYS 770"
        }
    },
    {
        "data": {
            "source": "BME/MEDPHYS 566",
            "target": "MEDPHYS 772"
        }
    },
    {
        "data": {
            "source": "BME/MEDPHYS 568",
            "target": "BME/MEDPHYS 710"
        }
    },
    {
        "data": {
            "source": "BME/MEDPHYS 573",
            "target": "BME/MEDPHYS 574"
        }
    },
    {
        "data": {
            "source": "BME/MEDPHYS 573",
            "target": "BME/MEDPHYS 580"
        }
    },
    {
        "data": {
            "source": "BME/MEDPHYS 573",
            "target": "MEDPHYS 775"
        }
    },
    {
        "data": {
            "source": "BME/MEDPHYS 578",
            "target": "MEDPHYS 665"
        }
    },
    {
        "data": {
            "source": "BME/MEDPHYS 578",
            "target": "MEDPHYS 666"
        }
    },
    {
        "data": {
            "source": "BME/MEDPHYS 578",
            "target": "MEDPHYS 775"
        }
    },
    {
        "data": {
            "source": "BME/MEDPHYS 580",
            "target": "MEDPHYS 581"
        }
    },
    {
        "data": {
            "source": "BME/MEDPHYS 580",
            "target": "MEDPHYS 662"
        }
    },
    {
        "data": {
            "source": "BME/MEDPHYS 580",
            "target": "MEDPHYS 663"
        }
    },
    {
        "data": {
            "source": "BME/MEDPHYS 580",
            "target": "MEDPHYS 665"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 113"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 113",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 213"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 213",
            "target": "MATH 222"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 222"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "PHYSICS 201"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "PHYSICS 202"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "PHYSICS 207"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "BME/MEDPHYS 568"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 234"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 319"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 320"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "PHYSICS 241"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "PHYSICS 247"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "BME/MEDPHYS 567"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "BME/MEDPHYS 578"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "MATH 321"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "MEDPHYS 563"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "MEDPHYS/NE 569"
        }
    },
    {
        "data": {
            "source": "MATH 319",
            "target": "BME/MEDPHYS 578"
        }
    },
    {
        "data": {
            "source": "MATH 320",
            "target": "BME/HONCOL/MEDPHYS/PHYSICS 501"
        }
    },
    {
        "data": {
            "source": "MATH 320",
            "target": "BME/MEDPHYS 575"
        }
    },
    {
        "data": {
            "source": "MATH 320",
            "target": "MATH 321"
        }
    },
    {
        "data": {
            "source": "MATH 321",
            "target": "PHYSICS 311"
        }
    },
    {
        "data": {
            "source": "MATH 321",
            "target": "PHYSICS 322"
        }
    },
    {
        "data": {
            "source": "MATH 375",
            "target": "MATH 376"
        }
    },
    {
        "data": {
            "source": "MATH 376",
            "target": "BME/MEDPHYS 573"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MEDPHYS/PHYSICS 265",
            "target": "BME/MEDPHYS 535"
        }
    },
    {
        "data": {
            "source": "MEDPHYS/PHYSICS 265",
            "target": "BME/MEDPHYS/PHMCOL-M/PHYSICS/RADIOL 619"
        }
    },
    {
        "data": {
            "source": "NE 305",
            "target": "MEDPHYS/NE 506"
        }
    },
    {
        "data": {
            "source": "PHYSICS 201",
            "target": "PHYSICS 202"
        }
    },
    {
        "data": {
            "source": "PHYSICS 201",
            "target": "PHYSICS 207"
        }
    },
    {
        "data": {
            "source": "PHYSICS 202",
            "target": "BME/MEDPHYS 568"
        }
    },
    {
        "data": {
            "source": "PHYSICS 202",
            "target": "BME/MEDPHYS 575"
        }
    },
    {
        "data": {
            "source": "PHYSICS 202",
            "target": "PHYSICS 205"
        }
    },
    {
        "data": {
            "source": "PHYSICS 202",
            "target": "PHYSICS 208"
        }
    },
    {
        "data": {
            "source": "PHYSICS 202",
            "target": "PHYSICS 311"
        }
    },
    {
        "data": {
            "source": "PHYSICS 205",
            "target": "NE 305"
        }
    },
    {
        "data": {
            "source": "PHYSICS 205",
            "target": "PHYSICS 241"
        }
    },
    {
        "data": {
            "source": "PHYSICS 207",
            "target": "PHYSICS 201"
        }
    },
    {
        "data": {
            "source": "PHYSICS 207",
            "target": "PHYSICS 208"
        }
    },
    {
        "data": {
            "source": "PHYSICS 208",
            "target": "BME/MEDPHYS 573"
        }
    },
    {
        "data": {
            "source": "PHYSICS 208",
            "target": "HONCOL/MEDPHYS 410"
        }
    },
    {
        "data": {
            "source": "PHYSICS 208",
            "target": "MEDPHYS/NTP 651"
        }
    },
    {
        "data": {
            "source": "PHYSICS 208",
            "target": "MEDPHYS/PHYSICS 265"
        }
    },
    {
        "data": {
            "source": "PHYSICS 208",
            "target": "PHYSICS 202"
        }
    },
    {
        "data": {
            "source": "PHYSICS 241",
            "target": "BME/MEDPHYS 567"
        }
    },
    {
        "data": {
            "source": "PHYSICS 241",
            "target": "BME/MEDPHYS 578"
        }
    },
    {
        "data": {
            "source": "PHYSICS 241",
            "target": "MEDPHYS 563"
        }
    },
    {
        "data": {
            "source": "PHYSICS 241",
            "target": "MEDPHYS/NE 569"
        }
    },
    {
        "data": {
            "source": "PHYSICS 241",
            "target": "PHYSICS 205"
        }
    },
    {
        "data": {
            "source": "PHYSICS 241",
            "target": "PHYSICS 448"
        }
    },
    {
        "data": {
            "source": "PHYSICS 247",
            "target": "PHYSICS 248"
        }
    },
    {
        "data": {
            "source": "PHYSICS 248",
            "target": "PHYSICS 241"
        }
    },
    {
        "data": {
            "source": "PHYSICS 248",
            "target": "PHYSICS 322"
        }
    },
    {
        "data": {
            "source": "PHYSICS 311",
            "target": "PHYSICS 448"
        }
    },
    {
        "data": {
            "source": "PHYSICS 322",
            "target": "PHYSICS 323"
        }
    },
    {
        "data": {
            "source": "PHYSICS 322",
            "target": "PHYSICS 448"
        }
    },
    {
        "data": {
            "source": "PHYSICS 323",
            "target": "BME/HONCOL/MEDPHYS/PHYSICS 501"
        }
    },
    {
        "data": {
            "source": "PHYSICS 448",
            "target": "PHYSICS 449"
        }
    },
    {
        "data": {
            "source": "PHYSICS 449",
            "target": "BME/HONCOL/MEDPHYS/PHYSICS 501"
        }
    }
]