[
    {
        "data": {
            "description": "Develop clinical knowledge and skills necessary to care for patients in Pediatrics and Obstetrics and Gynecology, with emphasis on unique skills such as taking care of vulnerable populations as identified in women's and child health and working with caregivers in addition to the patient themselves. Increase knowledge of fundamental science concepts introduced in Human Family Tree during Phase 1 of the curriculum, such as embryology and teratology, genetic testing, and neurodevelopment. Clinical experiences will occur in a range of representative inpatient, outpatient and surgical settings. In structured educational sessions, compare and contrast selected topics in pediatric, obstetric, and gynecologic patient populations, highlighting the relevant physiology, pathophysiology, basic science, and public health topics.",
            "id": "MEDSC-M 810",
            "parent": "MEDSC-M",
            "title": "SPECIALIZED CARE OF OBSTETRIC, GYNECOLOGIC, AND PEDIATRIC PATIENTS (SCOPE)"
        }
    },
    {
        "data": {
            "description": "Focus on assessing patients with urgent medical conditions, providing acute inpatient care, and transitioning patients to other care settings or home under the care of other professionals. Provide acute care in inpatient and outpatient urgent care settings as well as on the inpatient wards, and develop acute management plans and subsequent transition of care plans. Clinical experiences in acute care settings such as the emergency department and inpatient medicine (both general and subspecialty), psychiatry, and neurology. Builds upon fundamental science concepts introduced in Body in Balance and Mind and Motion, including Ohm's Law, acid-base balance, and volume regulation. Organ system-based approach employing varied modalities. Complete an integrated patient-centered experience by participating in the care of a patient from an urgent admission through inpatient treatment and discharge.",
            "id": "MEDSC-M 812",
            "parent": "MEDSC-M",
            "title": "ACUTE CARE"
        }
    },
    {
        "data": {
            "description": "Advanced course for medical students interested in teaching, pursuing careers in academic medicine and/or preparing to teach in residency. Develop knowledge and skills in the theory and practice of teaching and learning in laboratory-based environments such as the clinical teaching and assessment center (CTAC) and anatomy lab. Enhance and apply your skills with hands-on experiences observing and teaching classroom-based clinical skills and anatomy.",
            "id": "MEDSC-M 912",
            "parent": "MEDSC-M",
            "title": "TEACHING IN THE CLASSROOM: LABORATORY-BASED LEARNING IN MEDICAL EDUCATION"
        }
    },
    {
        "data": {
            "description": "Advanced learning for those interested in teaching, pursuing careers in academic medicine and/or preparation for teaching in residency. Develop knowledge and skills in the theory and practice of teaching and learning specific to design, implementation and facilitation of case-based learning. Enhance and apply your skills with hands-on experiences observing and teaching in classroom-based sessions. Teaching opportunities include facilitating Patient Centered Education (PaCE), Integrated Radiology, Anatomy, and Histology (iRAH), simulation, medium/small group case-based learning and large group team-based learning.",
            "id": "MEDSC-M 914",
            "parent": "MEDSC-M",
            "title": "TEACHING IN THE CLASSROOM: CASE-BASED LEARNING IN MEDICAL EDUCATION"
        }
    },
    {
        "data": {
            "description": "An inter-professional introduction on foundational knowledge regarding the history, structures and key health priorities of Wisconsin tribal nations delivered by a wide range of faculty and guest experts.",
            "id": "MEDSC-M 930",
            "parent": "MEDSC-M",
            "title": "AMERICAN INDIAN HEALTH, HISTORY & TRIBAL GOVERNANCE"
        }
    },
    {
        "data": {
            "description": "Best-practices in simulation facilitation, including crucial components such as prebriefing, skills-based education, immersive experiences, debriefing, learner evaluation and curriculum assessment.",
            "id": "MEDSC-M 852",
            "parent": "MEDSC-M",
            "title": "SIMULATION FACILITATION"
        }
    },
    {
        "data": {
            "description": "Care of adults and children undergoing an operation or procedure, including perioperative preparation, operative care, and post-operative cares for core clinical conditions in the specialties of anesthesia, neurosurgery, ophthalmology, general surgery, otolaryngology, urology, cardiothoracic surgery, peripheral vascular surgery, orthopedics, plastic and reconstructive surgery, and gynecology, as well as interventional radiology, procedural cardiology and gastroenterology. Basic science concepts include cerebral spinal fluid production and flow, fluids and electrolytes, consciousness, inflammation and wound healing, and cancer biology. Anatomic approach using case discussions, podcasts, curated independent reading, online nationally supported modules, and simulation skills. Longitudinal patient care experience integrating communication, evidence based medicine, health information technology, quality improvement  patient safety, professionalism, scientific inquiry, and public health.",
            "id": "MEDSC-M 813",
            "parent": "MEDSC-M",
            "title": "SURGICAL AND PROCEDURAL CARE"
        }
    },
    {
        "data": {
            "description": "Complete dissection and advanced study of the anatomy, histology, embryology, and neuroanatomy of a specific anatomical region as defined by student-generated learning objectives.",
            "id": "MEDSC-M 723",
            "parent": "MEDSC-M",
            "title": "INDEPENDENT ADVANCED ANATOMY DISSECTION"
        }
    },
    {
        "data": {
            "description": "Continued development in health care simulation methodology. Best practices in debriefing both procedural and immersive simulation scenarios.",
            "id": "MEDSC-M 853",
            "parent": "MEDSC-M",
            "title": "DEBRIEFING IN HEALTHCARE SIMULATION"
        }
    },
    {
        "data": {
            "description": "Designed for students to apply the knowledge and skills developed over four years of medical school and prepare them for the transition from medical student to intern. The course will cover topics in the following domains: Common and Critical Medical Conditions, Laboratory Interpretation and Procedural Skills, Professionalism and Communication, Hospital and Team Functioning and Life Skills. Sessions will include core topics for all students and sessions for those who will pursue medical or surgical specialties.",
            "id": "MEDSC-M 909",
            "parent": "MEDSC-M",
            "title": "INTERNSHIP PREP COURSE"
        }
    },
    {
        "data": {
            "description": "Designed for students to assume primary responsibility of patients in the outpatient setting. Work with direct oversight by a faculty attending physician as you interview and examine patients, decide upon accurate diagnoses and formulate an appropriate treatment plan. Offered among various specialties and across the statewide campus. A primary focus of this rotation is medical decision-making regarding the ordering of tests and labs, medications and other therapeutic interventions. Students are expected to demonstrate effective communication with patients.",
            "id": "MEDSC-M 902",
            "parent": "MEDSC-M",
            "title": "AMBULATORY ACTING INTERNSHIP"
        }
    },
    {
        "data": {
            "description": "Designed to introduce students in Phase 1 of the ForWard Curriculum to the rural community, its people, the health care issues they face, and the practice of medicine in rural communities. Key concepts of rural medicine, including health resources, access to care, injuries and illnesses associated with farming and agri-business, safety and protective equipment, and health policies. Preparation for clinical training and work in rural areas of Wisconsin.",
            "id": "MEDSC-M 740",
            "parent": "MEDSC-M",
            "title": "OVERVIEW OF RURAL HEALTH"
        }
    },
    {
        "data": {
            "description": "Focuses on molecular, genetic, embryologic, hormonal, anatomical and physiological factors that govern fertility, cell growth, fetal development, and pregnancy as well as the congenital anomalies that can occur when those processes are aberrant. Encompasses the full life-cycle spectrum including childhood growth and development, young adulthood/puberty, issues affecting adolescents and young adults, genetic basis of human disease, reproductive health, menopause, aging, unregulated cell growth (cancer) and end of life issues. Significant content from other competency domains, or \"longitudinal threads\", such as public health, advocacy, ethics, patient care/communication and clinical skills.",
            "id": "MEDSC-M 773",
            "parent": "MEDSC-M",
            "title": "HUMAN FAMILY TREE"
        }
    },
    {
        "data": {
            "description": "Identify the roles of physicians, interdisciplinary providers, health care systems, and communities in screening, treating, and preventing common, chronic conditions. Activities are centered on health promotion, outpatient-based chronic disease management, and community health. Clinical experiences will occur in primary care, behavioral health, and other ambulatory and community-based settings that focus on chronic disease management.",
            "id": "MEDSC-M 811",
            "parent": "MEDSC-M",
            "title": "CHRONIC AND PREVENTIVE CARE"
        }
    },
    {
        "data": {
            "description": "In-depth curriculum development and instructional design of a simulation activity. Practice conducting a thorough needs assessment. Develop clearly defined goals and objectives in determining best educational strategies as they relate to healthcare simulation.",
            "id": "MEDSC-M 851",
            "parent": "MEDSC-M",
            "title": "INSTRUCTIONAL DESIGN IN SIMULATION"
        }
    },
    {
        "data": {
            "description": "Independent research studies under the direct supervision of SMPH faculty. Each project is individualized to meet student learning objectives.",
            "id": "MEDSC-M 918",
            "parent": "MEDSC-M",
            "title": "INDEPENDENT READING AND RESEARCH IN MEDICAL SCIENCES"
        }
    },
    {
        "data": {
            "description": "Integrated examination of how the immune system interacts with foreign microbes, the normal micro biome, and self tissues, both normal and malignant. Examines inflammation and the impacts of this type of response on normal cells, in wound healing, infectious disease, and inflammatory diseases including autoimmune disease and dermatologic conditions, including neoplasia of the skin. Covers the development of adaptive immune responses from vaccination, infectious processes, and organ transplantation. Covers the basic biology and pathophysiology of \"invaders\" of the human body, including viruses, fungi, and bacteria, along with their clinical diagnosis and therapy. Addresses malignant transformation of the immune effector cells themselves, including cancers of mature lymphoid cells and bone marrow derived malignancies.",
            "id": "MEDSC-M 774",
            "parent": "MEDSC-M",
            "title": "INVADERS AND DEFENSE"
        }
    },
    {
        "data": {
            "description": "Introduction to advocacy for population health. Covers determinants of health and the systemic causes that specific populations experience with health and health care in the U.S. Explore a range of strategies and tools for creating productive change with, and on behalf of, groups of patients. Strengthen the ability to see connections between the experiences of individual patients and providers and the organizational, political, social, and economic structures that influence the experiences of all health care stakeholders.",
            "id": "MEDSC-M 941",
            "parent": "MEDSC-M",
            "title": "ADVOCATING FOR POPULATIONS: PARTNERING TO IMPROVE COMMUNITY HEALTH"
        }
    },
    {
        "data": {
            "description": "Introduction to concepts of health and disease, which vary from patient to patient and through time. View health from a population standpoint, with an introduction to basic public health concepts as well as how physicians may positively impact both individual and population level health. Woven within that framework are introductions to key aspects of professionalism, patient-centered history- taking, and core communication skills.",
            "id": "MEDSC-M 770",
            "parent": "MEDSC-M",
            "title": "PATIENTS, PROFESSIONALISM AND PUBLIC HEALTH"
        }
    },
    {
        "data": {
            "description": "Introduction to core basic science, pathophysiologic, and diagnostic principles requisite for the care and treatment of patients with musculoskeletal, neurologic, and psychiatric presentations and disorders. Basic science concepts include those from the traditional disciplines of cell biology, histology, biochemistry, anatomy, embryology, neuroscience, and behavioral science. Regular integration of these topics with their pathologic and pathophysiologic counterparts. Integration of content related to other competency domains, or \"longitudinal threads\", that include patient care  communication, evidence based medicine, health information technology, quality improvement  patient safety, professionalism, scientific inquiry and public health.",
            "id": "MEDSC-M 775",
            "parent": "MEDSC-M",
            "title": "MIND & MOTION"
        }
    },
    {
        "data": {
            "description": "Introduction to some of the core features of the U.S. Health Care System, as experienced by patients and the health care providers caring for them. Build your capacity for advocacy in clinical settings by exploring frameworks and strategies for addressing barriers and inequities, and communication tools to help patients and families better navigate complex systems and access community resources. Advocacy content concentrated on personal advocacy interests.",
            "id": "MEDSC-M 940",
            "parent": "MEDSC-M",
            "title": "ADVOCATING FOR PATIENTS: GETTING THE RIGHT CARE AT THE RIGHT TIME"
        }
    },
    {
        "data": {
            "description": "Learn the history and best practices of healthcare simulation. Gain global perspective on simulation terminology and best practices in simulation facilitation to advance safe, high-quality, patient-centered care.",
            "id": "MEDSC-M 850",
            "parent": "MEDSC-M",
            "title": "INTRODUCTION TO HEALTHCARE SIMULATION"
        }
    },
    {
        "data": {
            "description": "Medical interviewing, physical examination and cultural competency skills to enhance their ability to provide care for Spanish-speaking patients and their families. Pertinent medical vocabulary for clinical histories and physical exams, and grammar components to facilitate effective and professional communication. For health science students with intermediate or advanced Spanish proficiency.",
            "id": "MEDSC-M 735",
            "parent": "MEDSC-M",
            "title": "MEDICAL SPANISH FOR HEALTH SCIENCE STUDENTS"
        }
    },
    {
        "data": {
            "description": "Narrative medicine, developing narrative competence, storytelling, and personal reflection. Using medical humanities for personal statement writing, interview preparation and professional identity formation.",
            "id": "MEDSC-M 942",
            "parent": "MEDSC-M",
            "title": "NARRATIVE MEDICINE, STORYTELLING, AND PREPARING FOR RESIDENCY"
        }
    },
    {
        "data": {
            "description": "Organized around biomedical themes including nutrients, the digestive system, the biochemistry and endocrine control of metabolism, exercise and fitness and the removal of waste products and toxins to present an integrated picture of how these systems function together to maintain homeostasis. Integrates developmental content from competency domains, or \"longitudinal threads\", including communication, patient care, ethics, health information technology, public health, professionalism, quality improvement, patient safety, and scientific inquiry.",
            "id": "MEDSC-M 772",
            "parent": "MEDSC-M",
            "title": "FOOD, FASTING & FITNESS"
        }
    },
    {
        "data": {
            "description": "Organized around physiological themes, the course includes material related to the cardiovascular system, hematology, nephrology, and pulmonology to present an integrated picture of how these systems function together to maintain homeostasis. In addition, there is significant content from other competency domains such as public health, ethics, evidence-based medicine, patient care/communication and clinical skills.",
            "id": "MEDSC-M 771",
            "parent": "MEDSC-M",
            "title": "BODY IN BALANCE"
        }
    },
    {
        "data": {
            "description": "Provides a two-pronged opportunity for fourth year medical students to re-engage with MEDiC clinics where they may have volunteered during their first and second years of medical school, further appreciating the complexities of serving marginalized populations, and to use their recent clinical experience to contribute as both mentors and collaborators with students from multiple health professional professions. Careful focus on the broad public health issues affecting the patients in MEDiC clinics and how these issues inform their health status, health care and health access. Investigate the role of race in health disparities, as well as the role of socio-economic status.",
            "id": "MEDSC-M 910",
            "parent": "MEDSC-M",
            "title": "MEDIC CLINICS SELECTIVE: A STUDY OF MARGINALIZED POPULATIONS AND INTERPROFESSIONAL COLLABORATION"
        }
    },
    {
        "data": {
            "description": "Review and reinforce baseline skills you will need for internship training in any specialty, using interactive learning methods. Major topics include Radiology, Cardiology/Pulmonary, Urgent and Emergent situations, Procedural skills, Acute Illness, and Communication.",
            "id": "MEDSC-M 913",
            "parent": "MEDSC-M",
            "title": "WISCONSIN ACADEMY FOR RURAL MEDICINE (WARM) INTERNSHIP PREPARATION ELECTIVE"
        }
    },
    {
        "data": {
            "description": "Study of the anatomy of the head and neck, body wall, body cavities, limbs, and pelvic outlet through complete dissection of human cadavers. Hands-on experience in interpreting radiological cross-sectional images. Surgical correlates will be presented by practicing surgeons.",
            "id": "MEDSC-M 722",
            "parent": "MEDSC-M",
            "title": "CLINICAL ANATOMY AND RADIOLOGY"
        }
    },
    {
        "data": {
            "description": "Uses Wisconsin health disparities data as a tool to address the broader misconceptions about race, biology, and health. Includes an overview of the genetic mechanisms for species variation, human evolutionary history, human adaptation and clinical patterns, and misconceptions about the biological underpinnings of race and health outcomes with an emphasis on the social and environmental determinants of health.",
            "id": "MEDSC-M 911",
            "parent": "MEDSC-M",
            "title": "RACIAL HEALTH DISPARITIES IN WISCONSIN"
        }
    },
    {
        "data": {
            "id": "MEDSC-M",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 770",
            "target": "MEDSC-M 810"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 771",
            "target": "MEDSC-M 810"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 772",
            "target": "MEDSC-M 810"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 773",
            "target": "MEDSC-M 810"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 774",
            "target": "MEDSC-M 810"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 775",
            "target": "MEDSC-M 810"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 810",
            "target": "MEDSC-M 722"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 810",
            "target": "MEDSC-M 909"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 810",
            "target": "MEDSC-M 912"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 810",
            "target": "MEDSC-M 913"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 810",
            "target": "MEDSC-M 914"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 810",
            "target": "MEDSC-M 942"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 811",
            "target": "MEDSC-M 722"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 811",
            "target": "MEDSC-M 909"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 811",
            "target": "MEDSC-M 912"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 811",
            "target": "MEDSC-M 913"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 811",
            "target": "MEDSC-M 914"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 811",
            "target": "MEDSC-M 942"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 812",
            "target": "MEDSC-M 722"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 812",
            "target": "MEDSC-M 909"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 812",
            "target": "MEDSC-M 912"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 812",
            "target": "MEDSC-M 913"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 812",
            "target": "MEDSC-M 914"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 812",
            "target": "MEDSC-M 942"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "MEDSC-M 722"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "MEDSC-M 909"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "MEDSC-M 912"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "MEDSC-M 913"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "MEDSC-M 914"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "MEDSC-M 942"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 850",
            "target": "MEDSC-M 851"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 850",
            "target": "MEDSC-M 852"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 850",
            "target": "MEDSC-M 853"
        }
    }
]