[
    {
        "data": {
            "description": "Basic concepts of well-animal companion animal and equine health care, nutrition, and reproduction will be presented. Discussion of the etiology, pathophysiology, diagnosis, treatment, and prevention of important internal medicine and reproductive diseases in these species will be emphasized.",
            "id": "MEDSC-V 632",
            "parent": "MEDSC-V",
            "title": "COMPANION ANIMAL AND EQUINE MEDICINE I"
        }
    },
    {
        "data": {
            "description": "Basic concepts of well-animal companion animal and equine health care, nutrition, and reproduction will be presented. Discussion of the etiology, pathophysiology, diagnosis, treatment, and prevention of important internal medicine and reproductive diseases in these species will be emphasized.",
            "id": "MEDSC-V 633",
            "parent": "MEDSC-V",
            "title": "COMPANION ANIMAL AND EQUINE MEDICINE II"
        }
    },
    {
        "data": {
            "description": "Basic principles for food animal species. Integrates food animal medicine, theriogenology, nutrition and preventive medicine concepts.",
            "id": "MEDSC-V 634",
            "parent": "MEDSC-V",
            "title": "FOOD ANIMAL MEDICINE"
        }
    },
    {
        "data": {
            "description": "Cover various topics in emergency and critical care medicine. Several areas of emergency and critical care medicine will be presented.",
            "id": "MEDSC-V 577",
            "parent": "MEDSC-V",
            "title": "SMALL ANIMAL EMERGENCY AND CRITICAL CARE II"
        }
    },
    {
        "data": {
            "description": "Develop the ability to analyze, organize and integrate information effectively to make clinical decisions relating to the diagnosis, prognosis, management and control of diseases.",
            "id": "MEDSC-V 678",
            "parent": "MEDSC-V",
            "title": "SMALL ANIMAL INTERNAL MEDICINE"
        }
    },
    {
        "data": {
            "description": "Develop the technical, clinical and knowledge skills to effectively examine, diagnose and manage the dermatology patient.",
            "id": "MEDSC-V 668",
            "parent": "MEDSC-V",
            "title": "CLINICAL DERMATOLOGY ROTATION"
        }
    },
    {
        "data": {
            "description": "Diagnosis and medical treatment of diseases of horses, cattle, sheep, goats and pigs. Examine, admit and discharge cases in the Veterinary Medical Teaching Hospital.",
            "id": "MEDSC-V 670",
            "parent": "MEDSC-V",
            "title": "SENIOR ROTATION IN LARGE ANIMAL MEDICINE SERVICE"
        }
    },
    {
        "data": {
            "description": "Diagnosis, treatment, and recommendation of preventive measures for common medical, surgical and management problems on farms. Examine the environmental influences associated with such problems.",
            "id": "MEDSC-V 674",
            "parent": "MEDSC-V",
            "title": "SENIOR ROTATION IN AMBULATORY SERVICE"
        }
    },
    {
        "data": {
            "description": "Diagnostic techniques and therapy available for the management of cardiology patients.",
            "id": "MEDSC-V 669",
            "parent": "MEDSC-V",
            "title": "SMALL ANIMAL CARDIOLOGY ROTATION"
        }
    },
    {
        "data": {
            "description": "Focuses on basic swine medicine clinical skills including diagnosis and treatment of common swine diseases that present in individual pigs and populations. Influences of production practices and farm structure will be introduced as they impact the successful practice of swine medicine. Additionally, regulatory influences unique to swine veterinary medicine and principles of biosecurity/biocontainment and bioexclusion will be discussed.",
            "id": "MEDSC-V 635",
            "parent": "MEDSC-V",
            "title": "SWINE MEDICINE"
        }
    },
    {
        "data": {
            "description": "Formal laboratory instruction. Detailed examination techniques and diagnostic and therapeutic procedures relevant to veterinary procedures on all species of domestic animals.",
            "id": "MEDSC-V 625",
            "parent": "MEDSC-V",
            "title": "VETERINARY DIAGNOSTIC AND THERAPEUTIC TECHNIQUES"
        }
    },
    {
        "data": {
            "description": "Introduces use of the problem oriented medical record concepts, history taking, physical examination and basic restraint, and diagnostic and therapeutic techniques in large and small domestic animals.",
            "id": "MEDSC-V 570",
            "parent": "MEDSC-V",
            "title": "ANIMAL HEALTH HISTORY RESTRAINT AND PHYSICAL EXAMINATION"
        }
    },
    {
        "data": {
            "description": "Introduction to to various topics of emergency and critical care medicine.",
            "id": "MEDSC-V 576",
            "parent": "MEDSC-V",
            "title": "SMALL ANIMAL EMERGENCY AND CRITICAL CARE I"
        }
    },
    {
        "data": {
            "description": "Investigate and analyze farm and laboratory data and evaluate recommendations using benefit/cost analyses. Perform milking system, milking procedure, and environmental management evaluations.",
            "id": "MEDSC-V 703",
            "parent": "MEDSC-V",
            "title": "PRODUCTION MEDICINE II"
        }
    },
    {
        "data": {
            "description": "Lead cases by determining diagnosis and treatment of general practice preventative medicine and diseases of small animal species. Build clinical diagnostic and surgical skills, communication skills, interdisciplinary teamwork, self-reflection, and cultural humility skills.",
            "id": "MEDSC-V 716",
            "parent": "MEDSC-V",
            "title": "SMALL ANIMAL WISCARES ROTATION"
        }
    },
    {
        "data": {
            "description": "Offers opportunities for faculty coordinated experience in the veterinary medical profession outside School of Veterinary Medicine.",
            "id": "MEDSC-V 775",
            "parent": "MEDSC-V",
            "title": "EXTERNSHIP"
        }
    },
    {
        "data": {
            "description": "Presents awareness of the importance of nutrition in the veterinary practice.",
            "id": "MEDSC-V 629",
            "parent": "MEDSC-V",
            "title": "VETERINARY NUTRITION"
        }
    },
    {
        "data": {
            "description": "Projects in the laboratory and/or through library work in specific subject areas under the direct guidance of a faculty member.",
            "id": "MEDSC-V 699",
            "parent": "MEDSC-V",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Provide a practical, clinical experience by determining the diagnosis and treatment of general practice preventative medicine and diseases of dogs and cats.  Provide an opportunity to evaluate and treat primary or first opinion cases (medicine, surgery) seen in private practice, to develop proficiency in client communications, and to create a skills base for management of preventive health, new pet and primary medical and surgical cases.",
            "id": "MEDSC-V 714",
            "parent": "MEDSC-V",
            "title": "SMALL ANIMAL PRIMARY CARE ROTATION"
        }
    },
    {
        "data": {
            "description": "Provide instruction and guidance in obtaining a complete neurological history, interpreting examinations, diagnostic tests and rationally selecting an appropriate diagnosis and effective management for neurology cases.",
            "id": "MEDSC-V 667",
            "parent": "MEDSC-V",
            "title": "SMALL ANIMAL NEUROLOGY"
        }
    },
    {
        "data": {
            "description": "Rotation for applying principles of nutrition to dairy practice.",
            "id": "MEDSC-V 705",
            "parent": "MEDSC-V",
            "title": "PRODUCTION MEDICINE III-APPLIED DAIRY NUTRITION"
        }
    },
    {
        "data": {
            "description": "To develop skills in clinical medicine, palpation, interpretation of laboratory data and become acquainted with oncology clientele.",
            "id": "MEDSC-V 679",
            "parent": "MEDSC-V",
            "title": "SMALL ANIMAL ONCOLOGY"
        }
    },
    {
        "data": {
            "description": "Topics vary.",
            "id": "MEDSC-V 675",
            "parent": "MEDSC-V",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "Visit dairy farms, learn to identify production limiting problems, and develop a priority list based upon economic importance. The farm investigation consists of visual evaluations of farmstead and herd, interpretation of DHI records, and computer analysis of herd records.",
            "id": "MEDSC-V 701",
            "parent": "MEDSC-V",
            "title": "PRODUCTION MEDICINE I"
        }
    },
    {
        "data": {
            "description": "Work jointly with faculty, residents and interns to assess emergent patients, formulate both treatment and diagnostic plans. Under direct supervision, demonstrate basic ER skills and procedures upon patients, as is appropriate.",
            "id": "MEDSC-V 710",
            "parent": "MEDSC-V",
            "title": "SMALL ANIMAL EMERGENCY MEDICINE ROTATION"
        }
    },
    {
        "data": {
            "id": "MEDSC-V",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "MEDSC-V 576",
            "target": "MEDSC-V 577"
        }
    }
]