[
    {
        "data": {
            "description": "Covers innovation and entrepreneurship in an existing corporate environment. Adopt the perspective of decision-makers who must evaluate the potential of new technologies, decide on their adoption, and establish their implementation in the current firm's activities and products. Discuss how established firms can build an internal environment such that all employees adopt entrepreneurial behaviors and generate their own technological or business model innovations.",
            "id": "MHR 415",
            "parent": "MHR",
            "title": "STRATEGIC MANAGEMENT OF INNOVATION AND CORPORATE ENTREPRENEURSHIP"
        }
    },
    {
        "data": {
            "description": "Covers the graphs, properties and geometric significance of trigonometric functions of a real variable. Other topics include trigonometric equations and identities, application, trigonometric form of complex numbers, DeMoivre's theorem, and polar and parametric equations. The course also has a significant number of applications, especially related to other disciplines.",
            "id": "MATH 113",
            "parent": "MATH",
            "title": "TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "Examines growth strategies that extend the firm's scope into new businesses and geographies. Most firms operate in multiple products, markets, and geographic arenas. Explore complementarities (and costs) of operating in a portfolio of strategic arenas defined by products, customers, and global markets. This includes the analysis of strategic choices to vertically integrate (e.g., internal suppliers) as well as maintaining external alliance partners.",
            "id": "MHR 724",
            "parent": "MHR",
            "title": "GROWTH STRATEGIES: MULTI BUSINESS AND GLOBAL ARENAS"
        }
    },
    {
        "data": {
            "description": "Examines team dynamics, highlights key factors that influence team effectiveness, develops skills in diagnosing opportunities and threats that face teams, and enhances teamwork expertise. The content is applicable to projects across specializations. For instance, teamwork skills are essential to project teams developing new products/services, working on business strategy, implementing process improvements, designing new financial investment instruments, and developing real estate. In any of these projects, employees would work as a team to accomplish their goals. The team's success or failure will depend, to a large extent, on how the team members work together.",
            "id": "MHR 706",
            "parent": "MHR",
            "title": "LEADING AND WORKING IN TEAMS"
        }
    },
    {
        "data": {
            "description": "Improves students' negotiating skills, doing so by providing a theoretical underpinning that will help them to understand the sources of effective and ineffective approaches to negotiations.",
            "id": "EPD/GENBUS/MHR 785",
            "title": "EFFECTIVE NEGOTIATION STRATEGIES"
        }
    },
    {
        "data": {
            "description": "Action learning through engaging with a real-world technology venture in the context of a knowledge-intensive industry. In teams, negotiate a project to support venture development, plan and implement the project, and present the results to the venture and the instructor. Provides direct insight into technology venture processes, observation of pitching and mentoring activities, and the real-world challenges associated with early stage venturing.",
            "id": "MHR 641",
            "parent": "MHR",
            "title": "CREATIVE DESTRUCTION LAB II"
        }
    },
    {
        "data": {
            "description": "An applied early stage startup practicum and professional socialization seminar in Entrepreneurship and Enterprise Development for students admitted into the Wisconsin Fellowship in Enterprise Development Program. Meets weekly on the topic of entrepreneurship and enterprise development.  Learn to apply business and entrepreneurship frameworks and skills in a class project focused on early-stage ideas. Requires admission to the Wisconsin Enterprise Development Fellowship program",
            "id": "MHR 739",
            "parent": "MHR",
            "title": "WISCONSIN ENTERPRISE DEVELOPMENT FELLOWSHIP SEMINAR"
        }
    },
    {
        "data": {
            "description": "An overview and foundation in preparation for developing, launching, or advancing innovative projects in arts, culture, design, and humanities. Learn the unique contexts and challenges of creative careers. Develop creative project goals while gaining an understanding of the nature and structure of arts entrepreneurship in a variety of sectors - for-profit, nonprofit, government, and hybrid.",
            "id": "INTEGART/MHR 632",
            "title": "INTRODUCTION TO ARTS ENTREPRENEURSHIP"
        }
    },
    {
        "data": {
            "description": "Analysis and discussion of selected topics in organizational behavior and design.",
            "id": "MHR 872",
            "parent": "MHR",
            "title": "SEMINAR IN ORGANIZATIONAL BEHAVIOR AND DESIGN"
        }
    },
    {
        "data": {
            "description": "Become familiar with basic entrepreneurship principles and value proposition design techniques in social entrepreneurship settings with attention to the perspective of arts and cultural organizations. Content includes business model development, customer-driven innovation, lean startup practices, organizational capacity for entrepreneurial action, team performance, the structure of alliances and partnerships and funding mechanisms in the sector.",
            "id": "INTEGART/MHR 636",
            "title": "ENTREPRENEURSHIP IN ARTS & CULTURAL ORGANIZATIONS"
        }
    },
    {
        "data": {
            "description": "Concepts and techniques in corporate finance and investments. Topics include the financial environment, securities markets, financial markets, financial statements and analysis, working capital management, capital budgeting, cost of capital, dividend policy, asset valuation, investments, decision-making under uncertainty, mergers, options, and futures.",
            "id": "ECON/FINANCE 300",
            "title": "INTRODUCTION TO FINANCE"
        }
    },
    {
        "data": {
            "description": "Conduct research, apply strategic human resources knowledge, and complete a capstone project for a local client organization, addressing a human resources business challenge or need.",
            "id": "MHR 776",
            "parent": "MHR",
            "title": "STRATEGIC HUMAN RESOURCE MANAGEMENT CAPSTONE"
        }
    },
    {
        "data": {
            "description": "Contemporary theory of consumption, production, pricing and resource allocation.",
            "id": "ECON 301",
            "parent": "ECON",
            "title": "INTERMEDIATE MICROECONOMIC THEORY"
        }
    },
    {
        "data": {
            "description": "Continuation ofMATH 171. Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Completion ofMATH 217implies completion ofMATH 221and114.",
            "id": "MATH 217",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY II"
        }
    },
    {
        "data": {
            "description": "Continuation ofM H R 773.",
            "id": "MHR 774",
            "parent": "MHR",
            "title": "SEMINAR-ARTS ADMINISTRATION"
        }
    },
    {
        "data": {
            "description": "Continuation ofM H R 975.",
            "id": "MHR 976",
            "parent": "MHR",
            "title": "DOCTORAL RESEARCH SEMINAR IN MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Describes activities and skills necessary to start and manage an enterprise. Includes decisions about domain, purchase versus start-up, preferred market, financing, legal form, staffing, organization structure, location, and legal requirements. Describes the entrepreneurial role in business initiation.",
            "id": "MHR 722",
            "parent": "MHR",
            "title": "ENTREPRENEURIAL MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Designed for graduate students interested in learning about the fundamental issues related to starting and managing technology-based new ventures.  Encourages students to consider how technology-based solutions can solve economic and socially oriented problems.",
            "id": "MHR 741",
            "parent": "MHR",
            "title": "TECHNOLOGY ENTREPRENEURSHIP"
        }
    },
    {
        "data": {
            "description": "Designed for undergraduate students interested in learning about the fundamental issues related to starting and managing technology-based new ventures.  Encourages students to consider how technology-based solutions can solve economic and socially oriented problems.",
            "id": "MHR 441",
            "parent": "MHR",
            "title": "TECHNOLOGY ENTREPRENEURSHIP"
        }
    },
    {
        "data": {
            "description": "Designed to improve student knowledge of the bargaining process and their negotiating skills. Students will learn about different bargaining theories and have the opportunity to apply these theories in exercises and role-playing cases.",
            "id": "MHR 728",
            "parent": "MHR",
            "title": "BARGAINING, NEGOTIATING AND DISPUTE SETTLEMENT FOR MANAGERS"
        }
    },
    {
        "data": {
            "description": "Determinants of wage levels, wage structures and individual wages; analysis of the impact of wages on individual attitudes and decisions to participate and perform in organizations.",
            "id": "MHR 610",
            "parent": "MHR",
            "title": "COMPENSATION: THEORY AND ADMINISTRATION"
        }
    },
    {
        "data": {
            "description": "Develop capabilities to conceive of new ventures that create value and critically analyze the role of entrepreneurship in society.  Activities include: Imagine/design new ventures, identify markets and funding sources, develop founding teams, do scholarly research on impact of entrepreneurship.",
            "id": "MHR 320",
            "parent": "MHR",
            "title": "NEW VENTURES IN BUSINESS, THE ARTS AND SOCIAL ENTREPRENEURSHIP"
        }
    },
    {
        "data": {
            "description": "Economic problems of individuals, firms and industries with emphasis on value, price, and distribution of income.",
            "id": "ECON 101",
            "parent": "ECON",
            "title": "PRINCIPLES OF MICROECONOMICS"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "Examination and applied analysis of selected topics in administration of both visual and performing arts organizations; marketing and audience development, contracts and legal problems, fund development, program planning and evaluation, facilities management, business and government relations.",
            "id": "MHR 773",
            "parent": "MHR",
            "title": "SEMINAR-ARTS ADMINISTRATION"
        }
    },
    {
        "data": {
            "description": "Examination of behavioral science literature dealing with the processes by which individuals, small groups and organizations make decisions. Understanding decision-making behavior in order to improve managerial performance; modeling decision-making processes for systems design and theory building purposes. Knowledge of statistics strongly encouraged such asSTAT 301.",
            "id": "ISYE/MHR 729",
            "title": "BEHAVIORAL ANALYSIS OF MANAGEMENT DECISION MAKING"
        }
    },
    {
        "data": {
            "description": "Examines both financial and managerial accounting for business decisions. Emphasizes preparation and interpretation of financial statements, analysis of financial information, determination of costs for products and services, and use of accounting information for planning and control of business operations.",
            "id": "ACCTIS 300",
            "parent": "ACCTIS",
            "title": "ACCOUNTING PRINCIPLES"
        }
    },
    {
        "data": {
            "description": "Examines components that comprise teams, highlights key factors that influence team effectiveness, develops skills in diagnosing opportunities and threats that face teams, and enhances teamwork expertise.",
            "id": "MHR 401",
            "parent": "MHR",
            "title": "LEADING TEAMS"
        }
    },
    {
        "data": {
            "description": "Examines generally accepted accounting principles for measurement and reporting of financial information in a balance sheet, income statement, and statement of cash flows; introduction to analysis and interpretation of financial accounting data for decision-making purposes.",
            "id": "ACCTIS 100",
            "parent": "ACCTIS",
            "title": "INTRODUCTORY FINANCIAL ACCOUNTING"
        }
    },
    {
        "data": {
            "description": "Examines the effective management of behavior in organizations. Focuses on the application of theories of leadership and work motivation. Includes critical conceptual and analytical assessment of these theories. Emphasizes the management of work performance, managerial skill building, and enabling followers.",
            "id": "MHR 704",
            "parent": "MHR",
            "title": "MANAGING BEHAVIOR IN ORGANIZATIONS"
        }
    },
    {
        "data": {
            "description": "Experience networking, engagement, and access to research and industry leaders. Practice active reflection through application of course concepts in non-classroom settings. Includes professional development through career services support and mock interview panels.",
            "id": "MHR 750",
            "parent": "MHR",
            "title": "PROFESSIONAL DEVELOPMENT FOR ARTS LEADERSHIP"
        }
    },
    {
        "data": {
            "description": "Exploration of advanced subject areas possibly to be introduced into the business curriculum.",
            "id": "MHR 765",
            "parent": "MHR",
            "title": "CONTEMPORARY TOPICS"
        }
    },
    {
        "data": {
            "description": "Exploration of statistical inference and data analytics tools. Review of relevant foundations of statistics, machine learning and probability theory. Emphasis on applying the resulting concepts to canonical business examples, using both Excel and R.",
            "id": "GENBUS 704",
            "parent": "GENBUS",
            "title": "DATA TO DECISIONS"
        }
    },
    {
        "data": {
            "description": "Exploration of subject areas possibly to be introduced into the business curriculum.",
            "id": "MHR 365",
            "parent": "MHR",
            "title": "CONTEMPORARY TOPICS"
        }
    },
    {
        "data": {
            "description": "Explore emerging and current human resources topics through applied learning experiences such as personal assessments, case studies, industry meetings, and exercises or workshops. Interact with leading human resources and business professionals to gain exposure to various leadership and communication styles. Focus on enhancing leadership and communication effectiveness.",
            "id": "MHR 775",
            "parent": "MHR",
            "title": "APPLIED LEARNING IN HUMAN RESOURCE MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Explores the strategies and range of processes, methods, and resources that organizations use in talent (human capital) management initiatives to support achievement of business strategy and short and long-term objectives. The focus is on understanding the fundamentals of effective talent management including talent attraction, talent acquisition, talent (career) development, motivation and engagement, and talent retention.",
            "id": "MHR 611",
            "parent": "MHR",
            "title": "STRATEGIC TALENT MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Focuses on the process of starting and growing a new venture. Develop and utilize a set of qualitative and quantitative skills that can be applied in this context. Topics include how to assess and quantify growth potential of an entrepreneurial opportunity, how investors value startups, and how startups are effectively managed. Acquire a set of cross-functional concepts in finance, law, marketing, and strategy.",
            "id": "MHR 422",
            "parent": "MHR",
            "title": "ADVANCED ENTREPRENEURSHIP"
        }
    },
    {
        "data": {
            "description": "Focuses on the strategic management required in global business. Topics include environmental analysis, global strategy, and subsidiary control. The aim of the course is to develop special skills that are required to manage international firms.",
            "id": "INTLBUS/MHR 403",
            "title": "GLOBAL ISSUES IN MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Gain and apply knowledge about foundations of entrepreneurship, and key topics such as founding teams, customer/market discovery, starting and growing a business.",
            "id": "MHR 322",
            "parent": "MHR",
            "title": "INTRODUCTION TO ENTREPRENEURSHIP"
        }
    },
    {
        "data": {
            "description": "General management course that analyzes and integrates growth patterns and business disciplines in context of nascent and high growth firms.",
            "id": "MHR 427",
            "parent": "MHR",
            "title": "ENTREPRENEURIAL GROWTH STRATEGIES"
        }
    },
    {
        "data": {
            "description": "Helps student gain tools, concepts and information about how to generate value from Innovation and technology in existing organizations.",
            "id": "MHR 715",
            "parent": "MHR",
            "title": "STRATEGIC MANAGEMENT OF INNOVATION"
        }
    },
    {
        "data": {
            "description": "How startups and business accelerators create and diffuse innovation. Topics covered include the basic economics of startups and business accelerators, the development of acceleration platforms, the accelerator model of innovation sourcing and selection, and fostering mindsets of innovation.",
            "id": "MHR 716",
            "parent": "MHR",
            "title": "ACCELERATING INNOVATION"
        }
    },
    {
        "data": {
            "description": "Individual work suited to the needs of Ph.D. students may be arranged both during regular sessions and during the intersession periods.",
            "id": "MHR 999",
            "parent": "MHR",
            "title": "READING AND RESEARCH-MANAGEMENT AND HUMAN RESOURCES PHD"
        }
    },
    {
        "data": {
            "description": "Individual work suited to the needs of graduate students.",
            "id": "MHR 799",
            "parent": "MHR",
            "title": "READING AND RESEARCH-MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Individual work suited to the needs of undergraduate students may be arranged with a faculty member.",
            "id": "MHR 399",
            "parent": "MHR",
            "title": "READING AND RESEARCH-MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Individual work to complete dissertation requirement of Ph.D. program.",
            "id": "MHR 990",
            "parent": "MHR",
            "title": "MANAGEMENT INDEPENDENT RESEARCH PHD THESIS"
        }
    },
    {
        "data": {
            "description": "Integrated treatment of macroeconomics and microeconomics (seeECON 101andECON 102). Accelerated approach to economics training, especially for Economics: Math Emphasis majors.",
            "id": "ECON 111",
            "parent": "ECON",
            "title": "PRINCIPLES OF ECONOMICS-ACCELERATED TREATMENT"
        }
    },
    {
        "data": {
            "description": "Integrative approach to strategic management, including strategy formulation/implementation at business unit, corporate levels. Cases, discussion, lecture, simulation are used to communicate concepts. Emphasizes development of unique tools for analysis of companies and industries, application of knowledge to business problems.",
            "id": "MHR 723",
            "parent": "MHR",
            "title": "BUSINESS STRATEGY"
        }
    },
    {
        "data": {
            "description": "Intended for students who seek to transform their own ideas into new ventures.  Students will learn the process of evaluating, formalizing, and communicating a new venture idea.  Student originated product/service/venture concept required for course.",
            "id": "MHR 434",
            "parent": "MHR",
            "title": "VENTURE CREATION"
        }
    },
    {
        "data": {
            "description": "Intended for students who seek to transform their own ideas into new ventures.  Students will learn the process of evaluating, formalizing, and communicating a new venture idea.  Student originated product/service/venture concept required for course.",
            "id": "MHR 734",
            "parent": "MHR",
            "title": "VENTURE CREATION"
        }
    },
    {
        "data": {
            "description": "Introduces key topics and concepts associated with technology entrepreneurship, venture formation, and project-based organizational consulting. Allows for practice of key analytical approaches to understanding technology venturing processes. Application required.",
            "id": "MHR 640",
            "parent": "MHR",
            "title": "CREATIVE DESTRUCTION LAB I"
        }
    },
    {
        "data": {
            "description": "Introduction to analysis of economic data. The techniques of descriptive statistics and statistical inference (hypothesis testing and estimation) as directed toward application in economic research.",
            "id": "ECON 310",
            "parent": "ECON",
            "title": "STATISTICS: MEASUREMENT IN ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Introduction to financial management of firms and investment decision making; both theory and practice are emphasized. Topics covered include the financial environment and securities markets, financial statements and analysis, working capital management and capital budgeting, cost of capital, dividend policy, asset valuation, investments, decision making under uncertainty and selected topics such as mergers, options, futures.",
            "id": "FINANCE 700",
            "parent": "FINANCE",
            "title": "INTRODUCTION TO FINANCIAL MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Labor-management relations at the firm level including its evolution, characteristics and contemporary issues. Emphasis on analysis of the labor-management relationship through reference to theory and research on collective action, bargaining behavior and conflict resolution.",
            "id": "MHR 612",
            "parent": "MHR",
            "title": "LABOR-MANAGEMENT RELATIONS"
        }
    },
    {
        "data": {
            "description": "Learn about nonprofit board structure and governance, develop a commitment to community and civic engagement, and network with representatives from nonprofit organizations.",
            "id": "MHR 744",
            "parent": "MHR",
            "title": "NONPROFIT GOVERNANCE & BOARD MEMBERSHIP"
        }
    },
    {
        "data": {
            "description": "Learn how to create a socially-engaged businesses and how to use entrepreneurial approaches to non-profit ventures. Activities include developing mission statements, assessing social impact, seeking funding from varied sources. Guest lecturers, cases, role playing. Grounded in management theory.",
            "id": "MHR 321",
            "parent": "MHR",
            "title": "SOCIAL ENTREPRENEURSHIP"
        }
    },
    {
        "data": {
            "description": "Macroeconomic measurement and models of aggregate demand and supply; fiscal and monetary policy for unemployment, inflation, and growth.",
            "id": "ECON 102",
            "parent": "ECON",
            "title": "PRINCIPLES OF MACROECONOMICS"
        }
    },
    {
        "data": {
            "description": "Management of operations throughout an organization or supply chain. Emphasizes the coordination of resources to improve cost, quality, and customer service. Topics include capacity and materials management, operations strategy, and process improvement.",
            "id": "OTM 700",
            "parent": "OTM",
            "title": "OPERATIONS AND SUPPLY CHAIN MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Management of people and organizations, exploring concepts that will be valuable as a current employee or a future employee, manager, or leader. Concepts will be discussed at the individual, group or team, and the organizational level. Key organizational behavior topics include: diversity, attitude and job satisfaction, emotions, personality and value, individual and group decision making, motivation, teams, leadership, influence, strategy, organizational structure and culture, and change management.",
            "id": "MHR 700",
            "parent": "MHR",
            "title": "LEADING PEOPLE AND ORGANIZATIONS"
        }
    },
    {
        "data": {
            "description": "Managerial accounting concepts relevant for decision-making; use of accounting information for planning, decision-making, and control of business operations in various management and business environments.",
            "id": "ACCTIS 211",
            "parent": "ACCTIS",
            "title": "INTRODUCTORY MANAGERIAL ACCOUNTING"
        }
    },
    {
        "data": {
            "description": "Measurement and reporting guidelines underlying preparation of general purpose financial statements. Explore current measurement and reporting issues. Analyze and interpret financial statement data for investment, lending, and related decisions.",
            "id": "ACCTIS 700",
            "parent": "ACCTIS",
            "title": "FINANCIAL ACCOUNTING"
        }
    },
    {
        "data": {
            "description": "Offers an understanding of fundamental principles, methods, and tools used in management consulting and develop skills to diagnose the functioning of an organization, problem solving, and to design and implement interventions to enhance individual, group, and organizational effectiveness.",
            "id": "MHR 412",
            "parent": "MHR",
            "title": "MANAGEMENT CONSULTING"
        }
    },
    {
        "data": {
            "description": "Policies and practices; principles and techniques applicable to problems such as employee staffing, training, labor relations, wages, communications, etc.",
            "id": "MHR 305",
            "parent": "MHR",
            "title": "HUMAN RESOURCE MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Presents leadership theories grounded in research in Industrial and Organizational Psychology and Organizational Behavior and the implications of those theories for practice in organizations.",
            "id": "MHR 604",
            "parent": "MHR",
            "title": "LEADERSHIP THEORY AND PRACTICE"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Provides a framework for evaluating marketing problems and developing a marketing strategy. Customer, competitor, and collaborator factors are emphasized as foundations for marketing decision-making. Examines the key aspects of product, pricing, distribution, and promotion strategy.",
            "id": "MARKETNG 700",
            "parent": "MARKETNG",
            "title": "MARKETING MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Provides a thorough understanding of the advantages and challenges presented by workplace diversity, suggesting techniques to manage effectively and maximize the benefits of diversity. Includes a comprehensive survey of demographic groups and an analysis of their history to foster a thorough understanding of the dimensions of diversity. Discussions will include effectively managing diversity on the basis of race, sex, LGBTQIA, religion, age, ability, national origin, and intersectionality in organizations and about issues various groups face, including discrimination. Provides practical insight into subconscious/implicit bias, team diversity, and diversity management in the United States and abroad.  Goal is to learn to work with diverse groups to create a productive organization in which everyone feels included.",
            "id": "MHR 617",
            "parent": "MHR",
            "title": "DIVERSITY IN ORGANIZATIONS"
        }
    },
    {
        "data": {
            "description": "Provides central knowledge and skills to tackle challenges at the intersection of business and sustainability. Analysis of the causes of sustainability challenges as relating to business and study of frameworks and measurement systems for incorporating sustainability into corporate decision-making and business analysis.",
            "id": "MHR 310",
            "parent": "MHR",
            "title": "CHALLENGES & SOLUTIONS IN BUSINESS SUSTAINABILITY"
        }
    },
    {
        "data": {
            "description": "Provides central knowledge and skills to tackle challenges at the intersection of business and sustainability. Analysis of the causes of sustainability challenges as relating to business and study of frameworks and measurement systems for incorporating sustainability into corporate decision-making and business analysis.",
            "id": "MHR 710",
            "parent": "MHR",
            "title": "CHALLENGES & SOLUTIONS IN BUSINESS SUSTAINABILITY"
        }
    },
    {
        "data": {
            "description": "Seminar for Ph.D. candidates majoring in management and at or near the doctoral thesis stage. Focus: Assisting the student in working through the conceptualization and design of a thesis topic.",
            "id": "MHR 975",
            "parent": "MHR",
            "title": "DOCTORAL RESEARCH SEMINAR IN MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Solve critical business challenges. Drawing on and integrating the MBA core curriculum, conduct an in-depth analysis and make recommendations on a strategic problem posed by the sponsor company.",
            "id": "GENBUS 725",
            "parent": "GENBUS",
            "title": "CONSULTING PRACTICUM"
        }
    },
    {
        "data": {
            "description": "Students develop and present comprehensive business and financing plans for a start-up firm.  Investment recommendations are made to the WAVE Board.  Class meets in a seminar format with various subject matter experts.",
            "id": "MHR 738",
            "parent": "MHR",
            "title": "WEINERT APPLIED VENTURES IN ENTREPRENEURSHIP (WAVE)"
        }
    },
    {
        "data": {
            "description": "Students will gain the knowledge and skills to continuously enhance their own team performance and productivity as well as the teams they are involved with. They will also be in a much better position to lead teams effectively.",
            "id": "EPD/GENBUS/MHR 783",
            "title": "LEADING TEAMS"
        }
    },
    {
        "data": {
            "description": "Study and evaluation of merging issues in the field of personnel management. Extensive reading of appropriate literature together with analysis, reports and discussions.",
            "id": "MHR 871",
            "parent": "MHR",
            "title": "SEMINAR-PERSONNEL MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Synthesis of material from accounting, economics, finance, operations management, human resources, law, marketing, and technology to consider problems in corporate and business-level strategy; top management problems; discussion of actual business cases.",
            "id": "MHR 423",
            "parent": "MHR",
            "title": "STRATEGIC MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Technological advances have led many organizations to adopt a more \"data-driven\" approach to managing their employees. It is therefore critical for managers to understand how to integrate data analytics into their organization's human resource management or risk being at a competitive disadvantage. Build hands-on skills to analyze data in ways that facilitate the development and evaluation of human capital policies, practices, programs, and strategies. Learn to take advantage of data and analytics in decision-making processes. Emphasis on experiential learning using data from various organizational contexts.",
            "id": "MHR 614",
            "parent": "MHR",
            "title": "PEOPLE ANALYTICS"
        }
    },
    {
        "data": {
            "description": "The management of people and organizations: diversity, attitude and job satisfaction, emotions, personality and value, individual and group decision making, motivation, teams, leadership, influence, strategy, organizational structure and culture, and change management.",
            "id": "MHR 300",
            "parent": "MHR",
            "title": "MANAGING ORGANIZATIONS"
        }
    },
    {
        "data": {
            "description": "The objective of this course is to refine the quantitative skills necessary to succeed in intermediate- and advanced-level economics courses. The principle focus will be on applying the skills acquired in your math courses to the questions, models, and optimization problems that are common in economics. Topics include specific economic applications of algebra, financial mathematics, and calculus.",
            "id": "ECON 205",
            "parent": "ECON",
            "title": "QUANTITATIVE TOOLS FOR ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Theory and practice of negotiations.",
            "id": "MHR 628",
            "parent": "MHR",
            "title": "NEGOTIATIONS"
        }
    },
    {
        "data": {
            "description": "This PhD seminar explores contemporary entrepreneurship theory and research topics; providing students an opportunity to probe and develop scholarly theories of entrepreneurial behavior and outcomes. The course will incorporate presentations by the instructor, students and invited speakers.",
            "id": "MHR 977",
            "parent": "MHR",
            "title": "EMERGING ENTREPRENEURSHIP THEORY AND RESEARCH"
        }
    },
    {
        "data": {
            "description": "This doctoral level strategy research seminar invites students to explore drivers of performance heterogeneity among firms. Why do some firms out-perform others? The topic is integrative in that the answer draws on theory and empirical evidence from economics, sociology, and psychology, as well as management and organizational theory that is more interdisciplinary in nature. In studying this topic, we also focus on the research process: what is the anatomy of a scholarly contribution in strategy and how does one conduct strategy research?",
            "id": "MHR 973",
            "parent": "MHR",
            "title": "DOCTORAL RESEARCH SEMINAR IN BUSINESS STRATEGY"
        }
    },
    {
        "data": {
            "description": "To be effective, leaders must be able to adapt their organization and the people within it to address the challenges they face. Explore how leaders can enact, foster, and implement change in organizations and individuals. Topics will include managing organizational transformations, responding to crises, and performance improvement.",
            "id": "MHR 720",
            "parent": "MHR",
            "title": "LEADING CHANGE IN ORGANIZATIONS"
        }
    },
    {
        "data": {
            "description": "To be effective, leaders must be able to adapt their organization and the people within it to address the challenges they face. Those who are able to adapt quickly can create a competitive advantage. Explore how leaders can enact, foster, and implement change in organizations and individuals. Topics will include managing organizational transformations, responding to crises, and performance improvement.",
            "id": "MHR 420",
            "parent": "MHR",
            "title": "LEADING CHANGE IN ORGANIZATIONS"
        }
    },
    {
        "data": {
            "description": "Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Part of a 2-semester sequence withMATH 217; these two courses together are equivalent toMATH 114and221.",
            "id": "MATH 171",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY I"
        }
    },
    {
        "data": {
            "description": "Two broad substantive areas are covered. (1) Evidence (theoretical and empirical) reviewed on the determinants of employee job attitudes and behavior. For example, the impact of compensation on employee satisfaction and performance. (2) Functional activities of personnel management and their impact on employee behavior evaluated. Sample topics: Selection, development, evaluation and compensation. Knowledge of Statistics strongly encouraged such asSTAT 301.",
            "id": "MHR 705",
            "parent": "MHR",
            "title": "HUMAN RESOURCE MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Uses economic concepts to illustrate the nature of technological innovation, competition, and economic growth. Topics: economics of the intellectual property protection (IPP); market structure and innovation; interaction between public and private sectors; IPP and anticompetitive policies; globalization.",
            "id": "AAE/MHR 540",
            "title": "INTELLECTUAL PROPERTY RIGHTS, INNOVATION AND TECHNOLOGY"
        }
    },
    {
        "data": {
            "description": "With the Wisconsin Idea as our guidepost, emphasis placed on learning and practicing the conceptual frameworks and skills related to creating lasting and sustainable impact in Wisconsin communities. Through classroom discussions, guest speakers, site visits, and field-consulting project(s), acquire and practice skills needed in designing, facilitating and developing key relationships and strategies that promote community vibrancy, revitalization, and create (or keep) the essence of what makes our Wisconsin towns and organizations special.  Examples of the types of projects that will be conducted include the development of cultural plans, strategic/comprehensive community planning, program evaluations, change management, bench-marking, data collection and analysis, hosting public convenings (focus groups, town halls and forums), and business modeling.",
            "id": "MHR 747",
            "parent": "MHR",
            "title": "IMPACT CONSULTING FOR ARTS-BASED ORGANIZATIONS AND COMMUNITIES"
        }
    },
    {
        "data": {
            "id": "ACCTIS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ECON",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "FINANCE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "GENBUS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MARKETNG",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MHR",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "OTM",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ACCTIS 100",
            "target": "ACCTIS 211"
        }
    },
    {
        "data": {
            "source": "ACCTIS 100",
            "target": "ACCTIS 300"
        }
    },
    {
        "data": {
            "source": "ACCTIS 211",
            "target": "MHR 427"
        }
    },
    {
        "data": {
            "source": "ACCTIS 300",
            "target": "ACCTIS 100"
        }
    },
    {
        "data": {
            "source": "ACCTIS 300",
            "target": "ECON/FINANCE 300"
        }
    },
    {
        "data": {
            "source": "ACCTIS 700",
            "target": "GENBUS 725"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON 102"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON 301"
        }
    },
    {
        "data": {
            "source": "ECON 102",
            "target": "ECON 205"
        }
    },
    {
        "data": {
            "source": "ECON 102",
            "target": "ECON 310"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON 101"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON/FINANCE 300"
        }
    },
    {
        "data": {
            "source": "ECON 205",
            "target": "ECON 301"
        }
    },
    {
        "data": {
            "source": "ECON 301",
            "target": "AAE/MHR 540"
        }
    },
    {
        "data": {
            "source": "ECON 310",
            "target": "ECON/FINANCE 300"
        }
    },
    {
        "data": {
            "source": "ECON/FINANCE 300",
            "target": "MHR 422"
        }
    },
    {
        "data": {
            "source": "FINANCE 700",
            "target": "GENBUS 725"
        }
    },
    {
        "data": {
            "source": "GENBUS 704",
            "target": "GENBUS 725"
        }
    },
    {
        "data": {
            "source": "GENBUS 725",
            "target": "MHR 776"
        }
    },
    {
        "data": {
            "source": "MARKETNG 700",
            "target": "GENBUS 725"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 113"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 113",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "MATH 217"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "ECON 310"
        }
    },
    {
        "data": {
            "source": "MATH 217",
            "target": "ECON 205"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "ECON 111"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "MHR 305",
            "target": "MHR 611"
        }
    },
    {
        "data": {
            "source": "MHR 305",
            "target": "MHR 612"
        }
    },
    {
        "data": {
            "source": "MHR 322",
            "target": "MHR 422"
        }
    },
    {
        "data": {
            "source": "MHR 422",
            "target": "MHR 427"
        }
    },
    {
        "data": {
            "source": "MHR 423",
            "target": "MHR 415"
        }
    },
    {
        "data": {
            "source": "MHR 604",
            "target": "MHR 704"
        }
    },
    {
        "data": {
            "source": "MHR 640",
            "target": "MHR 641"
        }
    },
    {
        "data": {
            "source": "MHR 704",
            "target": "MHR 604"
        }
    },
    {
        "data": {
            "source": "MHR 705",
            "target": "MHR 610"
        }
    },
    {
        "data": {
            "source": "MHR 705",
            "target": "MHR 775"
        }
    },
    {
        "data": {
            "source": "MHR 705",
            "target": "MHR 776"
        }
    },
    {
        "data": {
            "source": "MHR 706",
            "target": "GENBUS 725"
        }
    },
    {
        "data": {
            "source": "MHR 723",
            "target": "MHR 724"
        }
    },
    {
        "data": {
            "source": "MHR 734",
            "target": "MHR 738"
        }
    },
    {
        "data": {
            "source": "OTM 700",
            "target": "GENBUS 725"
        }
    }
]