[
    {
        "data": {
            "description": "Establishes foundation of basic leadership fundamentals such as problem solving, communications, briefing and effective writing, goal setting, techniques for improving listening and speaking skills and an introduction to counseling.",
            "id": "MILSCI 102",
            "parent": "MILSCI",
            "title": "BASIC LEADERSHIP"
        }
    },
    {
        "data": {
            "description": "Learn in-depth leadership procedures, and practice the Army planning process for groups of 30 personnel. Learn how to conduct Army training and classes in order to teach other cadets based on prior knowledge.",
            "id": "MILSCI 311",
            "parent": "MILSCI",
            "title": "LEADERSHIP LAB 3B"
        }
    },
    {
        "data": {
            "description": "Surveys the American military experience from the Colonial Era to the present. Focus on learning about: the nature of combat, the impact of new technology on warfare, the relationship between civilian and military authorities, the impact of leadership, and the influence of political, social, and economic factors on military operations.",
            "id": "MILSCI 491",
            "parent": "MILSCI",
            "title": "AMERICAN MILITARY HISTORY"
        }
    },
    {
        "data": {
            "description": "Develop proficiency in planning and executing complex operations, functioning as a member of a staff, and mentoring subordinates. Explore training management methods of effective staff collaboration, and developmental counseling techniques.",
            "id": "MILSCI 401",
            "parent": "MILSCI",
            "title": "LEADERSHIP AND MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Identify successful leadership characteristics through observation of others and self through experiential learning exercises. Record observed traits (good and bad) in a dimensional leadership journal and discuss observations in small group settings. Learn map reading and land navigation skills, including conversion of magnetic and grid azimuths and resection.",
            "id": "MILSCI 201",
            "parent": "MILSCI",
            "title": "INDIVIDUAL LEADERSHIP STUDIES"
        }
    },
    {
        "data": {
            "description": "Learn how to allocate resources and time to adequately train large groups of people. Practice creating training plans, and bringing together all of the elements necessary to complete training. Opportunities to aid in the evaluation of others leadership, which gives them the ability to better review their own leadership.",
            "id": "MILSCI 410",
            "parent": "MILSCI",
            "title": "LEADERSHIP LAB 4A"
        }
    },
    {
        "data": {
            "description": "Study examines how to build successful teams, various methods for influencing action, effective communication in setting and achieving goals, the importance of timing the decision, creativity in the problem solving process and obtaining team buy-in through immediate feedback.",
            "id": "MILSCI 202",
            "parent": "MILSCI",
            "title": "LEADERSHIP AND TEAMWORK"
        }
    },
    {
        "data": {
            "description": "Conduct self-assessment of leadership style, develop personal fitness regimen, and learn to plan and conduct individual/small unit tactical training while testing reasoning and problem solving techniques. Receive direct feedback on leadership abilities.",
            "id": "MILSCI 301",
            "parent": "MILSCI",
            "title": "LEADERSHIP AND PROBLEM SOLVING"
        }
    },
    {
        "data": {
            "description": "Develop proficiency with hands-on experience in a field environment. Specific activities include military navigation, employment of communications and weapon systems, rappelling, and small unit tactics.",
            "id": "MILSCI 110",
            "parent": "MILSCI",
            "title": "LEADERSHIP LAB 1A"
        }
    },
    {
        "data": {
            "description": "Implement small unit tactical training, learnArmy methods for approaching and reacting to tactical situations. Covers land navigation skills, information processing skills, and Army leadership principles.",
            "id": "MILSCI 210",
            "parent": "MILSCI",
            "title": "LEADERSHIP LAB 2A"
        }
    },
    {
        "data": {
            "description": "Army organization and planning methods, and the opportunity to practice and implement these methods in practical exercises.",
            "id": "MILSCI 211",
            "parent": "MILSCI",
            "title": "LEADERSHIP LAB 2B"
        }
    },
    {
        "data": {
            "description": "Learn the final elements of an Army officer's job. Mentor and plan training, as well as monitor the effectiveness of others. Learn fine points of improving others performance and getting the most out of subordinates.",
            "id": "MILSCI 411",
            "parent": "MILSCI",
            "title": "LEADERSHIP LAB 4B"
        }
    },
    {
        "data": {
            "description": "Examines the role communications, values and ethics play in effective leadership. Topics include ethical decision-making, consideration of others and survey Army leadership doctrine. Emphasis is on improving oral and written communication abilities, and increasing small unit tactics skills.",
            "id": "MILSCI 302",
            "parent": "MILSCI",
            "title": "LEADERSHIP AND ETHICS"
        }
    },
    {
        "data": {
            "description": "Includes fundamentals of military law, administrative and logistics procedures and practical exercises on establishing an ethical command climate. Presentations, briefings and leadership positions are used to train and evaluate.",
            "id": "MILSCI 402",
            "parent": "MILSCI",
            "title": "OFFICERSHIP"
        }
    },
    {
        "data": {
            "description": "Introduction to life as a commissioned officer. Establishes fundamentals of leadership, Army values and skills required of a successful Army officer.",
            "id": "MILSCI 101",
            "parent": "MILSCI",
            "title": "FOUNDATIONS OF OFFICERSHIP"
        }
    },
    {
        "data": {
            "description": "Continuation ofMIL SCI 110",
            "id": "MILSCI 111",
            "parent": "MILSCI",
            "title": "LEADERSHIP LAB 1B"
        }
    },
    {
        "data": {
            "id": "MILSCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Small unit tactical troop leading procedures are taught and practiced. Hand signals, operations orders, and land navigation skills are perfected for preparation for national advanced leadership camp.",
            "id": "MILSCI 310",
            "parent": "MILSCI",
            "title": "LEADERSHIP LAB 3A"
        }
    }
]