[
    {
        "data": {
            "description": "Develop clinical knowledge and skills necessary to care for patients in Pediatrics and Obstetrics and Gynecology, with emphasis on unique skills such as taking care of vulnerable populations as identified in women's and child health and working with caregivers in addition to the patient themselves. Increase knowledge of fundamental science concepts introduced in Human Family Tree during Phase 1 of the curriculum, such as embryology and teratology, genetic testing, and neurodevelopment. Clinical experiences will occur in a range of representative inpatient, outpatient and surgical settings. In structured educational sessions, compare and contrast selected topics in pediatric, obstetric, and gynecologic patient populations, highlighting the relevant physiology, pathophysiology, basic science, and public health topics.",
            "id": "MEDSC-M 810",
            "parent": "MEDSC-M",
            "title": "SPECIALIZED CARE OF OBSTETRIC, GYNECOLOGIC, AND PEDIATRIC PATIENTS (SCOPE)"
        }
    },
    {
        "data": {
            "description": "Focus on assessing patients with urgent medical conditions, providing acute inpatient care, and transitioning patients to other care settings or home under the care of other professionals. Provide acute care in inpatient and outpatient urgent care settings as well as on the inpatient wards, and develop acute management plans and subsequent transition of care plans. Clinical experiences in acute care settings such as the emergency department and inpatient medicine (both general and subspecialty), psychiatry, and neurology. Builds upon fundamental science concepts introduced in Body in Balance and Mind and Motion, including Ohm's Law, acid-base balance, and volume regulation. Organ system-based approach employing varied modalities. Complete an integrated patient-centered experience by participating in the care of a patient from an urgent admission through inpatient treatment and discharge.",
            "id": "MEDSC-M 812",
            "parent": "MEDSC-M",
            "title": "ACUTE CARE"
        }
    },
    {
        "data": {
            "description": "Present assigned research papers from journals for critical evaluation. Write critiques of each paper evaluating the paper's introduction, methods, results, and discussion sections.",
            "id": "MM&I 696",
            "parent": "MM&I",
            "title": "CRITICAL THINKING IN MEDICAL MICROBIOLOGY AND IMMUNIOLOGY"
        }
    },
    {
        "data": {
            "description": "An introduction to the immune response to infectious disease. Examines the role of the host in host-parasite relationships using select microbial agents or antigens to illustrate the nonspecific and specific mechanisms of host defenses. Includes study of the nonspecific inflammatory response, the nature of microbial antigens, current concepts of antibody and cell-mediated immune reactions to infectious agents and the principles underlying the development of vaccines.",
            "id": "MM&I 341",
            "parent": "MM&I",
            "title": "IMMUNOLOGY"
        }
    },
    {
        "data": {
            "description": "An overview of methods used in quantitative systems biology, with a focus on biochemical systems relevant to the study of host-pathogen interactions, disease and microbial communities.",
            "id": "MM&I 760",
            "parent": "MM&I",
            "title": "QUANTITATIVE SYSTEMS BIOLOGY AND DISEASE"
        }
    },
    {
        "data": {
            "description": "Basic principles of ecology and interrelations between individuals, populations, communities, ecosystems and their environment; transmission genetics and introduction to population genetics; origin of life, evolutionary mechanisms, ancestral relationships among species, and the diversity of life.",
            "id": "BIOCORE 381",
            "parent": "BIOCORE",
            "title": "EVOLUTION, ECOLOGY, AND GENETICS"
        }
    },
    {
        "data": {
            "description": "Biosynthesis of biological molecules, signal transduction mechanisms, chemistry and metabolism of nucleic acids, protein synthesis, and molecular and cellular biology.",
            "id": "BIOCHEM 508",
            "parent": "BIOCHEM",
            "title": "GENERAL BIOCHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Broad coverage of animal virology taught at molecular level. Topics include virus structure, viral replication/lifecycle, aspects of pathogenesis and prevention.",
            "id": "BIOCHEM/MM&I 575",
            "title": "BIOLOGY OF VIRUSES"
        }
    },
    {
        "data": {
            "description": "Care of adults and children undergoing an operation or procedure, including perioperative preparation, operative care, and post-operative cares for core clinical conditions in the specialties of anesthesia, neurosurgery, ophthalmology, general surgery, otolaryngology, urology, cardiothoracic surgery, peripheral vascular surgery, orthopedics, plastic and reconstructive surgery, and gynecology, as well as interventional radiology, procedural cardiology and gastroenterology. Basic science concepts include cerebral spinal fluid production and flow, fluids and electrolytes, consciousness, inflammation and wound healing, and cancer biology. Anatomic approach using case discussions, podcasts, curated independent reading, online nationally supported modules, and simulation skills. Longitudinal patient care experience integrating communication, evidence based medicine, health information technology, quality improvement  patient safety, professionalism, scientific inquiry, and public health.",
            "id": "MEDSC-M 813",
            "parent": "MEDSC-M",
            "title": "SURGICAL AND PROCEDURAL CARE"
        }
    },
    {
        "data": {
            "description": "Carry out an independent research project that represents novel science in the chosen area under the guidance of an MMI faculty member. Evidence of success is measured by publication of results as first-authored papers in peer-reviewed papers.",
            "id": "MM&I 990",
            "parent": "MM&I",
            "title": "RESEARCH AND THESIS"
        }
    },
    {
        "data": {
            "description": "Cellular and molecular basis of life. The main themes are the structure and function of cells and organelles, the flow of energy in cells, and the storage, expression, and regulation of genetic information.",
            "id": "BIOCORE 383",
            "parent": "BIOCORE",
            "title": "CELLULAR BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Chemistry of biological materials, intermediary metabolism and protein structure.",
            "id": "BIOCHEM 507",
            "parent": "BIOCHEM",
            "title": "GENERAL BIOCHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Detailed study of the pathogenesis of vertebrate viral disease, stressing viral invasion, dissemination, mechanisms of disease production, immune pathology, persistence, resistance, and transmission.",
            "id": "MM&I/PATH-BIO 750",
            "title": "HOST-PARASITE RELATIONSHIPS IN VERTEBRATE VIRAL DISEASE"
        }
    },
    {
        "data": {
            "description": "Development and functions of immune response in animals; a comprehensive study of experimental humoral and cellular immunity.",
            "id": "MM&I/PATH-BIO 528",
            "title": "IMMUNOLOGY"
        }
    },
    {
        "data": {
            "description": "First semester independent study with the goal to do the preliminary research to write a senior thesis in Medical Microbiology  Immunology.",
            "id": "MM&I 691",
            "parent": "MM&I",
            "title": "FIRST SEMESTER SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Focuses on molecular, genetic, embryologic, hormonal, anatomical and physiological factors that govern fertility, cell growth, fetal development, and pregnancy as well as the congenital anomalies that can occur when those processes are aberrant. Encompasses the full life-cycle spectrum including childhood growth and development, young adulthood/puberty, issues affecting adolescents and young adults, genetic basis of human disease, reproductive health, menopause, aging, unregulated cell growth (cancer) and end of life issues. Significant content from other competency domains, or \"longitudinal threads\", such as public health, advocacy, ethics, patient care/communication and clinical skills.",
            "id": "MEDSC-M 773",
            "parent": "MEDSC-M",
            "title": "HUMAN FAMILY TREE"
        }
    },
    {
        "data": {
            "description": "Fungal genetics, genomics, and physiology using plant pathogenic fungi and the genetic models Aspergillus nidulans and Neurospora crassa as model systems to explore the current knowledge of fungal genetics and plant/fungal interactions.",
            "id": "BOTANY/GENETICS/MM&I/PLPATH 655",
            "title": "BIOLOGY AND GENETICS OF FUNGI"
        }
    },
    {
        "data": {
            "description": "General biological principles. Topics include: evolution, ecology, animal behavior, cell structure and function, genetics and molecular genetics and the physiology of a variety of organ systems emphasizing function in humans.",
            "id": "BIOLOGY/ZOOLOGY 101",
            "title": "ANIMAL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "General concepts of animal biology at an introductory level emphasizing the evolutionary relationships between animals. Learn about general body plans and strategies used to accomplish the basic tasks of staying alive in major animal groups using preserved and live animals. Study the diversity within each group of animals by integrating the body plans with the lifestyle and ecology of animals. Dissections of earthworm, freshwater mussel, squid, sea star, and rat aid the study of these general principles.",
            "id": "BIOLOGY/ZOOLOGY 102",
            "title": "ANIMAL BIOLOGY LABORATORY"
        }
    },
    {
        "data": {
            "description": "Genetics of eukaryotes and prokaryotes. Includes transmission genetics, probability and hypothesis testing, genetic mapping, molecular genetics, gene expression, and genetic engineering. Illustrative material includes viruses, bacteria, plants, fungi, insects, and humans.",
            "id": "GENETICS 467",
            "parent": "GENETICS",
            "title": "GENERAL GENETICS 1"
        }
    },
    {
        "data": {
            "description": "Host-pathogen relationships in microbial diseases.",
            "id": "MM&I 740",
            "parent": "MM&I",
            "title": "MECHANISMS OF MICROBIAL PATHOGENESIS"
        }
    },
    {
        "data": {
            "description": "Identification of analysis and solution of emerging infectious disease problems and the problems of bioterrorism.",
            "id": "MM&I 554",
            "parent": "MM&I",
            "title": "EMERGING INFECTIOUS DISEASES AND BIOTERRORISM"
        }
    },
    {
        "data": {
            "description": "Identify the roles of physicians, interdisciplinary providers, health care systems, and communities in screening, treating, and preventing common, chronic conditions. Activities are centered on health promotion, outpatient-based chronic disease management, and community health. Clinical experiences will occur in primary care, behavioral health, and other ambulatory and community-based settings that focus on chronic disease management.",
            "id": "MEDSC-M 811",
            "parent": "MEDSC-M",
            "title": "CHRONIC AND PREVENTIVE CARE"
        }
    },
    {
        "data": {
            "description": "Independent research in medical microbiology and immunology for undergraduates under the supervision of MMI faculty. Carry out literature reviews and laboratory bench work on an independent project; participate in laboratory meetings; and produce some written presentation of the work, usually in the form of a poster presentation at a local or national meeting.",
            "id": "MM&I 699",
            "parent": "MM&I",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Integrated examination of how the immune system interacts with foreign microbes, the normal micro biome, and self tissues, both normal and malignant. Examines inflammation and the impacts of this type of response on normal cells, in wound healing, infectious disease, and inflammatory diseases including autoimmune disease and dermatologic conditions, including neoplasia of the skin. Covers the development of adaptive immune responses from vaccination, infectious processes, and organ transplantation. Covers the basic biology and pathophysiology of \"invaders\" of the human body, including viruses, fungi, and bacteria, along with their clinical diagnosis and therapy. Addresses malignant transformation of the immune effector cells themselves, including cancers of mature lymphoid cells and bone marrow derived malignancies.",
            "id": "MEDSC-M 774",
            "parent": "MEDSC-M",
            "title": "INVADERS AND DEFENSE"
        }
    },
    {
        "data": {
            "description": "Introduction to concepts of health and disease, which vary from patient to patient and through time. View health from a population standpoint, with an introduction to basic public health concepts as well as how physicians may positively impact both individual and population level health. Woven within that framework are introductions to key aspects of professionalism, patient-centered history- taking, and core communication skills.",
            "id": "MEDSC-M 770",
            "parent": "MEDSC-M",
            "title": "PATIENTS, PROFESSIONALISM AND PUBLIC HEALTH"
        }
    },
    {
        "data": {
            "description": "Introduction to core basic science, pathophysiologic, and diagnostic principles requisite for the care and treatment of patients with musculoskeletal, neurologic, and psychiatric presentations and disorders. Basic science concepts include those from the traditional disciplines of cell biology, histology, biochemistry, anatomy, embryology, neuroscience, and behavioral science. Regular integration of these topics with their pathologic and pathophysiologic counterparts. Integration of content related to other competency domains, or \"longitudinal threads\", that include patient care  communication, evidence based medicine, health information technology, quality improvement  patient safety, professionalism, scientific inquiry and public health.",
            "id": "MEDSC-M 775",
            "parent": "MEDSC-M",
            "title": "MIND & MOTION"
        }
    },
    {
        "data": {
            "description": "Learn firsthand how a public health lab handles testing. Learn about the different areas of testing in the lab from the experts and how we work with the CDC and clinical labs for surveillance, diagnostics, and outbreak response. Useful training for diagnostic testing and those that will order these tests in their practice.",
            "id": "MM&I 911",
            "parent": "MM&I",
            "title": "MICROBIOLOGY DIAGNOSTICS IN PUBLIC HEALTH"
        }
    },
    {
        "data": {
            "description": "Medically important bacteria, emphasizing the process of pathogenesis and host/parasite interactions, as well as intervention strategies, immunity and genetics as they apply to the pathogens.",
            "id": "MM&I 301",
            "parent": "MM&I",
            "title": "PATHOGENIC BACTERIOLOGY"
        }
    },
    {
        "data": {
            "description": "Organized around biomedical themes including nutrients, the digestive system, the biochemistry and endocrine control of metabolism, exercise and fitness and the removal of waste products and toxins to present an integrated picture of how these systems function together to maintain homeostasis. Integrates developmental content from competency domains, or \"longitudinal threads\", including communication, patient care, ethics, health information technology, public health, professionalism, quality improvement, patient safety, and scientific inquiry.",
            "id": "MEDSC-M 772",
            "parent": "MEDSC-M",
            "title": "FOOD, FASTING & FITNESS"
        }
    },
    {
        "data": {
            "description": "Organized around physiological themes, the course includes material related to the cardiovascular system, hematology, nephrology, and pulmonology to present an integrated picture of how these systems function together to maintain homeostasis. In addition, there is significant content from other competency domains such as public health, ethics, evidence-based medicine, patient care/communication and clinical skills.",
            "id": "MEDSC-M 771",
            "parent": "MEDSC-M",
            "title": "BODY IN BALANCE"
        }
    },
    {
        "data": {
            "description": "Pathogenesis, clinical descriptions, and prevention.",
            "id": "MM&I 704",
            "parent": "MM&I",
            "title": "INFECTIOUS DISEASES OF HUMAN BEINGS"
        }
    },
    {
        "data": {
            "description": "Principles and application of chemical equilibrium, coordination chemistry, oxidation-reduction and electrochemistry, kinetics, nuclear chemistry, introduction to organic chemistry, and chemistry laboratory skills.",
            "id": "CHEM 104",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Principles of molecular structure and bonding applied to predict and explain the reactivity of alkanes, alkenes, alkynes, alkyl halides, alcohols, and thiols. Emphasis placed on rationalizing the stereochemical and regiochemical outcome of chemical processes.",
            "id": "CHEM 343",
            "parent": "CHEM",
            "title": "ORGANIC CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Principles of molecular structure and bonding applied to predict and explain the reactivity of aromatic systems, benzylic and allylic systems, aryl and vinyl halides, and carbonyl-containing compounds (e.g., ketones, carboxylic acids, esters, acid chlorides, amides). Emphasis placed on rationalizing the stereochemical and regiochemical outcome of chemical processes as well as arguing reaction outcomes from spectroscopic evidence.",
            "id": "CHEM 345",
            "parent": "CHEM",
            "title": "ORGANIC CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Second semester independent study with the goal to complete a senior thesis in Medical Microbiology  Immunology.",
            "id": "MM&I 692",
            "parent": "MM&I",
            "title": "SECOND SEMESTER SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Seminar series led by MMI faculty members.",
            "id": "MM&I 901",
            "parent": "MM&I",
            "title": "SEMINAR"
        }
    },
    {
        "data": {
            "description": "Specialized topics of current interest in medical microbiology.",
            "id": "MM&I 677",
            "parent": "MM&I",
            "title": "ADVANCED TOPICS IN MEDICAL MICROBIOLOGY"
        }
    },
    {
        "data": {
            "description": "Stoichiometry and the mole concept, the behavior of gases, liquids and solids, thermochemistry, electronic structure of atoms and chemical bonding, descriptive chemistry of selected elements and compounds, intermolecular forces, and chemistry laboratory skills.",
            "id": "CHEM 103",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "The biology of water-borne, food-borne, soil-borne and vector-borne parasites of animals including humans. Parasites are explored in the context of transmission, associated disease, diagnosis and treatment options, and environmental, cultural and socioeconomic drivers of disease epidemiology.",
            "id": "ENTOM/MM&I/PATH-BIO/ZOOLOGY 350",
            "title": "PARASITOLOGY"
        }
    },
    {
        "data": {
            "description": "The human microbiome can profoundly influence the balance between health and disease. Advances in next-generation sequencing technology and bioinformatics enabled the detailed study of the trillions of microorganisms living in us and on us and their associations with both healthy and disease conditions. Current state of the art approaches to study the microbiome through examples of human diseases with a known microbiome component. Critically assess the microbiome literature and design clinical studies aiming to include the microbiome as a variable. Bioinformatics tools required to study complex microbial communities by reproducing published datasets from human patients and learn ecological concepts to interpret results in a clinically meaningful way.",
            "id": "MM&I 902",
            "parent": "MM&I",
            "title": "THE ROLE OF THE HUMAN MICROBIOME IN HEALTH AND DISEASE"
        }
    },
    {
        "data": {
            "description": "The structure, multiplication, genetics, pathology and control of animal and plant viruses.",
            "id": "MM&I/ONCOLOGY/PLPATH 640",
            "title": "GENERAL VIROLOGY-MULTIPLICATION OF VIRUSES"
        }
    },
    {
        "data": {
            "description": "The two semester sequenceMATH 112-MATH 113covers similar material asMATH 114, but in a slower pace. Not recommended for students with less than an AB inMATH 96.",
            "id": "MATH 114",
            "parent": "MATH",
            "title": "ALGEBRA AND TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Part of a 2-semester sequence withMATH 217; these two courses together are equivalent toMATH 114and221.",
            "id": "MATH 171",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY I"
        }
    },
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics and selected topics in Animal Physiology.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Topics include: selected topics in plant physiology, a survey of the five major kingdoms of organisms, speciation and evolutionary theory, and ecology at multiple levels of the biological hierarchy.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Writing-intensive with opportunities to make observations and generate and test questions. Includes ecology field trips and research projects that focus on genetics and evolution.",
            "id": "BIOCORE 382",
            "parent": "BIOCORE",
            "title": "EVOLUTION, ECOLOGY, AND GENETICS LABORATORY"
        }
    },
    {
        "data": {
            "id": "BIOCHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "BIOCORE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "GENETICS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MEDSC-M",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MM&I",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 507",
            "target": "BIOCHEM 508"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 508",
            "target": "MM&I/ONCOLOGY/PLPATH 640"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "BIOCORE 382"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "BIOCORE 383"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "MM&I 301"
        }
    },
    {
        "data": {
            "source": "BIOCORE 382",
            "target": "MM&I 301"
        }
    },
    {
        "data": {
            "source": "BIOCORE 383",
            "target": "MM&I 554"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOCHEM/MM&I 575"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 152"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 101"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "GENETICS 467"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "target": "BIOLOGY/ZOOLOGY 102"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 151"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ENTOM/MM&I/PATH-BIO/ZOOLOGY 350"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "MM&I 341"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "MM&I/PATH-BIO 528"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 102",
            "target": "ENTOM/MM&I/PATH-BIO/ZOOLOGY 350"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 343"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "GENETICS 467"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "MM&I/PATH-BIO 528"
        }
    },
    {
        "data": {
            "source": "CHEM 343",
            "target": "CHEM 345"
        }
    },
    {
        "data": {
            "source": "CHEM 345",
            "target": "BIOCHEM 507"
        }
    },
    {
        "data": {
            "source": "GENETICS 467",
            "target": "MM&I/ONCOLOGY/PLPATH 640"
        }
    },
    {
        "data": {
            "source": "MATH 114",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 114"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 770",
            "target": "MEDSC-M 810"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 771",
            "target": "MEDSC-M 810"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 772",
            "target": "MEDSC-M 810"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 773",
            "target": "MEDSC-M 810"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 774",
            "target": "MEDSC-M 810"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 775",
            "target": "MEDSC-M 810"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 810",
            "target": "MM&I 902"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 810",
            "target": "MM&I 911"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 811",
            "target": "MM&I 902"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 811",
            "target": "MM&I 911"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 812",
            "target": "MM&I 902"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 812",
            "target": "MM&I 911"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "MM&I 902"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "MM&I 911"
        }
    },
    {
        "data": {
            "source": "MM&I 301",
            "target": "MM&I 554"
        }
    },
    {
        "data": {
            "source": "MM&I 301",
            "target": "MM&I 696"
        }
    },
    {
        "data": {
            "source": "MM&I 341",
            "target": "MM&I 696"
        }
    }
]