[
    {
        "data": {
            "description": "A preparation and introductory math course for students enrolled in the Summer Collegiate Experience program. Includes material from precalculus and calculus and related topics depending on students' results on the math placement exam.",
            "id": "MATH 118",
            "parent": "MATH",
            "title": "SUMMER COLLEGIATE EXPERIENCE MATHEMATICS COURSE"
        }
    },
    {
        "data": {
            "description": "Covers the graphs, properties and geometric significance of trigonometric functions of a real variable. Other topics include trigonometric equations and identities, application, trigonometric form of complex numbers, DeMoivre's theorem, and polar and parametric equations. The course also has a significant number of applications, especially related to other disciplines.",
            "id": "MATH 113",
            "parent": "MATH",
            "title": "TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "Accelerated coverage of topics in general chemistry, including introduction to laboratory techniques. Topics include atomic and molecular structure, chemical equilibrium, acid-base chemistry, thermodynamics, kinetics, and electrochemistry.",
            "id": "CHEM 109",
            "parent": "CHEM",
            "title": "ADVANCED GENERAL CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Accelerated introduction to  foundational materials concepts and the materials paradigm approach to problem solving and research. Atomic scale structure of materials; defects in crystalline materials; alloy phase diagrams, solid-state diffusion, phase transformations, microstructure development, micro/nano/atomic-scale structure-property relationships.",
            "id": "MS&E 550",
            "parent": "MS&E",
            "title": "MATERIALS FUNDAMENTALS"
        }
    },
    {
        "data": {
            "description": "Advanced concepts and methods for the use of x-ray scattering, diffraction, and spectroscopy in materials science and engineering. Underpinning fundamental mathematical and scattering concepts, including kinematic and dynamical diffraction, diffuse scattering, and optical coherence in x-ray scattering. Practical aspects of experiments at synchrotron light sources and free electron lasers. Applications, including structure of metals and ceramics, polymeric materials, thin films and nanostructures, and magnetic materials.",
            "id": "MS&E 648",
            "parent": "MS&E",
            "title": "ADVANCED X-RAY SCATTERING METHODS IN MATERIALS SCIENCE AND ENGINEERING"
        }
    },
    {
        "data": {
            "description": "An introduction to the physical principles underlying solid-state electronic and photonic devices, including elements of quantum mechanics, crystal structure, semiconductor band theory, carrier statistics, and band diagrams. Offers examples of modern semiconductor structures. Prior experience with MATLAB [such asE C E 203] is strongly encouraged but not required.",
            "id": "ECE/PHYSICS 235",
            "title": "INTRODUCTION TO SOLID STATE ELECTRONICS"
        }
    },
    {
        "data": {
            "description": "An introduction to the practice of transmission electron microscopy (TEM) and TEM sample preparation through hands-on laboratory training.",
            "id": "MS&E 758",
            "parent": "MS&E",
            "title": "TRANSMISSION ELECTRON MICROSCOPY LABORATORY"
        }
    },
    {
        "data": {
            "description": "An introduction to the theoretical and computational tools for computational materials, with hands on homework and laboratories. Topics may include atomistic simulation (e.g., molecular dynamics), mesoscale simulation (e.g,. Phase field method), macroscale simulation (e.g., finite element method), thermodynamic and kinetic modeling (CALPHAD method), informatics (e.g., machine learning), and special topics (e.g., solar cell design, electronic device simulation, etc.)",
            "id": "MS&E 460",
            "parent": "MS&E",
            "title": "INTRODUCTION TO COMPUTATIONAL MATERIALS SCIENCE AND ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Atomic, nanoscale and microscale structure of materials. Course is designed for first year graduate students with interests in materials research.",
            "id": "MS&E 551",
            "parent": "MS&E",
            "title": "STRUCTURE OF MATERIALS"
        }
    },
    {
        "data": {
            "description": "Basic principles of fluid flow, heat transfer and diffusion are introduced. Examples relevant to design and processing of materials including metals, semiconductors, glasses, polymers, and ceramics are given.",
            "id": "MS&E 331",
            "parent": "MS&E",
            "title": "TRANSPORT PHENOMENA IN MATERIALS"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for Physics, AMEP, and Astronomy-Physics majors. Mechanics, waves, thermodynamics and statistical mechanics, topics in modern physics; with computation.  A more mathematically rigorous and in-depth introduction to physics than the other introductory physics sequences.",
            "id": "PHYSICS 247",
            "parent": "PHYSICS",
            "title": "A MODERN INTRODUCTION TO PHYSICS"
        }
    },
    {
        "data": {
            "description": "Capstone experiences in materials design, selection and application for MSE students.  Emphasis on creativity and application of fundamental principles in problem identification, experimental design, data acquisition and analysis, and presentation of results.",
            "id": "MS&E 471",
            "parent": "MS&E",
            "title": "CAPSTONE PROJECT II"
        }
    },
    {
        "data": {
            "description": "Capstone experiences in materials design, selection, and application.  Emphasis on creativity and application of fundamental principles of public identification, experimental design, data acquisition and analysis, and presentation of results.",
            "id": "MS&E 470",
            "parent": "MS&E",
            "title": "CAPSTONE PROJECT I"
        }
    },
    {
        "data": {
            "description": "Classical theories, analytical and numerical modeling of various kinetic processes in materials. Including but not limited to transport, grain growth, phase separation, solidification, precipitation, chemical reactions, and multiphysics problems involving electrical, optical, mechanical, and magnetic properties of materials.",
            "id": "MS&E 660",
            "parent": "MS&E",
            "title": "MESOSCALE MODELING OF MATERIALS"
        }
    },
    {
        "data": {
            "description": "Classification of rock masses, stress and strain in rock, linear and non-linear behavior of rock, failure mechanisms, state of stress in rock masses, lab testing, geological and engineering applications.",
            "id": "CIVENGR/GEOSCI/GLE/MS&E 474",
            "title": "ROCK MECHANICS"
        }
    },
    {
        "data": {
            "description": "Continuation ofPHYSICS 247. Electromagnetism, circuits, optics, additional topics in modern physics; with computation.",
            "id": "PHYSICS 248",
            "parent": "PHYSICS",
            "title": "A MODERN INTRODUCTION TO PHYSICS"
        }
    },
    {
        "data": {
            "description": "Core organic chemistry concepts of structure, reactivity, and synthesis with regards to the functional groups commonly found in commercial and biological substances. Covers a selection of topics fromCHEM 343and345.",
            "id": "CHEM 341",
            "parent": "CHEM",
            "title": "ELEMENTARY ORGANIC CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Courses in Metallurgical Engineering.",
            "id": "MS&E 699",
            "parent": "MS&E",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Crystal symmetry, projection methods, X-ray studies of structural problems in the solid state.",
            "id": "MS&E 448",
            "parent": "MS&E",
            "title": "CRYSTALLOGRAPHY AND X-RAY DIFFRACTION"
        }
    },
    {
        "data": {
            "description": "Elastic and plastic deformation of real solids. Dislocation theory with applications to metals and alloys. Fracture, fatigue, brittle failure and methods for measuring the mechanical properties of materials.",
            "id": "MS&E 441",
            "parent": "MS&E",
            "title": "DEFORMATION OF SOLIDS"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "Experimental principles of materials science. Thermal, kinetic, structural, and materials synthesis experiments and associated concepts, data analysis, and presentation.",
            "id": "MS&E 361",
            "parent": "MS&E",
            "title": "KINETICS & THERMODYNAMICS LAB"
        }
    },
    {
        "data": {
            "description": "Experiments in the mechanical and electronic properties of matter in bulk and thin films; computer instrument control; and data analysis.",
            "id": "MS&E 362",
            "parent": "MS&E",
            "title": "SYNTHESIS & CHARACTERIZATION LAB"
        }
    },
    {
        "data": {
            "description": "Explores a detailed atomic and molecular view of matter and its interactions, with a specific focus on quantum theory, molecular structure, and chemical bonding. Application required for enrollment.",
            "id": "CHEM 115",
            "parent": "CHEM",
            "title": "CHEMICAL PRINCIPLES I"
        }
    },
    {
        "data": {
            "description": "First order differential equations, introduction to multivariable calculus and constrained optimization, infinite sequences and series, methods of approximation, and a brief introduction to probability. Models and applications from business and the social sciences.",
            "id": "MATH 213",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 2"
        }
    },
    {
        "data": {
            "description": "Fundamentals of fuel and cladding behavior in terms of thermal properties, chemical behavior and radiation damage.",
            "id": "MS&E/NE 423",
            "title": "NUCLEAR ENGINEERING MATERIALS"
        }
    },
    {
        "data": {
            "description": "Hands-on experience in modern tools of atomic and molecular modeling, including density functional theory, interatomic potentials, and molecular dynamics. Select additional/advanced techniques like high-throughput calculations, (Kinetic) Monte Carlo, accelerated molecular dynamics, and machine learning.",
            "id": "MS&E 760",
            "parent": "MS&E",
            "title": "MOLECULAR MODELING OF MATERIALS"
        }
    },
    {
        "data": {
            "description": "Independent study under faculty supervision.",
            "id": "MS&E 299",
            "parent": "MS&E",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Independent study under faculty supervision.",
            "id": "MS&E 999",
            "parent": "MS&E",
            "title": "INDEPENDENT WORK"
        }
    },
    {
        "data": {
            "description": "Integration of materials science theory and materials engineering practice as applied to the processing of materials at the microscopic level.",
            "id": "MS&E 333",
            "parent": "MS&E",
            "title": "MICROPROCESSING OF MATERIALS"
        }
    },
    {
        "data": {
            "description": "Introduces graduate students to the breadth, wealth and practices of materials research at the University of Wisconsin and in the professional materials research community.",
            "id": "MS&E 900",
            "parent": "MS&E",
            "title": "MATERIALS RESEARCH SEMINAR"
        }
    },
    {
        "data": {
            "description": "Introduction to applications of data science in materials science and engineering, including understanding the creation and use of modern data resources, data-centric approaches to materials, and the integration of machine learning across the materials landscape.",
            "id": "MS&E 561",
            "parent": "MS&E",
            "title": "MACHINE LEARNING IN MATERIALS"
        }
    },
    {
        "data": {
            "description": "Introduction to basic concepts of atomistic modeling in materials, including classical and quantum mechanical energy methods, energy optimization, molecular statistics, molecular dynamics, and Monte Carlo. Relevant aspects of thermodynamics, statistical mechanics, quantum mechanics, and computer programming will also be presented.",
            "id": "MS&E 560",
            "parent": "MS&E",
            "title": "FUNDAMENTALS OF ATOMISTIC MODELING"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Introduction to major thin-film deposition techniques and properties of thin films. Evaporation, plasma assisted processes with emphasis on sputter deposition, chemical vapor deposition ion beams. Film properties and characterization methods, applications.",
            "id": "MS&E 434",
            "parent": "MS&E",
            "title": "INTRODUCTION TO THIN-FILM DEPOSITION PROCESSES"
        }
    },
    {
        "data": {
            "description": "Introduction to structure and electronic properties; surface energy; thermodynamics of surfaces; diffusion. Surface barriers, work function, vibrational and electronic states. Chemical interactions: chemisorption, oxidation, corrosion, absorption kinetics, catalysis. Experimental methods and applications in metals, semiconductors.",
            "id": "MS&E 570",
            "parent": "MS&E",
            "title": "PROPERTIES OF SOLID SURFACES"
        }
    },
    {
        "data": {
            "description": "Introduction to thermodynamics of materials, equilibrium constants, solutions, heterogeneous equilibria and electrochemistry.",
            "id": "MS&E 330",
            "parent": "MS&E",
            "title": "THERMODYNAMICS OF MATERIALS"
        }
    },
    {
        "data": {
            "description": "Introduction to transmission electron microscopy of materials, including imaging, diffraction, and microanalysis. Knowledge of diffraction [such asM S & E 448] strongly encouraged.",
            "id": "MS&E 748",
            "parent": "MS&E",
            "title": "STRUCTURAL ANALYSIS OF MATERIALS"
        }
    },
    {
        "data": {
            "description": "Introduction to: atomic, electronic, and defect structures in materials; diffusional, mechanical and electrical properties of materials; and the role of structure and defects in diffusional, mechanical, and electrical properties.",
            "id": "MS&E 351",
            "parent": "MS&E",
            "title": "MATERIALS SCIENCE-STRUCTURE AND PROPERTY RELATIONS IN SOLIDS"
        }
    },
    {
        "data": {
            "description": "Laboratory instruction in sample preparation for and applications of quantitative microscopy, x-ray diffraction, and properties measurement in the context of structure-property relationships in materials.",
            "id": "MS&E 360",
            "parent": "MS&E",
            "title": "STRUCTURES & PHASES LAB"
        }
    },
    {
        "data": {
            "description": "Mathematical theory of dislocations and other crystal imperfections; mechanical properties of crystals in relation to imperfections. Knowledge of crystal structure and dislocations [such asM S & E 551] required.",
            "id": "MS&E 750",
            "parent": "MS&E",
            "title": "IMPERFECTIONS AND MECHANICAL PROPERTIES"
        }
    },
    {
        "data": {
            "description": "Metallurgical and engineering principles applied in the foundry and related industries, primarily for those interested in foundry engineering.",
            "id": "MS&E 461",
            "parent": "MS&E",
            "title": "ADVANCED METAL CASTING"
        }
    },
    {
        "data": {
            "description": "Metallurgical principles applied to welding; mechanisms of strengthening, phase equilibria, and microstructure of the weld zone. Modern processes including laser and electron beam welding.",
            "id": "ME/MS&E 462",
            "title": "WELDING METALLURGY"
        }
    },
    {
        "data": {
            "description": "Phase transformations, nucleation theory and the role of structural imperfections, alloy phase equilibria, interface reactions and growth kinetics, continuous transformations. Knowledge of diffusion and reactions [such asM S & E 352] required.",
            "id": "MS&E 752",
            "parent": "MS&E",
            "title": "ADVANCED MATERIALS SCIENCE: PHASE TRANSFORMATIONS"
        }
    },
    {
        "data": {
            "description": "Polymer chemistry and physics terminologies, structure-property relationship, polymer characterization, polymer synthesis, material requirements for optoelectronics including conjugated polymers, thin film transistors, light emitting diodes, non-linear optical materials, holographic data storage and liquid crystal polymers.",
            "id": "CHEM/MS&E 421",
            "title": "POLYMERIC MATERIALS"
        }
    },
    {
        "data": {
            "description": "Prepares graduate students for research in electronic materials and related areas by examining (1) how does the physical structure of a material affect its electronic structure and properties: and (2) state-of-the-art advance electronic materials.  Topics include:  molecular and organic semiconductors; carbon nanomaterials (nanotubes, nanoribbons and graphene); advances in conventional bulk zinc-blende and wurtzite semiconductors; polycrystalline, amorphous, and disordered materials; state-of-the-art high-  low-k dielectrics; and up-and-coming and next-generation materials. Knowledge of solid state physics [such asPHYSICS 551orM S & E 456] required.",
            "id": "MS&E 756",
            "parent": "MS&E",
            "title": "STRUCTURE AND PROPERTIES OF ADVANCED ELECTRONIC MATERIALS"
        }
    },
    {
        "data": {
            "description": "Primary objectives are to: 1) analyze how atoms and ions combine to form 3D crystals and glasses; 2) examine phase equilibria to understand the driving forces for the formation of particular ceramic phases; 3) introduce and discuss the nature of defects in ceramics; 4) discuss the migration of matter and of charge in ceramics; and 5) discuss properties and processing technologies of ceramics.",
            "id": "MS&E 451",
            "parent": "MS&E",
            "title": "INTRODUCTION TO CERAMIC MATERIALS"
        }
    },
    {
        "data": {
            "description": "Principles and application of chemical equilibrium, coordination chemistry, oxidation-reduction and electrochemistry, kinetics, nuclear chemistry, introduction to organic chemistry, and chemistry laboratory skills.",
            "id": "CHEM 104",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Principles of mechanics, force systems, equilibrium, structures, distributed forces, moments of inertia of areas, and friction.",
            "id": "EMA 201",
            "parent": "EMA",
            "title": "STATICS"
        }
    },
    {
        "data": {
            "description": "Principles of molecular structure and bonding applied to predict and explain the reactivity of alkanes, alkenes, alkynes, alkyl halides, alcohols, and thiols. Emphasis placed on rationalizing the stereochemical and regiochemical outcome of chemical processes.",
            "id": "CHEM 343",
            "parent": "CHEM",
            "title": "ORGANIC CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Principles of molecular structure and bonding applied to predict and explain the reactivity of aromatic systems, benzylic and allylic systems, aryl and vinyl halides, and carbonyl-containing compounds (e.g., ketones, carboxylic acids, esters, acid chlorides, amides). Emphasis placed on rationalizing the stereochemical and regiochemical outcome of chemical processes as well as arguing reaction outcomes from spectroscopic evidence.",
            "id": "CHEM 345",
            "parent": "CHEM",
            "title": "ORGANIC CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Principles of phase transformations, heat transfer and mechanical properties as applied to heat treatment practice. The design, modeling and analysis of heat treatment processes.",
            "id": "MS&E 465",
            "parent": "MS&E",
            "title": "FUNDAMENTALS OF HEAT TREATMENT"
        }
    },
    {
        "data": {
            "description": "Principles of the mechanics of solid multiphase systems. Role of heterogeneity and anisotropy in determining physical properties including elastic, dielectric and piezoelectric properties. Applications in lightweight structures, ultrastrong materials, materials for protection of the body, and materials for the replacement of human tissues. Materials with fibrous, lamellar, particular, and cellular structures.  Heterogeneous materials of biological origin. Biomimetic and bio-inspired materials.",
            "id": "EMA/MS&E 541",
            "title": "HETEROGENEOUS AND MULTIPHASE MATERIALS"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Provides overview of the field of Materials Science and Engineering, with significant design and hands-on components. Highlights different types of materials, with a focus on describing the extensive impact that Materials Science and Engineering has had on society. Small teams provide hands-on experience in materials design, synthesis, and processing and the fabrication of materials with desired properties and function.",
            "id": "MS&E 260",
            "parent": "MS&E",
            "title": "MATERIALS EXPERIENCE"
        }
    },
    {
        "data": {
            "description": "Quantitative description of electronic, optical, and magnetic structure-property relationships of materials. Strategies for the development of new materials and introduction to applications of these materials.",
            "id": "MS&E 456",
            "parent": "MS&E",
            "title": "ELECTRONIC, OPTICAL, AND MAGNETIC PROPERTIES OF MATERIALS"
        }
    },
    {
        "data": {
            "description": "Review of linear differential equations; series solution of linear differential equations; boundary value problems; Laplace transforms; possibly numerical methods and two dimensional autonomous systems.",
            "id": "MATH 319",
            "parent": "MATH",
            "title": "TECHNIQUES IN ORDINARY DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "description": "Special topics of interest to students in materials science and engineering.",
            "id": "MS&E 401",
            "parent": "MS&E",
            "title": "SPECIAL TOPICS IN MATERIALS SCIENCE AND ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Stoichiometry and the mole concept, the behavior of gases, liquids and solids, thermochemistry, electronic structure of atoms and chemical bonding, descriptive chemistry of selected elements and compounds, intermolecular forces, and chemistry laboratory skills.",
            "id": "CHEM 103",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Stress and strain, torsion, bending of beams, shearing stresses in beams, compound stresses, principal stresses, deflections of beams, statically indeterminate members, columns.",
            "id": "ME 306",
            "parent": "ME",
            "title": "MECHANICS OF MATERIALS"
        }
    },
    {
        "data": {
            "description": "Techniques of integration, improper integrals, first order ordinary differential equations, sequences and series, Taylor series, vector geometry in two and three dimensions.",
            "id": "MATH 222",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 2"
        }
    },
    {
        "data": {
            "description": "The basic factors that determine phase equilibria, structural and transformation characteristics of solids. Principles governing the thermodynamics and kinetics of phase transformations and microstructure evolution. Nucleation and growth processes in precipitation, recrystallization, solidification, oxidation, martensitic, ordering and spinodal reactions. Transformation behavior in polymers, biomaterials and nanomaterials.",
            "id": "MS&E 352",
            "parent": "MS&E",
            "title": "MATERIALS SCIENCE-TRANSFORMATION OF SOLIDS"
        }
    },
    {
        "data": {
            "description": "The basic structures and resulting properties of solid materials, including phase equilibria, meta-stability, mechanical properties, failure, corrosion, and materials selection.",
            "id": "MS&E 350",
            "parent": "MS&E",
            "title": "INTRODUCTION TO MATERIALS SCIENCE"
        }
    },
    {
        "data": {
            "description": "The design, properties, processing and selection of high temperature materials for structural applications. The fundamentals of diffusion, phase transformations, dislocation motion and oxidation governing the high temperature mechanical properties and structural performance of metallic and ceramic materials.",
            "id": "MS&E 463",
            "parent": "MS&E",
            "title": "MATERIALS FOR ELEVATED TEMPERATURE SERVICE"
        }
    },
    {
        "data": {
            "description": "The principal objectives of the course are to: i) introduce advanced processing methods for synthesizing nanomaterials, ranging from single nanoparticles to three-dimensional nanostructures, ii) discuss important thermodynamic and kinetic theories related to such processing, iii) describe methods for characterizing the structure and properties of nanomaterials, iv) discuss current and emerging applications for nanomaterials, and v) illustrate the interdisciplinary nature of nanotechnology and address critical challenges.",
            "id": "MS&E 553",
            "parent": "MS&E",
            "title": "NANOMATERIALS & NANOTECHNOLOGY"
        }
    },
    {
        "data": {
            "description": "The properties and structure of everyday materials. A non-mathematical exploration of the relation between structure and resulting properties of metals, plastics, ceramics, glasses, and composite materials. Case studies of important materials in the modern and historical context.",
            "id": "MS&E 151",
            "parent": "MS&E",
            "title": "MATERIALS OF THE MODERN WORLD"
        }
    },
    {
        "data": {
            "description": "The purpose of this course is to familiarize students with a variety of modern characterization techniques. Three general subject areas are covered: Physical Properties: Thermogravic analysis (TGA); differential scanning calorimetry (DSC); dynamic mechanical analysis (DMA); gel permeation chromatography (GPC). Spectroscopy, optical and x-ray: Ultraviolet/visible (VIS), molecular-infrared/Raman, Rheology; x-ray crystal and powder diffraction. Microscopy: scanning electron microscopy (SEM); SEM and energy dispersive analysis (EDS).",
            "id": "MS&E 363",
            "parent": "MS&E",
            "title": "BASIC MATERIALS CHARACTERIZATION TECHNIQUES"
        }
    },
    {
        "data": {
            "description": "The two semester sequenceMATH 112-MATH 113covers similar material asMATH 114, but in a slower pace. Not recommended for students with less than an AB inMATH 96.",
            "id": "MATH 114",
            "parent": "MATH",
            "title": "ALGEBRA AND TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "Thermodynamics and kinetics of metallic corrosion. The common forms of corrosion and corrosion susceptibility tests. Electrochemical measurement of corrosion rates. Corrosion prevention, economic considerations. High temperature oxidation and sulphidation. Corrosion case histories.",
            "id": "MS&E/NE 433",
            "title": "PRINCIPLES OF CORROSION"
        }
    },
    {
        "data": {
            "description": "Thermodynamics of condensed matters as applied to materials science and engineering.",
            "id": "MS&E 530",
            "parent": "MS&E",
            "title": "THERMODYNAMICS OF SOLIDS"
        }
    },
    {
        "data": {
            "description": "This course is designed to provide incoming students with an overview of the structure of materials and the relation to properties. Special emphasis is placed on modern materials and recent advancements in their application.",
            "id": "MS&E 250",
            "parent": "MS&E",
            "title": "INTRODUCTION TO MODERN MATERIALS"
        }
    },
    {
        "data": {
            "description": "This course is directed at graduate and advanced undergraduates with focused interest in polymeric materials. Basic principles of compatibility between macromolecules and small molecules, physical chemistry of blends and concepts in phase separation, and selected topics on materials design using self-assembly concepts.",
            "id": "MS&E 521",
            "parent": "MS&E",
            "title": "ADVANCED POLYMERIC MATERIALS"
        }
    },
    {
        "data": {
            "description": "Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Part of a 2-semester sequence withMATH 217; these two courses together are equivalent toMATH 114and221.",
            "id": "MATH 171",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY I"
        }
    },
    {
        "data": {
            "description": "Topics include: ironmaking and steelmaking; production of Cu, Zn, Al and Mg by electrolysis; solidification processing of alloys by ingot casting, continuous casting and directional solidification; growth of bulk single crystals of semiconductors and ceramics from melts.",
            "id": "MS&E 332",
            "parent": "MS&E",
            "title": "MACROPROCESSING OF MATERIALS"
        }
    },
    {
        "data": {
            "description": "Topics vary.",
            "id": "MS&E 803",
            "parent": "MS&E",
            "title": "SPECIAL TOPICS IN MATERIALS SCIENCE"
        }
    },
    {
        "data": {
            "description": "Under faculty supervision.",
            "id": "MS&E 790",
            "parent": "MS&E",
            "title": "MASTER'S RESEARCH OR THESIS"
        }
    },
    {
        "data": {
            "description": "Under faculty supervision.",
            "id": "MS&E 890",
            "parent": "MS&E",
            "title": "PRE-DISSERTATOR'S RESEARCH"
        }
    },
    {
        "data": {
            "description": "Under faculty supervision.",
            "id": "MS&E 990",
            "parent": "MS&E",
            "title": "RESEARCH AND THESIS"
        }
    },
    {
        "data": {
            "description": "Work experience that combines classroom theory with practical knowledge of operations to provide students with a background on which to develop and enhance a professional career.  The work experience is tailored for MS students from within the U.S. as well as eligible international students.",
            "id": "MS&E 702",
            "parent": "MS&E",
            "title": "GRADUATE COOPERATIVE EDUCATION PROGRAM"
        }
    },
    {
        "data": {
            "description": "Work experience which combines classroom theory with practical knowledge of operations to provide students with a background upon which to base a professional career.",
            "id": "MS&E 1",
            "parent": "MS&E",
            "title": "COOPERATIVE EDUCATION PROGRAM"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "EMA",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ME",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MS&E",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "PHYSICS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 109"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 341"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 343"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "MS&E 330"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 115",
            "target": "MS&E 260"
        }
    },
    {
        "data": {
            "source": "CHEM 341",
            "target": "CHEM/MS&E 421"
        }
    },
    {
        "data": {
            "source": "CHEM 343",
            "target": "CHEM 345"
        }
    },
    {
        "data": {
            "source": "CHEM 345",
            "target": "CHEM 341"
        }
    },
    {
        "data": {
            "source": "CHEM/MS&E 421",
            "target": "MS&E 521"
        }
    },
    {
        "data": {
            "source": "ECE/PHYSICS 235",
            "target": "MS&E 456"
        }
    },
    {
        "data": {
            "source": "EMA 201",
            "target": "CIVENGR/GEOSCI/GLE/MS&E 474"
        }
    },
    {
        "data": {
            "source": "EMA 201",
            "target": "ME 306"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 113"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 113",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 114",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 114"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "MS&E 260"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 213"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 213",
            "target": "MATH 222"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "CHEM 109"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 222"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "ECE/PHYSICS 235"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "EMA 201"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 319"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "ME 306"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MS&E 330"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "PHYSICS 247"
        }
    },
    {
        "data": {
            "source": "MATH 319",
            "target": "MS&E 660"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 114"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "ME 306",
            "target": "EMA/MS&E 541"
        }
    },
    {
        "data": {
            "source": "MS&E 330",
            "target": "MS&E 331"
        }
    },
    {
        "data": {
            "source": "MS&E 330",
            "target": "MS&E 434"
        }
    },
    {
        "data": {
            "source": "MS&E 330",
            "target": "MS&E 451"
        }
    },
    {
        "data": {
            "source": "MS&E 330",
            "target": "MS&E 530"
        }
    },
    {
        "data": {
            "source": "MS&E 330",
            "target": "MS&E/NE 433"
        }
    },
    {
        "data": {
            "source": "MS&E 333",
            "target": "MS&E 570"
        }
    },
    {
        "data": {
            "source": "MS&E 350",
            "target": "MS&E 332"
        }
    },
    {
        "data": {
            "source": "MS&E 350",
            "target": "MS&E 333"
        }
    },
    {
        "data": {
            "source": "MS&E 350",
            "target": "MS&E 351"
        }
    },
    {
        "data": {
            "source": "MS&E 350",
            "target": "MS&E 352"
        }
    },
    {
        "data": {
            "source": "MS&E 350",
            "target": "MS&E 360"
        }
    },
    {
        "data": {
            "source": "MS&E 350",
            "target": "MS&E 401"
        }
    },
    {
        "data": {
            "source": "MS&E 350",
            "target": "MS&E 448"
        }
    },
    {
        "data": {
            "source": "MS&E 350",
            "target": "MS&E 456"
        }
    },
    {
        "data": {
            "source": "MS&E 350",
            "target": "MS&E 461"
        }
    },
    {
        "data": {
            "source": "MS&E 350",
            "target": "MS&E 550"
        }
    },
    {
        "data": {
            "source": "MS&E 350",
            "target": "MS&E 553"
        }
    },
    {
        "data": {
            "source": "MS&E 350",
            "target": "MS&E 660"
        }
    },
    {
        "data": {
            "source": "MS&E 350",
            "target": "MS&E/NE 423"
        }
    },
    {
        "data": {
            "source": "MS&E 351",
            "target": "MS&E 350"
        }
    },
    {
        "data": {
            "source": "MS&E 351",
            "target": "MS&E 351"
        }
    },
    {
        "data": {
            "source": "MS&E 351",
            "target": "MS&E 361"
        }
    },
    {
        "data": {
            "source": "MS&E 351",
            "target": "MS&E 363"
        }
    },
    {
        "data": {
            "source": "MS&E 351",
            "target": "MS&E 434"
        }
    },
    {
        "data": {
            "source": "MS&E 351",
            "target": "MS&E 570"
        }
    },
    {
        "data": {
            "source": "MS&E 352",
            "target": "MS&E 441"
        }
    },
    {
        "data": {
            "source": "MS&E 352",
            "target": "MS&E 451"
        }
    },
    {
        "data": {
            "source": "MS&E 352",
            "target": "MS&E 463"
        }
    },
    {
        "data": {
            "source": "MS&E 352",
            "target": "MS&E 465"
        }
    },
    {
        "data": {
            "source": "MS&E 352",
            "target": "MS&E 470"
        }
    },
    {
        "data": {
            "source": "MS&E 360",
            "target": "MS&E 361"
        }
    },
    {
        "data": {
            "source": "MS&E 360",
            "target": "MS&E 363"
        }
    },
    {
        "data": {
            "source": "MS&E 361",
            "target": "MS&E 362"
        }
    },
    {
        "data": {
            "source": "MS&E 362",
            "target": "MS&E 470"
        }
    },
    {
        "data": {
            "source": "MS&E 448",
            "target": "MS&E 648"
        }
    },
    {
        "data": {
            "source": "MS&E 451",
            "target": "MS&E 551"
        }
    },
    {
        "data": {
            "source": "MS&E 470",
            "target": "MS&E 471"
        }
    },
    {
        "data": {
            "source": "MS&E 530",
            "target": "MS&E 752"
        }
    },
    {
        "data": {
            "source": "MS&E 748",
            "target": "MS&E 758"
        }
    },
    {
        "data": {
            "source": "PHYSICS 247",
            "target": "PHYSICS 248"
        }
    },
    {
        "data": {
            "source": "PHYSICS 248",
            "target": "ECE/PHYSICS 235"
        }
    }
]