[
    {
        "data": {
            "description": "Electrostatic fields, capacitance, multi-pole expansion, dielectric theory; magnetostatics; electromagnetic induction; magnetic properties of matter; Maxwell's equations and electromagnetic waves; relativity and electromagmetism. Experiments for this course are covered in PHYSICS 308.",
            "id": "PHYSICS 322",
            "parent": "PHYSICS",
            "title": "ELECTROMAGNETIC FIELDS"
        }
    },
    {
        "data": {
            "description": "Potential theory; static and dynamic electric and magnetic fields; macroscopic theory of dielectric and magnetic materials; Maxwell's equations; boundary conditions; wave equation; introduction to transmission lines.",
            "id": "ECE 220",
            "parent": "ECE",
            "title": "ELECTRODYNAMICS I"
        }
    },
    {
        "data": {
            "description": "Time harmonic fields and waves in linear media with applications to radiation, guiding and scattering; wave and surface impedance and admittance concepts; duality, uniqueness, image theory, equivalence principle, induction and compensation theorems, reciprocity, Green's functions, wave functions, potential and transform theory. Knowledge of electromagnetics [such asE C E 420] strongly encouraged.",
            "id": "ECE 740",
            "parent": "ECE",
            "title": "ELECTROMAGNETIC THEORY"
        }
    },
    {
        "data": {
            "description": "Topics covered include axioms of probability, random variables, the most important discrete and continuous probability distributions, expectation and variance, moment generating functions, conditional probability and conditional expectations, multivariate distributions, Markov's and Chebyshev's inequalities, laws of large numbers, and the central limit theorem.",
            "id": "MATH/STAT 431",
            "title": "INTRODUCTION TO THE THEORY OF PROBABILITY"
        }
    },
    {
        "data": {
            "description": "A survey of the nature of point defects, how these defects are produced, how the defects migrate and cluster, and what effects point defects and defect clusters have on the physical and mechanical properties of metals.",
            "id": "NE 541",
            "parent": "NE",
            "title": "RADIATION DAMAGE IN METALS"
        }
    },
    {
        "data": {
            "description": "Accelerated coverage of topics in general chemistry, including introduction to laboratory techniques. Topics include atomic and molecular structure, chemical equilibrium, acid-base chemistry, thermodynamics, kinetics, and electrochemistry.",
            "id": "CHEM 109",
            "parent": "CHEM",
            "title": "ADVANCED GENERAL CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "An introduction to linear algebra and differential equations with emphasis on the relationship between the theory of linear algebra and analytical and numerical techniques for solving differential equations. Linear algebra topics include linear systems, matrices and their algebra, vector spaces and linear transformations, eigenvalues and eigenvectors. Topics from differential equations include first order ODE, homogeneous and nonhomogeneous linear systems, and numerical methods.",
            "id": "MATH 320",
            "parent": "MATH",
            "title": "LINEAR ALGEBRA AND DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "description": "Analysis of nuclear systems for the production of useful power. Emphasis: thermodynamic cycles, reactor types, coupling of reactor and power plant, design synthesis, and plant economics.",
            "id": "NE 550",
            "parent": "NE",
            "title": "ADVANCED NUCLEAR POWER ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Basic description of plasmas: collective phenomena and sheaths, collisional processes, single particle motions, fluid models, equilibria, waves, electromagnetic properties, instabilities, and introduction to kinetic theory and nonlinear processes. Examples from fusion, astrophysical and materials processing processing plasmas.",
            "id": "ECE/NE/PHYSICS 525",
            "title": "INTRODUCTION TO PLASMAS"
        }
    },
    {
        "data": {
            "description": "Basic equations and physical parameters of point reactor kinetics without feedback effects; the nuclear reactor as a total system; reactor excursions, Fuchs-Nordheim and Bethe-Tait models; space-time reactor dynamics; synthesis methods.",
            "id": "NE 555",
            "parent": "NE",
            "title": "NUCLEAR REACTOR DYNAMICS"
        }
    },
    {
        "data": {
            "description": "Basic principles of fluid flow, heat transfer and diffusion are introduced. Examples relevant to design and processing of materials including metals, semiconductors, glasses, polymers, and ceramics are given.",
            "id": "MS&E 331",
            "parent": "MS&E",
            "title": "TRANSPORT PHENOMENA IN MATERIALS"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for Physics, AMEP, and Astronomy-Physics majors. Mechanics, waves, thermodynamics and statistical mechanics, topics in modern physics; with computation.  A more mathematically rigorous and in-depth introduction to physics than the other introductory physics sequences.",
            "id": "PHYSICS 247",
            "parent": "PHYSICS",
            "title": "A MODERN INTRODUCTION TO PHYSICS"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for engineering students. Electricity, magnetism, light, and sound.",
            "id": "PHYSICS 202",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for engineering students. Mechanics: kinematics, statics, dynamics; energy and momentum.",
            "id": "PHYSICS 201",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for students majoring in biological sciences. Mechanics: kinematics, statics, dynamics; energy and momentum. Heat and sound.",
            "id": "PHYSICS 207",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Continuation ofPHYSICS 207: calculus-based introduction to physics intended for students majoring in biological sciences. Electricity, magnetism, light, and modern physics.",
            "id": "PHYSICS 208",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Continuation ofPHYSICS 247. Electromagnetism, circuits, optics, additional topics in modern physics; with computation.",
            "id": "PHYSICS 248",
            "parent": "PHYSICS",
            "title": "A MODERN INTRODUCTION TO PHYSICS"
        }
    },
    {
        "data": {
            "description": "Continuation ofPHYSICS 248. Modern physics: introduction to quantum mechanics, topics from nuclear and particle physics, condensed matter physics, and atomic physics. Three lectures and one discussion per week.",
            "id": "PHYSICS 249",
            "parent": "PHYSICS",
            "title": "A MODERN INTRODUCTION TO PHYSICS"
        }
    },
    {
        "data": {
            "description": "Continuation ofPHYSICS 448. Review of atomic and other quantum phenomena and special relativity; introduction to quantum mechanics treating the more advanced topics of atomic physics and applications to molecular, solid state, nuclear, and elementary particle physics and quantum statistics.",
            "id": "PHYSICS 449",
            "parent": "PHYSICS",
            "title": "ATOMIC AND QUANTUM PHYSICS"
        }
    },
    {
        "data": {
            "description": "Coulomb Collisions, Boltzmann equation, Fokker-Planck methods, dynamical friction, neoclassical diffusion, collision operators radiation processes and experimental applications. Basic knowledge of plasmas [such asPHYSICS/​E C E/​N E  525] and advanced electromagnetics [such asPHYSICS 721orE C E 740] strongly encouraged.",
            "id": "ECE/NE/PHYSICS 725",
            "title": "PLASMA KINETIC THEORY AND RADIATION PROCESSES"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Current topics in plasma physics.",
            "id": "ECE/NE/PHYSICS 922",
            "title": "SEMINAR IN PLASMA PHYSICS"
        }
    },
    {
        "data": {
            "description": "Descriptive statistics, probability concepts and distributions, random variables. Hypothesis tests and confidence intervals for one- and two-sample problems. Linear regression, model checking, and inference. Analysis of variance and basic ideas in experimental design. Utilizes the R programming language.",
            "id": "STAT 324",
            "parent": "STAT",
            "title": "INTRODUCTORY APPLIED STATISTICS FOR ENGINEERS"
        }
    },
    {
        "data": {
            "description": "Design and performance of power plants for the generation of electric power; fossil, solar, wind, hydro and nuclear fuels, cycle analysis, component design and performance, plant operation, control, economics and environmental impact.",
            "id": "ME/NE 565",
            "title": "POWER PLANT TECHNOLOGY"
        }
    },
    {
        "data": {
            "description": "Directed study projects as arranged with instructor.",
            "id": "NE 699",
            "parent": "NE",
            "title": "ADVANCED INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Directed study projects as arranged with instructor.",
            "id": "NE 790",
            "parent": "NE",
            "title": "MASTER'S RESEARCH AND THESIS"
        }
    },
    {
        "data": {
            "description": "Directed study projects as arranged with instructor.",
            "id": "NE 990",
            "parent": "NE",
            "title": "RESEARCH AND THESIS"
        }
    },
    {
        "data": {
            "description": "Directed study projects as arranged with instructor.",
            "id": "NE 999",
            "parent": "NE",
            "title": "ADVANCED INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Economics of the nuclear fuel cycle. Economic and environmental impact of the nuclear fuel cycle. Impact on design, plant siting and regulation.",
            "id": "NE 571",
            "parent": "NE",
            "title": "ECONOMIC AND ENVIRONMENTAL ASPECTS OF NUCLEAR ENERGY"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "Experiments on nuclear instrumentation, counting, data analysis.",
            "id": "NE 427",
            "parent": "NE",
            "title": "NUCLEAR INSTRUMENTATION LABORATORY"
        }
    },
    {
        "data": {
            "description": "Experiments on reactor operation, flux measurement, measurements of reactor parameters, using pool type reactor.",
            "id": "NE 428",
            "parent": "NE",
            "title": "NUCLEAR REACTOR LABORATORY"
        }
    },
    {
        "data": {
            "description": "Explores a detailed atomic and molecular view of matter and its interactions, with a specific focus on quantum theory, molecular structure, and chemical bonding. Application required for enrollment.",
            "id": "CHEM 115",
            "parent": "CHEM",
            "title": "CHEMICAL PRINCIPLES I"
        }
    },
    {
        "data": {
            "description": "First and second laws of thermodynamics; thermodynamic properties of gases, vapors, and gas-vapor mixtures; energy-systems analysis including power cycles, refrigeration cycles and air-conditioning processes. Introduction to thermodynamics of reacting mixtures.",
            "id": "ME 361",
            "parent": "ME",
            "title": "THERMODYNAMICS"
        }
    },
    {
        "data": {
            "description": "First order differential equations, introduction to multivariable calculus and constrained optimization, infinite sequences and series, methods of approximation, and a brief introduction to probability. Models and applications from business and the social sciences.",
            "id": "MATH 213",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 2"
        }
    },
    {
        "data": {
            "description": "Fundamental concepts of conduction, convection, radiation. Heat-exchanger principles.",
            "id": "ME 364",
            "parent": "ME",
            "title": "ELEMENTARY HEAT TRANSFER"
        }
    },
    {
        "data": {
            "description": "Fundamental theory and recent advances in coherent radiation charged particle beam sources (microwave to X-ray wavelengths) including free electron lasers, wiggler/wave-particle dynamics, Cerenkov masers, gyrotrons, coherent gain and efficiency, spontaneous emission, beam sources and quality, related accelerator concepts experimental results and applications.",
            "id": "ECE/NE/PHYSICS 749",
            "title": "COHERENT GENERATION AND PARTICLE BEAMS"
        }
    },
    {
        "data": {
            "description": "Fundamentals of fuel and cladding behavior in terms of thermal properties, chemical behavior and radiation damage.",
            "id": "MS&E/NE 423",
            "title": "NUCLEAR ENGINEERING MATERIALS"
        }
    },
    {
        "data": {
            "description": "Gives students an introduction to computer and analytical skills to use in their subsequent course work and professional development. Discusses several methods of using computers to solve problems, including elementary programming techniques, symbolic manipulation languages, and software packages. Techniques will be illustrated using sample problems drawn from elementary engineering. Emphasis is on introduction of algorithms with the use of specific tools to illustrate the methods.",
            "id": "COMPSCI 310",
            "parent": "COMPSCI",
            "title": "PROBLEM SOLVING USING COMPUTERS"
        }
    },
    {
        "data": {
            "description": "Interactions and energy deposition by ionizing radiation in matter; concepts, quantities and units in radiological physics; principles and methods of radiation dosimetry.",
            "id": "BME/HONCOL/MEDPHYS/PHYSICS 501",
            "title": "RADIATION PHYSICS AND DOSIMETRY"
        }
    },
    {
        "data": {
            "description": "Introduction to atomic, solid state, and nuclear physics.",
            "id": "PHYSICS 205",
            "parent": "PHYSICS",
            "title": "MODERN PHYSICS FOR ENGINEERS"
        }
    },
    {
        "data": {
            "description": "Introduction to basic understanding and techniques. Plasma processing of materials for semiconductors, polymers, plasma spray coatings, ion implantation, etching, arcs, extractive metallurgy and welding. Plasma and materials diagnostics.",
            "id": "ECE/NE 528",
            "title": "PLASMA PROCESSING AND TECHNOLOGY"
        }
    },
    {
        "data": {
            "description": "Introduction to calculus of functions of several variables; calculus on parameterized curves, derivatives of functions of several variables, multiple integrals, vector calculus.",
            "id": "MATH 234",
            "parent": "MATH",
            "title": "CALCULUS--FUNCTIONS OF SEVERAL VARIABLES"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Introduction to modern statistical practice in the life sciences, using the R programming language. Topics include: exploratory data analysis, probability and random variables; one-sample testing and confidence intervals, role of assumptions, sample size determination, two-sample inference; basic ideas in experimental design, analysis of variance, linear regression, goodness-of fit; biological applications.",
            "id": "STAT 371",
            "parent": "STAT",
            "title": "INTRODUCTORY APPLIED STATISTICS FOR THE LIFE SCIENCES"
        }
    },
    {
        "data": {
            "description": "Introduction to physics at the non-calculus level. Principles of mechanics, heat, and waves, with applications to a number of different fields. Not recommended for students in the physical sciences and engineering.",
            "id": "PHYSICS 103",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Introduction to the main aspects of fusion power plants and the underlying plasma physics. Key design considerations will be summarized related to fusion fuels, resources, plasma physics, plasma-facing materials, magnets, neutronics, shielding, tritium breeding blankets, structural materials, activation, radiation damage, neutral beams, wave heating  current drive, safety, and environmental concerns. Focus on magnetic confinement fusion and its near-term and longer-term prospects.",
            "id": "NE 536",
            "parent": "NE",
            "title": "FEASIBILITY OF FUSION POWER PLANTS BASED ON CONTROLLED NUCLEAR FUSION"
        }
    },
    {
        "data": {
            "description": "Introduction to thermodynamics of materials, equilibrium constants, solutions, heterogeneous equilibria and electrochemistry.",
            "id": "MS&E 330",
            "parent": "MS&E",
            "title": "THERMODYNAMICS OF MATERIALS"
        }
    },
    {
        "data": {
            "description": "Introduction to: atomic, electronic, and defect structures in materials; diffusional, mechanical and electrical properties of materials; and the role of structure and defects in diffusional, mechanical, and electrical properties.",
            "id": "MS&E 351",
            "parent": "MS&E",
            "title": "MATERIALS SCIENCE-STRUCTURE AND PROPERTY RELATIONS IN SOLIDS"
        }
    },
    {
        "data": {
            "description": "Issues involved in decision-making regarding technological risks and risk management in areas such as nuclear power, hazardous waste disposal, and pollution control. Risk perception and cognitive biases; risk analysis and decision analysis; political issues in risk management; regulatory mechanisms; and risk communication. Selected case studies.",
            "id": "C&ESOC/ISYE/NE/SOC 708",
            "title": "SOCIETAL RISK MANAGEMENT OF TECHNOLOGICAL HAZARDS"
        }
    },
    {
        "data": {
            "description": "Kinetic theory; relativity; experimental origin of quantum theory; atomic structure and spectral lines; topics in solid state, nuclear and particle physics.",
            "id": "PHYSICS 241",
            "parent": "PHYSICS",
            "title": "INTRODUCTION TO MODERN PHYSICS"
        }
    },
    {
        "data": {
            "description": "Laws of mechanics and thermodynamics applied to fluids at rest and in motion; potential flow; dimensional analysis; viscous flow; pipe flow; boundary-layer theory; compressible flow.",
            "id": "ME 363",
            "parent": "ME",
            "title": "FLUID DYNAMICS"
        }
    },
    {
        "data": {
            "description": "MHD equations and validity in hot plasmas; magnetic structure and magnetic flux coordinates; equilibrium in various configurations; stability formulation, energy principle, classification of instabilities; ideal and resistive instability in various configurations, evolution of nonlinear tearing modes; force-free equilibria, helicity, MHD dynamo; experimental applications. Basic knowledge of plasmas [such asPHYSICS/​E C E/​N E  525] and advanced electromagnetics [such asPHYSICS 721orE C E 740] strongly encouraged.",
            "id": "ECE/NE/PHYSICS 726",
            "title": "PLASMA MAGNETOHYDRODYNAMICS"
        }
    },
    {
        "data": {
            "description": "Mass, momentum, and energy transport; calculation of transport coefficients; solution to problems in viscous flow, heat conduction, and diffusion; dimensional analysis; mass, momentum, and heat transfer coefficients; over-all balances; elementary applications.",
            "id": "CBE 320",
            "parent": "CBE",
            "title": "INTRODUCTORY TRANSPORT PHENOMENA"
        }
    },
    {
        "data": {
            "description": "Methods for risk and reliability analysis of engineered systems, particularly as applied in the nuclear power industry. Fault trees and event trees, Bayesian data analysis, probabilistic risk management. Some familiarity with nuclear plant safety systems is helpful, but not required.",
            "id": "ISYE/NE 574",
            "title": "METHODS FOR PROBABILISTIC RISK ANALYSIS OF NUCLEAR POWER PLANTS"
        }
    },
    {
        "data": {
            "description": "Nuclear fission/fusion, medical applications of radiation, radiation safety. Socio-economic topics including environmental justice, community engagement, nuclear policy. Brief history of and controversies in nuclear engineering. Career paths and ethics in engineering, and introduction to professional communication.",
            "id": "NE 231",
            "parent": "NE",
            "title": "INTRODUCTION TO NUCLEAR ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Overview of materials (cladding and structural materials) used in advanced reactor systems and the associated degradation. Interactions between the advanced nuclear reactor environment and materials. Surface degradation, corrosion, oxidation, dissolution, vaporization, mass transfer, diffusion, and hands-on examples related to advanced reactors.",
            "id": "NE 545",
            "parent": "NE",
            "title": "MATERIALS DEGRADATION IN ADVANCED NUCLEAR REACTOR ENVIRONMENTS"
        }
    },
    {
        "data": {
            "description": "Physical and biological aspects of the use of ionizing radiation in industrial and academic institutions; physical principles underlying shielding instrumentation, waste disposal; biological effects of low levels of ionizing radiation.",
            "id": "MEDPHYS/NE 569",
            "title": "HEALTH PHYSICS AND BIOLOGICAL EFFECTS"
        }
    },
    {
        "data": {
            "description": "Practical application of materials issues for nuclear systems including welding, non-destructive examination, optical microscopy, electron microscopy, to understand radiation damage and corrosion.",
            "id": "NE 424",
            "parent": "NE",
            "title": "NUCLEAR MATERIALS LABORATORY"
        }
    },
    {
        "data": {
            "description": "Presents the theoretical and practical information required to understand operation of nuclear reactors. Content includes all subjects which must be known by a person seeking an operating license for the university reactor. Instructors integrate information on similar operations and systems in a nuclear power plant.",
            "id": "NE 234",
            "parent": "NE",
            "title": "PRINCIPLES AND PRACTICE OF NUCLEAR REACTOR OPERATIONS"
        }
    },
    {
        "data": {
            "description": "Principles and application of chemical equilibrium, coordination chemistry, oxidation-reduction and electrochemistry, kinetics, nuclear chemistry, introduction to organic chemistry, and chemistry laboratory skills.",
            "id": "CHEM 104",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Principles of magnetic confinement and heating of plasmas for controlled thermonuclear fusion: magnetic field structures, single particle orbits, equilibrium, stability, collisions, transport, heating, modeling and diagnostics. Discussion of current leading confinement concepts: tokamaks, tandem mirrors, stellarators, reversed field pinches, etc.",
            "id": "ECE/NE/PHYSICS 527",
            "title": "PLASMA CONFINEMENT AND HEATING"
        }
    },
    {
        "data": {
            "description": "Probability and combinatorial methods, discrete and continuous, univariate and multivariate distributions, expected values, moments, normal distribution and derived distributions, estimation.",
            "id": "MATH/STAT 309",
            "title": "INTRODUCTION TO PROBABILITY AND MATHEMATICAL STATISTICS I"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Properties of nuclei, nuclear structure, radioactivity, nuclear reactions, fission, resonance reactions, moderation of neutrons.",
            "id": "NE 305",
            "parent": "NE",
            "title": "FUNDAMENTALS OF NUCLEAR ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Provides a background in the techniques for creating, exciting, and measuring the properties of lab plasmas and using the associated apparatus.",
            "id": "NE 526",
            "parent": "NE",
            "title": "LABORATORY COURSE IN PLASMAS"
        }
    },
    {
        "data": {
            "description": "Reactor design projects, reactor hazards, economics.",
            "id": "NE 412",
            "parent": "NE",
            "title": "NUCLEAR REACTOR DESIGN"
        }
    },
    {
        "data": {
            "description": "Reactor heat generation and removal; steady- and unsteady-state conduction in reactor elements; single phase, two-phase, and liquid metal cooling, core thermal design.",
            "id": "NE 411",
            "parent": "NE",
            "title": "NUCLEAR REACTOR ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Research by the Ph.D. students prior to becoming dissertators.",
            "id": "NE 890",
            "parent": "NE",
            "title": "PRE-DISSERTATOR'S RESEARCH"
        }
    },
    {
        "data": {
            "description": "Review of atomic and other quantum phenomena and special relativity; introduction to quantum mechanics treating the more advanced topics of atomic physics and applications to molecular, solid state, nuclear, and elementary particle physics and quantum statistics.",
            "id": "PHYSICS 448",
            "parent": "PHYSICS",
            "title": "ATOMIC AND QUANTUM PHYSICS"
        }
    },
    {
        "data": {
            "description": "Review of linear differential equations; series solution of linear differential equations; boundary value problems; Laplace transforms; possibly numerical methods and two dimensional autonomous systems.",
            "id": "MATH 319",
            "parent": "MATH",
            "title": "TECHNIQUES IN ORDINARY DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "description": "Review of topics in electrodynamics and special relativity; ionization and energy loss during scattering of charged particles; radiation from charged particles including Bremstrahlung, Cerenkov, and Synchrotron radiation; Thomson scattering of electromagnetic waves by charged particles. Knowledge of Dynamics [such asE M A 202orPHYSICS 311] and Electromagnetics [such asPHYSICS 322] required.",
            "id": "NE 741",
            "parent": "NE",
            "title": "INTERACTION OF RADIATION WITH MATTER"
        }
    },
    {
        "data": {
            "description": "Reviews basic calculations in electromagnetic engineering upon which all higher level concepts and physical model construction are based. It emphasizes quantitative calculation mastery in three spatial dimensions. Applies analysis tools from vector calculus to the calculation and prediction of electrical system properties. Examples include calculating electric and magnetic fields, electric potentials, total electric charge, and electric flux from change or current sources.",
            "id": "ECE 219",
            "parent": "ECE",
            "title": "ANALYTICAL METHODS FOR ELECTROMAGNETICS ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Solution of engineering problems using commercially-available software tools (spreadsheets, symbolic manipulators, and equation solvers). The emphasis will be on nuclear engineering problems, including radioactive decay, nuclear cross sections, scattering, and criticality.",
            "id": "EP 271",
            "parent": "EP",
            "title": "ENGINEERING PROBLEM SOLVING I"
        }
    },
    {
        "data": {
            "description": "Sources, interactions, and detection of ionizing radiation. Biological effects, shielding, standards of radiation protection.",
            "id": "NE 408",
            "parent": "NE",
            "title": "IONIZING RADIATION"
        }
    },
    {
        "data": {
            "description": "Special Topics in Plasma Physics. Knowledge of Plasma Physics [such asPHYSICS/​E C E/​N E  525] required",
            "id": "NE 903",
            "parent": "NE",
            "title": "SPECIAL TOPICS-PLASMA PHYSICS"
        }
    },
    {
        "data": {
            "description": "Special Topics in Reactor Engineering.",
            "id": "NE 602",
            "parent": "NE",
            "title": "SPECIAL TOPICS IN REACTOR ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Special relativity, electromagnetic momentum, electromagnetic waves: propagation, interference, scattering, reflection and refraction at a dielectric interface, waves in a conductor. Wave packets and group velocity, dispersion. Waveguides and transmission lines. Retarded potentials. Radiation.",
            "id": "PHYSICS 323",
            "parent": "PHYSICS",
            "title": "ELECTROMAGNETIC FIELDS"
        }
    },
    {
        "data": {
            "description": "Static and dynamic electromagnetic fields; forces and work in electromechanical systems; magnetic circuits; plane wave propagation; reflection of plane waves; generalized transmission line equations; current and voltage on transmission lines; impedance transformation and matching; Smith charts.",
            "id": "ECE 320",
            "parent": "ECE",
            "title": "ELECTRODYNAMICS II"
        }
    },
    {
        "data": {
            "description": "Stoichiometry and the mole concept, the behavior of gases, liquids and solids, thermochemistry, electronic structure of atoms and chemical bonding, descriptive chemistry of selected elements and compounds, intermolecular forces, and chemistry laboratory skills.",
            "id": "CHEM 103",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Techniques of integration, improper integrals, first order ordinary differential equations, sequences and series, Taylor series, vector geometry in two and three dimensions.",
            "id": "MATH 222",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 2"
        }
    },
    {
        "data": {
            "description": "The basic structures and resulting properties of solid materials, including phase equilibria, meta-stability, mechanical properties, failure, corrosion, and materials selection.",
            "id": "MS&E 350",
            "parent": "MS&E",
            "title": "INTRODUCTION TO MATERIALS SCIENCE"
        }
    },
    {
        "data": {
            "description": "The neutron transport equation and its application to the analysis of nuclear reactors. Numerical solution methods, including the multi-group model, one-group equations, energy-averaged constants, discrete ordinates, and Monte Carlo methods. Perturbation theory and variational techniques for practical problems. Knowledge of Nuclear Reactor Theory [such asN E 405] required.",
            "id": "NE 705",
            "parent": "NE",
            "title": "ADVANCED REACTOR THEORY"
        }
    },
    {
        "data": {
            "description": "The neutronics behavior of fission reactors, both from a theoretical and computational multi-group perspective. Multi-group diffusion theory, finite-difference and nodal methods, core heterogeneous effects, pin power reconstruction, thermal neutron spectra, fine group whole spectrum calculations and coarse group constant generation.",
            "id": "NE 505",
            "parent": "NE",
            "title": "NUCLEAR REACTOR ANALYSIS"
        }
    },
    {
        "data": {
            "description": "The neutronics behavior of fission reactors, primarily from a theoretical, one-speed perspective. Criticality, fission product poisoning, reactivity control, reactor stability and introductory concepts in fuel management, followed by slowing down and one-speed diffusion theory.",
            "id": "NE 405",
            "parent": "NE",
            "title": "NUCLEAR REACTOR THEORY"
        }
    },
    {
        "data": {
            "description": "Thermodynamics and kinetics of metallic corrosion. The common forms of corrosion and corrosion susceptibility tests. Electrochemical measurement of corrosion rates. Corrosion prevention, economic considerations. High temperature oxidation and sulphidation. Corrosion case histories.",
            "id": "MS&E/NE 433",
            "title": "PRINCIPLES OF CORROSION"
        }
    },
    {
        "data": {
            "description": "Topics in multi-variable calculus and introduction to differential equations.",
            "id": "MATH 376",
            "parent": "MATH",
            "title": "TOPICS IN MULTI-VARIABLE CALCULUS AND DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "description": "Two-phase flow and heat transfer in engineering systems. Pool boiling and flow boiling. Phenomenological modeling.",
            "id": "ME/NE 520",
            "title": "TWO-PHASE FLOW AND HEAT TRANSFER"
        }
    },
    {
        "data": {
            "description": "Undergraduate research and senior honors thesis in nuclear engineering.",
            "id": "NE 489",
            "parent": "NE",
            "title": "HONORS IN RESEARCH"
        }
    },
    {
        "data": {
            "description": "Use of Monte Carlo technique for applications in nuclear engineering and medical physics. Major theory of Monte Carlo neutral particle transport is discussed. Standard Monte Carlo transport software is used for exercises and projects. Major emphasis is on analysis of real-world problems.",
            "id": "MEDPHYS/NE 506",
            "title": "MONTE CARLO RADIATION TRANSPORT"
        }
    },
    {
        "data": {
            "description": "Vector spaces and linear transformations, differential calculus of scalar and vector fields, determinants, eigenvalues and eigenvectors, multiple integrals, line integrals, and surface integrals. Freshmen students are invited to enroll by the Department of Mathematics.",
            "id": "MATH 375",
            "parent": "MATH",
            "title": "TOPICS IN MULTI-VARIABLE CALCULUS AND LINEAR ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Waves in a cold plasma, wave-plasma interactions, waves in a hot plasma, Landau damping, cyclotron damping, magneto-hydrodynamic equilibria and instabilities, microinstabilities, introduction to nonlinear processes, and experimental applications. Basic knowledge of plasmas [such asPHYSICS/​E C E/​N E  525] and advanced electromagnetics [such asPHYSICS 721orE C E 740] strongly encouraged.",
            "id": "ECE/NE/PHYSICS 724",
            "title": "WAVES AND INSTABILITIES IN PLASMAS"
        }
    },
    {
        "data": {
            "description": "Work experience which combines classroom theory with practical knowledge of operations to provide students with a background upon which to base a professional career.",
            "id": "NE 1",
            "parent": "NE",
            "title": "COOPERATIVE EDUCATION PROGRAM"
        }
    },
    {
        "data": {
            "id": "CBE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "COMPSCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ECE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "EP",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ME",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MS&E",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "NE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "PHYSICS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "STAT",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "BME/HONCOL/MEDPHYS/PHYSICS 501",
            "target": "MEDPHYS/NE 506"
        }
    },
    {
        "data": {
            "source": "CBE 320",
            "target": "ME/NE 520"
        }
    },
    {
        "data": {
            "source": "CBE 320",
            "target": "ME/NE 565"
        }
    },
    {
        "data": {
            "source": "CBE 320",
            "target": "NE 411"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "ME 361"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "MS&E 350"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 109"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "MS&E 330"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "ME 361"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "MS&E 330"
        }
    },
    {
        "data": {
            "source": "CHEM 115",
            "target": "MS&E 351"
        }
    },
    {
        "data": {
            "source": "COMPSCI 310",
            "target": "NE 412"
        }
    },
    {
        "data": {
            "source": "ECE 219",
            "target": "ECE 220"
        }
    },
    {
        "data": {
            "source": "ECE 220",
            "target": "ECE 320"
        }
    },
    {
        "data": {
            "source": "ECE 320",
            "target": "ECE/NE 528"
        }
    },
    {
        "data": {
            "source": "ECE 320",
            "target": "ECE/NE/PHYSICS 525"
        }
    },
    {
        "data": {
            "source": "ECE 740",
            "target": "ECE/NE/PHYSICS 749"
        }
    },
    {
        "data": {
            "source": "ECE/NE/PHYSICS 525",
            "target": "ECE/NE/PHYSICS 527"
        }
    },
    {
        "data": {
            "source": "ECE/NE/PHYSICS 525",
            "target": "NE 526"
        }
    },
    {
        "data": {
            "source": "EP 271",
            "target": "NE 412"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 213"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "source": "MATH 213",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 222"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "COMPSCI 310"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 234"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 319"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 320"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "PHYSICS 247"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "ECE 219"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "MATH/STAT 431"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "MEDPHYS/NE 569"
        }
    },
    {
        "data": {
            "source": "MATH 319",
            "target": "ME 363"
        }
    },
    {
        "data": {
            "source": "MATH 319",
            "target": "MS&E 331"
        }
    },
    {
        "data": {
            "source": "MATH 319",
            "target": "NE 405"
        }
    },
    {
        "data": {
            "source": "MATH 320",
            "target": "BME/HONCOL/MEDPHYS/PHYSICS 501"
        }
    },
    {
        "data": {
            "source": "MATH 375",
            "target": "MATH 376"
        }
    },
    {
        "data": {
            "source": "MATH 375",
            "target": "NE 405"
        }
    },
    {
        "data": {
            "source": "MATH 376",
            "target": "MATH/STAT 431"
        }
    },
    {
        "data": {
            "source": "MATH 376",
            "target": "PHYSICS 248"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH/STAT 309",
            "target": "ISYE/NE 574"
        }
    },
    {
        "data": {
            "source": "MATH/STAT 431",
            "target": "MATH/STAT 309"
        }
    },
    {
        "data": {
            "source": "ME 361",
            "target": "ME 363"
        }
    },
    {
        "data": {
            "source": "ME 361",
            "target": "ME 364"
        }
    },
    {
        "data": {
            "source": "ME 361",
            "target": "ME/NE 520"
        }
    },
    {
        "data": {
            "source": "ME 361",
            "target": "ME/NE 565"
        }
    },
    {
        "data": {
            "source": "ME 361",
            "target": "NE 411"
        }
    },
    {
        "data": {
            "source": "ME 363",
            "target": "ME 364"
        }
    },
    {
        "data": {
            "source": "ME 364",
            "target": "ME/NE 520"
        }
    },
    {
        "data": {
            "source": "ME 364",
            "target": "NE 411"
        }
    },
    {
        "data": {
            "source": "MEDPHYS/NE 569",
            "target": "MEDPHYS/NE 506"
        }
    },
    {
        "data": {
            "source": "MS&E 330",
            "target": "MS&E 331"
        }
    },
    {
        "data": {
            "source": "MS&E 330",
            "target": "MS&E/NE 433"
        }
    },
    {
        "data": {
            "source": "MS&E 331",
            "target": "NE 536"
        }
    },
    {
        "data": {
            "source": "MS&E 350",
            "target": "MS&E 351"
        }
    },
    {
        "data": {
            "source": "MS&E 350",
            "target": "MS&E/NE 423"
        }
    },
    {
        "data": {
            "source": "MS&E 350",
            "target": "NE 424"
        }
    },
    {
        "data": {
            "source": "MS&E 350",
            "target": "NE 541"
        }
    },
    {
        "data": {
            "source": "MS&E 350",
            "target": "NE 545"
        }
    },
    {
        "data": {
            "source": "MS&E 351",
            "target": "MS&E 350"
        }
    },
    {
        "data": {
            "source": "MS&E 351",
            "target": "MS&E/NE 423"
        }
    },
    {
        "data": {
            "source": "MS&E 351",
            "target": "NE 424"
        }
    },
    {
        "data": {
            "source": "MS&E 351",
            "target": "NE 541"
        }
    },
    {
        "data": {
            "source": "MS&E 351",
            "target": "NE 545"
        }
    },
    {
        "data": {
            "source": "NE 305",
            "target": "MEDPHYS/NE 506"
        }
    },
    {
        "data": {
            "source": "NE 305",
            "target": "NE 405"
        }
    },
    {
        "data": {
            "source": "NE 305",
            "target": "NE 408"
        }
    },
    {
        "data": {
            "source": "NE 305",
            "target": "NE 411"
        }
    },
    {
        "data": {
            "source": "NE 305",
            "target": "NE 427"
        }
    },
    {
        "data": {
            "source": "NE 305",
            "target": "NE 536"
        }
    },
    {
        "data": {
            "source": "NE 405",
            "target": "NE 412"
        }
    },
    {
        "data": {
            "source": "NE 405",
            "target": "NE 428"
        }
    },
    {
        "data": {
            "source": "NE 405",
            "target": "NE 505"
        }
    },
    {
        "data": {
            "source": "NE 405",
            "target": "NE 550"
        }
    },
    {
        "data": {
            "source": "NE 405",
            "target": "NE 555"
        }
    },
    {
        "data": {
            "source": "NE 405",
            "target": "NE 571"
        }
    },
    {
        "data": {
            "source": "NE 411",
            "target": "NE 550"
        }
    },
    {
        "data": {
            "source": "NE 427",
            "target": "NE 428"
        }
    },
    {
        "data": {
            "source": "PHYSICS 103",
            "target": "PHYSICS 202"
        }
    },
    {
        "data": {
            "source": "PHYSICS 201",
            "target": "CBE 320"
        }
    },
    {
        "data": {
            "source": "PHYSICS 201",
            "target": "EP 271"
        }
    },
    {
        "data": {
            "source": "PHYSICS 201",
            "target": "PHYSICS 103"
        }
    },
    {
        "data": {
            "source": "PHYSICS 201",
            "target": "PHYSICS 202"
        }
    },
    {
        "data": {
            "source": "PHYSICS 201",
            "target": "PHYSICS 207"
        }
    },
    {
        "data": {
            "source": "PHYSICS 202",
            "target": "ECE 220"
        }
    },
    {
        "data": {
            "source": "PHYSICS 202",
            "target": "PHYSICS 205"
        }
    },
    {
        "data": {
            "source": "PHYSICS 202",
            "target": "PHYSICS 208"
        }
    },
    {
        "data": {
            "source": "PHYSICS 202",
            "target": "PHYSICS 322"
        }
    },
    {
        "data": {
            "source": "PHYSICS 205",
            "target": "NE 305"
        }
    },
    {
        "data": {
            "source": "PHYSICS 205",
            "target": "PHYSICS 241"
        }
    },
    {
        "data": {
            "source": "PHYSICS 205",
            "target": "PHYSICS 448"
        }
    },
    {
        "data": {
            "source": "PHYSICS 207",
            "target": "CBE 320"
        }
    },
    {
        "data": {
            "source": "PHYSICS 207",
            "target": "PHYSICS 201"
        }
    },
    {
        "data": {
            "source": "PHYSICS 207",
            "target": "PHYSICS 208"
        }
    },
    {
        "data": {
            "source": "PHYSICS 208",
            "target": "PHYSICS 322"
        }
    },
    {
        "data": {
            "source": "PHYSICS 241",
            "target": "MEDPHYS/NE 569"
        }
    },
    {
        "data": {
            "source": "PHYSICS 241",
            "target": "NE 305"
        }
    },
    {
        "data": {
            "source": "PHYSICS 241",
            "target": "PHYSICS 448"
        }
    },
    {
        "data": {
            "source": "PHYSICS 247",
            "target": "EP 271"
        }
    },
    {
        "data": {
            "source": "PHYSICS 247",
            "target": "PHYSICS 103"
        }
    },
    {
        "data": {
            "source": "PHYSICS 247",
            "target": "PHYSICS 248"
        }
    },
    {
        "data": {
            "source": "PHYSICS 248",
            "target": "PHYSICS 249"
        }
    },
    {
        "data": {
            "source": "PHYSICS 248",
            "target": "PHYSICS 322"
        }
    },
    {
        "data": {
            "source": "PHYSICS 249",
            "target": "MEDPHYS/NE 569"
        }
    },
    {
        "data": {
            "source": "PHYSICS 249",
            "target": "PHYSICS 241"
        }
    },
    {
        "data": {
            "source": "PHYSICS 249",
            "target": "PHYSICS 448"
        }
    },
    {
        "data": {
            "source": "PHYSICS 322",
            "target": "ECE/NE 528"
        }
    },
    {
        "data": {
            "source": "PHYSICS 322",
            "target": "ECE/NE/PHYSICS 525"
        }
    },
    {
        "data": {
            "source": "PHYSICS 322",
            "target": "PHYSICS 323"
        }
    },
    {
        "data": {
            "source": "PHYSICS 322",
            "target": "PHYSICS 448"
        }
    },
    {
        "data": {
            "source": "PHYSICS 323",
            "target": "BME/HONCOL/MEDPHYS/PHYSICS 501"
        }
    },
    {
        "data": {
            "source": "PHYSICS 448",
            "target": "PHYSICS 449"
        }
    },
    {
        "data": {
            "source": "PHYSICS 449",
            "target": "BME/HONCOL/MEDPHYS/PHYSICS 501"
        }
    },
    {
        "data": {
            "source": "STAT 324",
            "target": "ISYE/NE 574"
        }
    },
    {
        "data": {
            "source": "STAT 324",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "source": "STAT 371",
            "target": "STAT 324"
        }
    }
]