[
    {
        "data": {
            "description": "Direct supervision by Neurocritical Care attending physicians. Regularly scheduled supervisor-student meetings, which involve some or all of the following: rounding on service patients, observing procedures in the unit, presenting cases and teaching topics, and discussing patient cases. Independent activities, including reading about patient conditions and preparing for direct patient care, as needed. Other patient care related learning activities as assigned by instructors: these are dependent on the individual student and the patients under the student's care.",
            "id": "NEURSURG 921",
            "parent": "NEURSURG",
            "title": "INPATIENT NEURO ICU ELECTIVE"
        }
    },
    {
        "data": {
            "description": "Offers undergraduates majoring in an area of the biological sciences, and interested in preparing for advanced coursework in graduate or medical school, an opportunity to participate in neurological surgery research.",
            "id": "NEURSURG 699",
            "parent": "NEURSURG",
            "title": "NEUROSURGERY: DIRECTED IN STUDY IN RESEARCH"
        }
    },
    {
        "data": {
            "description": "Individually scheduled clinical elective, directly supervised by Neurological Surgery senior residents and attending physicians. Regularly scheduled supervisor-student meetings, which involve some or all of the following: rounding on service patients, participating in scheduled operative procedures, participating in sub-specialty clinics, presenting cases and teaching topics, and discussing patient cases. Independent activities include reading about patient conditions and preparing for direct patient care as needed. Other patient care-related learning activities as assigned by instructors, dependent on the individual student, the patients under the student's care, and the location.",
            "id": "NEURSURG 919",
            "parent": "NEURSURG",
            "title": "INDIVIDUALIZED NEUROLOGICAL SURGERY ELECTIVE"
        }
    },
    {
        "data": {
            "id": "NEURSURG",
            "type": "compound"
        }
    }
]