[
    {
        "data": {
            "description": "",
            "id": "NTP 675",
            "parent": "NTP",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "",
            "id": "NTP 990",
            "parent": "NTP",
            "title": "RESEARCH AND THESIS"
        }
    },
    {
        "data": {
            "description": "A group discussion of primary literature articles relevant to the neural basis of behavior with a purpose to understand the neural basis of behavior in animals, to learn to read papers critically and improve discussion leading skills.",
            "id": "NTP/ZOOLOGY 620",
            "title": "NEUROETHOLOGY SEMINAR"
        }
    },
    {
        "data": {
            "description": "Analysis of neural development with emphasis on experimental approaches. Combination of lectures and discussions of primary literature. Topics include neural induction, patterning, mechanisms of axon guidance, neural crest cell migration and differentiation, cortical development, and synapse formation and elimination.",
            "id": "NEURODPT/NTP/ZOOLOGY 765",
            "title": "DEVELOPMENTAL NEUROSCIENCE"
        }
    },
    {
        "data": {
            "description": "Application of the scientific method and experimental design, with a focus on experimental neuroscience. Topics include best practices that underlie robust and unbiased experimental approaches, methods, analyses, data interpretation and transparent reporting of results.",
            "id": "NTP 701",
            "parent": "NTP",
            "title": "EXPERIMENTAL DESIGN AND STATISTICAL METHODOLOGY"
        }
    },
    {
        "data": {
            "description": "Basic mechanisms in cellular neurophysiology: electrophysiology and chemistry of nerve signals, mechanisms in integration, simple nervous pathways and their behavioral correlates.",
            "id": "PSYCH/ZOOLOGY 523",
            "title": "NEUROBIOLOGY"
        }
    },
    {
        "data": {
            "description": "Behavior, including its development, motivation, frustrations, emotion, intelligence, learning, forgetting, personality, language, thinking, and social behavior.",
            "id": "PSYCH 202",
            "parent": "PSYCH",
            "title": "INTRODUCTION TO PSYCHOLOGY"
        }
    },
    {
        "data": {
            "description": "Biological basis of human and animal behaviors, including perception, action, cognition, social interaction and disease. Weekly themes from \"Cracking the Neural Code\" to \"Love and War\". Learn, develop and use neural mechanisms to explain and (attempt to) predict what they and others think and do in all facets of life.",
            "id": "PSYCH 454",
            "parent": "PSYCH",
            "title": "BEHAVIORAL NEUROSCIENCE"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for Physics, AMEP, and Astronomy-Physics majors. Mechanics, waves, thermodynamics and statistical mechanics, topics in modern physics; with computation.  A more mathematically rigorous and in-depth introduction to physics than the other introductory physics sequences.",
            "id": "PHYSICS 247",
            "parent": "PHYSICS",
            "title": "A MODERN INTRODUCTION TO PHYSICS"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for engineering students. Electricity, magnetism, light, and sound.",
            "id": "PHYSICS 202",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for engineering students. Mechanics: kinematics, statics, dynamics; energy and momentum.",
            "id": "PHYSICS 201",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for students majoring in biological sciences. Mechanics: kinematics, statics, dynamics; energy and momentum. Heat and sound.",
            "id": "PHYSICS 207",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Continuation ofPHYSICS 103. Principles of electricity and magnetism, light, optics, and modern physics, with applications to a number of different fields. Not recommended for students in the physical sciences and engineering.",
            "id": "PHYSICS 104",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Continuation ofPHYSICS 207: calculus-based introduction to physics intended for students majoring in biological sciences. Electricity, magnetism, light, and modern physics.",
            "id": "PHYSICS 208",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Continuation ofPHYSICS 247. Electromagnetism, circuits, optics, additional topics in modern physics; with computation.",
            "id": "PHYSICS 248",
            "parent": "PHYSICS",
            "title": "A MODERN INTRODUCTION TO PHYSICS"
        }
    },
    {
        "data": {
            "description": "Core concepts in human physiology from cells to organ-systems via online lectures and active learning activities including laboratory experiments. Topics include homeostasis, membrane transport, cellular physiology, regulation of metabolism, and functions of the nervous, endocrine, muscular, reproductive, cardiovascular, respiratory, renal, and gastrointestinal system.",
            "id": "ANAT&PHY 335",
            "parent": "ANAT&PHY",
            "title": "PHYSIOLOGY"
        }
    },
    {
        "data": {
            "description": "Covers various topics in neuroscience and in the related sciences that demonstrate the interaction between science and public policy.",
            "id": "NTP 660",
            "parent": "NTP",
            "title": "NEUROSCIENCE & PUBLIC POLICY SEMINAR"
        }
    },
    {
        "data": {
            "description": "Critical review of selected topics in neurobiology.",
            "id": "NTP 900",
            "parent": "NTP",
            "title": "NEUROSCIENCE SEMINAR: CURRENT TOPICS IN NEUROBIOLOGY"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "Explores the major organ systems including nervous, endocrine, muscular, cardiovascular, renal, and gastrointestinal. The main learning objective is an understanding of the cellular and molecular mechanisms through which homeostasis is integrated and maintained. Not open to students with credit for PHYSIOL 335 or 435 prior to fall 2018 orANAT&PHY 335",
            "id": "ANAT&PHY 435",
            "parent": "ANAT&PHY",
            "title": "FUNDAMENTALS OF HUMAN PHYSIOLOGY"
        }
    },
    {
        "data": {
            "description": "First order differential equations, introduction to multivariable calculus and constrained optimization, infinite sequences and series, methods of approximation, and a brief introduction to probability. Models and applications from business and the social sciences.",
            "id": "MATH 213",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 2"
        }
    },
    {
        "data": {
            "description": "Focuses on the cell signaling and the resulting structural changes that occur at neuronal synapses during memory formation. The aim is to understand how the synaptic changes underlying memory occur.",
            "id": "NEURODPT/NTP 629",
            "title": "MOLECULAR AND CELLULAR MECHANISMS OF MEMORY"
        }
    },
    {
        "data": {
            "description": "General biological principles. Topics include: evolution, ecology, animal behavior, cell structure and function, genetics and molecular genetics and the physiology of a variety of organ systems emphasizing function in humans.",
            "id": "BIOLOGY/ZOOLOGY 101",
            "title": "ANIMAL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Introduction to physics at the non-calculus level. Principles of mechanics, heat, and waves, with applications to a number of different fields. Not recommended for students in the physical sciences and engineering.",
            "id": "PHYSICS 103",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Introduction to the anatomy and physiology of the mammalian nervous system. Lectures will cover the neuroanatomy of the major subdivisions of the human brain, the major sensory and motor systems, and higher order functions. Lab/discussion sections will emphasize readings from the primary literature and hands-on dissections.",
            "id": "NEURODPT/NTP/PSYCH 611",
            "title": "SYSTEMS NEUROSCIENCE"
        }
    },
    {
        "data": {
            "description": "Origins and structures of mind, brain, and consciousness. Transitions from early mammalian through primate to hominid intelligence. Genetics and plasticity in brain development. Modern studies of human brain mechanisms and consciousness.",
            "id": "ANTHRO/NTP/PSYCH/ZOOLOGY 619",
            "title": "BIOLOGY OF MIND"
        }
    },
    {
        "data": {
            "description": "Outlines contemporary strategies to study consciousness and current knowledge of the neural correlates of consciousness and their alterations during sleep, parasomnia, anesthesia, coma, stroke, seizures, meditative and psychedelic states. Reviews recent work studying the neural correlates of conscious contents and their interactions with cognitive processes. Outlines contemporary theories of consciousness, illustrate how they can be empirically tested, and discuss their implications for the presence vs. absence of consciousness in artificial intelligent systems.",
            "id": "NTP 666",
            "parent": "NTP",
            "title": "NEUROSCIENCE OF CONSCIOUSNESS AND ITS DISORDERS"
        }
    },
    {
        "data": {
            "description": "Provides a practical foundation for neuroimaging research studies with statistical image analysis. Specific imaging methods include functional BOLD MRI, structural MRI morphometry, and diffusion tensor imaging. Lectures and associated in-class computer exercises will cover the physics and methods of image acquisition, steps and tools for image analyses, the basis for statistical image analyses and interpretation of the results.",
            "id": "MEDPHYS/NTP 651",
            "title": "METHODS FOR NEUROIMAGING RESEARCH"
        }
    },
    {
        "data": {
            "description": "Provides graduate students with the skills and knowledge necessary to succeed in science. Topics which are covered include choosing a thesis advisor, grant writing, preparing a seminar presentation, etc.",
            "id": "NTP 700",
            "parent": "NTP",
            "title": "PROFESSIONAL DEVELOPMENT FOR BIOMEDICAL GRADUATE STUDENTS"
        }
    },
    {
        "data": {
            "description": "Sleep occupies a third of our life, is found in all animal species carefully studied so far, and loss of sleep has both acute and long- term negative consequences on the brain and the body. Still, why we sleep remains unclear, and hypotheses on the role of sleep for synaptic homeostasis, learning and memory are being tested. Focuses on the neurobiology of sleep, with detailed review of the brain structures involved in controlling wake and sleep, as well as the circadian and homeostatic regulation of sleep. Other topics include changes in sleep need with age, animal models to study sleep, sleep disorders, and genetics of sleep.",
            "id": "NTP 677",
            "parent": "NTP",
            "title": "BASIC SLEEP MECHANISMS AND SLEEP DISORDERS: FROM NEUROBIOLOGY TO SLEEP MEDICINE"
        }
    },
    {
        "data": {
            "description": "Study of original papers leading to an understanding of the molecular basis of electrical activity in neurons. Topics include voltage-sensitive currents, molecular biology of neuronal receptorrs, synaptic transmission and sensory transduction.",
            "id": "NEURODPT/NTP 610",
            "title": "CELLULAR AND MOLECULAR NEUROSCIENCE"
        }
    },
    {
        "data": {
            "description": "Techniques of integration, improper integrals, first order ordinary differential equations, sequences and series, Taylor series, vector geometry in two and three dimensions.",
            "id": "MATH 222",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 2"
        }
    },
    {
        "data": {
            "description": "Theory and application of methods in computational neuroscience across various levels of organization from single cells to global brain dynamics and cognition. Computational neuroscience is an approach to understanding the development and function of nervous systems in mechanistic terms at many different structural scales. Topics include biophysical properties of neurons and synapses, neural plasticity, sensory systems, neural circuits, whole brain analysis and modeling, and different views on brain function. Includes primers on relevant computational techniques (ICA, information theoretical approaches, dynamical systems) and a computational problem set. Starts with an introduction to MATLAB (used for problem sets).",
            "id": "NEURODPT/NTP 640",
            "title": "COMPUTATIONAL NEUROSCIENCE: FROM SINGLE CELLS TO WHOLE BRAIN MODELS"
        }
    },
    {
        "data": {
            "description": "Topics in multi-variable calculus and introduction to differential equations.",
            "id": "MATH 376",
            "parent": "MATH",
            "title": "TOPICS IN MULTI-VARIABLE CALCULUS AND DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics and selected topics in Animal Physiology.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics, and selected topics in Animal Physiology. Designed for engineering majors that do not need a lab component.",
            "id": "ZOOLOGY 153",
            "parent": "ZOOLOGY",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Vector spaces and linear transformations, differential calculus of scalar and vector fields, determinants, eigenvalues and eigenvectors, multiple integrals, line integrals, and surface integrals. Freshmen students are invited to enroll by the Department of Mathematics.",
            "id": "MATH 375",
            "parent": "MATH",
            "title": "TOPICS IN MULTI-VARIABLE CALCULUS AND LINEAR ALGEBRA"
        }
    },
    {
        "data": {
            "id": "ANAT&PHY",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "NTP",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "PHYSICS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "PSYCH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ZOOLOGY",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ANAT&PHY 335",
            "target": "NEURODPT/NTP 629"
        }
    },
    {
        "data": {
            "source": "ANAT&PHY 435",
            "target": "ANAT&PHY 335"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "ANAT&PHY 335"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "ANAT&PHY 435"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 101"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "PSYCH 454"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "PSYCH/ZOOLOGY 523"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ANAT&PHY 335"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ANAT&PHY 435"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 151"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "PSYCH 454"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "PSYCH/ZOOLOGY 523"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ZOOLOGY 153"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 213"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 213",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 222"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "PHYSICS 247"
        }
    },
    {
        "data": {
            "source": "MATH 375",
            "target": "MATH 376"
        }
    },
    {
        "data": {
            "source": "MATH 376",
            "target": "PHYSICS 248"
        }
    },
    {
        "data": {
            "source": "NEURODPT/NTP 610",
            "target": "NEURODPT/NTP 640"
        }
    },
    {
        "data": {
            "source": "NEURODPT/NTP 610",
            "target": "NEURODPT/NTP/PSYCH 611"
        }
    },
    {
        "data": {
            "source": "NEURODPT/NTP/PSYCH 611",
            "target": "NEURODPT/NTP 640"
        }
    },
    {
        "data": {
            "source": "NEURODPT/NTP/PSYCH 611",
            "target": "NTP 660"
        }
    },
    {
        "data": {
            "source": "PHYSICS 103",
            "target": "PHYSICS 104"
        }
    },
    {
        "data": {
            "source": "PHYSICS 103",
            "target": "PHYSICS 202"
        }
    },
    {
        "data": {
            "source": "PHYSICS 104",
            "target": "MEDPHYS/NTP 651"
        }
    },
    {
        "data": {
            "source": "PHYSICS 201",
            "target": "PHYSICS 103"
        }
    },
    {
        "data": {
            "source": "PHYSICS 201",
            "target": "PHYSICS 202"
        }
    },
    {
        "data": {
            "source": "PHYSICS 201",
            "target": "PHYSICS 207"
        }
    },
    {
        "data": {
            "source": "PHYSICS 202",
            "target": "PHYSICS 104"
        }
    },
    {
        "data": {
            "source": "PHYSICS 202",
            "target": "PHYSICS 208"
        }
    },
    {
        "data": {
            "source": "PHYSICS 207",
            "target": "ANAT&PHY 435"
        }
    },
    {
        "data": {
            "source": "PHYSICS 207",
            "target": "PHYSICS 201"
        }
    },
    {
        "data": {
            "source": "PHYSICS 207",
            "target": "PHYSICS 208"
        }
    },
    {
        "data": {
            "source": "PHYSICS 208",
            "target": "MEDPHYS/NTP 651"
        }
    },
    {
        "data": {
            "source": "PHYSICS 208",
            "target": "NEURODPT/NTP 610"
        }
    },
    {
        "data": {
            "source": "PHYSICS 247",
            "target": "PHYSICS 103"
        }
    },
    {
        "data": {
            "source": "PHYSICS 247",
            "target": "PHYSICS 248"
        }
    },
    {
        "data": {
            "source": "PHYSICS 248",
            "target": "NEURODPT/NTP 610"
        }
    },
    {
        "data": {
            "source": "PHYSICS 248",
            "target": "NEURODPT/NTP 640"
        }
    },
    {
        "data": {
            "source": "PSYCH 202",
            "target": "PSYCH 454"
        }
    },
    {
        "data": {
            "source": "PSYCH 454",
            "target": "NEURODPT/NTP 640"
        }
    },
    {
        "data": {
            "source": "PSYCH 454",
            "target": "NTP 666"
        }
    },
    {
        "data": {
            "source": "PSYCH 454",
            "target": "NTP 677"
        }
    },
    {
        "data": {
            "source": "PSYCH/ZOOLOGY 523",
            "target": "NEURODPT/NTP 610"
        }
    },
    {
        "data": {
            "source": "PSYCH/ZOOLOGY 523",
            "target": "NEURODPT/NTP 629"
        }
    },
    {
        "data": {
            "source": "PSYCH/ZOOLOGY 523",
            "target": "NEURODPT/NTP 640"
        }
    },
    {
        "data": {
            "source": "PSYCH/ZOOLOGY 523",
            "target": "NTP 666"
        }
    },
    {
        "data": {
            "source": "PSYCH/ZOOLOGY 523",
            "target": "NTP 677"
        }
    },
    {
        "data": {
            "source": "PSYCH/ZOOLOGY 523",
            "target": "NTP/ZOOLOGY 620"
        }
    },
    {
        "data": {
            "source": "ZOOLOGY 153",
            "target": "ANAT&PHY 335"
        }
    },
    {
        "data": {
            "source": "ZOOLOGY 153",
            "target": "ANAT&PHY 435"
        }
    }
]