[
    {
        "data": {
            "description": "A comprehensive understanding of the intellectual traditions that informed the development of grounded theory, variations of grounded theory (second generation), and to provide an opportunity for active participation in grounded theory research. Requires hands-on participation in a field-research project of the student's choice, engaging in data-collection and analysis, and in-depth readings in symbolic interaction and grounded theory method.",
            "id": "NURSING 807",
            "parent": "NURSING",
            "title": "GROUNDED THEORY RESEARCH"
        }
    },
    {
        "data": {
            "description": "Advance students' knowledge of pediatric development to enhance clinical decision-making with emphasis on applying advanced assessment skills to the child and adolescent population.",
            "id": "NURSING 736",
            "parent": "NURSING",
            "title": "PEDIATRIC ASSESSMENT FOR MENTAL HEALTH ADVANCED PRACTICE NURSES"
        }
    },
    {
        "data": {
            "description": "Designed to prepare nurse leaders to recognize, analyze, and respond to current business concepts (e.g., human resources, legal, regulatory, and accreditation), economic, and financial management topics in healthcare systems. Applies key financial and business concepts to healthcare and examines current issues and trends in healthcare finance, including accounting, budgeting, cost analysis, human resource management, and the regulatory environment. Opportunities to analyze and evaluate the revenue and costs associated with a specific healthcare delivery system at the program- or organizational-level. Utilizes case studies including financial and clinical data to effectively balance the administrative and clinical needs of today's healthcare environment.",
            "id": "NURSING 711",
            "parent": "NURSING",
            "title": "BUSINESS CONCEPTS IN HEALTHCARE"
        }
    },
    {
        "data": {
            "description": "Emphasis on the exploration of ethical knowledge development with a focus on clarification, analysis and justification relevant to advanced nursing practice; examination and development of learners' moral understanding; and distinguishing between moral and other professional responsibilities.",
            "id": "NURSING 708",
            "parent": "NURSING",
            "title": "ETHICS FOR ADVANCED PRACTICE IN HEALTH CARE"
        }
    },
    {
        "data": {
            "description": "Examination of middle-range theory, micro-theory, and conceptual frameworks and their application in nursing science, with emphasis on critique and selection of a theory and/or framework to guide the student's research.",
            "id": "NURSING 801",
            "parent": "NURSING",
            "title": "THEORY IN NURSING RESEARCH"
        }
    },
    {
        "data": {
            "description": "Focuses on advancing knowledge of professional attributes and core competencies in the role of a nurse and how they are used in complex care settings. Gain an understanding of concepts of leadership, ethics, and advocacy. Broaden your understanding of nursing's role in the health care delivery system regarding quality improvement, care coordination, and palliation.",
            "id": "NURSING 325",
            "parent": "NURSING",
            "title": "PROFESSIONALISM IN HEALTH CARE SETTINGS"
        }
    },
    {
        "data": {
            "description": "Identification of computer and information technologies to support nursing in the diagnosis and treatment of human responses to health, illness, and development challenges.  Examination of information systems used in clinical practice, information processing challenges and nurses' roles in the evaluation of informatics solutions. Ethical, legal and social issues related to informatics in patient care.",
            "id": "NURSING 564",
            "parent": "NURSING",
            "title": "NURSING AND HEALTH INFORMATICS"
        }
    },
    {
        "data": {
            "description": "Introduces the foundational concepts of pharmacology, drug therapy, actions and interactions, and their therapeutic and adverse effects. Major drug classes are paired with health and illness concepts while considering the appropriate client-centered nursing interventions for disease states as they relate to retaining, attaining, or maintaining patients' health status across the lifespan.",
            "id": "NURSING 317",
            "parent": "NURSING",
            "title": "PHARMACOLOGY ESSENTIALS FOR NURSING PRACTICE"
        }
    },
    {
        "data": {
            "description": "Learn about complex health or health alterations and their management in regard to sexuality, reproduction, protection and movement, cognitive function, and maladaptive behavior. Emphasizes the nurse's role in management of complex health alterations within the health system, the community, and for transitions to home. The nursing process will frame learning activities that foster understanding the nursing role in providing evidence-based care to individuals, families, and communities experiencing related health and illness concerns in collaboration with an interprofessional team.",
            "id": "NURSING 443",
            "parent": "NURSING",
            "title": "ADVANCED CONCEPTS IN COMPLEX NURSING PRACTICE"
        }
    },
    {
        "data": {
            "description": "Learning is centered on advancing knowledge of professional attributes necessary in healthcare settings. Expand the understanding of core concepts related to ethics, advocacy, safe therapeutic care, technology, and health informatics at a systems-level to influence care and outcomes. Broaden the understanding of nursing's role in the healthcare delivery system regarding quality improvement, emergency preparedness, care coordination, and palliation.",
            "id": "NURSING 448",
            "parent": "NURSING",
            "title": "LEADERSHIP IN THE PROFESSION OF NURSING"
        }
    },
    {
        "data": {
            "description": "Provides an introduction to Alzheimer's disease and other dementias, with a focus on community supports for people living with dementia. Work across disciplines to learn how different areas of society can become dementia friendly and how to integrate relevant approaches in their future careers. Participate in a service-learning opportunity where you will work with local dementia-friendly community groups to strengthen supports for people with dementia and their caregivers.",
            "id": "NURSING 511",
            "parent": "NURSING",
            "title": "COMMUNITY SUPPORTS FOR PEOPLE WITH DEMENTIA"
        }
    },
    {
        "data": {
            "description": "Provides healthcare leaders with the knowledge, skills, and competencies to improve patient, organization and health system outcomes. Effective organizational and systems leadership will help to eliminate health disparities and promote patient safety and excellence in practice. Includes the analysis, integration, and application of principles of leadership and management to healthcare organizations and to population-based efforts across the healthcare delivery system including a basic introduction to finance. Emphasis is placed on the practical skills needed to succeed as leaders in today's complex environments.",
            "id": "NURSING 772",
            "parent": "NURSING",
            "title": "LEADERSHIP AND ORGANIZATIONAL DECISION-MAKING IN HEALTH CARE"
        }
    },
    {
        "data": {
            "description": "Provides the opportunity to learn more about the generation of nursing knowledge and about School of Nursing faculty members' research projects. An introduction to the principles, methods, and ethics of nursing research, strategies to evaluate the quality of research, and the importance of research for improving clinical practice.",
            "id": "NURSING 679",
            "parent": "NURSING",
            "title": "NURSING HONORS RESEARCH SEMINAR"
        }
    },
    {
        "data": {
            "description": "",
            "id": "NURSING 299",
            "parent": "NURSING",
            "title": "INDEPENDENT READING"
        }
    },
    {
        "data": {
            "description": "",
            "id": "NURSING 699",
            "parent": "NURSING",
            "title": "DIRECTED STUDY IN NURSING"
        }
    },
    {
        "data": {
            "description": "",
            "id": "NURSING 799",
            "parent": "NURSING",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "",
            "id": "NURSING 990",
            "parent": "NURSING",
            "title": "THESIS RESEARCH"
        }
    },
    {
        "data": {
            "description": "A field experience in preparation for conducting clinical research in the health care setting that corresponds to the a chosen health problem, phenomenon, or population of interest. Engage as participants and observers in the care setting to deepen your knowledge of the selected health problem and to examine the application of theory and research in the care setting. Negotiate a field experience with a selected agency or institution. Includes discussion of instructional experiences and issues.",
            "id": "NURSING 819",
            "parent": "NURSING",
            "title": "CLINICAL FIELD PRACTICUM - RESEARCH IN HEALTH CARE SETTINGS"
        }
    },
    {
        "data": {
            "description": "A study abroad equivalency. Enrollment in a UW-Madison resident study abroad program.",
            "id": "NURSING 400",
            "parent": "NURSING",
            "title": "STUDY ABROAD IN NURSING"
        }
    },
    {
        "data": {
            "description": "A supervised clinical practice to enhance clinical leadership skills within the role of an Advanced Practice Nurse.  Collaborate with a faculty course professor and clinical preceptor to meet individualized learning objectives.",
            "id": "NURSING 828",
            "parent": "NURSING",
            "title": "CLINICAL LEADERSHIP III"
        }
    },
    {
        "data": {
            "description": "A supervised clinical practice to enhance clinical leadership skills within the role of an Advanced Practice Nurse.  Collaborate with a faculty course professor and clinical preceptor to meet individualized learning objectives.",
            "id": "NURSING 829",
            "parent": "NURSING",
            "title": "CLINICAL LEADERSHIP IV"
        }
    },
    {
        "data": {
            "description": "Accelerated coverage of topics in general chemistry, including introduction to laboratory techniques. Topics include atomic and molecular structure, chemical equilibrium, acid-base chemistry, thermodynamics, kinetics, and electrochemistry.",
            "id": "CHEM 109",
            "parent": "CHEM",
            "title": "ADVANCED GENERAL CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Addresses conceptual and methodological perspectives in how patient-centered research and family-centered care research is conducted, from the development through the testing and implementation of interventions. Attention is given to various conceptualizations of patient-centeredness, to the behavioral and physiological origins of patient-centered interventions, family-centered care interventions, and to the trajectory of testing such interventions, from descriptive studies to experimental trials.",
            "id": "NURSING 818",
            "parent": "NURSING",
            "title": "PATIENT-CENTERED RESEARCH"
        }
    },
    {
        "data": {
            "description": "Addresses the team-based and patient-centered care of persons with mental health conditions. A special focus will be put on the management of psychotropic medication regimens. A combination of lecture, discussion, and small group work will be utilized.",
            "id": "NURSING/PHMPRAC 674",
            "title": "SEMINARS IN INTERPROFESSIONAL MENTAL HEALTH CARE"
        }
    },
    {
        "data": {
            "description": "Advance knowledge for clinical decision-making. Coordination of complex care across systems and settings will be emphasized.",
            "id": "NURSING 826",
            "parent": "NURSING",
            "title": "FOUNDATIONS FOR APN CLINICAL PRACTICE III"
        }
    },
    {
        "data": {
            "description": "An opportunity to explore and analyze healthcare systems including practical skills in leading teams. An individualized planned practicum provides an opportunity to explore the leader roles (multiple settings) within the context of an administrative issues. Emphasis is on clinical engagement in management projects requiring critical assessment, design, planning, intervention, and evaluation activities using theoretical models and management tools. The focus is on the advanced systems analysis and design of programs and services within an organization/community setting.",
            "id": "NURSING 712",
            "parent": "NURSING",
            "title": "HEALTH SYSTEMS LEADERSHIP AND INNOVATION PRACTICUM I"
        }
    },
    {
        "data": {
            "description": "An opportunity to meet with prevention professionals and scholars from across campus and the community to explore current and emerging issues of prevention research and professional practice.  Students must completeHDFS/​ED PSYCH/​NURSING/​SOC WORK  880before taking this course.",
            "id": "EDPSYCH/HDFS/NURSING/SOCWORK 881",
            "title": "CAPSTONE SEMINAR IN PREVENTION SCIENCE"
        }
    },
    {
        "data": {
            "description": "Analysis and integration of selected theories and models in psychotherapy, neuroscience, mental health, psychiatric disorders, and advanced psychiatric mental health nursing in complex care settings with diverse patients, communities, and populations.",
            "id": "NURSING 751",
            "parent": "NURSING",
            "title": "ADVANCED PRACTICE NURSING THEORY: PSYCHIATRIC MENTAL HEALTH"
        }
    },
    {
        "data": {
            "description": "Analyzes selected family and child development theories and research that inform advanced practice nursing. Applies these concepts to assess child and family needs, enhance the parent-child relationship, and develop family-centered, culturally responsive interventions in health and illness.",
            "id": "NURSING 741",
            "parent": "NURSING",
            "title": "ADVANCED PRACTICE NURSING THEORY: FAMILY PROCESS & CHILD DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Application of computer and information technologies to support nursing in the diagnosis and treatment of human responses to health, illness, and developmental challenges. Identification of information processing challenges and evaluation of informatics solutions. Ethical, legal and social issues related to informatics in patient care.",
            "id": "NURSING 764",
            "parent": "NURSING",
            "title": "NURSING AND HEALTH INFORMATICS"
        }
    },
    {
        "data": {
            "description": "Best practice approaches to health promotion and disease prevention are explored from their theoretical foundations to clinical applications in diverse populations. Content focuses on the study and synthesis of epidemiologic evidence with emerging social, psychological, and biological science to critically examine and propose evidence-based strategies to improve health outcomes, mitigate risk, and reduce disparities at the population level. Epidemiological principles, levels of prevention, population health theory, infectious disease control, and considerations specific to health equity and ethical health promotion practice in populations will be addressed.",
            "id": "NURSING 702",
            "parent": "NURSING",
            "title": "HEALTH PROMOTION AND DISEASE PREVENTION IN DIVERSE COMMUNITIES"
        }
    },
    {
        "data": {
            "description": "Build skills in collaboration, problem solving, and reflection to approach complex community-based public health problems contribute to becoming a public leader. Explore the six levels of public health leadership through the practices of current and past public health leaders, case studies, and personal experience.",
            "id": "NURSING/PHARMACY/PHYASST/PHYTHER/PUBLHLTH 758",
            "title": "INTERPROFESSIONAL PUBLIC HEALTH LEADERSHIP"
        }
    },
    {
        "data": {
            "description": "Builds on existing practice knowledge and skills with concepts from systems thinking, complex problem-solving, interdisciplinary collaboration, community engagement, coalition-building, and collective impact. Explorations of \"wicked\" problems in population health will challenge you to consider novel partnerships, shared decision-making, and innovative, multifaceted approaches to practice.",
            "id": "NURSING 724",
            "parent": "NURSING",
            "title": "POP HEALTH THEORY & METHODS SEMINAR II: INTERDIS PRACTICE, COLLECTIVE IMPACT & COALITION BUILDING"
        }
    },
    {
        "data": {
            "description": "Builds on health and illness concepts by focusing on individuals, families, and communities recognizing their unique attributes. Concepts included: acid-base balance, cellular regulation, intracranial regulation, genomics, sexuality and reproduction, and an introduction to the organization of the community/public health system. Other core nursing concepts are revisited as they apply to the community as client or in complex care situations. The nursing process frames learning activities that foster understanding the nursing role in providing evidence-based care to individuals, families across the lifespan, and to communities experiencing related health and illness concerns in collaboration with an interprofessional team.",
            "id": "NURSING 434",
            "parent": "NURSING",
            "title": "HEALTH AND ILLNESS CONCEPTS WITH INDIVIDUALS, FAMILIES, AND COMMUNITIES"
        }
    },
    {
        "data": {
            "description": "Builds on psychomotor and assessment skills necessary to provide direct care to individuals and families across the lifespan. Develop clinical judgment, knowledge, communication skills, and professional behavior while providing nursing care that is safe, evidence-based, and patient centered. Experiential learning takes place in simulated and clinical settings.",
            "id": "NURSING 326",
            "parent": "NURSING",
            "title": "HEALTH AND ILLNESS CONCEPTS WITH INDIVIDUALS AND FAMILIES: EXPERIENTIAL LEARNING"
        }
    },
    {
        "data": {
            "description": "Builds self-awareness, increasing knowledge, and advancing clinical skills needed to provide culturally congruent, person-centered care to patients with diverse backgrounds.",
            "id": "NURSING 510",
            "parent": "NURSING",
            "title": "CULTURALLY CONGRUENT PRACTICE"
        }
    },
    {
        "data": {
            "description": "Clinical application of medications in the management of various neurologic and psychiatric disease states. Assessment and therapeutic monitoring of drug therapy with emphasis on the concepts of drug selection, monitoring of drug effect and titration of regimen. Also incorporates issues regarding pharmacokinetics/dynamics, drug interactions, pharmacy practice, and patient education.",
            "id": "PHMPRAC 555",
            "parent": "PHMPRAC",
            "title": "PHARMACOTHERAPY I"
        }
    },
    {
        "data": {
            "description": "Concentrated study and field work in a selected area of clinical nursing.",
            "id": "NURSING 719",
            "parent": "NURSING",
            "title": "INDEPENDENT FIELD STUDY IN CLINICAL NURSING"
        }
    },
    {
        "data": {
            "description": "Continue the application of leadership and management skills and role development with a focus on leadership and innovation within complex health settings and across multisector partnerships. Emphasis on clinical engagement in management projects requiring critical assessment, design, planning, intervention, and evaluation activities using theoretical models and management tools to leverage technology and innovation. Focuses on leadership and innovation of programs and services within an organization/community-setting.",
            "id": "NURSING 713",
            "parent": "NURSING",
            "title": "HEALTH SYSTEMS LEADERSHIP AND INNOVATION PRACTICUM II"
        }
    },
    {
        "data": {
            "description": "Core concepts in human physiology from cells to organ-systems via online lectures and active learning activities including laboratory experiments. Topics include homeostasis, membrane transport, cellular physiology, regulation of metabolism, and functions of the nervous, endocrine, muscular, reproductive, cardiovascular, respiratory, renal, and gastrointestinal system.",
            "id": "ANAT&PHY 335",
            "parent": "ANAT&PHY",
            "title": "PHYSIOLOGY"
        }
    },
    {
        "data": {
            "description": "Course designed for the biomedical researcher. Topics include: descriptive statistics, hypothesis testing, estimation, confidence intervals, t-tests, chi-squared tests, analysis of variance, linear regression, correlation, nonparametric tests, survival analysis and odds ratio. Biomedical applications used for each topic.",
            "id": "BMI/STAT 541",
            "title": "INTRODUCTION TO BIOSTATISTICS"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Design, implementation and interpretation of epidemiologic studies; emphasis on methodologic problems in the measurement of disease frequency, natural history and risk factors.",
            "id": "POPHLTH/SOC 797",
            "title": "INTRODUCTION TO EPIDEMIOLOGY"
        }
    },
    {
        "data": {
            "description": "Designed for population health researcher. Topics include descriptive statistics, elementary probability, probability distributions, one- and two-sample normal inference (point estimation, hypothesis testing, confidence intervals), power and sample size calculations, one- and two-sample binomial inference, underlying assumptions and diagnostic work.",
            "id": "BMI/POPHLTH 551",
            "title": "INTRODUCTION TO BIOSTATISTICS FOR POPULATION HEALTH"
        }
    },
    {
        "data": {
            "description": "Designed to advance  knowledge for clinical decision-making. Complex and chronic health conditions are emphasized while continuing to promote health maintenance within the context of existing health problems.",
            "id": "NURSING 727",
            "parent": "NURSING",
            "title": "FOUNDATIONS FOR APN CLINICAL PRACTICE II"
        }
    },
    {
        "data": {
            "description": "Designed to advance knowledge for clinical decision making. Health promotion, illness prevention and common health conditions are emphasized.",
            "id": "NURSING 726",
            "parent": "NURSING",
            "title": "FOUNDATIONS FOR APN CLINICAL PRACTICE I"
        }
    },
    {
        "data": {
            "description": "Designed to develop skills in using evidence to improve nursing practice. Learn strategies to evaluate the quality of evidence and effectively integrate evidence into nursing practice. Learn how practice guidelines are developed, interpreted, and implemented in complex care settings. Learn the significance of engaging partners in evidence-based practice and identify processes to partner with others.",
            "id": "NURSING 435",
            "parent": "NURSING",
            "title": "EVIDENCE-BASED PRACTICE"
        }
    },
    {
        "data": {
            "description": "Develop an understanding of higher education curriculum rooted in the healthcare professions. Undergraduate and graduate level program structures are examined, including traditional and innovative designs. Processes of curriculum development, including needs assessment, implementation, evaluation, and outcomes assessment that provide the foundation for course scope and content inclusion. Guiding conceptual frameworks and underlying philosophical, political, and professional issues that impact curriculum development and change are examined. Current issues relevant to curriculum.",
            "id": "NURSING 785",
            "parent": "NURSING",
            "title": "FOUNDATIONS OF CURRICULUM DEVELOPMENT AND EVALUATION FOR HEALTHCARE PROFESSIONS"
        }
    },
    {
        "data": {
            "description": "Develop skills in using evidence to improve nursing practice. Learn strategies to evaluate the quality of evidence and effectively integrate evidence into nursing practice. Provides knowledge in how practice guidelines are developed, interpreted, and implemented in complex care settings. Understand the significance of engaging partners in evidence-based practice and identify processes to partner with others in order to have an impact on client care outcomes.",
            "id": "NURSING 447",
            "parent": "NURSING",
            "title": "SCHOLARSHIP FOR EVIDENCE-BASED PRACTICE"
        }
    },
    {
        "data": {
            "description": "Directed study as arranged with instructor.",
            "id": "NURSING 999",
            "parent": "NURSING",
            "title": "ADVANCED INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Directed study offers the student an opportunity to work with a faculty member on an individual study program.",
            "id": "NURSING 698",
            "parent": "NURSING",
            "title": "DIRECTED STUDY IN NURSING"
        }
    },
    {
        "data": {
            "description": "Ethical issues in the design, conduct and reporting of research are examined in the context of the nature of the scientific endeavor, the structure of the research community, and professional and federal guidelines for supporting scientific integrity and controlling misconduct.",
            "id": "NURSING 802",
            "parent": "NURSING",
            "title": "ETHICS AND THE RESPONSIBLE CONDUCT OF RESEARCH"
        }
    },
    {
        "data": {
            "description": "Evaluate and appraise health informatics and information technology in order to develop integrative approaches to the design, implementation and evaluation of health informatics solutions and problems. Application of standards, document architecture, decision support systems and heuristic rules and system life-cycle are key areas of focus. People and organization issues for system implementation and evaluation are applied to real data issues to examine privacy, data protection, and institutional responsibilities.",
            "id": "NURSING 715",
            "parent": "NURSING",
            "title": "EVALUATION OF HEALTH INFORMATICS SOLUTIONS"
        }
    },
    {
        "data": {
            "description": "Evaluate collective evidence and apply it, as appropriate, as a basis for improving nursing practice, health care, and healthcare outcomes.",
            "id": "NURSING 806",
            "parent": "NURSING",
            "title": "EVALUATION AND APPLICATION OF EVIDENCE-BASED PRACTICE"
        }
    },
    {
        "data": {
            "description": "Examination of key concepts in health disparities and health equity as they apply to nursing and related health research. Identification of structural and social determinants of equity that shape health at multiple levels, across the health and wellness continuum, in all health domains and throughout the life course. Emphasis on implications for the design, conduct, interpretation, and dissemination of nursing and health research.",
            "id": "NURSING 800",
            "parent": "NURSING",
            "title": "HEALTH EQUITY IN NURSING AND HEALTH RESEARCH"
        }
    },
    {
        "data": {
            "description": "Examination of the history of the discipline of nursing, with emphasis on the evolution of debates regarding what is known and how it is known.",
            "id": "NURSING 815",
            "parent": "NURSING",
            "title": "KNOWLEDGE DEVELOPMENT IN NURSING"
        }
    },
    {
        "data": {
            "description": "Examination of the substantive foundations of the discipline of nursing from a broad range of perspectives and domains of knowledge. The emphasis is on the identification and analysis of phenomena of concern to nursing, scientific and theoretical underpinnings of the discipline, the centrality of health and environment, hallmarks of scholarliness, and nursing leadership and collaboration to actualize the goals of nursing. Provides a foundational knowledge, skills, and attitudes needed for nursing leadership and population health.",
            "id": "NURSING 709",
            "parent": "NURSING",
            "title": "LEADERSHIP FOUNDATIONS: THE DISCIPLINE OF NURSING"
        }
    },
    {
        "data": {
            "description": "Examine theoretical perspectives and evidence-based approaches to human responses to health and illness during adulthood and old age. Concepts and research from multiple disciplines will be examined as a framework for reflective practice with adults.",
            "id": "NURSING 722",
            "parent": "NURSING",
            "title": "ADVANCED PRACTICE NURSING THEORY: ADULTS AND OLDER ADULTS"
        }
    },
    {
        "data": {
            "description": "Examines a variety of research methods available to address health care problems and issues in general, and nursing in particular.",
            "id": "NURSING 706",
            "parent": "NURSING",
            "title": "NURSING RESEARCH"
        }
    },
    {
        "data": {
            "description": "Examines the application of critical social theories in population health promotion when intersectionality, bias, and social inequities are social determinants of population health disparities. Intended to provide an opportunity to apply critical social theories to long-standing population health disparities and contemporary social health problems such as despair, homelessness, and loneliness. Emphasis on the appraisal of intersectionality, bias, and inequities in previous, present, or potential population health promotion strategies to eliminate health disparities.",
            "id": "NURSING 730",
            "parent": "NURSING",
            "title": "CRITICAL SOCIAL THEORIES IN POPULATION HEALTH"
        }
    },
    {
        "data": {
            "description": "Examines the history, rationale and mechanism of action of drugs used in the treatment of mental health and behavioral disorders. Emphasis is placed on neurobiological processes underlying psychopathology and clinical application of evidence-based pharmacological interventions across the lifespan. In addition, focus on pharmacokinetics, pharmacodynamics, side-effects, drug interactions, therapeutic monitoring and variations in special populations. Finally, review prescriptive authority, the potential impact of the current mental health care service system and ethical decision making for health care  professionals.",
            "id": "NURSING 657",
            "parent": "NURSING",
            "title": "CLINICAL PSYCHOPHARMACOLOGY"
        }
    },
    {
        "data": {
            "description": "Expand and strengthen leadership skills, enhance understanding of specialized advanced practice role including strategic planning and resource stewardship. Collaborate with course faculty and designated preceptors to establish and achieve individualized learning goals that directly pertain to specialty roles in advanced nursing practice.",
            "id": "NURSING 830",
            "parent": "NURSING",
            "title": "LEADERSHIP, ROLE DEVELOPMENT, AND RESOURCE STEWARDSHIP PRACTICUM"
        }
    },
    {
        "data": {
            "description": "Expand understanding of core nursing competencies such as safe therapeutic care and health informatics by examining how these concepts operate at a systems-level to influence care and outcomes. Focus is given to emergency preparedness as enacted in a variety of systems. Key conceptual elements of the healthcare system, organization, policy, financing and law, and quality improvement and their impact on care and outcomes are examined. Expand your understanding of scholarship and evidence-based practice by delving into the process of nursing research.",
            "id": "NURSING 444",
            "parent": "NURSING",
            "title": "HEALTH SYSTEMS, POLICY, ECONOMICS, AND RESEARCH"
        }
    },
    {
        "data": {
            "description": "Experiential learning focused on the application of foundational skills and perspectives of advanced population health nursing practice. Provides an opportunity to synthesize, integrate, and apply new knowledge and skills and gain professional experience in population health. Emphasis is on aggregate assessment and evidence-based planning, including critical appraisal of existent data, generation of primary data, community engagement, participatory solution-finding, and the identification of evidence-based strategies to promote and protect health and well-being.",
            "id": "NURSING 720",
            "parent": "NURSING",
            "title": "POPULATION HEALTH PRACTICUM I: WORKING IN THE AGGREGATE"
        }
    },
    {
        "data": {
            "description": "Exploration of interdisciplinary clinical research questions including strategies for assessing the evidence and methodology for conducting various types of literature reviews. Emphasizes an interdisciplinary perspective.",
            "id": "MEDICINE/NURSING/POPHLTH 705",
            "title": "SEMINAR IN INTERDISCIPLINARY CLINICAL RESEARCH EVIDENCE"
        }
    },
    {
        "data": {
            "description": "Exploration of population health nursing principles and practices, public health partnerships, population health advocacy, community health assessment, and identification of health patterns in populations in local, national, and global settings.",
            "id": "NURSING 432",
            "parent": "NURSING",
            "title": "POPULATION HEALTH NURSING"
        }
    },
    {
        "data": {
            "description": "Explore specialized roles, emerging issues, and current priorities in advanced population health nursing. Analyze novel and emergent population health challenges within context, and consider the unique knowledge, skills, and philosophies that prepared nurses can bring to solution-seeking and interdisciplinary efforts to promote or safeguard population health.",
            "id": "NURSING 725",
            "parent": "NURSING",
            "title": "POPULATION HEALTH THEORY AND METHODS SEMINAR III: EMERGING ISSUES AND SPECIALIZED ROLES"
        }
    },
    {
        "data": {
            "description": "Focus on professional development and socialization to the role of nurse scientist. Discussion emphasizes career development planning including traditional and alternative roles for PhD-prepared nurses, and current and emerging topics of importance to nursing science. The planned and ongoing research of graduate students and faculty in nursing will be featured as relevant.",
            "id": "NURSING 816",
            "parent": "NURSING",
            "title": "PROSEMINAR IN NURSING RESEARCH"
        }
    },
    {
        "data": {
            "description": "Focuses on developing advanced practice competencies in health assessment as relevant to a selected specialty and practice setting. Become grounded in the theoretical perspectives, empirical documentation, and practice skills necessary for advanced biopsychosocial and physical assessment, critical diagnostic reasoning, clinical decision-making, and communication. Interactions of developmental, biopsychosocial, and cultural contexts resulting in health effects. Demonstrate capacity to provide a full spectrum of healthcare services including health promotion, disease prevention, health protection, anticipatory guidance, counseling, and disease management. Provides a foundation for the advanced practice nurse to evaluate and address the health of individuals.",
            "id": "NURSING 601",
            "parent": "NURSING",
            "title": "ADVANCED HEALTH ASSESSMENT"
        }
    },
    {
        "data": {
            "description": "Focuses on foundational concepts necessary to provide person-centered, evidence-based nursing care, including the nursing process and health and illness concepts. Active learning is emphasized by gaining confidence with applying the nursing processes and begin to develop clinical judgment and assessment skills. Complements a companion experiential course [NURSING 316].",
            "id": "NURSING 313",
            "parent": "NURSING",
            "title": "FOUNDATIONS OF NURSING PRACTICE"
        }
    },
    {
        "data": {
            "description": "Focuses on health and illness concepts emphasizing care to individuals and families across the lifespan. Gain a fundamental understanding of allostasis, oxygenation and hemostasis, and protection and movement. Gain knowledge of these concepts through exemplars that illustrate common health processes and/or alterations. Frames learning activities that foster understanding of the nursing role in providing care to individuals and families experiencing related health and illness concerns.",
            "id": "NURSING 323",
            "parent": "NURSING",
            "title": "HEALTH AND ILLNESS CONCEPTS WITH INDIVIDUALS AND FAMILIES"
        }
    },
    {
        "data": {
            "description": "Focuses on health innovation and leadership, integrating systems thinking and relevant theories to advance innovation and achieve sustainable change in contemporary health settings. Leaders apply and synthesize theories of leadership, innovation, informatics, and business concepts to complex healthcare issues to improve outcomes. Utilizes current and emerging issues, theories, and case studies to explore attributes of innovative leaders, emerging models of care, innovation models, design and adoption, mergers and affiliations in healthcare, and entrepreneurship.",
            "id": "NURSING 714",
            "parent": "NURSING",
            "title": "ADVANCED HEALTH SYSTEMS LEADERSHIP AND INNOVATION"
        }
    },
    {
        "data": {
            "description": "Focuses on how to conduct qualitative research. Content addresses the philosophical underpinnings of various interpretive qualitative methodologies to assist in matching the best method to particular research questions. Engage in research procedures associated with various qualitative traditions.",
            "id": "NURSING 804",
            "parent": "NURSING",
            "title": "QUALITATIVE DESIGN AND METHODS"
        }
    },
    {
        "data": {
            "description": "Focuses on professional nursing attributes and interactions essential to professional competence. Study concepts that allow for providing care unique to an individual, family, community, and systems, and to the context in which they live. Concepts related to the health care delivery system are included to provide a foundation for beginning nursing practice. Knowledge from sciences, social studies, and humanities education is integrated into nursing practice and builds foundational knowledge of the science of nursing.",
            "id": "NURSING 315",
            "parent": "NURSING",
            "title": "PROFESSIONALISM IN NURSING PRACTICE"
        }
    },
    {
        "data": {
            "description": "Focuses on the conduct of research primarily from empirical, analytical traditions. Address the integration of research paradigms, questions, designs, and methods for such research. Compare details, characteristics, strengths and limitations of alternative research designs and methods. Discuss issues and standards for preparing research proposals for different purposes (e.g., institutional review boards for human subjects, NIH) to advance the nursing discipline.",
            "id": "NURSING 803",
            "parent": "NURSING",
            "title": "QUANTITATIVE DESIGN AND METHODS"
        }
    },
    {
        "data": {
            "description": "Focuses on the role of the baccalaureate generalist nurse in health promotion and disease prevention across the lifespan. Learn about factors that impact health of individuals and families. Active learning is emphasized through applying the nursing process to concepts such as health determinants, health education, self- management, and innate psychological needs related to well-being.",
            "id": "NURSING 314",
            "parent": "NURSING",
            "title": "HEALTH PROMOTION AND DISEASE PREVENTION ACROSS THE LIFESPAN"
        }
    },
    {
        "data": {
            "description": "Fosters advanced practice competencies and deeper understandings of collaborative practice in population health. Employ structured systems thinking, stakeholder engagement, and interdisciplinary leadership to investigate and address complex issues in population health. Advanced practice competencies to be developed include: structured approaches to systems thinking, community engagement, collaborative leadership, responsive communication, teamwork, multidisciplinary program planning, cross-sector collaboration, and collective impact.",
            "id": "NURSING 721",
            "parent": "NURSING",
            "title": "POPULATION HEALTH PRACTICUM II: COMMUNITY ACTION AND COLLECTIVE IMPACT"
        }
    },
    {
        "data": {
            "description": "Foundational knowledge needed to provide equitable, evidence-based nursing care for diverse children and their families. For each developmental level, holistically integrate health promotion, illness and injury prevention, health education, and anticipatory guidance and examines potential disparities, as key components of the nursing role. Emphasis on the application of the nursing process, the clinical judgment model, and related core competencies associated with understanding the pathophysiology of altered health patterns affecting children and the related management of nursing care.",
            "id": "NURSING 431",
            "parent": "NURSING",
            "title": "NURSING CARE OF CHILDREN & THEIR FAMILIES"
        }
    },
    {
        "data": {
            "description": "Fundamental knowledge about, and appreciation for, the adaptability of human physiological systems in meeting a range of exercise demands.",
            "id": "KINES 314",
            "parent": "KINES",
            "title": "PHYSIOLOGY OF EXERCISE"
        }
    },
    {
        "data": {
            "description": "Gain foundational knowledge and skills in interprofessional collaborative practice and HIV care. Explore the roles of medicine, nursing, pharmacy, and social work in the HIV care continuum. Discuss quality team-based care as a member of an interprofessional student team.",
            "id": "MEDICINE/NURSING/PHMPRAC/SOCWORK 467",
            "title": "INTERPROFESSIONAL COLLABORATIVE PRACTICE IN HIV CARE"
        }
    },
    {
        "data": {
            "description": "General biological principles. Topics include: evolution, ecology, animal behavior, cell structure and function, genetics and molecular genetics and the physiology of a variety of organ systems emphasizing function in humans.",
            "id": "BIOLOGY/ZOOLOGY 101",
            "title": "ANIMAL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Health problems and their nursing management, e.g., critical care nursing, health promotion and prevention of disease, nursing of developmental disabilities.",
            "id": "NURSING 590",
            "parent": "NURSING",
            "title": "CONTEMPORARY PRACTICES IN NURSING"
        }
    },
    {
        "data": {
            "description": "Immersive and comprehensive experience designed to prepare healthcare professional students for roles as effective educators. Dynamic blend of theoretical coursework, experiential hands-on teaching, and educational experiences to grow expertise in curriculum development, inclusive instructional design, and assessment strategies. Through collaboration with experienced preceptors, refine pedagogical skills, fostering an understanding of diverse learning styles and effective communication in the healthcare education context. Emphasis will be placed on evidence-based teaching methods, utilization of the latest technologies and innovative approaches to enhance student engagement.",
            "id": "NURSING 787",
            "parent": "NURSING",
            "title": "TEACHING AND LEARNING IN HEALTHCARE PROFESSIONS PRACTICUM"
        }
    },
    {
        "data": {
            "description": "In-depth study of selected physiological and pathophysiological concepts with application to advanced clinical practice across the lifespan.",
            "id": "NURSING 811",
            "parent": "NURSING",
            "title": "ADVANCED PATHOPHYSIOLOGY"
        }
    },
    {
        "data": {
            "description": "Increases student understanding of appropriate and accurate materials for consumer health and family education; the ethical and organizational policy issues that arise when providing consumer and family health information in different settings; the role of the public media in disseminating health information; the health-related information needs and preferences of racial/ethnic minority populations. It also provides an introduction to health information technologies, from search engines to websites to apps, that put people in charge of managing their own health information.",
            "id": "LIS/NURSING 517",
            "title": "DIGITAL HEALTH: INFORMATION AND TECHNOLOGIES SUPPORTING CONSUMERS AND PATIENTS"
        }
    },
    {
        "data": {
            "description": "Independent scholarly project involves a systematic, evidence-based approach to enhance health-related outcomes.",
            "id": "NURSING 906",
            "parent": "NURSING",
            "title": "SCHOLARLY PROJECT"
        }
    },
    {
        "data": {
            "description": "Integrates teaching and learning theories and evidence-based strategies for educating undergraduate and graduate health professions students in classroom and online environments. This course provides students with principles, models, and processes to plan, implement and evaluate teaching and learning experiences through curated readings, activities, and self- reflection. Students will apply strategies such as the integration of personal attributes and teaching style, use of technology, and a student- centered approach to develop optimal teaching practices.",
            "id": "NURSING 786",
            "parent": "NURSING",
            "title": "TEACHING AND LEARNING STRATEGIES FOR THE CLASSROOM AND ONLINE ENVIRONMENTS IN HEALTHCARE PROFESSIONS"
        }
    },
    {
        "data": {
            "description": "Integrates teaching and learning theories and evidence-based strategies for educating undergraduate and graduate health professions students in clinical and simulation environments. Provides principles, models, and processes to plan, implement and evaluate teaching and learning experiences through curated readings, activities, and self-reflection. Applies strategies such as the integration of personal attributes and teaching style, use of technology, and a student-centered approach to develop optimal teaching practices.",
            "id": "NURSING 784",
            "parent": "NURSING",
            "title": "TEACHING AND LEARNING STRATEGIES FOR CLINICAL AND SIMULATION ENVIRONMENTS IN HEALTHCARE PROFESSIONS"
        }
    },
    {
        "data": {
            "description": "Integration of learning acquired throughout the nursing program. Learning outcomes integrate concepts associated with five nursing program meta concepts (professionalism; person, family, community, and systems-centered care; health and illness; health care context; and scholarship for evidence-based practice). Using processes of analysis, synthesis, reflection, and application, advance in your transition to becoming a professional nurse. Includes mentoring through co- facilitation by faculty, academic staff, and practice professionals.",
            "id": "NURSING 445",
            "parent": "NURSING",
            "title": "TRANSFORMATIVE NURSING CAPSTONE"
        }
    },
    {
        "data": {
            "description": "Intended for biomedical researchers interested in the design and analysis of clinical trials. Topics include definition of hypotheses, measures of effectiveness, sample size, randomization, data collection and monitoring, and issues in statistical analysis.",
            "id": "BMI/STAT 542",
            "title": "INTRODUCTION TO CLINICAL TRIALS I"
        }
    },
    {
        "data": {
            "description": "Interdisciplinary health advocacy clinic providing broad individual and system advocacy for patients facing life changing health events. Advocacy topics include: medical decision-making, insurance, medical debt, disability and related policies and laws.",
            "id": "LAW/NURSING 768",
            "title": "HEALTH JUSTICE CLINIC"
        }
    },
    {
        "data": {
            "description": "Interdisciplinary team care of children with special health care needs across the trajectory of illness presented within the context of family, culture, social determinants of health, community, and healthcare policy.   Students introduced to interdisciplinary, collaborative, family-centered team care.",
            "id": "NURSING/PHMPRAC/SOCWORK 746",
            "title": "INTERDISCIPLINARY CARE OF CHILDREN WITH SPECIAL HEALTH CARE NEEDS"
        }
    },
    {
        "data": {
            "description": "Introduces psychomotor and assessment skills necessary to provide person-centered, evidence-based nursing care. Experience opportunities to promote wellness and respond to health problems by participating in direct client care in community and acute-care settings. Develop confidence with the application of skills and clinical judgment in a simulation lab and through concept-based learning experiences in care settings.",
            "id": "NURSING 316",
            "parent": "NURSING",
            "title": "FOUNDATIONS OF NURSING PRACTICE: EXPERIENTIAL LEARNING"
        }
    },
    {
        "data": {
            "description": "Introduction to health care systems. Factors affecting health and the value placed on health, the delivery of health care in different settings, the roles of various health workers, and the sociological and economic aspects of health care.",
            "id": "NURSING/S&APHM/SOCWORK 105",
            "title": "HEALTH CARE SYSTEMS: INTERDISCIPLINARY APPROACH"
        }
    },
    {
        "data": {
            "description": "Introduction to holistic relaxation concepts related to the body, mind  spirit. Examination of the physiology of stress and relaxation, strategies for facilitating wellness and evidence for the same. Experience and reflect upon selected strategies for wellness.",
            "id": "NURSING 513",
            "parent": "NURSING",
            "title": "INTRODUCTION TO RELAXATION: MIND, BODY, & SPIRIT"
        }
    },
    {
        "data": {
            "description": "Introduction to the breadth of careers and educational pathways in the nursing profession. Explore personal interests, capacities, and career goals in relation to nursing career options.",
            "id": "NURSING 100",
            "parent": "NURSING",
            "title": "INTRODUCTION TO THE NURSING PROFESSION"
        }
    },
    {
        "data": {
            "description": "Introduction to the foundational concepts, core functions, and professional values of advanced population health nursing. Contemporary issues in population health will be used to explore and integrate the epidemiological science, theoretical constructs, ethical considerations, and best practice strategies that underlie sound practice.",
            "id": "NURSING 723",
            "parent": "NURSING",
            "title": "POPULATION HEALTH THEORY AND METHODS SEMINAR I: CONTEMPORARY ISSUES & POPULATION HEALTH ETHICS"
        }
    },
    {
        "data": {
            "description": "Introduction to the science behind and strategies for wellness based on a functional health approach. Viewing the body as a complex and integrated system and address the root cause of illness or disease rather than treating only presenting symptoms. Disease manifestation stemming from many factors such as genetics, lifestyle and environment. Lifestyle health practices and health coaching strategies for working with clients or patients. View health through a functional health lens, using several strategies to manage and prevent illness.",
            "id": "NURSING 512",
            "parent": "NURSING",
            "title": "FUNCTIONAL HEALTH AND LIFESTYLE PRACTICE"
        }
    },
    {
        "data": {
            "description": "Learn principles and practices of social justice related to nursing and health in local and global settings. Concepts include health determinants, diverse populations in complex care settings, health outcomes, and interventions for racial and other underrepresented minorities. Expand the understanding of global health by examining global health systems, health and illness concepts on a global level, partnerships enacted in global settings, and the scope of nursing practice in global health. Provides a facilitated forum to critically reflect on their socially constructed identities and the impact these identities have on health care systems. Designed to develop perspective related to global health and nurses as global health actors invested in improving health of the global population as a whole.",
            "id": "NURSING 437",
            "parent": "NURSING",
            "title": "SOCIAL JUSTICE IN LOCAL AND GLOBAL SETTINGS"
        }
    },
    {
        "data": {
            "description": "Learn to provide high quality, person-centered nursing care to older adults, using current research, evidenced-based guidelines, and foundational content to assess, form nursing diagnoses, and manage the complex health needs of older adults by being able to differentiate between healthy and unhealthy aging, explore social determinants of health, provide for safety and well-being, and consider ethical clinical-decision making in geriatrics.",
            "id": "NURSING 433",
            "parent": "NURSING",
            "title": "NURSING CARE OF THE OLDER ADULT"
        }
    },
    {
        "data": {
            "description": "Learning is centered on health systems, policy, and economics. Expand understanding of core nursing competencies such as safe therapeutic care, and health informatics by examining how these concepts operate at a systems-level to influence care and outcomes. Focus is given to emergency preparedness as enacted in a variety of systems. Key conceptual elements of the healthcare system, organization, policy, financing and law and quality improvement and their impact on care and outcomes are examined.",
            "id": "NURSING 442",
            "parent": "NURSING",
            "title": "HEALTH SYSTEMS, POLICY, AND ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Major issues in developing, testing, and using research instruments, including links between concepts, variables, and measures; theories of measurement and scaling, including reliability and validity testing; and using measures in research.",
            "id": "NURSING 805",
            "parent": "NURSING",
            "title": "MEASUREMENT IN HEALTH RESEARCH"
        }
    },
    {
        "data": {
            "description": "Perinatal period: reproductive health, preconception, pregnancy (antepartum), labor and birth (intrapartum), the first 6 weeks after birth (postpartum), and the newborn. Nursing care will focus on health promotion and management for low and high-risk (those with complications) populations. Emphasis on the application of the nursing process, the clinical judgment model, and related core competencies associated with perinatal nursing.",
            "id": "NURSING 430",
            "parent": "NURSING",
            "title": "PERINATAL NURSING"
        }
    },
    {
        "data": {
            "description": "Pharmacotherapeutics content and application for advanced practice nursing. Emphasis on selection of appropriate therapeutics, development of clinical decision-making skills, and examination of legal, ethical, and safety issues in prescribing medications.",
            "id": "NURSING/PHMPRAC 605",
            "title": "PHARMACOTHERAPEUTICS FOR ADVANCED PRACTICE NURSES"
        }
    },
    {
        "data": {
            "description": "Physiological basis and methods of human exercise testing and training. Topics: clinical exercise physiology, exercise testing protocols, cardiopulmonary monitoring, basic ECG interpretation, exercise prescription.",
            "id": "KINES/NURSING 523",
            "title": "CLINICAL EXERCISE TESTING & TRAINING"
        }
    },
    {
        "data": {
            "description": "Prepares to meet the psychosocial health needs of individuals, families, and communities across the lifespan. Explore psychosocial concepts of stress, coping, mood, cognition, and behavior across the health-illness continuum and across practice settings. The human experience of psychosocial health needs is explored in the context of personal attributes, such as genetics, and interpersonal dynamics, such as family and community. Acquire the knowledge, attitudes, and skills needed to collaborate in the treatment and care of client psychosocial health needs.",
            "id": "NURSING 324",
            "parent": "NURSING",
            "title": "MEETING THE PSYCHOSOCIAL HEALTH NEEDS OF INDIVIDUALS, FAMILIES, AND COMMUNITIES"
        }
    },
    {
        "data": {
            "description": "Promotes learning of the research process in nursing through direct experience. Work closely with faculty to determine the nature, scope and design of the research experience. NURSING 700 or 701",
            "id": "NURSING 798",
            "parent": "NURSING",
            "title": "MASTER'S RESEARCH PRACTICUM"
        }
    },
    {
        "data": {
            "description": "Promotes the understanding of altered physiological processes underlying illness and disease. General concepts including etiology, pathogenesis, morphologic changes, and clinical significance are explored from the genetic, molecular, cellular, organ, and systems-levels. Connections between patient symptoms, clinical signs, diagnostics, prognosis, and therapeutic considerations will form the basis for early exposure to clinical reasoning for common acute and chronic diseases across the lifespan.",
            "id": "NURSING 318",
            "parent": "NURSING",
            "title": "PATHOPHYSIOLOGY ESSENTIALS FOR NURSING PRACTICE"
        }
    },
    {
        "data": {
            "description": "Provides a comprehensive overview of the U.S. healthcare system and policy-making process at the local, state, and federal levels, as well as an analysis of global health policies in other countries. Key policy issues covered include Medicare, Medicaid, the uninsured, public health, and healthcare reform. Addresses the role of key stakeholders, including policy-makers, interest groups, and the media on the development of health policy, as well as key forces involved in policy-making, including economics, innovation, social, ethical, and political factors. Examine the role and responsibility of nurse leaders and the impact of health policy on nursing practice at the individual, community, and population level.",
            "id": "NURSING 703",
            "parent": "NURSING",
            "title": "HEALTH CARE AND PUBLIC POLICY"
        }
    },
    {
        "data": {
            "description": "Provides a policy field experience that corresponds to a targeted focus area, phenomenon, or population of interest. Negotiate a policy experience with a selected agency or institution. Analyze relevant policies to your population of interest and actively influence the design, development, and implementation of a policy. Examine strategies to accelerate policy adoption and implementation.",
            "id": "NURSING 847",
            "parent": "NURSING",
            "title": "HEALTH POLICY PRACTICUM"
        }
    },
    {
        "data": {
            "description": "Provides content in theory, concepts, and methods of program planning and evaluation in the context of health care and community health organizations. Provides basic concept related to designing and implementing health services quality improvement projects.",
            "id": "NURSING 761",
            "parent": "NURSING",
            "title": "HEALTH PROGRAM PLANNING, EVALUATION, AND QUALITY IMPROVEMENT"
        }
    },
    {
        "data": {
            "description": "Spend concentrated time in two settings focusing on care to individuals across the lifespan, families, and communities. The concept-based learning activities are aligned with those taught in the companion didactic courses and build on previous learning and experiences. Provide direct care from an evidenced-based perspective, at an increasingly independent level. The learning activities are guided by nursing preceptors in practice settings and by School of Nursing faculty in simulation and seminar settings.",
            "id": "NURSING 436",
            "parent": "NURSING",
            "title": "HEALTH AND ILLNESS CONCEPTS WITH INDIVIDUALS, FAMILIES, AND COMMUNITIES: EXPERIENTIAL LEARNING"
        }
    },
    {
        "data": {
            "description": "Spend concentrated time in two settings focusing on the complex care of individuals across the lifespan, families, and communities. Demonstrate advanced ability to integrate professional nursing related theory and concepts as they develop and implement the plan of care. Mentoring by clinical nursing preceptors in the clinical setting and by School of Nursing faculty in simulation and seminar settings.",
            "id": "NURSING 446",
            "parent": "NURSING",
            "title": "ADVANCED CONCEPTS IN COMPLEX NURSING PRACTICE: EXPERIENTIAL LEARNING"
        }
    },
    {
        "data": {
            "description": "Supervised clinical practicum focuses on the continued development and application of advanced health promotion, assessment and clinical management skills within the context of chronic illness and complex health issues.",
            "id": "NURSING 728",
            "parent": "NURSING",
            "title": "ADVANCED PRACTICE CLINICAL APPLICATION AND ROLE DEVELOPMENT I"
        }
    },
    {
        "data": {
            "description": "Supervised clinical practicum focuses on the continued development and application of advanced health promotion, assessment and clinical management skills within the context of chronic illness and complex health issues.",
            "id": "NURSING 729",
            "parent": "NURSING",
            "title": "ADVANCED PRACTICE CLINICAL APPLICATION AND ROLE DEVELOPMENT II"
        }
    },
    {
        "data": {
            "description": "The senior honors thesis is a directed experience with selected aspects of the research process. Declared in the Nursing Honors Program",
            "id": "NURSING 682",
            "parent": "NURSING",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "The senior honors thesis is directed experience with selected aspects of the research process. Declared in the Nursing Honors Program",
            "id": "NURSING 681",
            "parent": "NURSING",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Theoretical foundation for community health nursing (CHN) applied to school nurse settings. Acquire the theoretical and practical foundations for establishing and maintaining school health nursing services. Content is drawn from nursing and public health sciences and includes topics of health promotion, disease prevention, epidemiology, evidence based practice, ethics, and the role of the CHN. The nursing process is applied with a focus of providing care at the individual through the population level. The ecological model is used to analyze the influence of socioeconomic, environmental, political, and cultural health determinants.",
            "id": "NURSING 470",
            "parent": "NURSING",
            "title": "SCHOOL NURSING IN THE CONTEXT OF COMMUNITY HEALTH PRACTICE"
        }
    },
    {
        "data": {
            "description": "Theoretical, empirical and practical foundation for prevention science as it relates to the prevention of human social problems. Research and evaluation methods, program design strategies, best practices and policy as they relate to the field of prevention are also examined.",
            "id": "EDPSYCH/HDFS/NURSING/SOCWORK 880",
            "title": "PREVENTION SCIENCE"
        }
    },
    {
        "data": {
            "description": "Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Part of a 2-semester sequence withMATH 217; these two courses together are equivalent toMATH 114and221.",
            "id": "MATH 171",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY I"
        }
    },
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics and selected topics in Animal Physiology.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Transition and expansion of leadership role for advanced practice.  Emphasis on the development of effective, ethical leadership styles; interpretation of legal and professional requirements and regulations; examination of the ethics, values, beliefs, and norms of decision-making in interdisciplinary, collaborative practice.",
            "id": "NURSING 704",
            "parent": "NURSING",
            "title": "LEADERSHIP IN ADVANCED PRACTICE NURSING I"
        }
    },
    {
        "data": {
            "id": "ANAT&PHY",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "KINES",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "NURSING",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "PHMPRAC",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ANAT&PHY 335",
            "target": "KINES 314"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 101"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ANAT&PHY 335"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 151"
        }
    },
    {
        "data": {
            "source": "BMI/POPHLTH 551",
            "target": "BMI/STAT 541"
        }
    },
    {
        "data": {
            "source": "BMI/STAT 541",
            "target": "BMI/STAT 542"
        }
    },
    {
        "data": {
            "source": "BMI/STAT 542",
            "target": "MEDICINE/NURSING/POPHLTH 705"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "ANAT&PHY 335"
        }
    },
    {
        "data": {
            "source": "KINES 314",
            "target": "KINES/NURSING 523"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "CHEM 109"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "NURSING 313",
            "target": "NURSING 323"
        }
    },
    {
        "data": {
            "source": "NURSING 313",
            "target": "NURSING 326"
        }
    },
    {
        "data": {
            "source": "NURSING 314",
            "target": "NURSING 324"
        }
    },
    {
        "data": {
            "source": "NURSING 314",
            "target": "NURSING 326"
        }
    },
    {
        "data": {
            "source": "NURSING 314",
            "target": "NURSING 447"
        }
    },
    {
        "data": {
            "source": "NURSING 314",
            "target": "NURSING 448"
        }
    },
    {
        "data": {
            "source": "NURSING 315",
            "target": "NURSING 325"
        }
    },
    {
        "data": {
            "source": "NURSING 315",
            "target": "NURSING 326"
        }
    },
    {
        "data": {
            "source": "NURSING 315",
            "target": "NURSING 435"
        }
    },
    {
        "data": {
            "source": "NURSING 316",
            "target": "NURSING 326"
        }
    },
    {
        "data": {
            "source": "NURSING 317",
            "target": "NURSING 326"
        }
    },
    {
        "data": {
            "source": "NURSING 323",
            "target": "NURSING 430"
        }
    },
    {
        "data": {
            "source": "NURSING 323",
            "target": "NURSING 431"
        }
    },
    {
        "data": {
            "source": "NURSING 323",
            "target": "NURSING 432"
        }
    },
    {
        "data": {
            "source": "NURSING 323",
            "target": "NURSING 434"
        }
    },
    {
        "data": {
            "source": "NURSING 323",
            "target": "NURSING 436"
        }
    },
    {
        "data": {
            "source": "NURSING 323",
            "target": "NURSING 437"
        }
    },
    {
        "data": {
            "source": "NURSING 323",
            "target": "NURSING 447"
        }
    },
    {
        "data": {
            "source": "NURSING 323",
            "target": "NURSING 448"
        }
    },
    {
        "data": {
            "source": "NURSING 324",
            "target": "NURSING 436"
        }
    },
    {
        "data": {
            "source": "NURSING 324",
            "target": "NURSING 447"
        }
    },
    {
        "data": {
            "source": "NURSING 324",
            "target": "NURSING 448"
        }
    },
    {
        "data": {
            "source": "NURSING 325",
            "target": "NURSING 435"
        }
    },
    {
        "data": {
            "source": "NURSING 326",
            "target": "NURSING 430"
        }
    },
    {
        "data": {
            "source": "NURSING 326",
            "target": "NURSING 431"
        }
    },
    {
        "data": {
            "source": "NURSING 326",
            "target": "NURSING 432"
        }
    },
    {
        "data": {
            "source": "NURSING 326",
            "target": "NURSING 433"
        }
    },
    {
        "data": {
            "source": "NURSING 326",
            "target": "NURSING 447"
        }
    },
    {
        "data": {
            "source": "NURSING 326",
            "target": "NURSING 448"
        }
    },
    {
        "data": {
            "source": "NURSING 434",
            "target": "NURSING 442"
        }
    },
    {
        "data": {
            "source": "NURSING 434",
            "target": "NURSING 443"
        }
    },
    {
        "data": {
            "source": "NURSING 434",
            "target": "NURSING 444"
        }
    },
    {
        "data": {
            "source": "NURSING 434",
            "target": "NURSING 445"
        }
    },
    {
        "data": {
            "source": "NURSING 434",
            "target": "NURSING 447"
        }
    },
    {
        "data": {
            "source": "NURSING 434",
            "target": "NURSING 448"
        }
    },
    {
        "data": {
            "source": "NURSING 435",
            "target": "NURSING 442"
        }
    },
    {
        "data": {
            "source": "NURSING 435",
            "target": "NURSING 444"
        }
    },
    {
        "data": {
            "source": "NURSING 435",
            "target": "NURSING 445"
        }
    },
    {
        "data": {
            "source": "NURSING 436",
            "target": "NURSING 442"
        }
    },
    {
        "data": {
            "source": "NURSING 436",
            "target": "NURSING 444"
        }
    },
    {
        "data": {
            "source": "NURSING 436",
            "target": "NURSING 445"
        }
    },
    {
        "data": {
            "source": "NURSING 436",
            "target": "NURSING 446"
        }
    },
    {
        "data": {
            "source": "NURSING 437",
            "target": "NURSING 442"
        }
    },
    {
        "data": {
            "source": "NURSING 437",
            "target": "NURSING 444"
        }
    },
    {
        "data": {
            "source": "NURSING 437",
            "target": "NURSING 445"
        }
    },
    {
        "data": {
            "source": "NURSING 601",
            "target": "NURSING 726"
        }
    },
    {
        "data": {
            "source": "NURSING 601",
            "target": "NURSING 736"
        }
    },
    {
        "data": {
            "source": "NURSING 702",
            "target": "NURSING 720"
        }
    },
    {
        "data": {
            "source": "NURSING 702",
            "target": "NURSING 723"
        }
    },
    {
        "data": {
            "source": "NURSING 704",
            "target": "NURSING 601"
        }
    },
    {
        "data": {
            "source": "NURSING 706",
            "target": "NURSING 906"
        }
    },
    {
        "data": {
            "source": "NURSING 712",
            "target": "NURSING 713"
        }
    },
    {
        "data": {
            "source": "NURSING 712",
            "target": "NURSING 830"
        }
    },
    {
        "data": {
            "source": "NURSING 713",
            "target": "NURSING 830"
        }
    },
    {
        "data": {
            "source": "NURSING 720",
            "target": "NURSING 721"
        }
    },
    {
        "data": {
            "source": "NURSING 721",
            "target": "NURSING 724"
        }
    },
    {
        "data": {
            "source": "NURSING 723",
            "target": "NURSING 721"
        }
    },
    {
        "data": {
            "source": "NURSING 723",
            "target": "NURSING 730"
        }
    },
    {
        "data": {
            "source": "NURSING 724",
            "target": "NURSING 725"
        }
    },
    {
        "data": {
            "source": "NURSING 726",
            "target": "NURSING 727"
        }
    },
    {
        "data": {
            "source": "NURSING 726",
            "target": "NURSING 728"
        }
    },
    {
        "data": {
            "source": "NURSING 727",
            "target": "NURSING 729"
        }
    },
    {
        "data": {
            "source": "NURSING 727",
            "target": "NURSING 826"
        }
    },
    {
        "data": {
            "source": "NURSING 728",
            "target": "NURSING 726"
        }
    },
    {
        "data": {
            "source": "NURSING 728",
            "target": "NURSING 727"
        }
    },
    {
        "data": {
            "source": "NURSING 729",
            "target": "NURSING 727"
        }
    },
    {
        "data": {
            "source": "NURSING 729",
            "target": "NURSING 826"
        }
    },
    {
        "data": {
            "source": "NURSING 729",
            "target": "NURSING 828"
        }
    },
    {
        "data": {
            "source": "NURSING 784",
            "target": "NURSING 787"
        }
    },
    {
        "data": {
            "source": "NURSING 806",
            "target": "NURSING 906"
        }
    },
    {
        "data": {
            "source": "NURSING 811",
            "target": "NURSING 726"
        }
    },
    {
        "data": {
            "source": "NURSING 811",
            "target": "NURSING 736"
        }
    },
    {
        "data": {
            "source": "NURSING 815",
            "target": "NURSING 818"
        }
    },
    {
        "data": {
            "source": "NURSING 828",
            "target": "NURSING 829"
        }
    },
    {
        "data": {
            "source": "NURSING 847",
            "target": "NURSING 830"
        }
    },
    {
        "data": {
            "source": "NURSING/PHMPRAC 605",
            "target": "NURSING 726"
        }
    },
    {
        "data": {
            "source": "NURSING/PHMPRAC 605",
            "target": "NURSING 736"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 555",
            "target": "NURSING/PHMPRAC 674"
        }
    },
    {
        "data": {
            "source": "POPHLTH/SOC 797",
            "target": "MEDICINE/NURSING/POPHLTH 705"
        }
    }
]