[
    {
        "data": {
            "description": "Integration of foundational nutrition and exercise physiology principles with sports nutrition concepts from a clinical perspective. Evaluation of the unique nutritional requirements for athletes/active individuals on body composition, performance, and timing of nutrients and hydration related to pre-activity, during activity, and post-activity recovery. Application of these concepts with clinical conditions requiring specialized sports nutrition approaches such as diabetes, gastrointestinal disorders, eating disorders, micronutrients deficiencies and life cycle populations (youth/adolescent, pregnant and masters' athletes). Analysis of sports nutrition research to utilize evidenced-based practice and recommendations around ergogenic aids/supplements and other sports nutrition topics.",
            "id": "NUTRSCI 750",
            "parent": "NUTRSCI",
            "title": "ADVANCED SPORTS NUTRITION"
        }
    },
    {
        "data": {
            "description": "Accelerated coverage of topics in general chemistry, including introduction to laboratory techniques. Topics include atomic and molecular structure, chemical equilibrium, acid-base chemistry, thermodynamics, kinetics, and electrochemistry.",
            "id": "CHEM 109",
            "parent": "CHEM",
            "title": "ADVANCED GENERAL CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Advanced skills and evolving methods of nutritional assessment. Measurement and interpretation of physical examination and laboratory parameters. Diagnosing malnutrition and nutrient deficiencies, including clinical characteristics used to identify and label the degree of malnutrition.",
            "id": "NUTRSCI 720",
            "parent": "NUTRSCI",
            "title": "ADVANCED NUTRITION ASSESSMENT"
        }
    },
    {
        "data": {
            "description": "Advanced study of the metabolic demands of critical illness and how these alterations influence the nutritional needs of critical care patients in various disease states. Using an evidence-based medical approach, students will assess nutrient requirements and determine best methods of nutrient delivery in various disease states. Anthropometric measures and hematological indices will be incorporated to assess nutritional status and monitor response to nutritional therapies.",
            "id": "NUTRSCI 650",
            "parent": "NUTRSCI",
            "title": "ADVANCED CLINICAL NUTRITION: CRITICAL CARE AND NUTRITION SUPPORT"
        }
    },
    {
        "data": {
            "description": "Advanced topics surrounding pathology, medical nutrition therapy, and nutrition support in relation to alterations in nutrition and metabolism that accompany disease stated. Research related to therapeutic nutrition.",
            "id": "NUTRSCI 632",
            "parent": "NUTRSCI",
            "title": "CLINICAL NUTRITION II"
        }
    },
    {
        "data": {
            "description": "An overview of the nutrition and dietetics professions: career options; professional development; professional references and resources; credentialing; professional issues.",
            "id": "NUTRSCI 200",
            "parent": "NUTRSCI",
            "title": "PROFESSIONAL SKILLS  IN DIETETICS"
        }
    },
    {
        "data": {
            "description": "Application of current theories and techniques of counseling and education to the field of nutrition and dietetics. Practical application of communication techniques, client-centered counseling methods, motivational interviewing, learning theories and behavior change techniques, and factors affecting eating patterns. Nutrition psychology and the psychoanalytic approach to nutrition counseling will be emphasized in the class. Principles of group counseling/facilitation and instructional material/media design.",
            "id": "NUTRSCI 652",
            "parent": "NUTRSCI",
            "title": "ADVANCED NUTRITION COUNSELING AND EDUCATION"
        }
    },
    {
        "data": {
            "description": "Biochemical and physiological basis of the nutritional requirements of humans.",
            "id": "NUTRSCI 332",
            "parent": "NUTRSCI",
            "title": "HUMAN NUTRITIONAL NEEDS"
        }
    },
    {
        "data": {
            "description": "Chemistry, nutrition, and metabolism of biological systems.",
            "id": "BIOCHEM 501",
            "parent": "BIOCHEM",
            "title": "INTRODUCTION TO BIOCHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Clinical problem solving, assessing medical record data, evaluating food intake, planning modified diets, and reviewing medical and research literature related to certain disease states/conditions. Develops critical thinking, teamwork and communication skills needed by the dietetic intern and dietitian.",
            "id": "NUTRSCI 642",
            "parent": "NUTRSCI",
            "title": "APPLICATIONS IN CLINICAL NUTRITION II"
        }
    },
    {
        "data": {
            "description": "Clinical problem solving, assessing medical record data, evaluating food intake, planning modified diets, and reviewing medical and research literature related to certain diseases/conditions. Develops critical thinking, teamwork and communication skills needed by the dietetic intern and dietitian.",
            "id": "NUTRSCI 641",
            "parent": "NUTRSCI",
            "title": "APPLICATIONS IN CLINICAL NUTRITION I"
        }
    },
    {
        "data": {
            "description": "Community nutrition as it applies to clinical nutrition practice: programs, resources and issues supporting clinical nutrition practice in the community.",
            "id": "NUTRSCI 725",
            "parent": "NUTRSCI",
            "title": "ADVANCED COMMUNITY NUTRITION"
        }
    },
    {
        "data": {
            "description": "Core concepts in human physiology from cells to organ-systems via online lectures and active learning activities including laboratory experiments. Topics include homeostasis, membrane transport, cellular physiology, regulation of metabolism, and functions of the nervous, endocrine, muscular, reproductive, cardiovascular, respiratory, renal, and gastrointestinal system.",
            "id": "ANAT&PHY 335",
            "parent": "ANAT&PHY",
            "title": "PHYSIOLOGY"
        }
    },
    {
        "data": {
            "description": "Core organic chemistry concepts of structure, reactivity, and synthesis with regards to the functional groups commonly found in commercial and biological substances. Covers a selection of topics fromCHEM 343and345.",
            "id": "CHEM 341",
            "parent": "CHEM",
            "title": "ELEMENTARY ORGANIC CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Covers basic and applied biochemical principles related to human disease. Topics such as: cancer, including cell cycle regulation, oncogenes and tumor suppressors, and cellular metabolism; metabolic disorders, including cardiovascular disease, metabolic syndrome, and diabetes;  biotechnology, including metabolomics, CRISPR-based genetic screens, and experimental models of human disease.",
            "id": "BIOCHEM/NUTRSCI 560",
            "title": "PRINCIPLES OF HUMAN DISEASE AND BIOTECHNOLOGY"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Current topics in Nutritional Sciences and undergraduate research presentations.",
            "id": "NUTRSCI 500",
            "parent": "NUTRSCI",
            "title": "UNDERGRADUATE CAPSTONE SEMINAR LABORATORY"
        }
    },
    {
        "data": {
            "description": "Directed study under direct guidance of a Nutritional Science faculty member or instructional academic staff member.",
            "id": "NUTRSCI 699",
            "parent": "NUTRSCI",
            "title": "SPECIAL PROBLEMS"
        }
    },
    {
        "data": {
            "description": "Discuss nutrient requirements, composition of ingredients used to meet requirements and the mathematical steps involved in diet formulation with emphasis on research animals and human subjects.",
            "id": "ANSCI/NUTRSCI 626",
            "title": "EXPERIMENTAL DIET DESIGN"
        }
    },
    {
        "data": {
            "description": "Evaluate research and apply management principles in dietetics practice. Enhance leadership and management skills for settings such as hospitals, long-term care facilities, schools, universities, prisons, and other locations where food and nutrition services are administered.",
            "id": "NUTRSCI 657",
            "parent": "NUTRSCI",
            "title": "MANAGEMENT IN DIETETICS"
        }
    },
    {
        "data": {
            "description": "Examination of various physiological states and how they affect metabolic pathways. Discussion of a number of special topics related to the unique roles of various tissues and to metabolic pathways in disease states, including adipocyte biology, beta-cell biology, epigenetics, inflammation, and aging related diseases.",
            "id": "BIOCHEM/NUTRSCI 645",
            "title": "MOLECULAR CONTROL OF METABOLISM AND METABOLIC DISEASE"
        }
    },
    {
        "data": {
            "description": "Exploration of cultural competency and humility as a factor in reducing nutrition-related health disparities, and an opportunity to foster community resilience within the United States. Analysis of how personal cultural perspectives can shape biases and stereotypes that can widen the health disparity gap. Principles of food and culture utilized to compare cultural perspectives of health and well-being, including influences of spirituality and religiosity on food choice and dietary patterns. Includes content collaborators and guest speakers from a variety of communities, and identities.",
            "id": "NUTRSCI 377",
            "parent": "NUTRSCI",
            "title": "CULTURAL ASPECTS OF FOOD AND NUTRITION"
        }
    },
    {
        "data": {
            "description": "Exploration of current challenges and research approaches related to the progress of nutritional sciences in the era of precision nutrition. Topics include limitations of population-based approaches to establishing dietary guidelines, hurdles to developing biomarkers for determining individual nutritional status, the impact of genetics, epigenetics, the microbiome, diet interactions, and other factors on nutritional and metabolic variability among people, and the ways in which precision nutrition can revolutionize how nutrition recommendations are devised and delivered to the public.",
            "id": "NUTRSCI 618",
            "parent": "NUTRSCI",
            "title": "RESEARCH APPROACHES IN THE ERA OF PRECISION NUTRITION"
        }
    },
    {
        "data": {
            "description": "Fundamentals in human macronutrient metabolism and its role in health and disease. Biochemistry and physiology of macronutrient digestion, anabolism, and catabolism. Disorders of energy metabolism (obesity, type 1 and type 2 diabetes, starvation). Metabolic effects of fiber and the microbiota. Body composition and energy assessment. Taught in an online format using lectures, guided readings, and projects.",
            "id": "NUTRSCI 710",
            "parent": "NUTRSCI",
            "title": "HUMAN ENERGY METABOLISM"
        }
    },
    {
        "data": {
            "description": "General biological principles. Topics include: evolution, ecology, animal behavior, cell structure and function, genetics and molecular genetics and the physiology of a variety of organ systems emphasizing function in humans.",
            "id": "BIOLOGY/ZOOLOGY 101",
            "title": "ANIMAL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Genetic factors that modulate the relationships between diet, health, and disease risks, including the effects of differences in our genetic makeup (Nutrigenetics), the regulation of gene expression by nutrients and dietary patterns (Nutrigenomics), and the interactions between diet, gut microbiome, and human hosts (Metagenomics).",
            "id": "NUTRSCI 711",
            "parent": "NUTRSCI",
            "title": "PERSONALIZED NUTRITION: GENETICS, GENOMICS, AND METAGENOMICS"
        }
    },
    {
        "data": {
            "description": "Highlights the important interaction between nutrition and the human gastrointestinal tract (GI). Includes exploration of various gastrointestinal related disorders and diseases, and covers contemporary issues, current research, and real-life examples applicable to the field of nutrition, and nutrition providers. Includes instruction from content collaborators and GI nutrition experts. Apply the pathophysiology of GI disorders and disease, deconstruct differential diagnoses; and describe current medical management and dietary requirements of an individual and translate this into appropriate medical nutritional therapy.",
            "id": "NUTRSCI 726",
            "parent": "NUTRSCI",
            "title": "NUTRITIONAL MANAGEMENT OF GASTROINTESTINAL DISORDERS"
        }
    },
    {
        "data": {
            "description": "Hunger and poverty in developing countries and the United States. Topics include: nutrition and health, population, food production and availability, and income distribution and employment.",
            "id": "AAE/AGRONOMY/NUTRSCI 350",
            "title": "WORLD HUNGER AND MALNUTRITION"
        }
    },
    {
        "data": {
            "description": "Independent research with assigned instructor. Research projects determined by agreement between instructor and student.",
            "id": "NUTRSCI 991",
            "parent": "NUTRSCI",
            "title": "RESEARCH NUTRITION"
        }
    },
    {
        "data": {
            "description": "Individual study and research for students completing theses under direct guidance of a Nutritional Science faculty or instructional academic staff member.",
            "id": "NUTRSCI 681",
            "parent": "NUTRSCI",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Individual study and research for students completing theses under direct guidance of a Nutritional Science faculty or instructional academic staff member.",
            "id": "NUTRSCI 682",
            "parent": "NUTRSCI",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Individual study and research for students completing theses under direct guidance of a Nutritional Science faculty or instructional academic staff member.",
            "id": "NUTRSCI 691",
            "parent": "NUTRSCI",
            "title": "SENIOR THESIS-NUTRITION"
        }
    },
    {
        "data": {
            "description": "Individual study and research for students completing theses under direct guidance of a Nutritional Science faculty or instructional academic staff member.",
            "id": "NUTRSCI 692",
            "parent": "NUTRSCI",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Influence of nutrition on growth and development; physiological basis of nutritional requirements throughout the life span, including the relationship of food habits and nutrition to selected chronic diseases; principles of nutritional intervention in community programs.",
            "id": "NUTRSCI 431",
            "parent": "NUTRSCI",
            "title": "NUTRITION IN THE LIFE SPAN"
        }
    },
    {
        "data": {
            "description": "Instructional orientation to teaching at the higher education level in the agricultural and life sciences, direct teaching experience under faculty supervision, experience in testing and evaluation of students, and the analysis of teaching performance.",
            "id": "NUTRSCI 799",
            "parent": "NUTRSCI",
            "title": "PRACTICUM IN NUTRITIONAL SCIENCES TEACHING"
        }
    },
    {
        "data": {
            "description": "Interactively address the knowledge, approach, and professional skills (conceptual, technical, and writing) required to create a successful grant proposal and initiate a career in research. Format is focused on the planning and completion of NIH-style grant proposals. Lectures and workshops will address the development of long term goals, hypotheses, and specific aims, as well as research design and methodology. Basic guidelines and approaches to proposal review and scoring are also covered. Several key components of a grant proposal will be generated using an iterative and peer-supported process.",
            "id": "NUTRSCI 745",
            "parent": "NUTRSCI",
            "title": "GRANT WRITING FOR NUTRITIONAL SCIENCES RESEARCH"
        }
    },
    {
        "data": {
            "description": "Internship under guidance of a Nutritional Sciences faculty or instructional academic staff member and internship site supervisor. Students are responsible for arranging the work and credits with the Nutritional Sciences faculty or instructional academic staff member and the internship site supervisor.",
            "id": "NUTRSCI 399",
            "parent": "NUTRSCI",
            "title": "COORDINATIVE INTERNSHIP/COOPERATIVE EDUCATION"
        }
    },
    {
        "data": {
            "description": "Interpret research relating to nutrition during the aging process. Gain an understanding of acute and chronic conditions in older persons, both in hospital and the community. Examine the impact of aging on organ systems and address the relationship among physiologic aging, nutrition, and disease.",
            "id": "NUTRSCI 655",
            "parent": "NUTRSCI",
            "title": "NUTRITION IN AGING"
        }
    },
    {
        "data": {
            "description": "Introduces students to global health concepts through multidisciplinary speakers dedicated to improving health through their unique training.  It targets students with an interest in public health and those who wish to learn how their field impacts their global issues.",
            "id": "ENTOM/NUTRSCI 203",
            "title": "INTRODUCTION TO GLOBAL HEALTH"
        }
    },
    {
        "data": {
            "description": "Introduction to the nutrition care process, including pathology, medical nutrition therapy, and nutrition support in relation to alterations in nutrition and metabolism that accompany disease states. Research related to therapeutic nutrition.",
            "id": "NUTRSCI 631",
            "parent": "NUTRSCI",
            "title": "CLINICAL NUTRITION I"
        }
    },
    {
        "data": {
            "description": "Lectures in nutrition with a substantial background in biochemistry. Emphasis on biochemical and physiological fundamentals of nutrition. Discussion of protein, fat, carbohydrate, energy, minerals and vitamins and their roles and interrelationships in nutrition and metabolism.",
            "id": "BIOCHEM/NUTRSCI 510",
            "title": "NUTRITIONAL BIOCHEMISTRY AND METABOLISM"
        }
    },
    {
        "data": {
            "description": "Micronutrients explores the function of vitamins and essential mineral nutrients from the biochemical and nutritional perspective with emphasis on issues essential for clinical nutrition.",
            "id": "NUTRSCI 715",
            "parent": "NUTRSCI",
            "title": "MICRONUTRIENTS: HUMAN PHYSIOLOGY AND DISEASE"
        }
    },
    {
        "data": {
            "description": "Nutrients and their assimilation, function, and interactions that affect metabolism in mammals.  Differences among species will be used to emphasize unique digestive and physiological functions and how these differences affect metabolism of nutrients. Humans will be used in some comparisons. Follows physiological progression of nutrients, starting with an overview of the digestive tract followed by water and builds on specific roles of nutrients and substrates needed to provide basic processes required for maintenance, tissue accretion, and homeostatic regulation of nutrients.",
            "id": "ANSCI/DYSCI/NUTRSCI 311",
            "title": "COMPARATIVE ANIMAL NUTRITION"
        }
    },
    {
        "data": {
            "description": "Nutrition and its relationship to humans and their biological, social, and physical environment; current issues and concerns that affect the nutritional status of various population groups.",
            "id": "NUTRSCI 132",
            "parent": "NUTRSCI",
            "title": "NUTRITION TODAY"
        }
    },
    {
        "data": {
            "description": "Overview of career paths related to human nutrition, a multidisciplinary domain that explores the complex relationship between dietary intake and health, encompassing diverse areas from scientific research, healthcare, education, product development, to policy and intervention.",
            "id": "NUTRSCI 100",
            "parent": "NUTRSCI",
            "title": "FUELING YOUR FUTURE WITH CAREERS IN NUTRITION"
        }
    },
    {
        "data": {
            "description": "Overview of the principles and processes necessary to evaluate and utilize bioactive food components and dietary supplements in practice, including federal regulations. Current scientific evidence supporting or refuting the biochemical and physiological efficacy of select bioactive food components and dietary supplements will be addressed.",
            "id": "NUTRSCI 675",
            "parent": "NUTRSCI",
            "title": "NUTRACEUTICALS FOR HEALTHCARE PROFESSIONALS"
        }
    },
    {
        "data": {
            "description": "Pediatric nutritional requirements with emphasis on issues related to evidence-based medical nutrition therapy.",
            "id": "NUTRSCI 651",
            "parent": "NUTRSCI",
            "title": "ADVANCED CLINICAL NUTRITION - PEDIATRICS"
        }
    },
    {
        "data": {
            "description": "Physiology, biochemistry and genetics of human obesity and diabetes. Critical review of current research on their etiology and treatment.",
            "id": "NUTRSCI 625",
            "parent": "NUTRSCI",
            "title": "ADVANCED NUTRITION: OBESITY AND DIABETES"
        }
    },
    {
        "data": {
            "description": "Presentation of original research results; discussion of recent articles in animal metabolism and nutrition.",
            "id": "BIOCHEM/NUTRSCI 901",
            "title": "SEMINAR-NUTRITION AND METABOLISM (ADVANCED)"
        }
    },
    {
        "data": {
            "description": "Presentation of reports from current journals of nutritional sciences.",
            "id": "NUTRSCI 600",
            "parent": "NUTRSCI",
            "title": "INTRODUCTORY SEMINAR IN NUTRITION"
        }
    },
    {
        "data": {
            "description": "Presents foundational principles and evidenced based recommendations for fueling active bodies and how proper nutrition relates to weight management, muscle development, recovery and performance.  Integrates counseling methods and techniques used for working with active populations through readings, learning activities and expert guest lecturers.  Features reading and interpreting scientific studies related to sports nutrition and interdisciplinary guest speakers representing sport performance and wellness programs.",
            "id": "NUTRSCI 550",
            "parent": "NUTRSCI",
            "title": "NUTRITION AND COUNSELING FOR ATHLETIC PERFORMANCE"
        }
    },
    {
        "data": {
            "description": "Principles and application of chemical equilibrium, coordination chemistry, oxidation-reduction and electrochemistry, kinetics, nuclear chemistry, introduction to organic chemistry, and chemistry laboratory skills.",
            "id": "CHEM 104",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Principles underlying the control of metabolism as it applies to macronutrients. Discusses advanced aspects of metabolic control. Metabolism of protein and amino acids, fat, and carbohydrate. Discusses fuel sensing and metabolism in disease.",
            "id": "BIOCHEM/NUTRSCI 619",
            "title": "ADVANCED NUTRITION: INTERMEDIARY METABOLISM OF MACRONUTRIENTS"
        }
    },
    {
        "data": {
            "description": "Provides an area equivalency for courses taken on Madison Study Abroad Programs that do not equate to existing UW courses. Enrollment in a UW-Madison resident study abroad program.",
            "id": "NUTRSCI 400",
            "parent": "NUTRSCI",
            "title": "STUDY ABROAD IN NUTRITIONAL SCIENCES"
        }
    },
    {
        "data": {
            "description": "Provides both scientific knowledge and application of nutrition related to exercise, health, and sports.",
            "id": "KINES/NUTRSCI 525",
            "title": "NUTRITION IN PHYSICAL ACTIVITY AND HEALTH"
        }
    },
    {
        "data": {
            "description": "Provides undergraduate students of all disciplines with an introduction to the field of epidemiology. As the \"detectives of public health,\" epidemiologists investigate the causes of disease, track outbreaks, screen and monitor the health of populations, and design studies to track health over time. Epidemiological research is used to identify groups at-risk for disease, guide public health programs and policies and generate hypotheses about the causes of diseases which can inform further research. Also examines association and causality, study design, and limitations to epidemiological evidence, drawing from real examples, both current and historical.",
            "id": "NUTRSCI 379",
            "parent": "NUTRSCI",
            "title": "INTRODUCTION TO EPIDEMIOLOGY"
        }
    },
    {
        "data": {
            "description": "Research use and development as it applies to clinical nutrition practice: effective use of the literature in evidence based practice and research development, problem development, methodology, analysis and reporting of results and conclusions.",
            "id": "NUTRSCI 653",
            "parent": "NUTRSCI",
            "title": "CLINICAL NUTRITION RESEARCH"
        }
    },
    {
        "data": {
            "description": "Research work under direct guidance of a Nutritional Sciences faculty or instructional academic staff member. Students are responsible for arranging the work and credits with the supervising instructor. Intended for students in the CALS Honors Program.",
            "id": "NUTRSCI 289",
            "parent": "NUTRSCI",
            "title": "HONORS INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Research work under direct guidance of a Nutritional Sciences faculty or instructional academic staff member. Students are responsible for arranging the work and credits with the supervising instructor.",
            "id": "NUTRSCI 299",
            "parent": "NUTRSCI",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Scientific knowledge of the metabolic functions, metabolism and nutritional requirements for some of the water soluble vitamins and all of the fat soluble vitamins.",
            "id": "NUTRSCI 627",
            "parent": "NUTRSCI",
            "title": "ADVANCED NUTRITION: VITAMINS"
        }
    },
    {
        "data": {
            "description": "Seminar features expert presentations of current research and issue-based applications that represent the breadth of nutritional sciences; topics investigate problems \"from molecules to communities\".",
            "id": "NUTRSCI 931",
            "parent": "NUTRSCI",
            "title": "SEMINAR-NUTRITION"
        }
    },
    {
        "data": {
            "description": "Seminars on topics in nutritional sciences of interest to Nutritional Sciences dissertators and reports on doctoral student research.",
            "id": "NUTRSCI 731",
            "parent": "NUTRSCI",
            "title": "RESEARCH IN PROGRESS SEMINAR"
        }
    },
    {
        "data": {
            "description": "Special topics on contemporary issues relevant to graduate students studying health and nutrition.",
            "id": "NUTRSCI 875",
            "parent": "NUTRSCI",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "Special topics on contemporary issues relevant to undergraduate students studying health and nutrition.",
            "id": "NUTRSCI 375",
            "parent": "NUTRSCI",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "Specialized educational experiences that address a broad range of global health topics through interdisciplinary approaches to health and include participation in applied public health activities or service learning projects with communities and partner organizations.",
            "id": "INTER-AG/NUTRSCI 421",
            "title": "GLOBAL HEALTH FIELD EXPERIENCE"
        }
    },
    {
        "data": {
            "description": "Stoichiometry and the mole concept, the behavior of gases, liquids and solids, thermochemistry, electronic structure of atoms and chemical bonding, descriptive chemistry of selected elements and compounds, intermolecular forces, and chemistry laboratory skills.",
            "id": "CHEM 103",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Techniques used to evaluate relationships of diet to health and disease in human populations; integration of knowledge gained with results of animal and clinical studies toward understanding dietary risk or protective factors for disease. Includes advanced diet assessment and basic epidemiologic approaches.",
            "id": "NUTRSCI/POPHLTH 621",
            "title": "INTRODUCTION TO NUTRITIONAL EPIDEMIOLOGY"
        }
    },
    {
        "data": {
            "description": "The emerging role of the electronic storage, retrieval and dissemination of food and nutrition related data and the effective use of information for problem solving and decision-making for the dietetics professional.",
            "id": "NUTRSCI 721",
            "parent": "NUTRSCI",
            "title": "NUTRITION INFORMATICS"
        }
    },
    {
        "data": {
            "description": "The first of two supervised practice experiences in nutrition and dietetics at University of Wisconsin Hospital and Clinics and affiliated sites. Dietetic interns apply their academic training, furthering their competency in: clinical nutrition, food systems management, research, and community experiences.",
            "id": "NUTRSCI 670",
            "parent": "NUTRSCI",
            "title": "NUTRITION AND DIETETICS PRACTICUM I"
        }
    },
    {
        "data": {
            "description": "The foundations and practice of community nutrition and health equity. Factors and resources affecting community nutrition programs and delivery of nutrition and education programs to diverse communities and vulnerable populations.",
            "id": "NUTRSCI 540",
            "parent": "NUTRSCI",
            "title": "COMMUNITY NUTRITION AND HEALTH EQUITY"
        }
    },
    {
        "data": {
            "description": "The second of two supervised practice experiences in nutrition and dietetics at University of Wisconsin Hospital and Clinics and affiliated sites. Dietetic interns apply their academic training, furthering their competency in: clinical nutrition, food systems management, research, and community experiences.",
            "id": "NUTRSCI 671",
            "parent": "NUTRSCI",
            "title": "NUTRITION AND DIETETICS PRACTICUM II"
        }
    },
    {
        "data": {
            "description": "The two semester sequenceMATH 112-MATH 113covers similar material asMATH 114, but in a slower pace. Not recommended for students with less than an AB inMATH 96.",
            "id": "MATH 114",
            "parent": "MATH",
            "title": "ALGEBRA AND TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "Topics discussed in regard to minerals are: metabolic roles; absorption, excretion, transport and cellular metabolism; nutritional and toxicological standards for humans and animal models; bioavailability; genetic interactions; and research methodologies.",
            "id": "NUTRSCI 623",
            "parent": "NUTRSCI",
            "title": "ADVANCED NUTRITION: MINERALS"
        }
    },
    {
        "data": {
            "description": "Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Part of a 2-semester sequence withMATH 217; these two courses together are equivalent toMATH 114and221.",
            "id": "MATH 171",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY I"
        }
    },
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics and selected topics in Animal Physiology.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Varied topics in clinical and human nutrition.",
            "id": "NUTRSCI 881",
            "parent": "NUTRSCI",
            "title": "SEMINAR-TOPICS IN HUMAN AND CLINICAL NUTRITION"
        }
    },
    {
        "data": {
            "id": "ANAT&PHY",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "BIOCHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "NUTRSCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ANAT&PHY 335",
            "target": "KINES/NUTRSCI 525"
        }
    },
    {
        "data": {
            "source": "ANAT&PHY 335",
            "target": "NUTRSCI 431"
        }
    },
    {
        "data": {
            "source": "ANAT&PHY 335",
            "target": "NUTRSCI 675"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 501",
            "target": "ANSCI/DYSCI/NUTRSCI 311"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 501",
            "target": "BIOCHEM/NUTRSCI 510"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 501",
            "target": "BIOCHEM/NUTRSCI 560"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 501",
            "target": "BIOCHEM/NUTRSCI 645"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 501",
            "target": "NUTRSCI 631"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 501",
            "target": "NUTRSCI 675"
        }
    },
    {
        "data": {
            "source": "BIOCHEM/NUTRSCI 510",
            "target": "NUTRSCI 500"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 101"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ANAT&PHY 335"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 151"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "NUTRSCI 332"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "NUTRSCI 332"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 341"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "ANAT&PHY 335"
        }
    },
    {
        "data": {
            "source": "CHEM 341",
            "target": "BIOCHEM 501"
        }
    },
    {
        "data": {
            "source": "MATH 114",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "CHEM 109"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 114"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "NUTRSCI 332",
            "target": "NUTRSCI 132"
        }
    },
    {
        "data": {
            "source": "NUTRSCI 332",
            "target": "NUTRSCI 431"
        }
    },
    {
        "data": {
            "source": "NUTRSCI 332",
            "target": "NUTRSCI 550"
        }
    },
    {
        "data": {
            "source": "NUTRSCI 332",
            "target": "NUTRSCI 631"
        }
    },
    {
        "data": {
            "source": "NUTRSCI 431",
            "target": "NUTRSCI 500"
        }
    },
    {
        "data": {
            "source": "NUTRSCI 431",
            "target": "NUTRSCI 540"
        }
    },
    {
        "data": {
            "source": "NUTRSCI 431",
            "target": "NUTRSCI 631"
        }
    },
    {
        "data": {
            "source": "NUTRSCI 631",
            "target": "NUTRSCI 200"
        }
    },
    {
        "data": {
            "source": "NUTRSCI 631",
            "target": "NUTRSCI 632"
        }
    },
    {
        "data": {
            "source": "NUTRSCI 631",
            "target": "NUTRSCI 641"
        }
    },
    {
        "data": {
            "source": "NUTRSCI 631",
            "target": "NUTRSCI 642"
        }
    }
]