[
    {
        "data": {
            "description": "Occupational therapy's role in the history and continuing evolution of health care, education, and social welfare. Discussion of the theoretical, evidence, and policy trends influencing occupational therapy practice across settings. Emphasizes development of leadership skills for shaping, advocating and guiding occupational therapy through a continually evolving practice landscape.",
            "id": "OCCTHER 812",
            "parent": "OCCTHER",
            "title": "CURRENT TRENDS SHAPING OCCUPATIONAL THERAPY PRACTICE"
        }
    },
    {
        "data": {
            "description": "Overview of the historical, theoretical and current practices of leadership, management and advocacy in health care, education and social service settings. Includes a reflective analysis of the student's own leadership and management style. Apply key principles of effective networking, collaboration and interdisciplinary practice to further develop leadership competencies.",
            "id": "OCCTHER 811",
            "parent": "OCCTHER",
            "title": "APPLIED LEADERSHIP AND MANAGEMENT IN OT"
        }
    },
    {
        "data": {
            "description": "Promote students' wellness as they manage graduate school and its demands. Examines health and well-being related to students' time-use patterns; balance among daily activities; daily routines and habits; circadian rhythms; meaningful moments; sleep; and social connections.",
            "id": "OCCTHER 731",
            "parent": "OCCTHER",
            "title": "LIVING WELL: WELLNESS PROMOTION FOR GRADUATE STUDENTS"
        }
    },
    {
        "data": {
            "description": "Addresses the foundations and basic tenets of occupational therapy; and explores the process, domain and parameters of practice. Topics include the history and development of the profession; occupational therapy organizations; certification and licensing; behaviors and responsibilities of occupational therapists; professional ethics; liability; and guidelines and laws governing practice. The Occupational Therapy Practice Framework and selected models, approaches and theoretical frames of reference are explored.",
            "id": "OCCTHER 710",
            "parent": "OCCTHER",
            "title": "PROFESSIONAL AND LEADERSHIP SKILLS 1: FOUNDATIONS"
        }
    },
    {
        "data": {
            "description": "Advance practice skills across the continuum of care among adult clients. Focus on clinical assessment, therapeutic intervention, and discharge planning to promote occupational participation and health. Application of skills learned in real-world settings.",
            "id": "OCCTHER 723",
            "parent": "OCCTHER",
            "title": "ENABLING OCCUPATIONS 2: ADULT FOCUS"
        }
    },
    {
        "data": {
            "description": "An advanced placement that provides an opportunity for applied experiences within their concentration area.",
            "id": "OCCTHER 883",
            "parent": "OCCTHER",
            "title": "DOCTORAL EXPERIENTIAL COMPONENT"
        }
    },
    {
        "data": {
            "description": "An in-depth look at the most common clinical diagnoses relevant to occupational therapy practice with a focus on pediatric and mental health practice settings.",
            "id": "OCCTHER 652",
            "parent": "OCCTHER",
            "title": "CLINICAL CONDITIONS II"
        }
    },
    {
        "data": {
            "description": "An in-depth look at the most common clinical diagnoses relevant to occupational therapy practice with an adolescent and adult population. Covers diagnoses particularly found in physical disability contexts.",
            "id": "OCCTHER 651",
            "parent": "OCCTHER",
            "title": "CLINICAL CONDITIONS I"
        }
    },
    {
        "data": {
            "description": "An introduction to application of informatics in practice including appropriate design, data management procedures and statistical analysis tools. Pursue a practice-relevant question which can be answered using available data.",
            "id": "OCCTHER 872",
            "parent": "OCCTHER",
            "title": "USING INFORMATION TO OPTIMIZE PRACTICE"
        }
    },
    {
        "data": {
            "description": "An opportunity to explore occupational therapy as a potential career; introduction to the general concepts of human occupation and adaptation; survey of OT practice settings and clinical groups.",
            "id": "OCCTHER 100",
            "parent": "OCCTHER",
            "title": "ORIENTATION TO OCCUPATIONAL THERAPY"
        }
    },
    {
        "data": {
            "description": "Complete implementation of individual Capstone Project, analyze the findings and prepare a written and oral presentation of the Capstone Project, as described and approved by the Primary Mentoring Committee.",
            "id": "OCCTHER 882",
            "parent": "OCCTHER",
            "title": "CAPSTONE PROJECT II"
        }
    },
    {
        "data": {
            "description": "Conduct evaluations and provide treatment under supervision for an assigned caseload in an approved practice setting to meet minimal competencies for independent practice.",
            "id": "OCCTHER 662",
            "parent": "OCCTHER",
            "title": "LEVEL II FIELDWORK A"
        }
    },
    {
        "data": {
            "description": "Conduct evaluations and provide treatment under supervision for an assigned caseload in an approved practice setting to meet minimal competencies for independent practice.",
            "id": "OCCTHER 664",
            "parent": "OCCTHER",
            "title": "LEVEL II FIELDWORK B"
        }
    },
    {
        "data": {
            "description": "Covers business and management aspects of occupational therapy practice, including leadership skills needed for administrative roles and interprofessional leadership in a variety of settings.",
            "id": "OCCTHER 712",
            "parent": "OCCTHER",
            "title": "PROFESSIONAL AND LEADERSHIP SKILLS 3: MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Covers respectful and effective communication with all stakeholders for occupational therapy service provision, including clients, caregivers, colleagues, community members and third party payers. Introduces team and group dynamics",
            "id": "OCCTHER 711",
            "parent": "OCCTHER",
            "title": "PROFESSIONAL AND LEADERSHIP SKILLS 2: EFFECTIVE INTERPROFESSIONAL RELATIONSHIPS"
        }
    },
    {
        "data": {
            "description": "Critically analyze the rigor and evidence supporting current occupation-based interventions for populations served by occupational therapists, create a professional presentation based on this research, and create materials to translate this information for consumer use. Understand key issues and current occupational science trends in fostering access to and equitable participation in occupations.",
            "id": "OCCTHER 734",
            "parent": "OCCTHER",
            "title": "LIVING WELL: OCCUPATION-BASED INTERVENTIONS PROMOTING HEALTH AND WELLNESS"
        }
    },
    {
        "data": {
            "description": "Designed to provide an overview of the research happening within the OT program at UW-Madison and to provide hands-on, mentored experience with generating evidence for practice.",
            "id": "OCCTHER 770",
            "parent": "OCCTHER",
            "title": "EVIDENCE BASED PRACTICE LAB PRACTICUM"
        }
    },
    {
        "data": {
            "description": "Differentiate and define the role of occupational therapy, other professions, and the client in inter-professional practice (IP). Describe models of IP collaborative practice, evaluate evidence supporting effective IP interventions, generate and implement strategies for an IP team to improve quality of services.",
            "id": "OCCTHER 813",
            "parent": "OCCTHER",
            "title": "ADVANCED PRACTICE IN INTERPROFESSIONAL CONTEXTS"
        }
    },
    {
        "data": {
            "description": "Examine and apply to a specific intervention or topic that is relevant to professional development goals and/or capstone project. Leverage appropriate methodologies, analytic tools and procedural reasoning in support of recommendations regarding the application of the intervention or approach in the practice environment.",
            "id": "OCCTHER 871",
            "parent": "OCCTHER",
            "title": "APPLICATION OF OCCUPATIONAL THERAPY EVIDENCE IN THE PRACTICE ENVIRONMENT"
        }
    },
    {
        "data": {
            "description": "Explore quality assurance in OT service delivery (including consumer satisfaction) and objective and subjective functional and occupational performance measures of OT interventions. Includes review of principles of measurement (reliability, validity and clinical utility). Examines general themes and trends in healthcare outcomes measurement and research as well as issues germane to specific areas of OT practice.  Learn strategies and skills for assessing the psychometric properties and clinical utility of a variety of outcomes measures.",
            "id": "OCCTHER 873",
            "parent": "OCCTHER",
            "title": "ADVANCED OUTCOME MEASUREMENT IN OCCUPATIONAL THERAPY"
        }
    },
    {
        "data": {
            "description": "Explores population-based intervention for occupational justice, health and wellness. Provides a basic set of competencies in the domains central to the field of public health including systems thinking, social determinants of health, and health care reform policy.",
            "id": "OCCTHER 733",
            "parent": "OCCTHER",
            "title": "PROMOTING HEALTH AND WELLNESS FOR POPULATIONS"
        }
    },
    {
        "data": {
            "description": "Exposure to clinical occupational therapy practice through observation, participation in guided evaluation and treatment procedures, data collection and organization, and communication with clients and other professionals while working in clinical setting under supervision of licensed occupational therapist.",
            "id": "OCCTHER 726",
            "parent": "OCCTHER",
            "title": "LEVEL 1 FIELDWORK A: ADULT PHYSICAL DISABILITIES"
        }
    },
    {
        "data": {
            "description": "Exposure to community-based mental health OT practice through observation, participation in guided evaluation and treatment procedures, data collection and organization, and communication with clients and other professionals.",
            "id": "OCCTHER 727",
            "parent": "OCCTHER",
            "title": "LEVEL 1 FIELDWORK B: COMMUNITY-BASED MENTAL HEALTH"
        }
    },
    {
        "data": {
            "description": "Exposure to pediatric OT practice through observation, participation in guided evaluation and treatment procedures, data collection and organization, and communication with clients and other professionals.",
            "id": "OCCTHER 728",
            "parent": "OCCTHER",
            "title": "LEVEL 1 FIELDWORK C: PEDIATRICS"
        }
    },
    {
        "data": {
            "description": "Facilitate learning for peers around cases.  Develop a learning case based on fieldwork experience. Synthesize learning from previous coursework with an emphasis on advocacy and population health and apply to cases in a comprehensive way using problem-based learning strategies with an assigned learning group.",
            "id": "OCCTHER 822",
            "parent": "OCCTHER",
            "title": "CASE SYNTHESIS 2"
        }
    },
    {
        "data": {
            "description": "Foundations of pediatric occupational therapy practice including theory and core concepts; models of practice and service delivery; the assessment and treatment process; and alterations in performance components, skills, and participation for children and adolescents with various conditions will be discussed",
            "id": "OCCTHER 725",
            "parent": "OCCTHER",
            "title": "ENABLING OCCUPATIONS 4: PEDIATRICS"
        }
    },
    {
        "data": {
            "description": "Gain a complex understanding of the form, function and meaning of daily occupations and the role they play in lifestyle change for wellness promotion. Learn the architecture of daily life including its biological and sociocultural foundations for patterning occupational rounds in order to promote and sustain motivation to change.",
            "id": "OCCTHER 732",
            "parent": "OCCTHER",
            "title": "LIVING WELL: DESIGNING OCCUPATION-BASED WELLNESS PROMOTION"
        }
    },
    {
        "data": {
            "description": "Highlights anatomical structures and biomechanical principles most relevant to the practice of occupational therapy. Areas of the body deemed most significant to the practice of Occupational Therapy (OT) will be given greater time and explored with greater depth. As critical thinking is an essential component of clinical practice, focus learning on function and thinking through how anatomy influences clinical care, daily occupations, and pathology.",
            "id": "OCCTHER 630",
            "parent": "OCCTHER",
            "title": "CLINICAL AND FUNCTIONAL ANATOMY FOR OCCUPATIONAL THERAPISTS"
        }
    },
    {
        "data": {
            "description": "Introduce clinical assessment and therapeutic intervention strategies to promote occupational participation and health among adult clients with a focus on orthopedics and medical considerations. Application of skills learned in real-world settings.",
            "id": "OCCTHER 722",
            "parent": "OCCTHER",
            "title": "ENABLING OCCUPATIONS 1: ADULT FOCUS"
        }
    },
    {
        "data": {
            "description": "Introduces capstone experience and project including providing a step-by-step guide for the development, planning, implementation and dissemination of the entry-level and post-professional occupational therapy doctoral capstone experience and project.",
            "id": "OCCTHER 880",
            "parent": "OCCTHER",
            "title": "INTRODUCTION TO CAPSTONE"
        }
    },
    {
        "data": {
            "description": "Learn foundational skills necessary to promote, prevent and treat the mental health and psychosocial needs of clients, groups and populations. Topics include: Recovery, mental health and psychosocial assessments and treatments of common mental health disorders and health and wellness promotion.",
            "id": "OCCTHER 724",
            "parent": "OCCTHER",
            "title": "ENABLING OCCUPATIONS 3: MENTAL HEALTH ACROSS THE LIFE SPAN"
        }
    },
    {
        "data": {
            "description": "Learn the necessary skills for effectively designing and implementing professional presentations in a variety of interprofessional contexts including educational settings, professional conferences, practice workshops, and scholarly contributions. Review and critique communication from various media.",
            "id": "OCCTHER 814",
            "parent": "OCCTHER",
            "title": "COMMUNICATING OT TO INTERPROFESSIONAL AUDIENCES"
        }
    },
    {
        "data": {
            "description": "Overview of neuroanatomical structures relevant for students in allied health professional training who work with clinical populations. The anatomical regions deemed most significant to practice, given current understandings of the brain and its function, will be explored. The primary focus is on the anatomical regions, neurophysiology, and resultant observable phenomenology related to human function as well as practical clinical application and current research findings.",
            "id": "OCCTHER 640",
            "parent": "OCCTHER",
            "title": "APPLIED NEUROANATOMY FOR ALLIED HEALTH PROFESSIONALS"
        }
    },
    {
        "data": {
            "description": "Prepares for Capstone Project Proposal and learning plan for experiential setting connected to proposed project. Complete a problem statement, needs assessment, literature review and plans and implementation methods.",
            "id": "OCCTHER 881",
            "parent": "OCCTHER",
            "title": "CAPSTONE PROJECT 1"
        }
    },
    {
        "data": {
            "description": "Provides an introduction to theory development in occupational therapy, activity analysis, functional mobility and one model of occupational therapy practice. Application of knowledge of gross human anatomy to assess movement in the context of occupation.",
            "id": "OCCTHER 650",
            "parent": "OCCTHER",
            "title": "ENABLING OCCUPATIONS: INTRODUCTION"
        }
    },
    {
        "data": {
            "description": "Provides the opportunity to establish or advance understanding of evidence-based practice through critical exploration of research ethics and approaches.  Critically review literature relevant to occupational therapy and determine how research findings can inform practice. First in the evidence-based practice sequence leading to the development of a proposal and completion of a scholarly study.",
            "id": "OCCTHER 771",
            "parent": "OCCTHER",
            "title": "EVIDENCE BASED PRACTICE 1: BASICS"
        }
    },
    {
        "data": {
            "description": "Supports the completion of a scholarly study and the skills needed to translate research to practice. Through a series of lectures, statistics/writing consultations, and mentored research, students complete and publicly present their scholarly work.",
            "id": "OCCTHER 773",
            "parent": "OCCTHER",
            "title": "EVIDENCE BASED PRACTICE 3: RESEARCH TRANSLATION"
        }
    },
    {
        "data": {
            "description": "Supports the development of a research proposal and the skills needed to implement a research project. Develop a research proposal and analyze data to inform practice in occupational therapy. Second in the evidence-based practice sequence leading to the development of a proposal and completion of a scholarly study.",
            "id": "OCCTHER 772",
            "parent": "OCCTHER",
            "title": "EVIDENCE BASED PRACTICE 2: RESEARCH DESIGN, METHODS, AND ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Synthesize learning from previous coursework and apply to cases in a comprehensive way using problem-based learning strategies with an assigned learning group.",
            "id": "OCCTHER 821",
            "parent": "OCCTHER",
            "title": "CASE SYNTHESIS 1"
        }
    },
    {
        "data": {
            "id": "OCCTHER",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "OCCTHER 651",
            "target": "OCCTHER 652"
        }
    },
    {
        "data": {
            "source": "OCCTHER 664",
            "target": "OCCTHER 883"
        }
    },
    {
        "data": {
            "source": "OCCTHER 710",
            "target": "OCCTHER 711"
        }
    },
    {
        "data": {
            "source": "OCCTHER 711",
            "target": "OCCTHER 712"
        }
    },
    {
        "data": {
            "source": "OCCTHER 722",
            "target": "OCCTHER 723"
        }
    },
    {
        "data": {
            "source": "OCCTHER 723",
            "target": "OCCTHER 724"
        }
    },
    {
        "data": {
            "source": "OCCTHER 723",
            "target": "OCCTHER 726"
        }
    },
    {
        "data": {
            "source": "OCCTHER 724",
            "target": "OCCTHER 725"
        }
    },
    {
        "data": {
            "source": "OCCTHER 724",
            "target": "OCCTHER 727"
        }
    },
    {
        "data": {
            "source": "OCCTHER 725",
            "target": "OCCTHER 728"
        }
    },
    {
        "data": {
            "source": "OCCTHER 726",
            "target": "OCCTHER 727"
        }
    },
    {
        "data": {
            "source": "OCCTHER 727",
            "target": "OCCTHER 728"
        }
    },
    {
        "data": {
            "source": "OCCTHER 771",
            "target": "OCCTHER 770"
        }
    },
    {
        "data": {
            "source": "OCCTHER 771",
            "target": "OCCTHER 772"
        }
    },
    {
        "data": {
            "source": "OCCTHER 772",
            "target": "OCCTHER 773"
        }
    },
    {
        "data": {
            "source": "OCCTHER 821",
            "target": "OCCTHER 822"
        }
    },
    {
        "data": {
            "source": "OCCTHER 880",
            "target": "OCCTHER 881"
        }
    },
    {
        "data": {
            "source": "OCCTHER 881",
            "target": "OCCTHER 882"
        }
    }
]