[
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics and selected topics in Animal Physiology.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Provides a background in the use of animals in the study of human disease and hands-on exposure to common techniques such as tissue collection and processing, surgeries, imaging, and other manipulations. Lectures by basic scientists and clinicians will provide background about each of the organ systems or diseases and the ethics of animal research. Prior to start of course, completion of online animal safety training. Instructions will be provided after enrollment.",
            "id": "ONCOLOGY 745",
            "parent": "ONCOLOGY",
            "title": "MODELING HUMAN DISEASE IN ANIMALS"
        }
    },
    {
        "data": {
            "description": "Principles of molecular structure and bonding applied to predict and explain the reactivity of alkanes, alkenes, alkynes, alkyl halides, alcohols, and thiols. Emphasis placed on rationalizing the stereochemical and regiochemical outcome of chemical processes.",
            "id": "CHEM 343",
            "parent": "CHEM",
            "title": "ORGANIC CHEMISTRY I"
        }
    },
    {
        "data": {
            "id": "ONCOLOGY",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "CHEM 511",
            "target": "ONCOLOGY 673"
        }
    },
    {
        "data": {
            "description": "A review and discussion of the current literature on topics related to cancer biology. The emphasis is on the development of skills in data analysis, critical interpretation, and clear writing.",
            "id": "ONCOLOGY 725",
            "parent": "ONCOLOGY",
            "title": "READINGS IN CANCER BIOLOGY"
        }
    },
    {
        "data": {
            "source": "GENETICS 466",
            "target": "GENETICS 467"
        }
    },
    {
        "data": {
            "source": "BIOCORE 383",
            "target": "BIOCORE 485"
        }
    },
    {
        "data": {
            "description": "Principles and application of chemical equilibrium, coordination chemistry, oxidation-reduction and electrochemistry, kinetics, nuclear chemistry, introduction to organic chemistry, and chemistry laboratory skills.",
            "id": "CHEM 104",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY II"
        }
    },
    {
        "data": {
            "source": "CHEM 345",
            "target": "BIOCHEM 507"
        }
    },
    {
        "data": {
            "description": "Genetics of eukaryotes and prokaryotes. Includes transmission genetics, probability and hypothesis testing, genetic mapping, molecular genetics, gene expression, and genetic engineering. Illustrative material includes viruses, bacteria, plants, fungi, insects, and humans.",
            "id": "GENETICS 467",
            "parent": "GENETICS",
            "title": "GENERAL GENETICS 1"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ANAT&PHY 335"
        }
    },
    {
        "data": {
            "description": "Accelerated coverage of topics in general chemistry, including introduction to laboratory techniques. Topics include atomic and molecular structure, chemical equilibrium, acid-base chemistry, thermodynamics, kinetics, and electrochemistry.",
            "id": "CHEM 109",
            "parent": "CHEM",
            "title": "ADVANCED GENERAL CHEMISTRY"
        }
    },
    {
        "data": {
            "source": "CHEM 343",
            "target": "CHEM 345"
        }
    },
    {
        "data": {
            "description": "Core organic chemistry concepts of structure, reactivity, and synthesis with regards to the functional groups commonly found in commercial and biological substances. Covers a selection of topics fromCHEM 343and345.",
            "id": "CHEM 341",
            "parent": "CHEM",
            "title": "ELEMENTARY ORGANIC CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Genetics in eukaryotes and prokaryotes.  Includes transmission genetics, molecular genetics, evolutionary genetics, genetic engineering, and societal issues associated with genetics.  Illustrative material includes bacteria, plants, insects, and vertebrates.",
            "id": "GENETICS 466",
            "parent": "GENETICS",
            "title": "PRINCIPLES OF GENETICS"
        }
    },
    {
        "data": {
            "description": "Introduction to the basic principles and concepts of the biology of plants. an integrative approach stressing evolutionary sequences and the relationship between structure and function at succeeding levels of organization: molecule, cell, organism, population, community. Correlated lectures, laboratories, and discussions.",
            "id": "BIOLOGY/BOTANY 130",
            "title": "GENERAL BOTANY"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 501",
            "target": "M&ENVTOX/ONCOLOGY/PHMCOL-M/PHMSCI/POPHLTH 625"
        }
    },
    {
        "data": {
            "source": "BIOCORE 485",
            "target": "M&ENVTOX/ONCOLOGY/PHMCOL-M/PHMSCI/POPHLTH 625"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "ONCOLOGY 401"
        }
    },
    {
        "data": {
            "description": "Basic principles of toxicology and biochemical mechanisms of toxicity in mammalian species and man. Correlation between morphological and functional changes caused by toxicants in different organs of the body.",
            "id": "M&ENVTOX/ONCOLOGY/PHMCOL-M/PHMSCI/POPHLTH 625",
            "title": "TOXICOLOGY I"
        }
    },
    {
        "data": {
            "source": "ZOOLOGY 153",
            "target": "ANAT&PHY 335"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 508",
            "target": "ONCOLOGY 673"
        }
    },
    {
        "data": {
            "description": "Core concepts in human physiology from cells to organ-systems via online lectures and active learning activities including laboratory experiments. Topics include homeostasis, membrane transport, cellular physiology, regulation of metabolism, and functions of the nervous, endocrine, muscular, reproductive, cardiovascular, respiratory, renal, and gastrointestinal system.",
            "id": "ANAT&PHY 335",
            "parent": "ANAT&PHY",
            "title": "PHYSIOLOGY"
        }
    },
    {
        "data": {
            "id": "BIOCHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "ANAT&PHY 335"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "ANAT&PHY 435"
        }
    },
    {
        "data": {
            "source": "GENETICS 466",
            "target": "MM&I/ONCOLOGY/PLPATH 640"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "GENETICS 467"
        }
    },
    {
        "data": {
            "source": "CHEM 343",
            "target": "CHEM 341"
        }
    },
    {
        "data": {
            "source": "CHEM 115",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "description": "Explores a detailed atomic and molecular view of matter and its interactions, with a specific focus on quantum theory, molecular structure, and chemical bonding. Application required for enrollment.",
            "id": "CHEM 115",
            "parent": "CHEM",
            "title": "CHEMICAL PRINCIPLES I"
        }
    },
    {
        "data": {
            "description": "Directed study projects as arranged with instructor.",
            "id": "ONCOLOGY 699",
            "parent": "ONCOLOGY",
            "title": "SPECIAL RESEARCH PROBLEMS"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "MICROBIO/ONCOLOGY 545"
        }
    },
    {
        "data": {
            "source": "ANAT&PHY 435",
            "target": "ANAT&PHY 335"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ZOOLOGY 153"
        }
    },
    {
        "data": {
            "description": "Genetic analysis, population genetics, evolution and quantitative genetics. Includes mutant screens, pathway analysis, mosaic analysis, reverse genetics, genomics, Hardy-Weinberg  linkage equilibrium, inbreeding, genetic drift, natural selection, population structure, inheritance of complex traits, domestication and human evolution.",
            "id": "GENETICS 468",
            "parent": "GENETICS",
            "title": "GENERAL GENETICS 2"
        }
    },
    {
        "data": {
            "source": "CHEM 345",
            "target": "CHEM 511"
        }
    },
    {
        "data": {
            "description": "Study the physiology of and consider how plants and animals interact with their environments to survive, obtain nutrients, exchange gases, and reproduce, also how the complex systems of neural and endocrine regulation in animals and hormonal and environmental regulation in plants allow cells and organs to communicate.",
            "id": "BIOCORE 485",
            "parent": "BIOCORE",
            "title": "PRINCIPLES OF PHYSIOLOGY"
        }
    },
    {
        "data": {
            "source": "CHEM 343",
            "target": "BIOCHEM 501"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "ANAT&PHY 435"
        }
    },
    {
        "data": {
            "description": "Principles of molecular structure and bonding applied to predict and explain the reactivity of aromatic systems, benzylic and allylic systems, aryl and vinyl halides, and carbonyl-containing compounds (e.g., ketones, carboxylic acids, esters, acid chlorides, amides). Emphasis placed on rationalizing the stereochemical and regiochemical outcome of chemical processes as well as arguing reaction outcomes from spectroscopic evidence.",
            "id": "CHEM 345",
            "parent": "CHEM",
            "title": "ORGANIC CHEMISTRY II"
        }
    },
    {
        "data": {
            "source": "GENETICS 467",
            "target": "GENETICS 468"
        }
    },
    {
        "data": {
            "id": "BIOCORE",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "MICROBIO/ONCOLOGY 545"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ANAT&PHY 435"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 101"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 508",
            "target": "M&ENVTOX/ONCOLOGY/PHMCOL-M/PHMSCI/POPHLTH 625"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "ZOOLOGY 153",
            "target": "ANAT&PHY 435"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ONCOLOGY 401"
        }
    },
    {
        "data": {
            "id": "ZOOLOGY",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Examines special topics in cancer research.  Topics and content will vary each semester and by section of the course.",
            "id": "ONCOLOGY 675",
            "parent": "ONCOLOGY",
            "title": "ADVANCED OR SPECIAL TOPICS IN CANCER RESEARCH"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 508",
            "target": "MM&I/ONCOLOGY/PLPATH 640"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "BIOCORE 383"
        }
    },
    {
        "data": {
            "description": "Independent research and writing for graduate students under the supervision of a faculty member.",
            "id": "ONCOLOGY 990",
            "parent": "ONCOLOGY",
            "title": "RESEARCH"
        }
    },
    {
        "data": {
            "description": "Emphasizes the symmetry, structure and bonding of inorganic compounds. Selected topics may include applications in transition metal chemistry, organometallic chemistry, industrial catalysis, advanced bioinorganic chemistry, solid-state chemistry or main group chemistry.",
            "id": "CHEM 511",
            "parent": "CHEM",
            "title": "ADVANCED INORGANIC CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics, and selected topics in Animal Physiology. Designed for engineering majors that do not need a lab component.",
            "id": "ZOOLOGY 153",
            "parent": "ZOOLOGY",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "The structure, multiplication, genetics, pathology and control of animal and plant viruses.",
            "id": "MM&I/ONCOLOGY/PLPATH 640",
            "title": "GENERAL VIROLOGY-MULTIPLICATION OF VIRUSES"
        }
    },
    {
        "data": {
            "description": "A review and discussion of the fundamentals of ethical issues in science.",
            "id": "ONCOLOGY 715",
            "parent": "ONCOLOGY",
            "title": "ETHICS IN SCIENCE"
        }
    },
    {
        "data": {
            "description": "Basic principles of ecology and interrelations between individuals, populations, communities, ecosystems and their environment; transmission genetics and introduction to population genetics; origin of life, evolutionary mechanisms, ancestral relationships among species, and the diversity of life.",
            "id": "BIOCORE 381",
            "parent": "BIOCORE",
            "title": "EVOLUTION, ECOLOGY, AND GENETICS"
        }
    },
    {
        "data": {
            "id": "GENETICS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "GENETICS 468",
            "target": "GENETICS 466"
        }
    },
    {
        "data": {
            "description": "Stoichiometry and the mole concept, the behavior of gases, liquids and solids, thermochemistry, electronic structure of atoms and chemical bonding, descriptive chemistry of selected elements and compounds, intermolecular forces, and chemistry laboratory skills.",
            "id": "CHEM 103",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY I"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "MICROBIO/ONCOLOGY 545"
        }
    },
    {
        "data": {
            "description": "Cellular and molecular basis of life. The main themes are the structure and function of cells and organelles, the flow of energy in cells, and the storage, expression, and regulation of genetic information.",
            "id": "BIOCORE 383",
            "parent": "BIOCORE",
            "title": "CELLULAR BIOLOGY"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Biological processes associated with and characteristic of neoplasia.",
            "id": "ONCOLOGY 401",
            "parent": "ONCOLOGY",
            "title": "INTRODUCTION TO EXPERIMENTAL ONCOLOGY"
        }
    },
    {
        "data": {
            "description": "Viral, chemical, and physical factors involved in tumor formation in humans and experimental animals; biology and biochemistry of neoplasia, both in vivo and in vitro.",
            "id": "ONCOLOGY 703",
            "parent": "ONCOLOGY",
            "title": "CARCINOGENESIS AND TUMOR CELL BIOLOGY"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 109"
        }
    },
    {
        "data": {
            "description": "Biosynthesis of biological molecules, signal transduction mechanisms, chemistry and metabolism of nucleic acids, protein synthesis, and molecular and cellular biology.",
            "id": "BIOCHEM 508",
            "parent": "BIOCHEM",
            "title": "GENERAL BIOCHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "The theory and practice of protein purification. Topics covered include conventional and recent protein fractionation techniques; enzyme assays, handling, and characterization; purification strategy; and overproduction of cloned gene products. The emphasis is on micro and laboratory scale purifications.",
            "id": "ONCOLOGY 673",
            "parent": "ONCOLOGY",
            "title": "PURIFICATION AND CHARACTERIZATION OF PROTEIN AND PROTEIN COMPLEXES"
        }
    },
    {
        "data": {
            "description": "General biological principles. Topics include: evolution, ecology, animal behavior, cell structure and function, genetics and molecular genetics and the physiology of a variety of organ systems emphasizing function in humans.",
            "id": "BIOLOGY/ZOOLOGY 101",
            "title": "ANIMAL BIOLOGY"
        }
    },
    {
        "data": {
            "source": "CHEM 341",
            "target": "BIOCHEM 501"
        }
    },
    {
        "data": {
            "description": "Explores the major organ systems including nervous, endocrine, muscular, cardiovascular, renal, and gastrointestinal. The main learning objective is an understanding of the cellular and molecular mechanisms through which homeostasis is integrated and maintained. Not open to students with credit for PHYSIOL 335 or 435 prior to fall 2018 orANAT&PHY 335",
            "id": "ANAT&PHY 435",
            "parent": "ANAT&PHY",
            "title": "FUNDAMENTALS OF HUMAN PHYSIOLOGY"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 507",
            "target": "BIOCHEM 508"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "GENETICS 467",
            "target": "GENETICS 466"
        }
    },
    {
        "data": {
            "source": "ANAT&PHY 335",
            "target": "M&ENVTOX/ONCOLOGY/PHMCOL-M/PHMSCI/POPHLTH 625"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 343"
        }
    },
    {
        "data": {
            "description": "Become familiar with bioinformatics theory and principles. Provides real-world experience that can be applied to your own work. Provides a foundation of knowledge that can be used to critically evaluate existing bioinformatics tools that can be used in your work, and in the absence of an appropriate tool, identify the analyses that demand the development of novel tools.",
            "id": "ONCOLOGY 778",
            "parent": "ONCOLOGY",
            "title": "BIOINFORMATICS FOR BIOLOGISTS"
        }
    },
    {
        "data": {
            "source": "ANAT&PHY 435",
            "target": "M&ENVTOX/ONCOLOGY/PHMCOL-M/PHMSCI/POPHLTH 625"
        }
    },
    {
        "data": {
            "description": "Critical review of selected topics in cancer research.",
            "id": "ONCOLOGY 901",
            "parent": "ONCOLOGY",
            "title": "SEMINAR"
        }
    },
    {
        "data": {
            "description": "Emphasis is on the development of skills in data analysis and interpretation, grant proposal writing, and oral presentation to help prepare students for their Preliminary Exam.",
            "id": "ONCOLOGY 735",
            "parent": "ONCOLOGY",
            "title": "CURRENT PROBLEMS IN CANCER BIOLOGY"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "GENETICS 467"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 151"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "GENETICS 466"
        }
    },
    {
        "data": {
            "description": "Chemistry of biological materials, intermediary metabolism and protein structure.",
            "id": "BIOCHEM 507",
            "parent": "BIOCHEM",
            "title": "GENERAL BIOCHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Chemistry, nutrition, and metabolism of biological systems.",
            "id": "BIOCHEM 501",
            "parent": "BIOCHEM",
            "title": "INTRODUCTION TO BIOCHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Seminars on current topics in agricultural, medical, and industrial biotechnology such as: microbiological production of food, drink, biopharmaceuticals; production methods, genetic engineering (vectors, recombination cloning), continuous fermentation; bioconversion processes and production of chemicals from biomass; plant biotechnology; transgenic animals.",
            "id": "MICROBIO/ONCOLOGY 545",
            "title": "TOPICS IN BIOTECHNOLOGY"
        }
    },
    {
        "data": {
            "id": "ANAT&PHY",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "GENETICS 467",
            "target": "MM&I/ONCOLOGY/PLPATH 640"
        }
    }
]