[
    {
        "data": {
            "description": "A preparation and introductory math course for students enrolled in the Summer Collegiate Experience program. Includes material from precalculus and calculus and related topics depending on students' results on the math placement exam.",
            "id": "MATH 118",
            "parent": "MATH",
            "title": "SUMMER COLLEGIATE EXPERIENCE MATHEMATICS COURSE"
        }
    },
    {
        "data": {
            "description": "Covers the graphs, properties and geometric significance of trigonometric functions of a real variable. Other topics include trigonometric equations and identities, application, trigonometric form of complex numbers, DeMoivre's theorem, and polar and parametric equations. The course also has a significant number of applications, especially related to other disciplines.",
            "id": "MATH 113",
            "parent": "MATH",
            "title": "TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "Develop clinical knowledge and skills necessary to care for patients in Pediatrics and Obstetrics and Gynecology, with emphasis on unique skills such as taking care of vulnerable populations as identified in women's and child health and working with caregivers in addition to the patient themselves. Increase knowledge of fundamental science concepts introduced in Human Family Tree during Phase 1 of the curriculum, such as embryology and teratology, genetic testing, and neurodevelopment. Clinical experiences will occur in a range of representative inpatient, outpatient and surgical settings. In structured educational sessions, compare and contrast selected topics in pediatric, obstetric, and gynecologic patient populations, highlighting the relevant physiology, pathophysiology, basic science, and public health topics.",
            "id": "MEDSC-M 810",
            "parent": "MEDSC-M",
            "title": "SPECIALIZED CARE OF OBSTETRIC, GYNECOLOGIC, AND PEDIATRIC PATIENTS (SCOPE)"
        }
    },
    {
        "data": {
            "description": "Focus on assessing patients with urgent medical conditions, providing acute inpatient care, and transitioning patients to other care settings or home under the care of other professionals. Provide acute care in inpatient and outpatient urgent care settings as well as on the inpatient wards, and develop acute management plans and subsequent transition of care plans. Clinical experiences in acute care settings such as the emergency department and inpatient medicine (both general and subspecialty), psychiatry, and neurology. Builds upon fundamental science concepts introduced in Body in Balance and Mind and Motion, including Ohm's Law, acid-base balance, and volume regulation. Organ system-based approach employing varied modalities. Complete an integrated patient-centered experience by participating in the care of a patient from an urgent admission through inpatient treatment and discharge.",
            "id": "MEDSC-M 812",
            "parent": "MEDSC-M",
            "title": "ACUTE CARE"
        }
    },
    {
        "data": {
            "description": "HIV kills three million people per year, more than any other infectious disease. We will learn about the transmission, immunology, virology, vaccinology and societal impact of this virus. Six of the world's leading HIV scientists will give guest lectures.",
            "id": "PATH/PATH-BIO 210",
            "title": "HIV: SEX, SOCIETY AND SCIENCE"
        }
    },
    {
        "data": {
            "description": "In much of the world, infection remains the leading cause of disease and death. While medicine has made great strides in the diagnosis and treatment of infection, new and deadly pathogens continue to emerge, and antibiotic resistance continues to grow. No matter what a physician's specialty, understanding principals of infectious disease manifestations, diagnosis and treatment are key.",
            "id": "PATH 950",
            "parent": "PATH",
            "title": "INFECTIOUS DISEASE DETECTIVES"
        }
    },
    {
        "data": {
            "description": "Maximize preparedness for residency by correlating basic science concepts with practical decision-making in clinical transfusion medicine. Tested topics are customized based on the student's specialty interests. Topics include hemostasis, immunology of transfusions, transfusion reactions, red blood cell (RBC) antigens and antibodies, product modifications, lab tests, indications, therapeutic apheresis, blood donation, special patient populations and circumstances such as obstetrics or neonates, and massive transfusion in surgery and trauma.",
            "id": "PATH 921",
            "parent": "PATH",
            "title": "TRANSFUSION MEDICINE CUSTOMIZED"
        }
    },
    {
        "data": {
            "description": "The surgeon-pathologist relationship is an integral aspect of the surgical care process. The intraoperative and postoperative findings of the pathologist confirm that the appropriate course of action was taken, and this information determines what the surgeon will tell the patient and his or her family about the disease entity, prognosis, and recommended next steps. In this basic science selective, future surgeons will have the opportunity to refresh their understanding of essential anatomy and histology, and deepen their knowledge of disease pathophysiology. They will also engage in multiple practical learning activities such as cutting a frozen section, working up a transfusion reaction, staining and interpreting an FNA cytology slide, assisting in prosecting (grossing) surgical pathology and autopsy specimens and following up on the diagnosis/molecular testing/tumor board discussion to enhance their understanding of the pathologist's critical role in managing surgical patients.",
            "id": "PATH 960",
            "parent": "PATH",
            "title": "PATHOLOGY FOR SURGEONS"
        }
    },
    {
        "data": {
            "description": "Unique opportunity for fourth year medical students to develop an intervention project focused on women's health and cancer prevention, diagnosis, treatment, or awareness globally and locally. Explore how women's health is influenced by both biological and sociocultural factors. Observe components of diagnosis of women's related cancers.  Analyze molecular components of cancers used for diagnosis and treatment. Deconstruct the unique diseases that affect women throughout the life cycle and social factors that influence them.",
            "id": "PATH 963",
            "parent": "PATH",
            "title": "WOMEN'S GLOBAL HEALTH: A FOCUS ON WOMEN'S CANCERS AND PUBLIC HEALTH INTERVENTIONS"
        }
    },
    {
        "data": {
            "description": "Accelerated coverage of topics in general chemistry, including introduction to laboratory techniques. Topics include atomic and molecular structure, chemical equilibrium, acid-base chemistry, thermodynamics, kinetics, and electrochemistry.",
            "id": "CHEM 109",
            "parent": "CHEM",
            "title": "ADVANCED GENERAL CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Advances in medicine are increasingly being driven by \"big data\" analyses, including proteomics, genomics, and metabolomics. Basic knowledge of how to analyze these datasets can allow one to generate and test hypotheses that have the potential to transform a field. In this course, students will conduct individual data mining expeditions using a collection of large proteomics and metabolomics data sets. Formulate hypotheses about the interrelationships of molecules and their potential relationship to health, disease, and biological phenotypes. Basic background instruction on \"omics\" methodologies, heritability studies, and analytical methods will be provided. Provides the basic knowledge to carry out future 'omics analyses; using scientific inquiry to potentially transform the practice of medicine.",
            "id": "PATH 970",
            "parent": "PATH",
            "title": "GENOMICS, PROTEOMICS, AND METABOLOMICS: A DEEP DIVE INTO OMICS DATA ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Basic principles of toxicology and biochemical mechanisms of toxicity in mammalian species and man. Correlation between morphological and functional changes caused by toxicants in different organs of the body.",
            "id": "M&ENVTOX/ONCOLOGY/PHMCOL-M/PHMSCI/POPHLTH 625",
            "title": "TOXICOLOGY I"
        }
    },
    {
        "data": {
            "description": "Biosynthesis of biological molecules, signal transduction mechanisms, chemistry and metabolism of nucleic acids, protein synthesis, and molecular and cellular biology.",
            "id": "BIOCHEM 508",
            "parent": "BIOCHEM",
            "title": "GENERAL BIOCHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for engineering students. Mechanics: kinematics, statics, dynamics; energy and momentum.",
            "id": "PHYSICS 201",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for students majoring in biological sciences. Mechanics: kinematics, statics, dynamics; energy and momentum. Heat and sound.",
            "id": "PHYSICS 207",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Care of adults and children undergoing an operation or procedure, including perioperative preparation, operative care, and post-operative cares for core clinical conditions in the specialties of anesthesia, neurosurgery, ophthalmology, general surgery, otolaryngology, urology, cardiothoracic surgery, peripheral vascular surgery, orthopedics, plastic and reconstructive surgery, and gynecology, as well as interventional radiology, procedural cardiology and gastroenterology. Basic science concepts include cerebral spinal fluid production and flow, fluids and electrolytes, consciousness, inflammation and wound healing, and cancer biology. Anatomic approach using case discussions, podcasts, curated independent reading, online nationally supported modules, and simulation skills. Longitudinal patient care experience integrating communication, evidence based medicine, health information technology, quality improvement  patient safety, professionalism, scientific inquiry, and public health.",
            "id": "MEDSC-M 813",
            "parent": "MEDSC-M",
            "title": "SURGICAL AND PROCEDURAL CARE"
        }
    },
    {
        "data": {
            "description": "Chemistry of biological materials, intermediary metabolism and protein structure.",
            "id": "BIOCHEM 507",
            "parent": "BIOCHEM",
            "title": "GENERAL BIOCHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Clinical elective for fourth year medical students.",
            "id": "PATH 926",
            "parent": "PATH",
            "title": "PATHOLOGY: CLINICAL MICROBIOLOGY-MARSHFIELD"
        }
    },
    {
        "data": {
            "description": "Clinical microbiology lab practice, with a focus on identification of bacteria, fungi, and parasites. Learn techniques in specimen collection, staining, and plating. Gain an understanding of culture media, incubation, isolation, and microscopic and colony characteristics.",
            "id": "PATH 914",
            "parent": "PATH",
            "title": "CLINICAL MICROBIOLOGY: PHENOTYPIC IDENTIFICATION OF COMMON ORGANISMS"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Culture-based methods for detecting and quantifying viruses. Describe concepts such as viral load, transmissibility, tissue tropism, host immune responses, and the effectiveness of various antiviral therapies. Perform multiple techniques for working with and quantifying viruses.  Compare and contrast various methods of detecting and quantifying viruses.",
            "id": "PATH 913",
            "parent": "PATH",
            "title": "TECHNIQUES IN VIROLOGY"
        }
    },
    {
        "data": {
            "description": "Directed study projects for freshmen and sophomores.",
            "id": "PATH 399",
            "parent": "PATH",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Directed study projects for juniors and seniors.",
            "id": "PATH 699",
            "parent": "PATH",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Emphasizes current understanding of molecular and cellular mechanisms. Wherever possible, human diseases are used to illustrate the outcome at the organismal level of defects in these mechanisms. Focuses on different cell types and how cells function. We also discuss how cells talk to themselves and each other. Topics include mechanisms of cell survival and division. Provides an overview of a broad set of cell biology topics to demonstrate the breadth and diversity of cellular functions.",
            "id": "PATH 750",
            "parent": "PATH",
            "title": "CELLULAR AND MOLECULAR BIOLOGY/PATHOLOGY"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "Examines the molecular, cellular, physiological, and clinical aspects of aging beyond basic biology in a biomedical/clinical research setting.  Aging and age-related diseases are examined via the combined expertise of basic scientists and clinicians covering a range of topics directly relevant to biology of aging research, including the clinical perspective, the research perspective, and the integration of the two.",
            "id": "PATH 751",
            "parent": "PATH",
            "title": "BIOLOGY OF AGING"
        }
    },
    {
        "data": {
            "description": "Explores the major organ systems including nervous, endocrine, muscular, cardiovascular, renal, and gastrointestinal. The main learning objective is an understanding of the cellular and molecular mechanisms through which homeostasis is integrated and maintained. Not open to students with credit for PHYSIOL 335 or 435 prior to fall 2018 orANAT&PHY 335",
            "id": "ANAT&PHY 435",
            "parent": "ANAT&PHY",
            "title": "FUNDAMENTALS OF HUMAN PHYSIOLOGY"
        }
    },
    {
        "data": {
            "description": "Focuses on molecular mechanisms of diseases. Course will focus on four modules: Neuroscience, cancer biology, growth factor/matrix biology, and immunology. Course will consist of a one hour lecture and a one hour group discussion.",
            "id": "PATH 809",
            "parent": "PATH",
            "title": "MOLECULAR MECHANISMS OF DISEASE"
        }
    },
    {
        "data": {
            "description": "Focuses on molecular, genetic, embryologic, hormonal, anatomical and physiological factors that govern fertility, cell growth, fetal development, and pregnancy as well as the congenital anomalies that can occur when those processes are aberrant. Encompasses the full life-cycle spectrum including childhood growth and development, young adulthood/puberty, issues affecting adolescents and young adults, genetic basis of human disease, reproductive health, menopause, aging, unregulated cell growth (cancer) and end of life issues. Significant content from other competency domains, or \"longitudinal threads\", such as public health, advocacy, ethics, patient care/communication and clinical skills.",
            "id": "MEDSC-M 773",
            "parent": "MEDSC-M",
            "title": "HUMAN FAMILY TREE"
        }
    },
    {
        "data": {
            "description": "For Grad and medical students desiring advanced pathology; work done under the direction of a senior staff member.",
            "id": "PATH 990",
            "parent": "PATH",
            "title": "RESEARCH"
        }
    },
    {
        "data": {
            "description": "Gain fundamental knowledge of immunopathology and molecular immunology medicine, and have an in-depth research experience that combines pathobiological and translational immunology research.",
            "id": "PATH 807",
            "parent": "PATH",
            "title": "IMMUNOPATHOLOGY: THE IMMUNE SYSTEM IN HEALTH AND DISEASE"
        }
    },
    {
        "data": {
            "description": "General biological principles. Topics include: evolution, ecology, animal behavior, cell structure and function, genetics and molecular genetics and the physiology of a variety of organ systems emphasizing function in humans.",
            "id": "BIOLOGY/ZOOLOGY 101",
            "title": "ANIMAL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Identify the roles of physicians, interdisciplinary providers, health care systems, and communities in screening, treating, and preventing common, chronic conditions. Activities are centered on health promotion, outpatient-based chronic disease management, and community health. Clinical experiences will occur in primary care, behavioral health, and other ambulatory and community-based settings that focus on chronic disease management.",
            "id": "MEDSC-M 811",
            "parent": "MEDSC-M",
            "title": "CHRONIC AND PREVENTIVE CARE"
        }
    },
    {
        "data": {
            "description": "Integrated examination of how the immune system interacts with foreign microbes, the normal micro biome, and self tissues, both normal and malignant. Examines inflammation and the impacts of this type of response on normal cells, in wound healing, infectious disease, and inflammatory diseases including autoimmune disease and dermatologic conditions, including neoplasia of the skin. Covers the development of adaptive immune responses from vaccination, infectious processes, and organ transplantation. Covers the basic biology and pathophysiology of \"invaders\" of the human body, including viruses, fungi, and bacteria, along with their clinical diagnosis and therapy. Addresses malignant transformation of the immune effector cells themselves, including cancers of mature lymphoid cells and bone marrow derived malignancies.",
            "id": "MEDSC-M 774",
            "parent": "MEDSC-M",
            "title": "INVADERS AND DEFENSE"
        }
    },
    {
        "data": {
            "description": "Introduces the pathogenesis of disease via integration of actual autopsy patient cases. Emphasis is placed on understanding the basic mechanisms of disease at the level of cell, organ, and body, as well as the morphologic expression patterns of selected common specific disease processes. Participate in autopsy gross organ conferences as well as microscopic review sessions. Concepts covered in lectures will be applied and reinforced in the interactive autopsy sessions. Observe at least one full autopsy, gaining a three-dimensional understanding of structure and disease.",
            "id": "PATH 802",
            "parent": "PATH",
            "title": "HISTOPATHOLOGY FOR TRANSLATIONAL SCIENTISTS"
        }
    },
    {
        "data": {
            "description": "Introduction to concepts of health and disease, which vary from patient to patient and through time. View health from a population standpoint, with an introduction to basic public health concepts as well as how physicians may positively impact both individual and population level health. Woven within that framework are introductions to key aspects of professionalism, patient-centered history- taking, and core communication skills.",
            "id": "MEDSC-M 770",
            "parent": "MEDSC-M",
            "title": "PATIENTS, PROFESSIONALISM AND PUBLIC HEALTH"
        }
    },
    {
        "data": {
            "description": "Introduction to core basic science, pathophysiologic, and diagnostic principles requisite for the care and treatment of patients with musculoskeletal, neurologic, and psychiatric presentations and disorders. Basic science concepts include those from the traditional disciplines of cell biology, histology, biochemistry, anatomy, embryology, neuroscience, and behavioral science. Regular integration of these topics with their pathologic and pathophysiologic counterparts. Integration of content related to other competency domains, or \"longitudinal threads\", that include patient care  communication, evidence based medicine, health information technology, quality improvement  patient safety, professionalism, scientific inquiry and public health.",
            "id": "MEDSC-M 775",
            "parent": "MEDSC-M",
            "title": "MIND & MOTION"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Learn the basic science principles of common laboratory tests. Apply this knowledge to assignments in which you make clinical judgments and answer common patient questions about lab test interpretations. Customize the curriculum based on your specialty interests.",
            "id": "PATH 922",
            "parent": "PATH",
            "title": "LABORATORY MEDICINE CUSTOMIZED"
        }
    },
    {
        "data": {
            "description": "Learn the variety of techniques, methodologies, and instrumentation used in modern clinical microbiology laboratory practice. Gain an understanding of mass spectrometry, NAAT, PCR, sequencing, antigen/antibody detection, antimicrobial susceptibility testing, point-of-care testing, and biomarkers of infection.",
            "id": "PATH 915",
            "parent": "PATH",
            "title": "CLINICAL MICROBIOLOGY: OVERVIEW OF TECHNOLOGIES AND METHODOLOGIES"
        }
    },
    {
        "data": {
            "description": "Meets the NIH Institutional Training Grant requirements covering all ten of targeted areas in biomedical research. Subject matter incorporates the following topics for instruction: 1) Conflict of interest - personal, professional, and financial; 2) Policies regarding human subjects, and rigor and reproducibility in clinical research; 3) Policies regarding live vertebrate animal subjects, rigor and reproducibility and transparency in pre-clinical research, and safe laboratory practices; 4) Mentor and mentee responsibilities and relationships; 5) Collaborative research including collaborations with industry; 6) Peer review; 7) Data acquisition and laboratory tools (management, sharing and ownership); 8) Research misconduct and policies for handling misconduct; 9) Responsible authorship and publication; 10) The scientist as a responsible member of society, contemporary ethical issues in biomedical research, and the environmental and societal impacts of scientific research.",
            "id": "PATH 755",
            "parent": "PATH",
            "title": "RESPONSIBLE CONDUCT IN RESEARCH: RESEARCH ETHICS, RIGOR, REPRODUCIBILITY AND TRANSPARENCY"
        }
    },
    {
        "data": {
            "description": "Organized around biomedical themes including nutrients, the digestive system, the biochemistry and endocrine control of metabolism, exercise and fitness and the removal of waste products and toxins to present an integrated picture of how these systems function together to maintain homeostasis. Integrates developmental content from competency domains, or \"longitudinal threads\", including communication, patient care, ethics, health information technology, public health, professionalism, quality improvement, patient safety, and scientific inquiry.",
            "id": "MEDSC-M 772",
            "parent": "MEDSC-M",
            "title": "FOOD, FASTING & FITNESS"
        }
    },
    {
        "data": {
            "description": "Organized around physiological themes, the course includes material related to the cardiovascular system, hematology, nephrology, and pulmonology to present an integrated picture of how these systems function together to maintain homeostasis. In addition, there is significant content from other competency domains such as public health, ethics, evidence-based medicine, patient care/communication and clinical skills.",
            "id": "MEDSC-M 771",
            "parent": "MEDSC-M",
            "title": "BODY IN BALANCE"
        }
    },
    {
        "data": {
            "description": "Patients with sickle cell disease can present to any medical specialty with manifestations or complications of the disease. Using a disease-focused biopsychosocial approach, the goal is the identification and understanding of barriers to health and the potential opportunities for improvement. The topics surveyed include: 1) clinical review, 2) community voices, 3) diversity, equity, and inclusion, 4) practical communication skills, 5) actionable examples of quality improvement, 6) health care systems, 7) economics, 8) global health, 9) ethics, and 10) advocacy via intellectual persuasion.",
            "id": "PATH 923",
            "parent": "PATH",
            "title": "SICKLE CELL DISEASE AND PUBLIC HEALTH"
        }
    },
    {
        "data": {
            "description": "Principles and application of chemical equilibrium, coordination chemistry, oxidation-reduction and electrochemistry, kinetics, nuclear chemistry, introduction to organic chemistry, and chemistry laboratory skills.",
            "id": "CHEM 104",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Principles of molecular structure and bonding applied to predict and explain the reactivity of alkanes, alkenes, alkynes, alkyl halides, alcohols, and thiols. Emphasis placed on rationalizing the stereochemical and regiochemical outcome of chemical processes.",
            "id": "CHEM 343",
            "parent": "CHEM",
            "title": "ORGANIC CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Principles of molecular structure and bonding applied to predict and explain the reactivity of aromatic systems, benzylic and allylic systems, aryl and vinyl halides, and carbonyl-containing compounds (e.g., ketones, carboxylic acids, esters, acid chlorides, amides). Emphasis placed on rationalizing the stereochemical and regiochemical outcome of chemical processes as well as arguing reaction outcomes from spectroscopic evidence.",
            "id": "CHEM 345",
            "parent": "CHEM",
            "title": "ORGANIC CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Provides a basic understanding of the causes, pathophysiology, pathology and clinical manifestations of disease states from a medical perspective.",
            "id": "PATH 404",
            "parent": "PATH",
            "title": "PATHOPHYSIOLOGIC PRINCIPLES OF HUMAN DISEASES"
        }
    },
    {
        "data": {
            "description": "Review of current publications on relevant topics selected by department faculty and trainer.",
            "id": "PATH 901",
            "parent": "PATH",
            "title": "STUDENT SEMINAR / JOURNAL CLUB"
        }
    },
    {
        "data": {
            "description": "Selected topics in inorganic and organic chemistry. Emphasis is on relevance to biological, environmental and social issues.",
            "id": "CHEM 108",
            "parent": "CHEM",
            "title": "CHEMISTRY IN OUR WORLD"
        }
    },
    {
        "data": {
            "description": "Stoichiometry and the mole concept, the behavior of gases, liquids and solids, thermochemistry, electronic structure of atoms and chemical bonding, descriptive chemistry of selected elements and compounds, intermolecular forces, and chemistry laboratory skills.",
            "id": "CHEM 103",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Survey of the basic methods and fundamental biochemical mechanisms of toxicity. Toxicity in mammalian organ systems, techniques for evaluating toxicity, as well as mechanisms of species specificity, and environmental interactions (with toxicant examples) are presented.",
            "id": "M&ENVTOX/PATH/PHMCOL-M/PHMSCI/POPHLTH 626",
            "title": "TOXICOLOGY II"
        }
    },
    {
        "data": {
            "description": "The emphasis is on our current understanding of molecular and cellular mechanisms. Wherever possible, human diseases are used to illustrate the outcome at the organismal level of defects in these mechanisms. Discussions focus on immunology and cancer biology. Topics include mechanisms of cell survival, cell division, signal transduction, gene expression, vesicular transport, autophagy and cell death. Explore a broad set of cell biology topics, in greater detail such that they will have a better understanding of the breadth and diversity of cellular functions by the end of the semester. Learn how to critically evaluate the literature and the rigor of research.",
            "id": "PATH 752",
            "parent": "PATH",
            "title": "CELLULAR AND MOLECULAR BIOLOGY/PATHOLOGY SEMINAR"
        }
    },
    {
        "data": {
            "description": "The genome impacts human health and disease from the moment of conception throughout growth, development, and aging. This course offers a comprehensive overview of clinical laboratory testing in the fields of medical genetics and public health. Topics include how genetic testing is integrated into patient care, including prenatal genetics, newborn screening, genetic testing in children and adults, and oncology genetics. Students will develop a strong foundational knowledge of basic genetics principles, identify indications for genetic testing, interpret population screening results and the implications for public health, assess the utility of diagnostic testing, and recognize the limitations of genetic testing and clinical laboratory medicine. It is anticipated that students will incorporate these concepts, knowledge, experiences, and evidence in their future clinical practice.",
            "id": "PATH 949",
            "parent": "PATH",
            "title": "GENETICS THROUGH THE LIFE CYCLE"
        }
    },
    {
        "data": {
            "description": "The two semester sequenceMATH 112-MATH 113covers similar material asMATH 114, but in a slower pace. Not recommended for students with less than an AB inMATH 96.",
            "id": "MATH 114",
            "parent": "MATH",
            "title": "ALGEBRA AND TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "This course will focus on disease pathogenesis and discussion of the leading disease research model. Throughout the course, we will combine expert clinicians, basic scientists, and literature review on specific major diseases.",
            "id": "PATH 803",
            "parent": "PATH",
            "title": "PATHOGENESIS OF MAJOR HUMAN DISEASES"
        }
    },
    {
        "data": {
            "description": "Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Part of a 2-semester sequence withMATH 217; these two courses together are equivalent toMATH 114and221.",
            "id": "MATH 171",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY I"
        }
    },
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics and selected topics in Animal Physiology.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Understand the battle between humans and infectious diseases. Learn how microbes evade the immune system and develop resistance to antibiotics. Discuss emerging pathogens and multidrug resistant organisms and the techniques used to combat them.",
            "id": "PATH 916",
            "parent": "PATH",
            "title": "CLINICAL MICROBIOLOGY: ANTIMICROBIAL RESISTANCE AND EMERGING PATHOGENS"
        }
    },
    {
        "data": {
            "description": "Understand the central role that diagnostic pathology and laboratory testing play in medical care in all specialties. Review your course work in anatomic and clinical Pathology and add to your fund of knowledge. Familiarize yourself with the workings of a busy diagnostic tissue laboratory. Participate in daily \"clinical-pathologist\" discussions concerning the effects of various pathological conditions as they relate to specific clinical problems. Understand the role of anatomic and clinical pathology as they contribute to the understanding of disease processes.",
            "id": "PATH 920",
            "parent": "PATH",
            "title": "GENERAL PATHOLOGY CLERKSHIP"
        }
    },
    {
        "data": {
            "description": "Understanding molecular mechanisms of hematologic disease, and developing a foundation in the principles of relevant molecular assays, is critical to providing appropriate patient care.  Topics include bases of neoplastic disorders of the hematopoietic and lymphoid systems, how underlying molecular abnormalities contribute to the pathophysiology of these diseases, and the evolving spectrum of molecular and cytogenetic/FISH testing and other ancillary testing (such as flow cytometry), which are often utilized in the work-up of hematopoietic and lymphoid malignancies. Learn about strengths and weaknesses of these technologies, and how pathologists integrate results of molecular testing with the traditional histologic exam to produce accurate diagnoses and drive clinical decision making. Develop an understanding of how knowing the underlying molecular pathology of a hematopoietic or lymphoid malignancy can inform prognosis and guide therapy.",
            "id": "PATH 962",
            "parent": "PATH",
            "title": "THE MOLECULAR BASIS OF HEMATOLOGIC MALIGNANCIES"
        }
    },
    {
        "data": {
            "description": "Utilize a case-based learning approach to interpret blood bank test results such as ABO typing data, antibody screens, antibody panels, and direct antiglobulin tests. Identify antibodies to red blood cell and platelet antigens. Demystify the inner workings of the blood bank clinical laboratory. Improve your ability to understand and communicate results from the blood bank.",
            "id": "PATH 924",
            "parent": "PATH",
            "title": "IMMUNOHEMATOLOGY"
        }
    },
    {
        "data": {
            "description": "Weekly Seminar for graduate students, professional students, medical professionals.",
            "id": "PATH 900",
            "parent": "PATH",
            "title": "SEMINAR"
        }
    },
    {
        "data": {
            "id": "ANAT&PHY",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "BIOCHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MEDSC-M",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "PATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "PHYSICS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ANAT&PHY 435",
            "target": "M&ENVTOX/ONCOLOGY/PHMCOL-M/PHMSCI/POPHLTH 625"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 507",
            "target": "BIOCHEM 508"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 508",
            "target": "M&ENVTOX/ONCOLOGY/PHMCOL-M/PHMSCI/POPHLTH 625"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 101"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ANAT&PHY 435"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 151"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "PATH 404"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 108"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 109"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 343"
        }
    },
    {
        "data": {
            "source": "CHEM 108",
            "target": "ANAT&PHY 435"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 343",
            "target": "CHEM 345"
        }
    },
    {
        "data": {
            "source": "CHEM 345",
            "target": "BIOCHEM 507"
        }
    },
    {
        "data": {
            "source": "M&ENVTOX/ONCOLOGY/PHMCOL-M/PHMSCI/POPHLTH 625",
            "target": "M&ENVTOX/PATH/PHMCOL-M/PHMSCI/POPHLTH 626"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 113"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 113",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 114",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 114"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "CHEM 109"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "PHYSICS 201"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "PHYSICS 207"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 114"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 770",
            "target": "MEDSC-M 810"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 771",
            "target": "MEDSC-M 810"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 772",
            "target": "MEDSC-M 810"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 773",
            "target": "MEDSC-M 810"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 774",
            "target": "MEDSC-M 810"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 775",
            "target": "MEDSC-M 810"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 810",
            "target": "PATH 913"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 810",
            "target": "PATH 914"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 810",
            "target": "PATH 915"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 810",
            "target": "PATH 916"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 810",
            "target": "PATH 921"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 810",
            "target": "PATH 922"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 810",
            "target": "PATH 923"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 810",
            "target": "PATH 924"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 810",
            "target": "PATH 960"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 810",
            "target": "PATH 962"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 810",
            "target": "PATH 970"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 811",
            "target": "PATH 913"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 811",
            "target": "PATH 914"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 811",
            "target": "PATH 915"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 811",
            "target": "PATH 916"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 811",
            "target": "PATH 921"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 811",
            "target": "PATH 922"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 811",
            "target": "PATH 923"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 811",
            "target": "PATH 924"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 811",
            "target": "PATH 960"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 811",
            "target": "PATH 962"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 811",
            "target": "PATH 970"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 812",
            "target": "PATH 913"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 812",
            "target": "PATH 914"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 812",
            "target": "PATH 915"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 812",
            "target": "PATH 916"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 812",
            "target": "PATH 921"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 812",
            "target": "PATH 922"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 812",
            "target": "PATH 923"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 812",
            "target": "PATH 924"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 812",
            "target": "PATH 960"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 812",
            "target": "PATH 962"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 812",
            "target": "PATH 970"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "PATH 913"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "PATH 914"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "PATH 915"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "PATH 916"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "PATH 921"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "PATH 922"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "PATH 923"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "PATH 924"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "PATH 960"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "PATH 962"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "PATH 970"
        }
    },
    {
        "data": {
            "source": "PATH 404",
            "target": "M&ENVTOX/ONCOLOGY/PHMCOL-M/PHMSCI/POPHLTH 625"
        }
    },
    {
        "data": {
            "source": "PATH 750",
            "target": "PATH 752"
        }
    },
    {
        "data": {
            "source": "PHYSICS 201",
            "target": "PHYSICS 207"
        }
    },
    {
        "data": {
            "source": "PHYSICS 207",
            "target": "ANAT&PHY 435"
        }
    },
    {
        "data": {
            "source": "PHYSICS 207",
            "target": "PHYSICS 201"
        }
    }
]