[
    {
        "data": {
            "description": "A preparation and introductory math course for students enrolled in the Summer Collegiate Experience program. Includes material from precalculus and calculus and related topics depending on students' results on the math placement exam.",
            "id": "MATH 118",
            "parent": "MATH",
            "title": "SUMMER COLLEGIATE EXPERIENCE MATHEMATICS COURSE"
        }
    },
    {
        "data": {
            "description": "Covers the graphs, properties and geometric significance of trigonometric functions of a real variable. Other topics include trigonometric equations and identities, application, trigonometric form of complex numbers, DeMoivre's theorem, and polar and parametric equations. The course also has a significant number of applications, especially related to other disciplines.",
            "id": "MATH 113",
            "parent": "MATH",
            "title": "TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "Explore the new frontier of evolutionary and ecological solutions to public health challenges through analyses and discussions. Evolution is often viewed as a purely historical topic disconnected from modern practical concerns. This view is incomplete: evolution plays a key role in many areas of modern life and underlies many public health challenges like drug resistance in bacteria and cancer, vaccine development, circadian medicine, and the 'spill-over' of pathogens from wildlife to humans (and vice versa). These issues, however, are intricately connected to social drivers like the use of antibiotics to treat viruses or as growth promoters in livestock. More evolutionary-guided solutions to understanding and addressing these challenges are critical for a sustainable and healthy future.",
            "id": "PATH-BIO 307",
            "parent": "PATH-BIO",
            "title": "SUPERBUGS, SEX, & DRUGS: WHY MODERN MEDICINE NEEDS EVOLUTIONARY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "HIV kills three million people per year, more than any other infectious disease. We will learn about the transmission, immunology, virology, vaccinology and societal impact of this virus. Six of the world's leading HIV scientists will give guest lectures.",
            "id": "PATH/PATH-BIO 210",
            "title": "HIV: SEX, SOCIETY AND SCIENCE"
        }
    },
    {
        "data": {
            "description": "",
            "id": "PATH-BIO 299",
            "parent": "PATH-BIO",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "",
            "id": "PATH-BIO 930",
            "parent": "PATH-BIO",
            "title": "ADVANCED SEMINAR"
        }
    },
    {
        "data": {
            "description": "",
            "id": "PATH-BIO 990",
            "parent": "PATH-BIO",
            "title": "RESEARCH"
        }
    },
    {
        "data": {
            "description": "Accelerated coverage of topics in general chemistry, including introduction to laboratory techniques. Topics include atomic and molecular structure, chemical equilibrium, acid-base chemistry, thermodynamics, kinetics, and electrochemistry.",
            "id": "CHEM 109",
            "parent": "CHEM",
            "title": "ADVANCED GENERAL CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Active Learning experience highlighting problem solving and critical thinking that horizontally and vertically integrates material from other veterinary medicine courses by using exercises constructed in the context of clinical cases or scenaria.",
            "id": "PATH-BIO 525",
            "parent": "PATH-BIO",
            "title": "ACTIVE, INTEGRATED LEARNING I"
        }
    },
    {
        "data": {
            "description": "Active Learning experience highlighting problem solving and critical thinking that horizontally and vertically integrates material from other veterinary medicine courses by using exercises constructed in the context of clinical cases or scenaria.",
            "id": "PATH-BIO 526",
            "parent": "PATH-BIO",
            "title": "ACTIVE, INTEGRATED LEARNING II"
        }
    },
    {
        "data": {
            "description": "Addresses the science, ethics, history, and communication strategies associated with the use of animals in research. Seeks to identify and employ common ground among those with different perspectives to enable students to make good decisions about this contentious topic.",
            "id": "MEDHIST/PATH-BIO 370",
            "title": "ADDRESSING CONTROVERSY: THE SCIENCE, ETHICS, AND PUBLIC DISCUSSION OF ANIMAL RESEARCH"
        }
    },
    {
        "data": {
            "description": "Basic principles of ecology and interrelations between individuals, populations, communities, ecosystems and their environment; transmission genetics and introduction to population genetics; origin of life, evolutionary mechanisms, ancestral relationships among species, and the diversity of life.",
            "id": "BIOCORE 381",
            "parent": "BIOCORE",
            "title": "EVOLUTION, ECOLOGY, AND GENETICS"
        }
    },
    {
        "data": {
            "description": "Basic veterinary parasitology with emphasis on biology, diagnosis, pathophysiology, treatment and management of parasitic infections of veterinary importance.",
            "id": "PATH-BIO 514",
            "parent": "PATH-BIO",
            "title": "VETERINARY PARASITOLOGY"
        }
    },
    {
        "data": {
            "description": "Concepts and techniques of clinical pathology with emphasis on those procedures that are important in the diagnosis of animal diseases.",
            "id": "PATH-BIO 562",
            "parent": "PATH-BIO",
            "title": "VETERINARY CLINICAL PATHOLOGY"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Current concepts in basic and clinical immunology with special emphasis on domesticated species and aspects of immunology.",
            "id": "PATH-BIO 510",
            "parent": "PATH-BIO",
            "title": "VETERINARY IMMUNOLOGY"
        }
    },
    {
        "data": {
            "description": "Detailed study of the pathogenesis of vertebrate viral disease, stressing viral invasion, dissemination, mechanisms of disease production, immune pathology, persistence, resistance, and transmission.",
            "id": "MM&I/PATH-BIO 750",
            "title": "HOST-PARASITE RELATIONSHIPS IN VERTEBRATE VIRAL DISEASE"
        }
    },
    {
        "data": {
            "description": "Development and functions of immune response in animals; a comprehensive study of experimental humoral and cellular immunity.",
            "id": "MM&I/PATH-BIO 528",
            "title": "IMMUNOLOGY"
        }
    },
    {
        "data": {
            "description": "Emphasis on the pathogenesis of bacterial and fungal diseases of animals. Become familiar with the methods used to identify representative bacterial and fungal pathogens.",
            "id": "PATH-BIO 517",
            "parent": "PATH-BIO",
            "title": "VETERINARY BACTERIOLOGY AND MYCOLOGY"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "General biological principles. Topics include: evolution, ecology, animal behavior, cell structure and function, genetics and molecular genetics and the physiology of a variety of organ systems emphasizing function in humans.",
            "id": "BIOLOGY/ZOOLOGY 101",
            "title": "ANIMAL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "General concepts of animal biology at an introductory level emphasizing the evolutionary relationships between animals. Learn about general body plans and strategies used to accomplish the basic tasks of staying alive in major animal groups using preserved and live animals. Study the diversity within each group of animals by integrating the body plans with the lifestyle and ecology of animals. Dissections of earthworm, freshwater mussel, squid, sea star, and rat aid the study of these general principles.",
            "id": "BIOLOGY/ZOOLOGY 102",
            "title": "ANIMAL BIOLOGY LABORATORY"
        }
    },
    {
        "data": {
            "description": "General mechanisms of disease at the cellular, tissue, organ, and organismal levels. Cell injury and cell death, neoplasia, inflammation, circulation, and genetics.",
            "id": "PATH-BIO 559",
            "parent": "PATH-BIO",
            "title": "VETERINARY GENERAL PATHOLOGY"
        }
    },
    {
        "data": {
            "description": "Individual research and study in pathobiological sciences for completing an honors thesis as arranged with a faculty member.",
            "id": "PATH-BIO 681",
            "parent": "PATH-BIO",
            "title": "SENIOR HONORS THESIS I"
        }
    },
    {
        "data": {
            "description": "Individual research and study in pathobiological sciences for completing an honors thesis as arranged with a faculty member.",
            "id": "PATH-BIO 682",
            "parent": "PATH-BIO",
            "title": "SENIOR HONORS THESIS II"
        }
    },
    {
        "data": {
            "description": "Instructional orientation to teaching at the higher education level in the agricultural and life sciences, direct teaching experience under faculty supervision, experience in testing and evaluation of students, and the analysis of teaching performance.",
            "id": "PATH-BIO 799",
            "parent": "PATH-BIO",
            "title": "PRACTICUM IN VETERINARY SCIENCE TEACHING"
        }
    },
    {
        "data": {
            "description": "Introduction to basic concepts in virology and covers biology and pathogenesis of viral diseases of animals with an emphasis on viruses important to veterinary medicine.",
            "id": "PATH-BIO 513",
            "parent": "PATH-BIO",
            "title": "VETERINARY VIROLOGY"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Learn basic concepts and approaches to population problems in veterinary medicine. Methods appropriate to investigation of disease outbreaks, surveillance of animal disease and production and the design of epidemiological studies of the determinants of disease are presented.",
            "id": "PATH-BIO 512",
            "parent": "PATH-BIO",
            "title": "INTRODUCTION TO VETERINARY EPIDEMIOLOGY"
        }
    },
    {
        "data": {
            "description": "Morphological manifestations of disease in animals. Diseases and disease processes will be discussed by organ system, stressing important diseases in domestic animals.",
            "id": "PATH-BIO 560",
            "parent": "PATH-BIO",
            "title": "VETERINARY SYSTEMIC PATHOLOGY I"
        }
    },
    {
        "data": {
            "description": "Morphological manifestations of disease in animals. Diseases and disease processes will be discussed by organ system, stressing important diseases in domestic animals.",
            "id": "PATH-BIO 561",
            "parent": "PATH-BIO",
            "title": "VETERINARY SYSTEMIC PATHOLOGY II"
        }
    },
    {
        "data": {
            "description": "Offers opportunities for faculty coordinated experience in the veterinary medical profession outside School of Veterinary Medicine.",
            "id": "PATH-BIO 775",
            "parent": "PATH-BIO",
            "title": "EXTERNSHIP"
        }
    },
    {
        "data": {
            "description": "Principles and application of chemical equilibrium, coordination chemistry, oxidation-reduction and electrochemistry, kinetics, nuclear chemistry, introduction to organic chemistry, and chemistry laboratory skills.",
            "id": "CHEM 104",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Projects in the laboratory and/or through library work in specific subject area under the direct guidance of faculty member.",
            "id": "PATH-BIO 699",
            "parent": "PATH-BIO",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Provides experience with necropsy procedures in all animal species and in developing interpretive skills by participating in the School of Veterinary Medicine/Veterinary Medical Teaching Hospital diagnostic anatomic pathology service under the guidance of the faculty.",
            "id": "PATH-BIO 660",
            "parent": "PATH-BIO",
            "title": "VETERINARY NECROPSY ROTATION"
        }
    },
    {
        "data": {
            "description": "Provides instruction in principles and concepts of research ethics through presentations and discussion of case studies. Topics pertinent to development of a successful career in research are also included.",
            "id": "COMPBIO/PATH-BIO 812",
            "title": "RESEARCH ETHICS AND CAREER DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Role and regulatory obligations of the veterinary profession in preventing zoonoses, understanding the need for judicious use of antibiotics, and promoting the safety of food of animal origin.",
            "id": "PATH-BIO 515",
            "parent": "PATH-BIO",
            "title": "REGULATORY VETERINARY MEDICINE AND PUBLIC HEALTH"
        }
    },
    {
        "data": {
            "description": "Stoichiometry and the mole concept, the behavior of gases, liquids and solids, thermochemistry, electronic structure of atoms and chemical bonding, descriptive chemistry of selected elements and compounds, intermolecular forces, and chemistry laboratory skills.",
            "id": "CHEM 103",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "The biology of water-borne, food-borne, soil-borne and vector-borne parasites of animals including humans. Parasites are explored in the context of transmission, associated disease, diagnosis and treatment options, and environmental, cultural and socioeconomic drivers of disease epidemiology.",
            "id": "ENTOM/MM&I/PATH-BIO/ZOOLOGY 350",
            "title": "PARASITOLOGY"
        }
    },
    {
        "data": {
            "description": "The two semester sequenceMATH 112-MATH 113covers similar material asMATH 114, but in a slower pace. Not recommended for students with less than an AB inMATH 96.",
            "id": "MATH 114",
            "parent": "MATH",
            "title": "ALGEBRA AND TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Part of a 2-semester sequence withMATH 217; these two courses together are equivalent toMATH 114and221.",
            "id": "MATH 171",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY I"
        }
    },
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics and selected topics in Animal Physiology.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Topics include: selected topics in plant physiology, a survey of the five major kingdoms of organisms, speciation and evolutionary theory, and ecology at multiple levels of the biological hierarchy.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Topics of importance to the animal health field.",
            "id": "PATH-BIO 150",
            "parent": "PATH-BIO",
            "title": "CONTEMPORARY TOPICS AND CAREERS IN THE VETERINARY SCIENCES"
        }
    },
    {
        "data": {
            "description": "Topics vary.",
            "id": "PATH-BIO 675",
            "parent": "PATH-BIO",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "id": "BIOCORE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "PATH-BIO",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "PATH-BIO 307"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 152"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 101"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "target": "BIOLOGY/ZOOLOGY 102"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 151"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ENTOM/MM&I/PATH-BIO/ZOOLOGY 350"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "MM&I/PATH-BIO 528"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 102",
            "target": "ENTOM/MM&I/PATH-BIO/ZOOLOGY 350"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 109"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "MM&I/PATH-BIO 528"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 113"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 113",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 114",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 114"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "CHEM 109"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 114"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 171"
        }
    }
]