[
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "PEDIAT 909"
        }
    },
    {
        "data": {
            "description": "Focus on assessing patients with urgent medical conditions, providing acute inpatient care, and transitioning patients to other care settings or home under the care of other professionals. Provide acute care in inpatient and outpatient urgent care settings as well as on the inpatient wards, and develop acute management plans and subsequent transition of care plans. Clinical experiences in acute care settings such as the emergency department and inpatient medicine (both general and subspecialty), psychiatry, and neurology. Builds upon fundamental science concepts introduced in Body in Balance and Mind and Motion, including Ohm's Law, acid-base balance, and volume regulation. Organ system-based approach employing varied modalities. Complete an integrated patient-centered experience by participating in the care of a patient from an urgent admission through inpatient treatment and discharge.",
            "id": "MEDSC-M 812",
            "parent": "MEDSC-M",
            "title": "ACUTE CARE"
        }
    },
    {
        "data": {
            "description": "Supervised by house staff and attending physicians activities include attending a variety of outpatient clinics with pediatric cardiologists, inpatient pediatric cardiology rounds and consults with the inpatient service team, observing various scheduled procedures (including echocardiography, ECG, cardiac catheterization, electrophysiology study), attending pediatric cardiology related conferences, presenting cases and teaching topics, and discussing patient cases.",
            "id": "PEDIAT 943",
            "parent": "PEDIAT",
            "title": "PEDIATRIC CARDIOLOGY ELECTIVE"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 810",
            "target": "PEDIAT 921"
        }
    },
    {
        "data": {
            "description": "Introduction to core basic science, pathophysiologic, and diagnostic principles requisite for the care and treatment of patients with musculoskeletal, neurologic, and psychiatric presentations and disorders. Basic science concepts include those from the traditional disciplines of cell biology, histology, biochemistry, anatomy, embryology, neuroscience, and behavioral science. Regular integration of these topics with their pathologic and pathophysiologic counterparts. Integration of content related to other competency domains, or \"longitudinal threads\", that include patient care  communication, evidence based medicine, health information technology, quality improvement  patient safety, professionalism, scientific inquiry and public health.",
            "id": "MEDSC-M 775",
            "parent": "MEDSC-M",
            "title": "MIND & MOTION"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 812",
            "target": "PEDIAT 938"
        }
    },
    {
        "data": {
            "description": "Pediatric acting interns will serve as the primary provider for pediatric patients in one of the offered inpatient settings. This includes responsibility for diagnosis and management; communication with patients, families, and other interdisciplinary care providers; and self-directed learning and application of evidence-based medicine. The student will work under the direct supervision of a senior resident, fellows and the pediatric faculty. This rotation will provide the student with the opportunity to function at the intern level and play an active role in inpatient management of inpatient pediatric patients.",
            "id": "PEDIAT 938",
            "parent": "PEDIAT",
            "title": "INPATIENT ACTING INTERNSHIP-PEDIATRICS"
        }
    },
    {
        "data": {
            "description": "Care of adults and children undergoing an operation or procedure, including perioperative preparation, operative care, and post-operative cares for core clinical conditions in the specialties of anesthesia, neurosurgery, ophthalmology, general surgery, otolaryngology, urology, cardiothoracic surgery, peripheral vascular surgery, orthopedics, plastic and reconstructive surgery, and gynecology, as well as interventional radiology, procedural cardiology and gastroenterology. Basic science concepts include cerebral spinal fluid production and flow, fluids and electrolytes, consciousness, inflammation and wound healing, and cancer biology. Anatomic approach using case discussions, podcasts, curated independent reading, online nationally supported modules, and simulation skills. Longitudinal patient care experience integrating communication, evidence based medicine, health information technology, quality improvement  patient safety, professionalism, scientific inquiry, and public health.",
            "id": "MEDSC-M 813",
            "parent": "MEDSC-M",
            "title": "SURGICAL AND PROCEDURAL CARE"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 812",
            "target": "PEDIAT 921"
        }
    },
    {
        "data": {
            "description": "Supervised activities include seeing patients in outpatient clinics, rounding with inpatient attendings, attending weekly pediatric rheumatology conferences, observing procedures and attending one-to-one tutorials.",
            "id": "PEDIAT 970",
            "parent": "PEDIAT",
            "title": "PEDIATRIC RHEUMATOLOGY ELECTIVE"
        }
    },
    {
        "data": {
            "id": "MEDSC-M",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 775",
            "target": "MEDSC-M 810"
        }
    },
    {
        "data": {
            "description": "Develop clinical knowledge and skills necessary to care for patients in Pediatrics and Obstetrics and Gynecology, with emphasis on unique skills such as taking care of vulnerable populations as identified in women's and child health and working with caregivers in addition to the patient themselves. Increase knowledge of fundamental science concepts introduced in Human Family Tree during Phase 1 of the curriculum, such as embryology and teratology, genetic testing, and neurodevelopment. Clinical experiences will occur in a range of representative inpatient, outpatient and surgical settings. In structured educational sessions, compare and contrast selected topics in pediatric, obstetric, and gynecologic patient populations, highlighting the relevant physiology, pathophysiology, basic science, and public health topics.",
            "id": "MEDSC-M 810",
            "parent": "MEDSC-M",
            "title": "SPECIALIZED CARE OF OBSTETRIC, GYNECOLOGIC, AND PEDIATRIC PATIENTS (SCOPE)"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 810",
            "target": "PEDIAT 938"
        }
    },
    {
        "data": {
            "id": "PEDIAT",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Independent study projects as arranged with faculty or instructional staff.",
            "id": "PEDIAT 699",
            "parent": "PEDIAT",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Supervised activities include attending pediatric hematology/oncology clinics, evaluating patients in the clinics and attending the weekly pediatric hematology/oncology conferences.",
            "id": "PEDIAT 956",
            "parent": "PEDIAT",
            "title": "PEDIATRIC HEMATOLOGY-ONCOLOGY ELECTIVE"
        }
    },
    {
        "data": {
            "description": "Use both didactics and simulations to cover high yield topics that a new Pediatric Intern should know to start a Pediatrics Residency. Working with a team of faculty, multi-disciplinary staff, residents, fellows and course directors, review topics such as intravenous fluid management, nutrition, vaccines, newborn care, fever and antibiotic therapy, developmental skills, hematology/oncology emergencies, dermatology, respiratory distress, endocrine emergencies, radiology, and informed consent. Participate in simulations to review medical knowledge, communication skills, and teamwork. Participate in difficult communication cases including obtaining informed consent or talking with parents of patients who choose to decline recommended management options. Practice common pediatric skills including IV placement, umbilical line placement, defibrilation, airway management, lumbar puncture, and suturing.",
            "id": "PEDIAT 909",
            "parent": "PEDIAT",
            "title": "PEDIATRICS INTERNSHIP PREP COURSE (PIPC)"
        }
    },
    {
        "data": {
            "description": "Supervised activities include interacting with patients primarily in outpatient setting, participating in all clinics, rounds, consults and other components of the service. Active participation in patient evaluations and patient management is another component of this rotation.",
            "id": "PEDIAT 953",
            "parent": "PEDIAT",
            "title": "CLINICAL GENETICS ELECTIVE"
        }
    },
    {
        "data": {
            "description": "Multiple professional and scientific groups have identified the underrepresentation and lack of advancement of women in academia as a national workforce problem. Review evolving perspectives of leadership and how unconscious assumptions about the behaviors and traits of men, women, and leaders impede women's advancement. Emphasizes the implications for women in the fields of science, health and engineering and explore the potential impact on the advancement of knowledge and improvements in health. Provides the opportunity to apply evidence-based perspectives using experiential methods.",
            "id": "MEDPHYS/PEDIAT 705",
            "title": "WOMEN AND LEADERSHIP: SCIENCE, HEALTH AND ENGINEERING"
        }
    },
    {
        "data": {
            "description": "Independent research under the direct supervision of department of pediatrics faculty. Each students research project is individualized to meet student research goals within context of faculty research needs.",
            "id": "PEDIAT 910",
            "parent": "PEDIAT",
            "title": "INDEPENDENT READING AND RESEARCH IN PEDIATRICS"
        }
    },
    {
        "data": {
            "description": "Students will participate in pediatric gastroenterology outpatient clinics, round with inpatient faculty, attend pediatric gastroenterology conferences, attend daily pediatric conferences including morning report, case conferences, and grand rounds. Students will also be able to observe procedures in the operating room. Students will be responsible for a 20 minute case-based presentation at the end of the rotation.",
            "id": "PEDIAT 973",
            "parent": "PEDIAT",
            "title": "PEDIATRIC GASTROENTEROLOGY"
        }
    },
    {
        "data": {
            "description": "Supervised activities include: attending outpatient clinics, rounding with inpatient attendings, attending weekly didactic and clinical conferences, observation of flexible bronchoscopies and participating in one-on-one tutorials.",
            "id": "PEDIAT 967",
            "parent": "PEDIAT",
            "title": "PEDIATRIC PULMONOLOGY ELECTIVE"
        }
    },
    {
        "data": {
            "description": "Supervised activities include interacting with patients primarily in outpatient (some inpatient) settings, performing histories and physical examinations and managing patients with supervision by our staff.  Group and individual discussions concerning patients seen in both the outpatient and inpatient settings will occur.",
            "id": "PEDIAT 950",
            "parent": "PEDIAT",
            "title": "PEDIATRIC ENDOCRINOLOGY AND DIABETES ELECTIVE"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 810",
            "target": "PEDIAT 909"
        }
    },
    {
        "data": {
            "description": "Supervised activities include inpatient management in an intensive care setting and attending all the neonatal division educational sessions, which may include; Neonatology journal club, Multidisciplinary discharge planning rounds, and Individual patient care conferences.",
            "id": "PEDIAT 935",
            "parent": "PEDIAT",
            "title": "SURGICAL, NEUROLOGIC, & COMPLEX CARE OF THE NEONATE ELECTIVE"
        }
    },
    {
        "data": {
            "description": "Supervised activities include interacting with patients primarily in outpatient setting, participating in all clinical activities and other components of the individualized rotation.",
            "id": "PEDIAT 919",
            "parent": "PEDIAT",
            "title": "INDIVIDUALIZED CLINICAL ELECTIVE IN PEDIATRICS"
        }
    },
    {
        "data": {
            "description": "Provides an in-depth introduction to a variety of kidney diseases, allowing students to build upon their ability to diagnose and treat complex pediatric and adolescent patients. Students will rotate through the American Family Children's Hospital inpatient nephrology service, outpatient nephrology clinic, and the inpatient dialysis unit. Two and four week rotations are available.",
            "id": "PEDIAT 963",
            "parent": "PEDIAT",
            "title": "PEDIATRIC NEPHROLOGY"
        }
    },
    {
        "data": {
            "description": "Supervised activities include interacting with patients in adolescent outpatient clinics, performing histories, physical examinations and managing patients with supervision by our staff.  Give a didactic presentation at the end of the rotation on a topic of student's choice as well as write a blog for Writes of Passage. Customize clinic schedule from a menu of opportunities provided by the director.",
            "id": "PEDIAT 940",
            "parent": "PEDIAT",
            "title": "ADOLESCENT MEDICINE ELECTIVE"
        }
    },
    {
        "data": {
            "description": "Supervised activities include seeing patients in outpatient clinics, observing procedures and attending weekly pediatric allergy conferences.  Hands-on clerkship experience in this sub-specialty involves both very common and uncommon diseases in pediatrics in allergy and immunology.  Specific topics that are covered include food allergy, asthma, allergic rhinitis, atopic dermatitis, and primary immune deficiency.  As these diseases are increasing in prevalence and have broad impacts on child health, this experience is ideal preparation for careers in pediatric and medical specialties, or surgical specialties.",
            "id": "PEDIAT 941",
            "parent": "PEDIAT",
            "title": "PEDIATRIC ALLERGY/IMMUNOLOGY ELECTIVE"
        }
    },
    {
        "data": {
            "description": "Under direct supervision by faculty, participate in medical co-management and care coordination for children with medical complexity. Multifaceted approach to learning about children with medical complexity, with focus on history and exam skills during scheduled maintenance and acute care visits. Pediatric ethics, organizing and maintaining accurate and up-to-date electronic medical records, documentation skills.",
            "id": "PEDIAT 942",
            "parent": "PEDIAT",
            "title": "PEDIATRIC COMPLEX CARE ELECTIVE"
        }
    },
    {
        "data": {
            "description": "Participate in an interdisciplinary training program to learn foundational knowledge, skills, and attitudes related to the care of individuals with developmental disabilities. Covers neuromotor development, cognitive development, communication development, psychosocial development, physical health, quality of life, and other topics relevant to the care of individuals with developmental disabilities, as well as Lifecourse Story Team sessions that focus on a family-centered exploration of the experience of a child with a developmental disability and their family. Learn the role of different disciplines and the relevant systems of care for individuals with developmental disabilities. Explore impact of different legal and health policies on individuals with developmental disabilities and their families, as well as the concept of \"ableism\" and strategies to reduce this.",
            "id": "PEDIAT 921",
            "parent": "PEDIAT",
            "title": "WISCONSIN LEADERSHIP EDUCATION IN NEURODEVELOPMENTAL AND RELATED DISABILITIES (LEND)"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 773",
            "target": "MEDSC-M 810"
        }
    },
    {
        "data": {
            "description": "Students will round as members of the inpatient Pediatric Infectious Disease consult team. They will perform infectious disease focused history and physical examinations and participate in the development and communication of management recommendations. Students will also attend outpatient infectious disease clinics, case conferences, microbiology rounds and daily pediatric conferences including morning report, problem conference and grand rounds.",
            "id": "PEDIAT 971",
            "parent": "PEDIAT",
            "title": "PEDIATRIC INFECTIOUS DISEASES"
        }
    },
    {
        "data": {
            "description": "Supervised activities include interacting with patients and Licensed Athletic Trainers, residents and primary care sports medicine fellow in various outpatient settings and participating in assigned sports medicine clinics.  Participating in patient evaluations, patient management and attending the weekly Friday morning sports medicine conference are additional components of this rotation.  Other opportunities may include observing or evaluating patients in other clinical situations including the McClain Center UW athlete clinics, high school game coverage, PT clinics, other orthopedic clinics.",
            "id": "PEDIAT 966",
            "parent": "PEDIAT",
            "title": "PRIMARY CARE SPORTS MEDICINE ELECTIVE"
        }
    },
    {
        "data": {
            "description": "Research and/or scholarly work (e.g. quality improvement, clinical case reports) supervised by faculty and/or staff member within the Department of Pediatrics with appropriate content expertise. A supervisor and project must be identified prior to requesting enrollment in this course.",
            "id": "PEDIAT 990",
            "parent": "PEDIAT",
            "title": "RESEARCH"
        }
    },
    {
        "data": {
            "description": "Activities include attending deliveries of high-risk infants, admitting and managing a circumscribed select group of patients under the supervision of the attending neonatologist. Daily notes and orders are written and counter-signed by the neonatologist. Weekly rounds are made with social worker/discharge planner. Night call will be taken every fourth night. Attend appropriate perinatal conferences.",
            "id": "PEDIAT 930",
            "parent": "PEDIAT",
            "title": "PEDIATRIC NEONATOLOGY ELECTIVE"
        }
    },
    {
        "data": {
            "description": "An introduction to developmental pediatrics and the care of children with developmental disabilities. Students will rotate through a variety of clinics which will be tailored based on interest.",
            "id": "PEDIAT 975",
            "parent": "PEDIAT",
            "title": "DEVELOPMENTAL PEDIATRICS"
        }
    },
    {
        "data": {
            "description": "Focuses on molecular, genetic, embryologic, hormonal, anatomical and physiological factors that govern fertility, cell growth, fetal development, and pregnancy as well as the congenital anomalies that can occur when those processes are aberrant. Encompasses the full life-cycle spectrum including childhood growth and development, young adulthood/puberty, issues affecting adolescents and young adults, genetic basis of human disease, reproductive health, menopause, aging, unregulated cell growth (cancer) and end of life issues. Significant content from other competency domains, or \"longitudinal threads\", such as public health, advocacy, ethics, patient care/communication and clinical skills.",
            "id": "MEDSC-M 773",
            "parent": "MEDSC-M",
            "title": "HUMAN FAMILY TREE"
        }
    }
]