[
    {
        "data": {
            "description": "An introduction to proof writing techniques through a study of classical topics in elementary number theory. Topics include the divisibility, basic properties of primes, congruences, Fermat's theorem.",
            "id": "MATH 467",
            "parent": "MATH",
            "title": "INTRODUCTION TO NUMBER THEORY"
        }
    },
    {
        "data": {
            "description": "Feeling like life is absurd, that existence is meaningless? Worried that you aren't living authentically? Then a course in Existentialism is just what you need. Study the classic texts of this intellectual movement that expressed despondency about Western civilization, its decadence, and its values. Along the way you'll meet the likes of Kierkegaard, Nietzsche, Heidegger, Sartre, Camus, and De Beauvoir.",
            "id": "PHILOS 440",
            "parent": "PHILOS",
            "title": "EXISTENTIALISM"
        }
    },
    {
        "data": {
            "description": "A philosophical study of some of the major moral issues in contemporary society, such as those concerning abortion, euthanasia, punishment, property, politics, sex, nuclear disarmament, and world hunger.",
            "id": "PHILOS 341",
            "parent": "PHILOS",
            "title": "CONTEMPORARY MORAL ISSUES"
        }
    },
    {
        "data": {
            "description": "A survey of major philosophers and philosophical currents within Judaism from antiquity through the seventeenth century.",
            "id": "JEWISH/PHILOS/RELIGST 435",
            "title": "JEWISH PHILOSOPHY FROM ANTIQUITY TO THE SEVENTEENTH CENTURY"
        }
    },
    {
        "data": {
            "description": "A survey of problems concerning the nature, sources, and limits of human knowledge, including such topics as scepticism, the concept of knowledge, sensory perception, evidence, justified belief, induction.",
            "id": "PHILOS 503",
            "parent": "PHILOS",
            "title": "THEORY OF KNOWLEDGE"
        }
    },
    {
        "data": {
            "description": "Adequacy of ethical theories in handling such wrongs as harm to the land, to posterity, to endangered species, and to the ecosystem itself. Exploration of the view that not all moral wrongs involve harm to humans. Inquiry into the notion of the quality of life and the ethics of the \"lifeboat\" situation.",
            "id": "ENVIRST/PHILOS 441",
            "title": "ENVIRONMENTAL ETHICS"
        }
    },
    {
        "data": {
            "description": "An examination of select topics in philosophy.",
            "id": "PHILOS 701",
            "parent": "PHILOS",
            "title": "READING SEMINAR"
        }
    },
    {
        "data": {
            "description": "An examination of the philosophical problems associated with free will.",
            "id": "PHILOS 530",
            "parent": "PHILOS",
            "title": "FREEDOM FATE AND CHOICE"
        }
    },
    {
        "data": {
            "description": "An in-depth study of a selection of ethical issues arising from the application of modern biotechnology to microorganisms, plants, non-human animals, and human beings. We will aim at a discussion that is informed by empirical research and by work done in ethical theory, political philosophy, and other relevant disciplines, and whose character is rigorous, clear, nuanced, and unbiased.",
            "id": "AGRONOMY/C&ESOC/MEDHIST/PHILOS 565",
            "title": "THE ETHICS OF MODERN BIOTECHNOLOGY"
        }
    },
    {
        "data": {
            "description": "An intensive study of one or more topics such as: existence, universals and particulars, space and time, individuals, individuation, categories, substance and attribute, necessity, events and processes.",
            "id": "PHILOS 562",
            "parent": "PHILOS",
            "title": "SPECIAL TOPICS IN METAPHYSICS"
        }
    },
    {
        "data": {
            "description": "An introduction to linear algebra and differential equations with emphasis on the relationship between the theory of linear algebra and analytical and numerical techniques for solving differential equations. Linear algebra topics include linear systems, matrices and their algebra, vector spaces and linear transformations, eigenvalues and eigenvectors. Topics from differential equations include first order ODE, homogeneous and nonhomogeneous linear systems, and numerical methods.",
            "id": "MATH 320",
            "parent": "MATH",
            "title": "LINEAR ALGEBRA AND DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "description": "An introduction to linear algebra. Topics include matrix algebra, linear systems of equations, vector spaces, sub-spaces, linear dependence, span, basis, rank of matrices, determinants, linear transformations, coordinate representations, kernel, range, eigenvalues and eigenvectors, diagonalization, inner products and orthogonal vectors, symmetric matrices. Covers linear algebra topics in greater depth and detail thanMATH 320. Formal techniques in mathematical argument [MATH 341] not covered.",
            "id": "MATH 340",
            "parent": "MATH",
            "title": "ELEMENTARY MATRIX AND LINEAR ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Analysis of current philosophies of art and of criticism.",
            "id": "PHILOS 553",
            "parent": "PHILOS",
            "title": "AESTHETICS"
        }
    },
    {
        "data": {
            "description": "Analysis of religious experience and activity, and examination of principal religious ideas in light of modern psychology, philosophy, science, and anthropology.",
            "id": "PHILOS/RELIGST 501",
            "title": "PHILOSOPHY OF RELIGION"
        }
    },
    {
        "data": {
            "description": "Argument in familiar contexts; emphasis upon developing critical skills in comprehending, evaluating, and engaging in contemporary forms of reasoning, with special attention to the uses of argument in mass communication media.",
            "id": "PHILOS 210",
            "parent": "PHILOS",
            "title": "REASON IN COMMUNICATION"
        }
    },
    {
        "data": {
            "description": "Basic concepts of logic, sets, partial order and other relations, and functions. Basic concepts of mathematics (definitions, proofs, sets, functions, and relations) with a focus on discrete structures: integers, bits, strings, trees, and graphs.  Propositional logic, Boolean algebra, and predicate logic. Mathematical induction and recursion. Invariants and algorithmic correctness. Recurrences and asymptotic growth analysis. Fundamentals of counting.",
            "id": "COMPSCI/MATH 240",
            "title": "INTRODUCTION TO DISCRETE MATHEMATICS"
        }
    },
    {
        "data": {
            "description": "Basics of logic and mathematical proofs; propositional logic; first order logic; undecidability.",
            "id": "MATH/PHILOS 571",
            "title": "MATHEMATICAL LOGIC"
        }
    },
    {
        "data": {
            "description": "Case studies of moral issues in business; types or reasons appealed to for settlement.",
            "id": "PHILOS 243",
            "parent": "PHILOS",
            "title": "ETHICS IN BUSINESS"
        }
    },
    {
        "data": {
            "description": "Continuation ofMATH 171. Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Completion ofMATH 217implies completion ofMATH 221and114.",
            "id": "MATH 217",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY II"
        }
    },
    {
        "data": {
            "description": "Covers material in first and second semester calculus but it is intended to teach math majors to write and understand proofs in mathematics in general and in calculus in particular.",
            "id": "MATH 421",
            "parent": "MATH",
            "title": "THE THEORY OF SINGLE VARIABLE CALCULUS"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Covers various philosophers from the 17th century through early 20th century.",
            "id": "PHILOS 432",
            "parent": "PHILOS",
            "title": "HISTORY OF MODERN PHILOSOPHY"
        }
    },
    {
        "data": {
            "description": "Critical examination of classical and contemporary conceptions of moral education.",
            "id": "EDPOL/PHILOS 550",
            "title": "PHILOSOPHY OF MORAL EDUCATION"
        }
    },
    {
        "data": {
            "description": "Develops a habit of mind, competency, and comfort in working with numerical data. Learn to reason and solve quantitative problems from a wide array of authentic contexts and everyday life situations, develop the ability to reason mathematically, and make and evaluate logical arguments supported by quantitative evidence. This course is for students who need to satisfy part A of the Quantitative Reasoning requirement and prepare for QR-B courses, but do not want to continue in the calculus sequence.",
            "id": "MATH 141",
            "parent": "MATH",
            "title": "QUANTITATIVE REASONING AND PROBLEM SOLVING"
        }
    },
    {
        "data": {
            "description": "Economics examined from the viewpoint of the philosophy of science. Normative and positive aspects of economic theory. Deterministic and statistical explanation. Arrow impossibility theorem. Radical economics.",
            "id": "ECON/PHILOS 524",
            "title": "PHILOSOPHY AND ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "Ethical issues apparently created by new biomedical technologies, such as genetic screening, prenatal diagnosis, prolongation of life, treatment of severe birth defects, in vitro fertilization, behavior modification, psychosurgery, and transplantation.",
            "id": "MEDHIST/PHILOS 558",
            "title": "ETHICAL ISSUES IN HEALTH CARE"
        }
    },
    {
        "data": {
            "description": "Ethical theories and problems as discussed in the late nineteenth and twentieth centuries.",
            "id": "PHILOS 541",
            "parent": "PHILOS",
            "title": "MODERN ETHICAL THEORIES"
        }
    },
    {
        "data": {
            "description": "Examination and analysis of conceptions of teaching and learning in classical philosophical works and in contemporary literature in the philosophy of education.",
            "id": "EDPOL/PHILOS 545",
            "title": "PHILOSOPHICAL CONCEPTIONS OF TEACHING AND LEARNING"
        }
    },
    {
        "data": {
            "description": "Examination of selected topics in philosophy.",
            "id": "PHILOS 304",
            "parent": "PHILOS",
            "title": "TOPICS IN PHILOSOPHY: HUMANITIES"
        }
    },
    {
        "data": {
            "description": "Examine debates about the legacy of idealism by discussing some of their most familiar interlocutors - Hegel, Nietzsche, Marx - as well as interlocutors who were obscured from history.",
            "id": "PHILOS 340",
            "parent": "PHILOS",
            "title": "19TH CENTURY PHILOSOPHY: IDEALISM AND ITS CRITICS"
        }
    },
    {
        "data": {
            "description": "Examines ethical issues in the distribution, financing, and delivery of health care (primarily in the United States). Explores key issues in U.S. health policy and forms the empirical foundation for the rest of the class. Engages is ongoing debates in moral and political philosophy over putative entitlements to health and health care. Investigates the nature, justifiability, and methods of health care rationing (including bedside rationing by doctors) and the myriad issues implicated by the near-universally shared goal of health care cost containment.",
            "id": "MEDHIST/PHILOS 505",
            "title": "JUSTICE AND HEALTH CARE"
        }
    },
    {
        "data": {
            "description": "First order differential equations, introduction to multivariable calculus and constrained optimization, infinite sequences and series, methods of approximation, and a brief introduction to probability. Models and applications from business and the social sciences.",
            "id": "MATH 213",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 2"
        }
    },
    {
        "data": {
            "description": "Focus on various central questions in philosophy of science, potentially including topics from the history of philosophy of science as well as topics important to contemporary philosophy of science. Topics might include: What is science? How does scientific explanation work? How do scientists generate and use evidence? What is the relationship between science and social or political values? What are the aims of science? May also include discussion of specific subdisciplines of philosophy of science, such as philosophy of biology, philosophy of physics, philosophy of medicine, and more.",
            "id": "PHILOS 320",
            "parent": "PHILOS",
            "title": "PHILOSOPHY OF SCIENCE"
        }
    },
    {
        "data": {
            "description": "Focuses on ethical issues implicated in a population-level approach to disease prevention and health promotion.  Explores prominent theoretical approaches to public health ethics and engages with several ethical tensions.  Example issues include: the use of coercive or intrusive public health; the justification of patemalistic measures in societies; the extent to which societies should hold individuals responsible for their health conditions; the need to decide who receives life-saving treatment or vaccination; and climate changes and intergenerational justice; ethical issues in international pharmaceutical research.",
            "id": "MEDHIST/PHILOS 515",
            "title": "PUBLIC HEALTH ETHICS"
        }
    },
    {
        "data": {
            "description": "Focuses on the conceptual and ethical recognition of the importance of good teaching, and skills and knowledge drawn from up-to-date pedagogical research. Engages with complex questions about the purposes of higher education and your role in it to better understand your own beliefs, attitudes, and values regarding higher education. Use best practices in teaching and learning in a low-stakes environment to practice and receive feedback on your performance of those skills.",
            "id": "PHILOS 904",
            "parent": "PHILOS",
            "title": "TEACHING PHILOSOPHY"
        }
    },
    {
        "data": {
            "description": "Human beings, and perhaps other kinds of creatures, are agents: we can make things happen. We do things intentionally, guide our behavior in light of our reasons, exhibit self-control, and plan for the future. What is it to be an agent, and what makes an event an intentional action? As Wittgenstein put the question, \"What is left over if I subtract the fact that my arm goes up from the fact that I raise my arm?\" Emphasis on contemporary readings, including Donald Davidson and G.E.M. Anscombe.",
            "id": "PHILOS 566",
            "parent": "PHILOS",
            "title": "PHILOSOPHY OF ACTION"
        }
    },
    {
        "data": {
            "description": "In-depth analysis of ethical issues arising from the practices and advances of brain science in clinical, research, legal, and consumer contexts. Includes a foundation in ethical theory and philosophical methodology.",
            "id": "MEDHIST/PHILOS 534",
            "title": "ETHICS AND THE BRAIN"
        }
    },
    {
        "data": {
            "description": "Independent study as arranged with a faculty member.",
            "id": "PHILOS 599",
            "parent": "PHILOS",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Independent study as arranged with a faculty member.",
            "id": "PHILOS 698",
            "parent": "PHILOS",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Independent study as arranged with a faculty member.",
            "id": "PHILOS 699",
            "parent": "PHILOS",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Independent study as arranged with a faculty member.",
            "id": "PHILOS 799",
            "parent": "PHILOS",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Individual mentored study for graduate students completing theses, as arranged with a faculty member.",
            "id": "PHILOS 990",
            "parent": "PHILOS",
            "title": "RESEARCH AND THESIS"
        }
    },
    {
        "data": {
            "description": "Individual mentored study for graduate students, as arranged with a faculty member.",
            "id": "PHILOS 999",
            "parent": "PHILOS",
            "title": "INDEPENDENT WORK"
        }
    },
    {
        "data": {
            "description": "Individual mentored study for seniors completing theses for honors in the major, as arranged with a faculty member.",
            "id": "PHILOS 681",
            "parent": "PHILOS",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Individual mentored study for seniors completing theses for honors in the major, as arranged with a faculty member.",
            "id": "PHILOS 682",
            "parent": "PHILOS",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Individual mentored study for seniors completing theses, as arranged with a faculty member.",
            "id": "PHILOS 691",
            "parent": "PHILOS",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Individual mentored study for seniors completing theses, as arranged with a faculty member.",
            "id": "PHILOS 692",
            "parent": "PHILOS",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Intensive study of ethical theory, or of one or more ethical theories or moral philosophers of the present or modern period. Variable content.",
            "id": "PHILOS 543",
            "parent": "PHILOS",
            "title": "SPECIAL TOPICS IN ETHICS"
        }
    },
    {
        "data": {
            "description": "Introduces the subject of philosophy through a question that is familiar to nearly every person: What is the meaning of life?  This question will be approached through reading both classical philosophical works and the works of contemporary philosophers.",
            "id": "PHILOS 141",
            "parent": "PHILOS",
            "title": "THE MEANING OF LIFE"
        }
    },
    {
        "data": {
            "description": "Introduction to calculus of functions of several variables; calculus on parameterized curves, derivatives of functions of several variables, multiple integrals, vector calculus.",
            "id": "MATH 234",
            "parent": "MATH",
            "title": "CALCULUS--FUNCTIONS OF SEVERAL VARIABLES"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Introduction to various philosophical questions and to the strategies that philosophers use to address these.",
            "id": "PHILOS 101",
            "parent": "PHILOS",
            "title": "INTRODUCTION TO PHILOSOPHY"
        }
    },
    {
        "data": {
            "description": "Major problems in metaphysics, such as: existence, universals and particulars, space and time, individuals, categories, substance and attribute, necessity.",
            "id": "PHILOS 560",
            "parent": "PHILOS",
            "title": "METAPHYSICS"
        }
    },
    {
        "data": {
            "description": "Major themes of moral philosophy, from Plato and Aristotle to Bentham and Mill, with critical study of outstanding works.",
            "id": "PHILOS 549",
            "parent": "PHILOS",
            "title": "GREAT MORAL PHILOSOPHERS"
        }
    },
    {
        "data": {
            "description": "Nature and functions of science; the logic of scientific method; clarification of such concepts as cause, law, theory, probability, determinism, teleology.",
            "id": "PHILOS 520",
            "parent": "PHILOS",
            "title": "PHILOSOPHY OF THE NATURAL SCIENCES"
        }
    },
    {
        "data": {
            "description": "Nature of mind (mental states such as thinking and feeling) and its relation to physical states, with emphasis on recent advances in philosophy and psychology.",
            "id": "PHILOS 551",
            "parent": "PHILOS",
            "title": "PHILOSOPHY OF MIND"
        }
    },
    {
        "data": {
            "description": "Nature of moral problems and of ethical theory, varieties of moral skepticism, practical ethics and the evaluation of social institutions.",
            "id": "PHILOS 241",
            "parent": "PHILOS",
            "title": "INTRODUCTORY ETHICS"
        }
    },
    {
        "data": {
            "description": "One or more classical philosophers, movements, or problems selected for intensive study.",
            "id": "PHILOS 454",
            "parent": "PHILOS",
            "title": "CLASSICAL PHILOSOPHERS"
        }
    },
    {
        "data": {
            "description": "One or more special topics in the Theory of Knowledge or one or more major theories of knowledge. Variable content.",
            "id": "PHILOS 504",
            "parent": "PHILOS",
            "title": "SPECIAL TOPICS IN THE THEORY OF KNOWLEDGE"
        }
    },
    {
        "data": {
            "description": "One or more specific topics in contemporary philosophy bridging two or more areas such as epistemology, metaphysics, philosophy of mind, philosophy of language, or moral philosophy.",
            "id": "PHILOS 567",
            "parent": "PHILOS",
            "title": "TOPICS IN CONTEMPORARY PHILOSOPHY"
        }
    },
    {
        "data": {
            "description": "Philosophical doctrines involved in justification of political decisions; analysis of some fundamental concepts, e.g. the common good, authority, justice, natural law, natural rights.",
            "id": "PHILOS 555",
            "parent": "PHILOS",
            "title": "POLITICAL PHILOSOPHY"
        }
    },
    {
        "data": {
            "description": "Problems raised by genetics, evolutionary theory, and taxonomy: patterns of explanatory force and dispensability of teleology; objectivity of taxonomy.",
            "id": "ENVIRST/PHILOS 523",
            "title": "PHILOSOPHICAL PROBLEMS OF THE BIOLOGICAL SCIENCES"
        }
    },
    {
        "data": {
            "description": "Propositional and predicate logic, with emphasis on metatheory; independence of rules and completeness theorems; discussion of technical and philosophical limitations of classical logic.",
            "id": "PHILOS 511",
            "parent": "PHILOS",
            "title": "SYMBOLIC LOGIC"
        }
    },
    {
        "data": {
            "description": "Review of linear differential equations; series solution of linear differential equations; boundary value problems; Laplace transforms; possibly numerical methods and two dimensional autonomous systems.",
            "id": "MATH 319",
            "parent": "MATH",
            "title": "TECHNIQUES IN ORDINARY DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "description": "Selected from logic of theory construction, theoretical entities, models, applied mathematics, nature of laws, conventionalism, probability, etc. Variable content.",
            "id": "PHILOS 522",
            "parent": "PHILOS",
            "title": "SPECIAL TOPIC"
        }
    },
    {
        "data": {
            "description": "Selected moral and philosophical issues raised by the Holocaust such as when and whom to rescue; includes issues arising after the annihilation such as forgiveness and reconciliation.",
            "id": "JEWISH/PHILOS 442",
            "title": "MORAL PHILOSOPHY AND THE HOLOCAUST"
        }
    },
    {
        "data": {
            "description": "Selected topics addressing various philosophical questions and to the strategies that philosophers use to address these.",
            "id": "PHILOS 104",
            "parent": "PHILOS",
            "title": "SPECIAL TOPICS IN PHILOSOPHY FOR FRESHMEN"
        }
    },
    {
        "data": {
            "description": "Selected topics in philosophical logic and in the various applications of logic to philosophical problems. Variable content.",
            "id": "PHILOS 512",
            "parent": "PHILOS",
            "title": "METHODS OF LOGIC"
        }
    },
    {
        "data": {
            "description": "Seminar on epistemology.",
            "id": "PHILOS 903",
            "parent": "PHILOS",
            "title": "SEMINAR: EPISTEMOLOGY"
        }
    },
    {
        "data": {
            "description": "Seminar on ethics.",
            "id": "PHILOS 941",
            "parent": "PHILOS",
            "title": "SEMINAR-ETHICS"
        }
    },
    {
        "data": {
            "description": "Seminar on logic.",
            "id": "PHILOS 911",
            "parent": "PHILOS",
            "title": "SEMINAR-LOGIC"
        }
    },
    {
        "data": {
            "description": "Seminar on metaphysics.",
            "id": "PHILOS 960",
            "parent": "PHILOS",
            "title": "METAPHYSICS SEMINAR"
        }
    },
    {
        "data": {
            "description": "Seminar on philosophy of language.",
            "id": "PHILOS 916",
            "parent": "PHILOS",
            "title": "SEMINAR-PHILOSOPHY OF LANGUAGE"
        }
    },
    {
        "data": {
            "description": "Seminar on philosophy of mind.",
            "id": "PHILOS 951",
            "parent": "PHILOS",
            "title": "SEMINAR-PHILOSOPHY OF MIND"
        }
    },
    {
        "data": {
            "description": "Seminar on philosophy of science.",
            "id": "PHILOS 920",
            "parent": "PHILOS",
            "title": "SEMINAR-PHILOSOPHY OF SCIENCE:CAUSATION, EXPLANATION & PROBABILITY"
        }
    },
    {
        "data": {
            "description": "Seminar on social and political philosophy.",
            "id": "PHILOS 955",
            "parent": "PHILOS",
            "title": "SEMINAR SOCIAL AND POLITICAL PHILOSOPHY"
        }
    },
    {
        "data": {
            "description": "Seminar on the history of philosophy focusing on a period or figure(s).",
            "id": "PHILOS 830",
            "parent": "PHILOS",
            "title": "ADVANCED HISTORY OF PHILOSOPHY"
        }
    },
    {
        "data": {
            "description": "Seminar on the history of philosophy focusing on a period or figure(s).",
            "id": "PHILOS 835",
            "parent": "PHILOS",
            "title": "ADVANCED HISTORY OF PHILOSOPHY"
        }
    },
    {
        "data": {
            "description": "Specific topics in social and political philosophy such as war and peace, property and industry, individualism and collectivism, freedom and justice.",
            "id": "PHILOS 557",
            "parent": "PHILOS",
            "title": "ISSUES IN SOCIAL PHILOSOPHY"
        }
    },
    {
        "data": {
            "description": "Sturm-Liouville theory; Fourier series, including mean convergence; boundary value problems for linear second order partial differential equations, including separation of variables and eigenfunction expansions.",
            "id": "MATH 322",
            "parent": "MATH",
            "title": "APPLIED MATHEMATICAL ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Survey of various texts with an emphasis on close reading and developing writing skills.",
            "id": "PHILOS 902",
            "parent": "PHILOS",
            "title": "PROSEMINAR IN PHILOSOPHY"
        }
    },
    {
        "data": {
            "description": "Techniques of integration, improper integrals, first order ordinary differential equations, sequences and series, Taylor series, vector geometry in two and three dimensions.",
            "id": "MATH 222",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 2"
        }
    },
    {
        "data": {
            "description": "The formal characteristics of logical truth and inference.",
            "id": "PHILOS 211",
            "parent": "PHILOS",
            "title": "ELEMENTARY LOGIC"
        }
    },
    {
        "data": {
            "description": "The nature and function of language, theories of meaning, semantic and syntactic paradoxes, proper names, private languages, rules, and linguistic relativity.",
            "id": "PHILOS 516",
            "parent": "PHILOS",
            "title": "LANGUAGE AND MEANING"
        }
    },
    {
        "data": {
            "description": "The real numbers, elements of set theory, metric spaces and basic topology, sequences and series, limits, continuity, differentiation, integration, sequences and series of functions, uniform convergence.",
            "id": "MATH 521",
            "parent": "MATH",
            "title": "ANALYSIS I"
        }
    },
    {
        "data": {
            "description": "The theory of linear algebra with an introduction to proofs and proof writing. Topics include vector spaces, linear dependence, span, basis, linear transformations, kernel, image, inner products and inner product spaces, geometry, eigenvalues, eigenvectors, standard matrix factorizations. Other content includes basic set theory, logical operations, quantifiers, direct and indirect arguments, and induction. Differential equations [MATH 320] not covered.",
            "id": "MATH 341",
            "parent": "MATH",
            "title": "LINEAR ALGEBRA"
        }
    },
    {
        "data": {
            "description": "There are many ethical issues related to food production, distribution, consumption, and policy, including animal welfare, animal rights, vegetarianism and veganism, environmental impact, treatment of workers, prospects for agricultural reform, ethical responsibilities of corporate and industry actors, and labeling issues surrounding the use of genetically engineered foods. Some are more theoretical, such as which individuals affected by agriculture deserve direct moral consideration. Other are more practical, such as how to feed a growing global population. We will begin with a brief survey of ethical theories and methods of ethical reasoning, and then explore, from both personal and policy perspectives, several food ethics issues. Among the aims of the course are the goals of helping you think critically about the ethically relevant impacts of your own food choices and improving your understanding of ethical issues implicated in food systems.",
            "id": "MEDHIST/PHILOS 344",
            "title": "FOOD ETHICS"
        }
    },
    {
        "data": {
            "description": "Topics from historical and contemporary feminist thought; attention to one or more feminist philosophers, historical movements, philosophical frameworks, or sets of philosophically related issues.",
            "id": "PHILOS 556",
            "parent": "PHILOS",
            "title": "TOPICS IN FEMINISM AND PHILOSOPHY"
        }
    },
    {
        "data": {
            "description": "Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Part of a 2-semester sequence withMATH 217; these two courses together are equivalent toMATH 114and221.",
            "id": "MATH 171",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY I"
        }
    },
    {
        "data": {
            "description": "Topics in multi-variable calculus and introduction to differential equations.",
            "id": "MATH 376",
            "parent": "MATH",
            "title": "TOPICS IN MULTI-VARIABLE CALCULUS AND DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "description": "Treatment of a topic in philosophy in a course offered at a university outside the United States.",
            "id": "PHILOS 106",
            "parent": "PHILOS",
            "title": "STUDY ABROAD IN PHILOSOPHY"
        }
    },
    {
        "data": {
            "description": "Treatment of a topic in philosophy in a course offered at a university outside the United States.",
            "id": "PHILOS 206",
            "parent": "PHILOS",
            "title": "STUDY ABROAD IN PHILOSOPHY"
        }
    },
    {
        "data": {
            "description": "Treatment of a topic in philosophy in a course offered at a university outside the United States.",
            "id": "PHILOS 506",
            "parent": "PHILOS",
            "title": "STUDY ABROAD IN PHILOSOPHY"
        }
    },
    {
        "data": {
            "description": "Various philosophers from the presocratics to the Stoics and Epicureans; particular emphasis on Plato and Aristotle.",
            "id": "PHILOS 430",
            "parent": "PHILOS",
            "title": "HISTORY OF ANCIENT PHILOSOPHY"
        }
    },
    {
        "data": {
            "description": "Vector analysis: algebra and geometry of vectors, vector differential and integral calculus, theorems of Green, Gauss, and Stokes; complex analysis: analytic functions, complex integrals and residues, Taylor and Laurent series.",
            "id": "MATH 321",
            "parent": "MATH",
            "title": "APPLIED MATHEMATICAL ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Vector spaces and linear transformations, differential calculus of scalar and vector fields, determinants, eigenvalues and eigenvectors, multiple integrals, line integrals, and surface integrals. Freshmen students are invited to enroll by the Department of Mathematics.",
            "id": "MATH 375",
            "parent": "MATH",
            "title": "TOPICS IN MULTI-VARIABLE CALCULUS AND LINEAR ALGEBRA"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "PHILOS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "COMPSCI/MATH 240",
            "target": "MATH 467"
        }
    },
    {
        "data": {
            "source": "MATH 141",
            "target": "PHILOS 210"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "MATH 217"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 213"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 213",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 217",
            "target": "COMPSCI/MATH 240"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 222"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 234"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 319"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 320"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 340"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 467"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "MATH 321"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "MATH 341"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "MATH 421"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "MATH 521"
        }
    },
    {
        "data": {
            "source": "MATH 319",
            "target": "MATH 321"
        }
    },
    {
        "data": {
            "source": "MATH 320",
            "target": "MATH 321"
        }
    },
    {
        "data": {
            "source": "MATH 321",
            "target": "MATH 322"
        }
    },
    {
        "data": {
            "source": "MATH 322",
            "target": "MATH 521"
        }
    },
    {
        "data": {
            "source": "MATH 340",
            "target": "MATH 321"
        }
    },
    {
        "data": {
            "source": "MATH 340",
            "target": "MATH 467"
        }
    },
    {
        "data": {
            "source": "MATH 341",
            "target": "MATH 321"
        }
    },
    {
        "data": {
            "source": "MATH 375",
            "target": "MATH 321"
        }
    },
    {
        "data": {
            "source": "MATH 375",
            "target": "MATH 376"
        }
    },
    {
        "data": {
            "source": "MATH 375",
            "target": "MATH 467"
        }
    },
    {
        "data": {
            "source": "MATH 376",
            "target": "MATH 321"
        }
    },
    {
        "data": {
            "source": "MATH 376",
            "target": "MATH 322"
        }
    },
    {
        "data": {
            "source": "MATH 421",
            "target": "MATH 521"
        }
    },
    {
        "data": {
            "source": "MATH 421",
            "target": "MATH/PHILOS 571"
        }
    },
    {
        "data": {
            "source": "MATH 467",
            "target": "MATH/PHILOS 571"
        }
    },
    {
        "data": {
            "source": "MATH 521",
            "target": "MATH/PHILOS 571"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 141"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "PHILOS 211",
            "target": "PHILOS 511"
        }
    },
    {
        "data": {
            "source": "PHILOS 211",
            "target": "PHILOS 512"
        }
    }
]