[
    {
        "data": {
            "description": "Provides learners with information regarding self-care of common, minor health conditions.  Emphasis on: illness prevention, health condition symptoms, guidelines for over-the-counter product use, adverse effects and alcohol/drug interactions of over-the-counter products, when to request professional care.",
            "id": "PHMPRAC 305",
            "parent": "PHMPRAC",
            "title": "CONSUMER SELF-CARE AND OVER-THE-COUNTER DRUGS"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 556",
            "target": "PHMPRAC 655"
        }
    },
    {
        "data": {
            "description": "Expand upon the knowledge gained in Practice Innovation I to produce positive change within the health care system. Students will integrate concepts in their practice area of interest with the project management skills learned placing special emphasis on project implementation, measurement, and articulation of results.",
            "id": "PHMPRAC 629",
            "parent": "PHMPRAC",
            "title": "PRACTICE INNOVATION II"
        }
    },
    {
        "data": {
            "description": "Pharmacotherapeutics content and application for advanced practice nursing. Emphasis on selection of appropriate therapeutics, development of clinical decision-making skills, and examination of legal, ethical, and safety issues in prescribing medications.",
            "id": "NURSING/PHMPRAC 605",
            "title": "PHARMACOTHERAPEUTICS FOR ADVANCED PRACTICE NURSES"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 426",
            "target": "PHMPRAC 526"
        }
    },
    {
        "data": {
            "description": "Clinical application of medications in the management of various disease states. Assessment and therapeutic monitoring of disease states and drug therapy using the concepts of pharmacokinetics/dynamics, drug interactions, pharmacy practice and patient counseling. Topics include cardiovascular and pulmonary therapeutics.",
            "id": "PHMPRAC 556",
            "parent": "PHMPRAC",
            "title": "PHARMACOTHERAPY II"
        }
    },
    {
        "data": {
            "description": "Develop professional identity and demonstrate behaviors that regulate personal emotions and support well-being.  Identify personal strengths and communicate these strengths to others.  Engage in continuous professional and interprofessional development to provide patient care that is safe and equitable.",
            "id": "PHMPRAC 463",
            "parent": "PHMPRAC",
            "title": "PROFESSIONAL DEVELOPMENT AND ENGAGEMENT II- CULTIVATING SELF- AWARENESS"
        }
    },
    {
        "data": {
            "description": "Integrates prior course work in pharmacotherapy, pathophysiology, and drug literature evaluation into the provision of pharmaceutical care to ambulatory patients. Activities include conducting patient interviews and assessments, providing drug information to patients and health professionals, and monitoring drug therapy in ambulatory settings.",
            "id": "PHMPRAC 741",
            "parent": "PHMPRAC",
            "title": "AMBULATORY PHARMACEUTICAL CARE CLERKSHIP"
        }
    },
    {
        "data": {
            "description": "Provides students with knowledge and skills needed to perform triage and make self-care and therapeutic recommendations for self-limiting health conditions commonly encountered in pharmacy practice.",
            "id": "PHMPRAC 638",
            "parent": "PHMPRAC",
            "title": "NONPRESCRIPTION PRODUCTS & SELF-CARE"
        }
    },
    {
        "data": {
            "description": "Gain foundational knowledge of the societal implications of antimicrobial resistance and the basic tenets of antimicrobial stewardship in multiple practice settings. Apply these tenets by developing antimicrobial stewardship intervention(s) and design measurement of associated outcomes.",
            "id": "PHMPRAC 560",
            "parent": "PHMPRAC",
            "title": "SEMINARS IN ANTIMICROBIAL STEWARDSHIP"
        }
    },
    {
        "data": {
            "description": "Develop knowledge and skills needed to perform triage and make self-care and therapeutic recommendations for self-limiting health conditions commonly encountered in pharmacy practice.",
            "id": "PHMPRAC 438",
            "parent": "PHMPRAC",
            "title": "NONPRESCRIPTION MEDICATIONS AND SELF-CARE"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 526",
            "target": "PHMPRAC 625"
        }
    },
    {
        "data": {
            "description": "Preparation for antimicrobial exposure and monitoring during internships to ensure safe and effective patient use of antimicrobials. Exposure to antibiotic-related drug information questions in the community and institution settings and review of primary literature to respond to these questions.",
            "id": "PHMPRAC 559",
            "parent": "PHMPRAC",
            "title": "INTRODUCTION TO ANTIMICROBIAL PHARMACOTHERAPY"
        }
    },
    {
        "data": {
            "description": "Integrates prior didactic course work into the provision of care and the development and delivery of services for hospitalized patients. Exposure to the five pillars of the medication use system (prescribing, transcribing, dispensing, administering, monitoring), plus procurement/storage along with the hospital services and processes that support them. Includes exposure to hospital-based services/programs/committees such as investigational drugs, Pharmacy and Therapeutics, quality/performance improvement (MUE), technologies, and personnel management. Exposure to best-practices, regulatory, legal, and accreditation standards/requirements that influence the quality and delivery of care to hospitalized patients.",
            "id": "PHMPRAC 742",
            "parent": "PHMPRAC",
            "title": "HEALTH-SYSTEM PHARMACY PRACTICE CLERKSHIP"
        }
    },
    {
        "data": {
            "id": "PHARMACY",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "PHARMACY 423",
            "target": "PHMPRAC 426"
        }
    },
    {
        "data": {
            "description": "Individual study for seniors completing theses as arranged with a faculty member.",
            "id": "PHMPRAC 692",
            "parent": "PHMPRAC",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 653",
            "target": "PHMPRAC 654"
        }
    },
    {
        "data": {
            "description": "Interdisciplinary team care of children with special health care needs across the trajectory of illness presented within the context of family, culture, social determinants of health, community, and healthcare policy.   Students introduced to interdisciplinary, collaborative, family-centered team care.",
            "id": "NURSING/PHMPRAC/SOCWORK 746",
            "title": "INTERDISCIPLINARY CARE OF CHILDREN WITH SPECIAL HEALTH CARE NEEDS"
        }
    },
    {
        "data": {
            "description": "Addresses the team-based and patient-centered care of persons with mental health conditions. A special focus will be put on the management of psychotropic medication regimens. A combination of lecture, discussion, and small group work will be utilized.",
            "id": "NURSING/PHMPRAC 674",
            "title": "SEMINARS IN INTERPROFESSIONAL MENTAL HEALTH CARE"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 611",
            "target": "PHMPRAC 612"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 655",
            "target": "PHMPRAC 659"
        }
    },
    {
        "data": {
            "description": "Integrates didactic learning with active participation in a wide-variety of patient-care activities under the supervision of a pharmacist preceptor including medication reconciliation, patient consultation, complex medication reviews, documentation, therapeutic drug monitoring and calculations. Continued exposure to the Pharmacist Patient Care Process (PPCP), which is a framework for providing patient care in a pharmacy practice setting.",
            "id": "PHMPRAC 625",
            "parent": "PHMPRAC",
            "title": "PHARMACY PRACTICE EXPERIENCES III"
        }
    },
    {
        "data": {
            "description": "The second experience of a three-year Introductory Pharmacy Practice Experiences (IPPEs) sequence. Provides opportunities to integrate learning from prior didactic courses such as The Role of the Pharmacist in the Public Health System, Managing Pharmacy Systems for Patient Care, current pharmacotherapy courses, and a previous community IPPE, into observation and discussion of the provision of patient care. Participate in a wide-variety of activities to expose them to the role of the pharmacist and patient care opportunities that exist in and out of the pharmacy practice setting. Focus on the provision of care in an institutional setting along with a variety of pharmacy practice settings which fall under an elective category. Continued exposure to the Pharmacist Patient Care Process (PPCP), which is a framework for providing patient care in a pharmacy practice setting.",
            "id": "PHMPRAC 526",
            "parent": "PHMPRAC",
            "title": "PHARMACY PRACTICE EXPERIENCES II"
        }
    },
    {
        "data": {
            "description": "Social justice seminar focusing on diversity, equity, inclusion, and leadership in the health professions. Focus on historical and contemporary issues in the healthcare system and equip students to develop the awareness, skills, and applied behaviors to impact healthcare inequities at the micro and macro level.",
            "id": "PHMPRAC 469",
            "parent": "PHMPRAC",
            "title": "HEALTH EQUITY & SOCIAL JUSTICE FOR HEALTHCARE PROVIDERS"
        }
    },
    {
        "data": {
            "description": "Presentation and discussion of topics that involve the therapeutic management of disease states of companion, food, and exotic animals. Emphasis is placed upon the principles of drug regulations, drug therapy, toxicology, and available commercial products.",
            "id": "PHMPRAC 670",
            "parent": "PHMPRAC",
            "title": "VETERINARY THERAPEUTICS"
        }
    },
    {
        "data": {
            "description": "Addresses the selection, dosing, and monitoring of drugs in children from birth to adolescence. Drugs in pregnancy and lactation are also addressed. The course combines lecture,small group work, and discussion.",
            "id": "PHMPRAC 657",
            "parent": "PHMPRAC",
            "title": "SEMINARS IN PEDIATRIC PHARMACOTHERAPY"
        }
    },
    {
        "data": {
            "description": "Gain immersive pharmacy practice experience in a different country. Learn about global health, medication use, health systems, and pharmacy practice with a health equity lens.",
            "id": "PHMPRAC 761",
            "parent": "PHMPRAC",
            "title": "INTERNATIONAL PHARMACY CLERKSHIP"
        }
    },
    {
        "data": {
            "description": "Directed study projects as arranged with a faculty member.",
            "id": "PHMPRAC 699",
            "parent": "PHMPRAC",
            "title": "ADVANCED INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Weekly lectures will familiarize the student with pharmacy information systems and the use of data and data processing systems for decision support.  Students will complete a data analysis and report project to drive a decision in the hospital.",
            "id": "PHMPRAC 617",
            "parent": "PHMPRAC",
            "title": "HEALTH SYSTEM PHARMACY DATA ANALYSIS AND INFORMATICS"
        }
    },
    {
        "data": {
            "description": "Clinical application of medications in the management of various disease states. Assessment and therapeutic monitoring of disease states and drug therapy using the concepts of pharmacokinetics/dynamics, drug interactions, pharmacy practice and patient counseling. Topics include various renal, endocrine, gastrointestinal, rheumatologic and immunologic disease therapeutics.",
            "id": "PHMPRAC 655",
            "parent": "PHMPRAC",
            "title": "PHARMACOTHERAPY III"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 628",
            "target": "PHMPRAC 629"
        }
    },
    {
        "data": {
            "description": "Integrates didactic learning with active participation in a wide-variety of patient-care activities under the supervision of a pharmacist preceptor including medication reconciliation, patient consultation, complex medication reviews, documentation, therapeutic drug monitoring and calculations. Continued exposure to the Pharmacist Patient Care Process (PPCP), which is a framework for providing patient care in a pharmacy practice setting.",
            "id": "PHMPRAC 626",
            "parent": "PHMPRAC",
            "title": "PHARMACY PRACTICE EXPERIENCES IV"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 555",
            "target": "PHMPRAC 556"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 655",
            "target": "PHMPRAC 654"
        }
    },
    {
        "data": {
            "description": "Designed to introduce student pharmacists to many aspects of pharmacy practice. Participate in a wide-variety of activities to expose them to the role of the pharmacist and the many patient care opportunities that exist in and out of the community pharmacy practice setting. Observe pharmacists in a community pharmacy. Gain a broad understanding of the pharmacist's public health role. Actively participate in assigned teams in a longitudinal experience with an assigned older adult in the community. All of these experiences will be guided by a modified continuing professional development framework (prepare, plan, do, reflect).",
            "id": "PHMPRAC 426",
            "parent": "PHMPRAC",
            "title": "PHARMACY PRACTICE EXPERIENCE I"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 553",
            "target": "PHMPRAC 554"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 554",
            "target": "PHMPRAC 655"
        }
    },
    {
        "data": {
            "description": "Learn pharmacotherapeutic skills necessary to develop competence as a pharmacist to assume the responsibility to improve therapeutic patient outcomes related to medication use. Skills will include patient and provider communication, identification and resolution of drug related problems, and documentation.",
            "id": "PHMPRAC 554",
            "parent": "PHMPRAC",
            "title": "INTEGRATED PHARMACOTHERAPY SKILLS II"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 556",
            "target": "PHMPRAC 638"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 462",
            "target": "PHMPRAC 463"
        }
    },
    {
        "data": {
            "description": "Clinical application of medications in the management of various disease states. Assessment and therapeutic monitoring of disease states and drug therapy using the concepts of pharmacokinetics/dynamics, drug interactions, pharmacy practice and patient counseling. Topics include various oncology and infectious disease therapeutics. A one credit elective option will be offered to students and involves academic leadership skill development. Student leaders will lead discussion activities which involve clinical cases, scientific literature review, oncology literature discussions.",
            "id": "PHMPRAC 656",
            "parent": "PHMPRAC",
            "title": "PHARMACOTHERAPY IV"
        }
    },
    {
        "data": {
            "description": "Individual study for seniors completing theses as arranged with a faculty member.",
            "id": "PHMPRAC 691",
            "parent": "PHMPRAC",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Enhanced education on diabetes topics; current approaches to the medical management of patients with diabetes including the pharmacist's role in diabetes education and coaching/case management.",
            "id": "PHMPRAC 679",
            "parent": "PHMPRAC",
            "title": "ADVANCED DIABETES MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Experiential course that integrates prior course work in pharmacotherapy, pathophysiology, and drug literature evaluation into the provision of pharmaceutical care to ambulatory patients. Students will conduct patient interviews and assessments, provide drug information to patients and health professionals, and monitor drug therapy in ambulatory settings.",
            "id": "PHMPRAC 760",
            "parent": "PHMPRAC",
            "title": "ELECTIVE PHARMACY PRACTICE CLERKSHIP"
        }
    },
    {
        "data": {
            "description": "Introduction to Pharmacy Informatics, the scientific field that utilizes a systems approach to medication-related data and information, including its acquisition, storage, analysis, and dissemination, in the delivery of optimal medication-related patient care and health outcomes.",
            "id": "PHMPRAC 468",
            "parent": "PHMPRAC",
            "title": "INTRODUCTION TO PHARMACY INFORMATICS"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 464",
            "target": "PHMPRAC 465"
        }
    },
    {
        "data": {
            "description": "A survey of the clinical diagnostic and therapeutic use of radioactive pharmaceuticals. Included is a review of nuclear physics, radiation biology, radiation chemistry, regulatory issues, and radiation safety, as these areas relate to the synthesis, formulation, dispensing, and administration of radiopharmaceuticals.",
            "id": "PHMPRAC 612",
            "parent": "PHMPRAC",
            "title": "RADIOPHARMACEUTICALS"
        }
    },
    {
        "data": {
            "description": "Develop professional identity and become more engaged with the profession of pharmacy.  Demonstrate behaviors that regulate personal emotions and support well-being.  Engage in continuous professional and interprofessional development to provide patient care that is safe and equitable.  Prepare for future introductory pharmacy practice experiences.",
            "id": "PHMPRAC 464",
            "parent": "PHMPRAC",
            "title": "PROFESSIONAL DEVELOPMENT AND ENGAGEMENT III:  PROMOTING PROFESSIONAL ENGAGEMENT"
        }
    },
    {
        "data": {
            "description": "Integrates prior didactic course work in pharmacotherapy, pathophysiology, and drug literature evaluation into the provision of pharmaceutical care to hospitalized patients. Participate in the provision of direct pharmaceutical care, by monitoring drug therapy, providing patient counseling, and providing drug information and pharmacokinetic dosing recommendations for patients. Gain experience and insight into health education by interacting with other health professionals and health-professions students.",
            "id": "PHMPRAC 740",
            "parent": "PHMPRAC",
            "title": "ACUTE PHARMACEUTICAL CARE CLERKSHIP"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 656",
            "target": "PHMPRAC 657"
        }
    },
    {
        "data": {
            "description": "Develops the skills and judgment necessary to apply the knowledge gained in the basic and clinical sciences to specific patient care situations. In addition, demonstrates the philosophy that clinical (APPE) and distributive pharmaceutical services should be patient oriented and integrated in contemporary ambulatory practice.",
            "id": "PHMPRAC 743",
            "parent": "PHMPRAC",
            "title": "COMMUNITY PHARMACY PRACTICE CLERKSHIP"
        }
    },
    {
        "data": {
            "description": "Application of foundational knowledge of project management to hands-on experiences planning positive change within the health care system. Students will learn to think strategically, to critically assess a problem, identify solutions, and implement change. Students will integrate concepts in their practice area of interest with the project management skills learned in this course.",
            "id": "PHMPRAC 628",
            "parent": "PHMPRAC",
            "title": "PRACTICE INNOVATION I"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 461",
            "target": "PHMPRAC 462"
        }
    },
    {
        "data": {
            "description": "Seminars, primary literature review, and patient case discussions on selected cardiovascular conditions, including: ACS, HF, valvular disease, cardiac devices, hemodynamic monitoring, heart transplantation, arrhythmias, ACLS, pulmonary arterial hypertension, stroke, and metabolic syndrome.",
            "id": "PHMPRAC 677",
            "parent": "PHMPRAC",
            "title": "SEMINARS IN CARDIOLOGY"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 655",
            "target": "PHMPRAC 656"
        }
    },
    {
        "data": {
            "description": "Clinical application of medications in the management of various neurologic and psychiatric disease states. Assessment and therapeutic monitoring of drug therapy with emphasis on the concepts of drug selection, monitoring of drug effect and titration of regimen. Also incorporates issues regarding pharmacokinetics/dynamics, drug interactions, pharmacy practice, and patient education.",
            "id": "PHMPRAC 555",
            "parent": "PHMPRAC",
            "title": "PHARMACOTHERAPY I"
        }
    },
    {
        "data": {
            "description": "Addresses the pharmacotherapeutic management of various critical care conditions. Guest lectures, primary literature review, patient case discussions, student-led presentations, and small group work will be utilized.",
            "id": "PHMPRAC 668",
            "parent": "PHMPRAC",
            "title": "SEMINARS IN CRITICAL CARE"
        }
    },
    {
        "data": {
            "id": "PHMPRAC",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Develop professional identity and become more engaged with the profession of pharmacy.  Explore personal values, skills, and strengths and identify their implications for patient care and professional practice.  Engage in continuous professional and interprofessional development to provide patient care that is safe and equitable.  Prepare for future introductory pharmacy practice experiences.",
            "id": "PHMPRAC 462",
            "parent": "PHMPRAC",
            "title": "PROFESSIONAL DEVELOPMENT AND ENGAGEMENT I- DEVELOPING YOUR PROFESSIONAL IDENTITY"
        }
    },
    {
        "data": {
            "description": "An overview of the imaging modalities offered in a Hospital Radiology Department. Completion of this course will help students understand the concepts of radiation, how it is used, and some of the tests and medications a patient may encounter when in the Radiology Department of a hospital.",
            "id": "PHMPRAC 611",
            "parent": "PHMPRAC",
            "title": "MEDICAL IMAGING FOR PHARMACISTS"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 655",
            "target": "PHMPRAC 679"
        }
    },
    {
        "data": {
            "description": "Clinical management of disorders of fluid, electrolytes, and acid-base in patients with normal and abnormal homeostatic mechanisms. Also included is parenteral nutritional support.",
            "id": "PHMPRAC 550",
            "parent": "PHMPRAC",
            "title": "FLUID AND ELECTROLYTE THERAPY"
        }
    },
    {
        "data": {
            "description": "Provides an interdivisional foundation for pharmacy students to understand many aspects of pharmacy through a wide variety of activities. Delivers a broad understanding of the pharmacist's public health and patient advocacy role with opportunities to practice basic calculations related to drug formulations in the context of safety, drug stability, and patient care. Fosters development of communication skills with peers and patients and be introduced to patient counseling principles.  Includes active participation in a longitudinal group experience with an assigned senior in the community to apply course content.",
            "id": "PHARMACY 423",
            "parent": "PHARMACY",
            "title": "PHARMACY INTEGRATED LEARNING LABORATORY"
        }
    },
    {
        "data": {
            "description": "Practical experience in a veterinary medicine environment with emphasis on the drug treatment of diseases in animals.",
            "id": "PHMPRAC 764",
            "parent": "PHMPRAC",
            "title": "VETERINARY PHARMACY CLERKSHIP"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 555",
            "target": "PHMPRAC 668"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 555",
            "target": "PHMPRAC 554"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 463",
            "target": "PHMPRAC 464"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 653",
            "target": "PHMPRAC 656"
        }
    },
    {
        "data": {
            "description": "Fundamentals of drug literature and statistical evaluation to enable students to make decisions regarding the clinical use of drugs in their practice.",
            "id": "PHMPRAC 570",
            "parent": "PHMPRAC",
            "title": "DRUG LITERATURE EVALUATION"
        }
    },
    {
        "data": {
            "description": "Gain foundational knowledge and skills in interprofessional collaborative practice and HIV care. Explore the roles of medicine, nursing, pharmacy, and social work in the HIV care continuum. Discuss quality team-based care as a member of an interprofessional student team.",
            "id": "MEDICINE/NURSING/PHMPRAC/SOCWORK 467",
            "title": "INTERPROFESSIONAL COLLABORATIVE PRACTICE IN HIV CARE"
        }
    },
    {
        "data": {
            "description": "Gain experience with clinical and translational research in a mentored situation. Learn study design, laboratory techniques, statistical analysis, manuscript preparation, and ethical principles of research.",
            "id": "PHMPRAC 769",
            "parent": "PHMPRAC",
            "title": "CLINICAL RESEARCH AND PHARMACY INVESTIGATION CLERSKSHIP"
        }
    },
    {
        "data": {
            "description": "Learn pharmacotherapeutic skills necessary to develop competence as a pharmacist to assume the responsibility to improve therapeutic patient outcomes related to medication use. Skills will include patient communication, identification and resolution of drug related problems, and documentation.",
            "id": "PHMPRAC 553",
            "parent": "PHMPRAC",
            "title": "INTEGRATED PHARMACOTHERAPY SKILLS I"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 555",
            "target": "NURSING/PHMPRAC 674"
        }
    },
    {
        "data": {
            "description": "A mentoring, leadership and facilitation class for pharmacy student peer mentors who are assisting instructors of the Exploring Pharmacy courses",
            "id": "PHMPRAC 471",
            "parent": "PHMPRAC",
            "title": "EXPLORING PHARMACY PEER MENTOR SEMINAR"
        }
    },
    {
        "data": {
            "description": "Addresses vaccine-preventable diseases and the implementation of pharmacy-based immunization delivery programs.",
            "id": "PHMPRAC 650",
            "parent": "PHMPRAC",
            "title": "COMPREHENSIVE IMMUNIZATION DELIVERY"
        }
    },
    {
        "data": {
            "description": "Develop professional identity and become more engaged with the profession of pharmacy.  Engage in continuous professional and interprofessional development to provide patient care that is safe and equitable; utilize appropriate published evidence to answer clinical questions; and prepare for advanced pharmacy practice experiences.",
            "id": "PHMPRAC 465",
            "parent": "PHMPRAC",
            "title": "PROFESSIONAL DEVELOPMENT AND ENGAGEMENT IV- EMBRACING CONTINUOUS PROFESSIONAL DEVELOPMENT"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 554",
            "target": "PHMPRAC 638"
        }
    },
    {
        "data": {
            "description": "Learn and build upon pharmacotherapeutic skills necessary to develop competence as a pharmacist to assume the responsibility to improve therapeutic patient outcomes related to medication use. Skills will include patient and healthcare provider communication, identification and resolution of drug related problems, documentation, and complex problem solving skills.",
            "id": "PHMPRAC 653",
            "parent": "PHMPRAC",
            "title": "INTEGRATED PHARMACOTHERAPY SKILLS III"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 625",
            "target": "PHMPRAC 626"
        }
    },
    {
        "data": {
            "description": "Introduces students to pharmacy faculty responsibilities. Students will participate in a variety of activities to expose them to the role of the pharmacy educator and will actively participate in the education of DPH-1 or DPH-2 students.",
            "id": "PHMPRAC 671",
            "parent": "PHMPRAC",
            "title": "INTRODUCTION TO ACADEMIC PHARMACY I"
        }
    },
    {
        "data": {
            "description": "Addresses practical issues surrounding the optimization of medication use in the treatment of patients with cancer. Practical solutions to the everyday challenges of providing exceptional clinical oncology care in a safe, fiscally responsible manner to optimize clinical outcomes of patients with cancer. Included subjects range across clinical, operational, and practice management issues that affect oncology pharmacy practice. These subjects include: pharmacogenomics, cell therapies, oncology research, survivorship, oral chemotherapy management, hazardous drug handling, value of cancer care, specialty pharmacy and Risk Evaluation and Mitigation Strategy (REMS) processes, and transitions of care. Although focused on oncology patients, offers practical exposure to issues confronting the care of patients with other types of diseases.",
            "id": "PHMPRAC 678",
            "parent": "PHMPRAC",
            "title": "SEMINARS IN ONCOLOGY"
        }
    },
    {
        "data": {
            "description": "Specialized subject matter of current interest to graduate students in the MS Pharmacy Administration program.",
            "id": "PHMPRAC 962",
            "parent": "PHMPRAC",
            "title": "GRADUATE SEMINAR IN HEALTH-SYSTEM PHARMACY"
        }
    },
    {
        "data": {
            "description": "Learn and build upon pharmacotherapeutic skills necessary to develop competence as a pharmacist to assume the responsibility to improve therapeutic patient outcomes related to medication use. The course will focus on building complex problem solving skills including the integration of patient and provider communication, documentation, and evaluation of integrated patient cases with a secondary focus on patient profile reviews and comprehensive medication review and assessment.",
            "id": "PHMPRAC 654",
            "parent": "PHMPRAC",
            "title": "INTEGRATED PHARMACOTHERAPY SKILLS IV"
        }
    },
    {
        "data": {
            "description": "Antimicrobial Stewardship has emerged as an important component of patient care in both inpatient and outpatient settings. Pharmacists can play an essential role in Antimicrobial Stewardship through application of knowledge in pharmacology, therapeutics, pharmacokinetics, microbiology, and biotechnology, most often expressed in the acute care setting, where patient health status and therapeutic decision making are ongoing. Addresses the ever-changing skill set required for pharmacists to understand therapeutic options and make effective interventions in the care of infected patients. Emphasis is placed on new treatment modalities as well as challenging the status quo of conventional management principles.",
            "id": "PHMPRAC 659",
            "parent": "PHMPRAC",
            "title": "INFECTIOUS DISEASES PHARMACOTHERAPY IN THE ACUTE CARE SETTING"
        }
    },
    {
        "data": {
            "description": "Directed study projects for graduate students as arranged with a faculty member.",
            "id": "PHMPRAC 999",
            "parent": "PHMPRAC",
            "title": "ADVANCED INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Introduction to, and exploration of, contemporary pharmacy practice settings and interprofessional practice, including opportunities for career advancement.",
            "id": "PHMPRAC 461",
            "parent": "PHMPRAC",
            "title": "PATHWAYS IN PHARMACY PRACTICE"
        }
    },
    {
        "data": {
            "description": "Specialized Pharmacy subject matter of current interest to undergraduate and professional students.",
            "id": "PHMPRAC 490",
            "parent": "PHMPRAC",
            "title": "SELECTED TOPICS IN PHARMACY PRACTICE"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 556",
            "target": "PHMPRAC 668"
        }
    },
    {
        "data": {
            "source": "PHMPRAC 553",
            "target": "PHMPRAC 556"
        }
    },
    {
        "data": {
            "description": "Specialized subject matter of current interest to graduate students in the MS Pharmacy Administration program.",
            "id": "PHMPRAC 961",
            "parent": "PHMPRAC",
            "title": "GRADUATE SEMINAR IN HEALTH-SYSTEM PHARMACY"
        }
    },
    {
        "data": {
            "description": "Explores the contribution of pharmacy and pharmacists to global health initiatives. Topics will be selected and presented by course faculty and students.",
            "id": "PHMPRAC 673",
            "parent": "PHMPRAC",
            "title": "SEMINARS IN GLOBAL HEALTH PHARMACY"
        }
    },
    {
        "data": {
            "description": "Designed to expose students to personal leadership qualities essential to operate efficiently within an integrated health care delivery system and advance the profession and practice of pharmacy. Students will gain a foundation to become future pharmacy leaders through an understanding of pharmacy's continual evolution in the changing health care environment.",
            "id": "PHMPRAC 610",
            "parent": "PHMPRAC",
            "title": "LEADERSHIP IN HEALTH-SYSTEM PHARMACY"
        }
    }
]