[
    {
        "data": {
            "description": "A series of lectures by experts covering: i) introductory drug development and delivery system development processes; ii) various drug delivery routes (oral, topical, rectal, vaginal, urethral, nasal, and pulmonary); iii) various delivery systems (conventional, ophthalmic, CNS, and recent advances); iv) delivery systems related to biofilms, infection, and vaccines.",
            "id": "PHMSCI 540",
            "parent": "PHMSCI",
            "title": "DRUG DELIVERY SYSTEMS FOR PHARMACOTHERAPY"
        }
    },
    {
        "data": {
            "description": "Accelerated coverage of topics in general chemistry, including introduction to laboratory techniques. Topics include atomic and molecular structure, chemical equilibrium, acid-base chemistry, thermodynamics, kinetics, and electrochemistry.",
            "id": "CHEM 109",
            "parent": "CHEM",
            "title": "ADVANCED GENERAL CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Addresses the range of materials currently being utilized for various biomedical applications, the biological systems governing biomaterial applications, analytical techniques pertinent to biomaterial evaluation, and selected major medical applications in which biomaterials play an important role.",
            "id": "BME/PHMSCI 430",
            "title": "BIOLOGICAL INTERACTIONS WITH MATERIALS"
        }
    },
    {
        "data": {
            "description": "An introduction to parenteral therapy and nutrition focusing on the fundamental properties, calculations involved and the methods to prepare safe and reliable injectable medications for patients.",
            "id": "PHMSCI 542",
            "parent": "PHMSCI",
            "title": "PARENTERAL THERAPY AND NUTRITION"
        }
    },
    {
        "data": {
            "description": "Applications of physicochemical principles to pharmaceutical systems.",
            "id": "PHMSCI 420",
            "parent": "PHMSCI",
            "title": "PHYSICOCHEMICAL PRINCIPLES OF DRUG FORMULATION AND DELIVERY"
        }
    },
    {
        "data": {
            "description": "Basic biology of microorganisms, including structure, function, physiology, genetics, ecology, diversity, and evolution.",
            "id": "MICROBIO 303",
            "parent": "MICROBIO",
            "title": "BIOLOGY OF MICROORGANISMS"
        }
    },
    {
        "data": {
            "description": "Basic concepts in the chemistry of small molecule medicinal products. Structure activity of cholinergic, adrenergic, serotonergic and dopaminergic agents, antidepressant, antianxiety drugs, opioids, and antihistamines. Overview of drug metabolism and the clinical effects of metabolic drug interactions and genetic variability in drug metabolism genes.",
            "id": "PHMSCI 531",
            "parent": "PHMSCI",
            "title": "MEDICINAL CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Basic laboratory techniques employed in pharmacological and toxicological research.",
            "id": "PHMSCI 558",
            "parent": "PHMSCI",
            "title": "LABORATORY TECHNIQUES IN PHARMACOLOGY AND TOXICOLOGY"
        }
    },
    {
        "data": {
            "description": "Basic principles of ecology and interrelations between individuals, populations, communities, ecosystems and their environment; transmission genetics and introduction to population genetics; origin of life, evolutionary mechanisms, ancestral relationships among species, and the diversity of life.",
            "id": "BIOCORE 381",
            "parent": "BIOCORE",
            "title": "EVOLUTION, ECOLOGY, AND GENETICS"
        }
    },
    {
        "data": {
            "description": "Basic principles of toxicology and biochemical mechanisms of toxicity in mammalian species and man. Correlation between morphological and functional changes caused by toxicants in different organs of the body.",
            "id": "M&ENVTOX/ONCOLOGY/PHMCOL-M/PHMSCI/POPHLTH 625",
            "title": "TOXICOLOGY I"
        }
    },
    {
        "data": {
            "description": "Biosynthesis of biological molecules, signal transduction mechanisms, chemistry and metabolism of nucleic acids, protein synthesis, and molecular and cellular biology.",
            "id": "BIOCHEM 508",
            "parent": "BIOCHEM",
            "title": "GENERAL BIOCHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for engineering students. Mechanics: kinematics, statics, dynamics; energy and momentum.",
            "id": "PHYSICS 201",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for students majoring in biological sciences. Mechanics: kinematics, statics, dynamics; energy and momentum. Heat and sound.",
            "id": "PHYSICS 207",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Cellular and molecular basis of life. The main themes are the structure and function of cells and organelles, the flow of energy in cells, and the storage, expression, and regulation of genetic information.",
            "id": "BIOCORE 383",
            "parent": "BIOCORE",
            "title": "CELLULAR BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Chemistry of biological materials, intermediary metabolism and protein structure.",
            "id": "BIOCHEM 507",
            "parent": "BIOCHEM",
            "title": "GENERAL BIOCHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Chemistry of medicinal products, including antihyperlipidemics, glucocorticoids, estrogens, progestins, nonsteroidal anti-inflammatories, antitumor agents, and enzyme inhibitors.",
            "id": "PHMSCI 532",
            "parent": "PHMSCI",
            "title": "MEDICINAL CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Chemistry of metabolic processes and products of living matter with emphasis on pharmaceutical and medicinal aspects as well as recombinant DNA technology. Laboratory experience with the chemistry of metabolic processes, products of living matter and recombinant DNA.",
            "id": "PHMSCI 432",
            "parent": "PHMSCI",
            "title": "PHARMACEUTICAL BIOCHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Chemistry, nutrition, and metabolism of biological systems.",
            "id": "BIOCHEM 501",
            "parent": "BIOCHEM",
            "title": "INTRODUCTION TO BIOCHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Collaborate on a research project from the conception of research questions through data analysis and the effective communication of results. Explore the biosynthesis of antibiotics and other small molecules by uncultured bacteria through the analysis of culture-independent DNA sequencing (metagenomics) data, learning about bioinformatics and genomics along the way. Make new discoveries of microbial species and biochemical pathways.",
            "id": "PHMSCI 254",
            "parent": "PHMSCI",
            "title": "TINY EARTH GENOMICS - RESEARCHING UNCULTURED ANTIBIOTIC-PRODUCING MICROBES"
        }
    },
    {
        "data": {
            "description": "Core concepts in human physiology from cells to organ-systems via online lectures and active learning activities including laboratory experiments. Topics include homeostasis, membrane transport, cellular physiology, regulation of metabolism, and functions of the nervous, endocrine, muscular, reproductive, cardiovascular, respiratory, renal, and gastrointestinal system.",
            "id": "ANAT&PHY 335",
            "parent": "ANAT&PHY",
            "title": "PHYSIOLOGY"
        }
    },
    {
        "data": {
            "description": "Core organic chemistry concepts of structure, reactivity, and synthesis with regards to the functional groups commonly found in commercial and biological substances. Covers a selection of topics fromCHEM 343and345.",
            "id": "CHEM 341",
            "parent": "CHEM",
            "title": "ELEMENTARY ORGANIC CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Directed study projects as arranged with a faculty member.",
            "id": "PHMSCI 699",
            "parent": "PHMSCI",
            "title": "ADVANCED INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Directed study projects for graduate students as arranged with a faculty member.",
            "id": "PHMSCI 999",
            "parent": "PHMSCI",
            "title": "ADVANCED INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Explores the major organ systems including nervous, endocrine, muscular, cardiovascular, renal, and gastrointestinal. The main learning objective is an understanding of the cellular and molecular mechanisms through which homeostasis is integrated and maintained. Not open to students with credit for PHYSIOL 335 or 435 prior to fall 2018 orANAT&PHY 335",
            "id": "ANAT&PHY 435",
            "parent": "ANAT&PHY",
            "title": "FUNDAMENTALS OF HUMAN PHYSIOLOGY"
        }
    },
    {
        "data": {
            "description": "Explores the process of bringing pharmaceutical products to market, particularly as it applies to the scaling up, manufacturing, and maintenance phases that come after FDA approval of a product is obtained. Identifies various factors that impact the life cycle management of pharmaceutical products from development to sustained large-scale distribution, such as: target product profile (TPP), chemistry, manufacturing and controls (CMC), active pharmaceutical ingredient (API) supply chain considerations, raw materials shortages, demand planning/forecasting, and post-approval regulatory considerations.",
            "id": "PHMSCI 754",
            "parent": "PHMSCI",
            "title": "LIFECYCLE MANAGEMENT OF PHARMACEUTICAL PRODUCTS"
        }
    },
    {
        "data": {
            "description": "General biological principles. Topics include: evolution, ecology, animal behavior, cell structure and function, genetics and molecular genetics and the physiology of a variety of organ systems emphasizing function in humans.",
            "id": "BIOLOGY/ZOOLOGY 101",
            "title": "ANIMAL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "General concepts of animal biology at an introductory level emphasizing the evolutionary relationships between animals. Learn about general body plans and strategies used to accomplish the basic tasks of staying alive in major animal groups using preserved and live animals. Study the diversity within each group of animals by integrating the body plans with the lifestyle and ecology of animals. Dissections of earthworm, freshwater mussel, squid, sea star, and rat aid the study of these general principles.",
            "id": "BIOLOGY/ZOOLOGY 102",
            "title": "ANIMAL BIOLOGY LABORATORY"
        }
    },
    {
        "data": {
            "description": "Identifies and examines the key regulatory agencies and practices that govern the highly regulated and diverse pharmaceutical industry. Highlights current and emerging FDA and ICH regulations and guidance documents to successfully navigate meeting with the agencies and to submit required documentation for successful product development.",
            "id": "PHMSCI 751",
            "parent": "PHMSCI",
            "title": "INTRODUCTION TO REGULATORY PRACTICE"
        }
    },
    {
        "data": {
            "description": "Independent research and writing for graduate and students under the supervision of a faculty member.",
            "id": "PHMSCI 990",
            "parent": "PHMSCI",
            "title": "RESEARCH"
        }
    },
    {
        "data": {
            "description": "Individual study for seniors completing theses as arranged with a faculty member.",
            "id": "PHMSCI 691",
            "parent": "PHMSCI",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Individual study for seniors completing theses as arranged with a faculty member.",
            "id": "PHMSCI 692",
            "parent": "PHMSCI",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Introduces students to the biological effects of drugs on human health. Emphasis on how drugs, especially those used in diseases of major human health significance, act in the body. Drugs that are abused also will be covered. This course is not intended for medical, nursing, pharmacy, and physician assistant students.",
            "id": "PHMSCI 310",
            "parent": "PHMSCI",
            "title": "DRUGS AND THEIR ACTIONS"
        }
    },
    {
        "data": {
            "description": "Introduces synthetic and biological polymers applied for drug targeting and controlled drug release, focusing on injectable drugs, including biologics.",
            "id": "PHMSCI 775",
            "parent": "PHMSCI",
            "title": "POLYMERIC DRUG DELIVERY"
        }
    },
    {
        "data": {
            "description": "Introduction to basic concepts of drug delivery and action, methods used to study drug action. Includes a brief survey of drugs acting on the cardiovascular system, the central nervous system and other drug targets.",
            "id": "PHMSCI 761",
            "parent": "PHMSCI",
            "title": "INTRODUCTION TO PHARMACOLOGY"
        }
    },
    {
        "data": {
            "description": "Introduction to the basic principles and concepts of the biology of plants. an integrative approach stressing evolutionary sequences and the relationship between structure and function at succeeding levels of organization: molecule, cell, organism, population, community. Correlated lectures, laboratories, and discussions.",
            "id": "BIOLOGY/BOTANY 130",
            "title": "GENERAL BOTANY"
        }
    },
    {
        "data": {
            "description": "Introductory laboratory course in compounding and dispensing of pharmaceutical dosage forms, including sterile products. Includes practice in interpretation of prescription orders, pharmaceutical calculations, compounding procedures, physical manipulation of drugs and dosage form components, and product packaging and labeling.",
            "id": "PHMSCI 541",
            "parent": "PHMSCI",
            "title": "PHARMACEUTICAL CALCULATIONS, DISPENSING AND COMPOUNDING"
        }
    },
    {
        "data": {
            "description": "Introductory-level graduate course providing overview of the drug development process, involving drug discovery, drug action, and drug delivery. Exposes students to cutting-edge research and the chemistry, biology, physical chemistry, and engineering that underpin pharmaceutical sciences research.",
            "id": "PHMSCI 780",
            "parent": "PHMSCI",
            "title": "PRINCIPLES OF PHARMACEUTICAL SCIENCES"
        }
    },
    {
        "data": {
            "description": "Origin, nature, classification, and description of intermolecular forces. The hydrophobic effect. Molecular complexes, binding constants, and their measurements. General principles of self-assembly, molecular recognition, complex formation, host design. Supramolecular systems and their dynamics. Micelles, bilayers, vesicles, biological membranes.",
            "id": "CHEM/PHMSCI 766",
            "title": "MOLECULAR RECOGNITION"
        }
    },
    {
        "data": {
            "description": "Overview of the drug development process from discovery to approval. Process of drug development from target identification to investigational new drug (IND) submission including tenets of rational drug design, preclinical CMC activities, and preclinical pharmacology, pharmacokinetic, and toxicology studies. Small and large molecules (biologics/biotherapeutics) will be covered. Brief history of drug development and various case studies offering insights into preclinical drug development.",
            "id": "PHMSCI 762",
            "parent": "PHMSCI",
            "title": "THE DRUG DEVELOPMENT PROCESS I"
        }
    },
    {
        "data": {
            "description": "Pharmacological actions and underlying basic and clinical science of antimicrobial and antiviral drugs. Pharmacology of hormones and other drugs affecting the endocrine system.",
            "id": "PHMSCI 623",
            "parent": "PHMSCI",
            "title": "PHARMACOLOGY III"
        }
    },
    {
        "data": {
            "description": "Pharmacological actions of important drugs, including drugs that affect the peripheral and central nervous systems.",
            "id": "PHMSCI 521",
            "parent": "PHMSCI",
            "title": "PHARMACOLOGY I"
        }
    },
    {
        "data": {
            "description": "Pharmacological actions of important drugs, including hematopoietic, thrombolytic, antihyperlipidemic, immunopharmacologic, anticancer, anti-inflammatory, diuretic, antihypertensive, antianginal, and anti-arrhythmic agents, and agents used to treat congestive heart failure.",
            "id": "PHMCOL-M/PHMSCI 522",
            "title": "PHARMACOLOGY II"
        }
    },
    {
        "data": {
            "description": "Principles and application of chemical equilibrium, coordination chemistry, oxidation-reduction and electrochemistry, kinetics, nuclear chemistry, introduction to organic chemistry, and chemistry laboratory skills.",
            "id": "CHEM 104",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Principles of molecular structure and bonding applied to predict and explain the reactivity of alkanes, alkenes, alkynes, alkyl halides, alcohols, and thiols. Emphasis placed on rationalizing the stereochemical and regiochemical outcome of chemical processes.",
            "id": "CHEM 343",
            "parent": "CHEM",
            "title": "ORGANIC CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Principles of molecular structure and bonding applied to predict and explain the reactivity of aromatic systems, benzylic and allylic systems, aryl and vinyl halides, and carbonyl-containing compounds (e.g., ketones, carboxylic acids, esters, acid chlorides, amides). Emphasis placed on rationalizing the stereochemical and regiochemical outcome of chemical processes as well as arguing reaction outcomes from spectroscopic evidence.",
            "id": "CHEM 345",
            "parent": "CHEM",
            "title": "ORGANIC CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Process of drug development from first-in-human (FIH) to regulatory submission for approval, including the different phases of clinical development, role of biomarkers and companion diagnostics in clinical trials, and chemistry, manufacturing, and controls of drug product. Discussion of clinical development of different modalities, including small molecules and protein therapeutics.",
            "id": "PHMSCI 763",
            "parent": "PHMSCI",
            "title": "THE DRUG DEVELOPMENT PROCESS II"
        }
    },
    {
        "data": {
            "description": "Provides a basic understanding of the causes, pathophysiology, pathology and clinical manifestations of disease states from a medical perspective.",
            "id": "PATH 404",
            "parent": "PATH",
            "title": "PATHOPHYSIOLOGIC PRINCIPLES OF HUMAN DISEASES"
        }
    },
    {
        "data": {
            "description": "Provides a high-level overview of how data analysis techniques augment the drug discovery and development process. Focuses on project-based skills-building through the application of industry-standard software and use of public databases. Explores best practices for data processing and management to ensure experimental reproducibility. Develops troubleshooting skills through critical evaluation of data analysis results and root cause analysis.",
            "id": "PHMSCI 756",
            "parent": "PHMSCI",
            "title": "INTRODUCTION TO DATA ANALYSES IN DRUG DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Provides an in-depth introduction to the molecular and cellular principles of pharmacology. Emphasis is on the mechanisms of drug and small molecule action in cells, with a particular focus on downstream signaling pathways, second messenger systems, protein kinase cascades, and the regulation of gene transcription.",
            "id": "PHMSCI 581",
            "parent": "PHMSCI",
            "title": "MOLECULAR AND CELLULAR PRINCIPLES IN PHARMACOLOGY"
        }
    },
    {
        "data": {
            "description": "Provides an introduction to key terminology and lays a foundation of the critical body of knowledge project team members must master in a contemporary drug development enterprise. The latest project management theory is integrated with practical techniques and tools so that course participants learn to properly manage and schedule quality, budget, and progress objectives. Provides an overview of the economic structures, management and policy issues that drive and challenge the pharmaceutical and biotechnology industries.",
            "id": "PHMSCI 753",
            "parent": "PHMSCI",
            "title": "PHARMACEUTICAL ECONOMICS AND PROJECT MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Provides the experience and skill to find, read and critically analyze scientific and regulatory literature in the field of drug discovery and development.",
            "id": "PHMSCI 759",
            "parent": "PHMSCI",
            "title": "CURRENT TRENDS IN DRUG DISCOVERY AND DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Quantitative aspects of drug absorption, distribution, metabolism, and excretion. Philosophy and applications of pharmacokinetic modeling and its use in clinical practice.",
            "id": "PHMSCI 768",
            "parent": "PHMSCI",
            "title": "PHARMACOKINETICS"
        }
    },
    {
        "data": {
            "description": "Science and technology of molecular solid materials with applications in medicine, food, energetic materials, and organic electronics.",
            "id": "PHMSCI 773",
            "parent": "PHMSCI",
            "title": "MOLECULAR SOLIDS"
        }
    },
    {
        "data": {
            "description": "Senior student presentations of independent research or of published papers on a specific topic approved by the course coordinator. Faculty-led seminars on selected topics regarding responsible conduct of research. The course also provides a venue for career talks by Pharmacology and Toxicology alumni and guests working in a variety of professional settings - research, industry (pharmaceutical;  biotech; contract research; consumer products; etc.), a variety of healthcare professions, and law.",
            "id": "PHMSCI 679",
            "parent": "PHMSCI",
            "title": "PHARMACOLOGY AND TOXICOLOGY SEMINAR"
        }
    },
    {
        "data": {
            "description": "Specialized subject matter of current interest to graduate students.",
            "id": "PHMSCI 493",
            "parent": "PHMSCI",
            "title": "SELECTED TOPICS IN PHARMACEUTICAL SCIENCES"
        }
    },
    {
        "data": {
            "description": "Specialized subject matter of current interest to undergraduate and professional students.",
            "id": "PHMSCI 490",
            "parent": "PHMSCI",
            "title": "SELECTED TOPICS IN PHARMACEUTICAL SCIENCES"
        }
    },
    {
        "data": {
            "description": "Stoichiometry and the mole concept, the behavior of gases, liquids and solids, thermochemistry, electronic structure of atoms and chemical bonding, descriptive chemistry of selected elements and compounds, intermolecular forces, and chemistry laboratory skills.",
            "id": "CHEM 103",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Study the physiology of and consider how plants and animals interact with their environments to survive, obtain nutrients, exchange gases, and reproduce, also how the complex systems of neural and endocrine regulation in animals and hormonal and environmental regulation in plants allow cells and organs to communicate.",
            "id": "BIOCORE 485",
            "parent": "BIOCORE",
            "title": "PRINCIPLES OF PHYSIOLOGY"
        }
    },
    {
        "data": {
            "description": "Summation of core coursework to a real-world project and/or internship experience. Synthesis of knowledge, skills and abilities to demonstrate aptitude for careers in respective industries.",
            "id": "PHMSCI 760",
            "parent": "PHMSCI",
            "title": "SUMMATIVE RESEARCH INTERNSHIP"
        }
    },
    {
        "data": {
            "description": "Survey of the basic methods and fundamental biochemical mechanisms of toxicity. Toxicity in mammalian organ systems, techniques for evaluating toxicity, as well as mechanisms of species specificity, and environmental interactions (with toxicant examples) are presented.",
            "id": "M&ENVTOX/PATH/PHMCOL-M/PHMSCI/POPHLTH 626",
            "title": "TOXICOLOGY II"
        }
    },
    {
        "data": {
            "description": "Survey of the drug development process from target identification, development, preclinical studies, clinical trials to post-approval monitoring, particularly as applicable to neuroactive drugs. Differences between small and large molecules (biologics) will be covered, along with a basic coverage of regulatory authorities. A brief history of drug development will be provided, along with coverage of special topics related to stages of the drug development process. Broad survey-style overview of the phases in the drug development process, regulatory considerations, relevant vocabulary, and the ability to communicate within the industry.",
            "id": "PHMSCI 757",
            "parent": "PHMSCI",
            "title": "SURVEY OF THE NEUROACTIVE DRUG DEVELOPMENT PROCESS"
        }
    },
    {
        "data": {
            "description": "Synthesis and biosynthesis of natural products in drug discovery. Topics include: natural products in drug discovery; biosynthetic pathways and synthetic strategies for major natural product classes; and basic bioorganic chemistry and enzyme mechanisms in biosynthesis.",
            "id": "PHMSCI 786",
            "parent": "PHMSCI",
            "title": "NATURAL PRODUCT SYNTHESIS, BIOSYNTHESIS AND DRUG DISCOVERY"
        }
    },
    {
        "data": {
            "description": "Teaches the theory and application of many common laboratory techniques and instruments used in drug discovery and development.  Includes a laboratory component to teach safety and basic techniques necessary for working in a lab. Instruction begins with basic techniques and builds upon these techniques to instruct in proper sample preparation and handling for analysis using a variety of analytical instrumentation.",
            "id": "PHMSCI 755",
            "parent": "PHMSCI",
            "title": "LABORATORY AND INSTRUMENTATION METHODS"
        }
    },
    {
        "data": {
            "description": "The pharmaceutical and biopharmaceutical industries have strict documentation and production requirements.  Prepares the learner to work in a regulated environment. Explains roles and responsibilities across multiple disciplines and proper documentation practices. Prepares learner for protocol, report creation and audit responses.  Discusses specifications, guidances and root-cause analysis.",
            "id": "PHMSCI 752",
            "parent": "PHMSCI",
            "title": "GXP (GOOD PRACTICE): WORKING IN A REGULATED ENVIRONMENT"
        }
    },
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics and selected topics in Animal Physiology.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics, and selected topics in Animal Physiology. Designed for engineering majors that do not need a lab component.",
            "id": "ZOOLOGY 153",
            "parent": "ZOOLOGY",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Topics include: selected topics in plant physiology, a survey of the five major kingdoms of organisms, speciation and evolutionary theory, and ecology at multiple levels of the biological hierarchy.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Weekly series that provides exposure to a diverse array of research topics. Students enroll in one of three sections, corresponding to their research core (Drug Action, Drug Discovery, or Drug Delivery). Students in their 2nd year and beyond present their research progress or review literature. The course includes talks from nationally and internationally recognized scientists from academia and industry.",
            "id": "PHMSCI 931",
            "parent": "PHMSCI",
            "title": "PHARMACEUTICAL SCIENCES SEMINAR"
        }
    },
    {
        "data": {
            "description": "Weekly series that provides exposure to a diverse array of research topics. Students enroll in one of three sections, corresponding to their research core (Drug Action, Drug Discovery, or Drug Delivery). Students in their 2nd-year and beyond present their research progress or review literature. The course includes talks from nationally and internationally recognized scientists from academia and industry.",
            "id": "PHMSCI 932",
            "parent": "PHMSCI",
            "title": "PHARMACEUTICAL SCIENCES SEMINAR"
        }
    },
    {
        "data": {
            "id": "ANAT&PHY",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "BIOCHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "BIOCORE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MICROBIO",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "PATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "PHMSCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "PHYSICS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ZOOLOGY",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ANAT&PHY 335",
            "target": "M&ENVTOX/ONCOLOGY/PHMCOL-M/PHMSCI/POPHLTH 625"
        }
    },
    {
        "data": {
            "source": "ANAT&PHY 335",
            "target": "PHMSCI 521"
        }
    },
    {
        "data": {
            "source": "ANAT&PHY 435",
            "target": "ANAT&PHY 335"
        }
    },
    {
        "data": {
            "source": "ANAT&PHY 435",
            "target": "M&ENVTOX/ONCOLOGY/PHMCOL-M/PHMSCI/POPHLTH 625"
        }
    },
    {
        "data": {
            "source": "ANAT&PHY 435",
            "target": "PHMSCI 521"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 501",
            "target": "M&ENVTOX/ONCOLOGY/PHMCOL-M/PHMSCI/POPHLTH 625"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 507",
            "target": "BIOCHEM 508"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 508",
            "target": "PHMSCI 521"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 508",
            "target": "PHMSCI 786"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "BIOCORE 383"
        }
    },
    {
        "data": {
            "source": "BIOCORE 383",
            "target": "BIOCORE 485"
        }
    },
    {
        "data": {
            "source": "BIOCORE 383",
            "target": "MICROBIO 303"
        }
    },
    {
        "data": {
            "source": "BIOCORE 485",
            "target": "M&ENVTOX/ONCOLOGY/PHMCOL-M/PHMSCI/POPHLTH 625"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "MICROBIO 303"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "ANAT&PHY 335"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "ANAT&PHY 435"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 152"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 101"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BME/PHMSCI 430"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "MICROBIO 303"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "target": "BIOLOGY/ZOOLOGY 102"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ANAT&PHY 335"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ANAT&PHY 435"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 151"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "PATH 404"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ZOOLOGY 153"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 102",
            "target": "BME/PHMSCI 430"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 109"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 343"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 341",
            "target": "BIOCHEM 501"
        }
    },
    {
        "data": {
            "source": "CHEM 343",
            "target": "BIOCHEM 501"
        }
    },
    {
        "data": {
            "source": "CHEM 343",
            "target": "CHEM 345"
        }
    },
    {
        "data": {
            "source": "CHEM 345",
            "target": "BIOCHEM 507"
        }
    },
    {
        "data": {
            "source": "CHEM 345",
            "target": "CHEM 341"
        }
    },
    {
        "data": {
            "source": "CHEM 345",
            "target": "PHMSCI 786"
        }
    },
    {
        "data": {
            "source": "M&ENVTOX/ONCOLOGY/PHMCOL-M/PHMSCI/POPHLTH 625",
            "target": "M&ENVTOX/PATH/PHMCOL-M/PHMSCI/POPHLTH 626"
        }
    },
    {
        "data": {
            "source": "MICROBIO 303",
            "target": "PHMSCI 254"
        }
    },
    {
        "data": {
            "source": "PATH 404",
            "target": "M&ENVTOX/ONCOLOGY/PHMCOL-M/PHMSCI/POPHLTH 625"
        }
    },
    {
        "data": {
            "source": "PATH 404",
            "target": "PHMSCI 521"
        }
    },
    {
        "data": {
            "source": "PHMCOL-M/PHMSCI 522",
            "target": "PHMSCI 623"
        }
    },
    {
        "data": {
            "source": "PHMSCI 420",
            "target": "PHMSCI 541"
        }
    },
    {
        "data": {
            "source": "PHMSCI 432",
            "target": "PHMSCI 531"
        }
    },
    {
        "data": {
            "source": "PHMSCI 521",
            "target": "PHMCOL-M/PHMSCI 522"
        }
    },
    {
        "data": {
            "source": "PHMSCI 521",
            "target": "PHMSCI 581"
        }
    },
    {
        "data": {
            "source": "PHMSCI 531",
            "target": "PHMSCI 532"
        }
    },
    {
        "data": {
            "source": "PHMSCI 540",
            "target": "PHMSCI 542"
        }
    },
    {
        "data": {
            "source": "PHMSCI 541",
            "target": "PHMSCI 542"
        }
    },
    {
        "data": {
            "source": "PHYSICS 201",
            "target": "PHYSICS 207"
        }
    },
    {
        "data": {
            "source": "PHYSICS 207",
            "target": "ANAT&PHY 435"
        }
    },
    {
        "data": {
            "source": "PHYSICS 207",
            "target": "PHYSICS 201"
        }
    },
    {
        "data": {
            "source": "ZOOLOGY 153",
            "target": "ANAT&PHY 335"
        }
    },
    {
        "data": {
            "source": "ZOOLOGY 153",
            "target": "ANAT&PHY 435"
        }
    },
    {
        "data": {
            "source": "ZOOLOGY 153",
            "target": "BME/PHMSCI 430"
        }
    }
]