[
    {
        "data": {
            "description": "A 2 month intensive clinical learning experience with an emphasis in an elective specialty discipline and taking place in a variety of off-campus clinical settings under the direction of a supervising physician preceptor. Elective specialty disciplines include but are not limited to family medicine, internal medicine, emergency medicine, general surgery, cardiothoracic surgery, orthopedic surgery, ENT, dermatology, pediatrics, women's health and psychiatry/behavioral health.",
            "id": "PHYASST 769",
            "parent": "PHYASST",
            "title": "PHYSICIAN ASSISTANT PRECEPTORSHIP: ELECTIVE"
        }
    },
    {
        "data": {
            "description": "A 2 month intensive clinical learning experience with an emphasis in emergency medicine and taking place in a variety of off-campus clinical settings under the direction of a supervising physician preceptor.",
            "id": "PHYASST 759",
            "parent": "PHYASST",
            "title": "PHYSICIAN ASSISTANT PRECEPTORSHIP: EMERGENCY MEDICINE"
        }
    },
    {
        "data": {
            "description": "A 2 month intensive clinical learning experience with an emphasis in family medicine and taking place in a variety of off-campus clinical settings under the direction of a supervising physician preceptor.",
            "id": "PHYASST 739",
            "parent": "PHYASST",
            "title": "PHYSICIAN ASSISTANT PRECEPTORSHIP: FAMILY MEDICINE"
        }
    },
    {
        "data": {
            "description": "A 2 month intensive clinical learning experience with an emphasis in internal medicine and taking place in a variety of off-campus clinical settings under the direction of a supervising physician preceptor.",
            "id": "PHYASST 749",
            "parent": "PHYASST",
            "title": "PHYSICIAN ASSISTANT PRECEPTORSHIP: INTERNAL MEDICINE"
        }
    },
    {
        "data": {
            "description": "A 2 month intensive clinical learning experience with an emphasis in surgery and taking place in a variety of off-campus clinical settings under the direction of a supervising physician preceptor.",
            "id": "PHYASST 729",
            "parent": "PHYASST",
            "title": "PHYSICIAN ASSISTANT PRECEPTORSHIP: SURGERY"
        }
    },
    {
        "data": {
            "description": "Addresses the concepts of prevention and population health and explores the topics of: health systems/policy, and community aspects of practice. Case examples and community-oriented learning experiences will be incorporated into the course.",
            "id": "PHYASST 611",
            "parent": "PHYASST",
            "title": "CLINICAL PREVENTION AND COMMUNITY PRACTICE II"
        }
    },
    {
        "data": {
            "description": "Addresses the concepts of prevention and population health. Multiple topics will be explored including but not limited to: Health Information Literacy, Immunizations, Nutrition, Exercise, Communication and Counseling Skills, and Integrative Medicine.",
            "id": "PHYASST 610",
            "parent": "PHYASST",
            "title": "CLINICAL PREVENTION AND COMMUNITY PRACTICE I"
        }
    },
    {
        "data": {
            "description": "Advanced physical examination and patient evaluation techniques with an emphasis on the musculoskeletal system; selected physical exam procedures in the complete evaluation of patients; advanced medical interviewing skills.",
            "id": "PHYASST 620",
            "parent": "PHYASST",
            "title": "ADVANCED PATIENT EVALUATION I"
        }
    },
    {
        "data": {
            "description": "An introduction to the role of the physician assistant in surgery, fundamental principles of pre-, intra- and post-operative surgical care, operating room aseptic technique, and common strategies to avoid and to treat surgical complications.",
            "id": "PHYASST 670",
            "parent": "PHYASST",
            "title": "FUNDAMENTALS OF SURGERY"
        }
    },
    {
        "data": {
            "description": "Build skills in collaboration, problem solving, and reflection to approach complex community-based public health problems contribute to becoming a public leader. Explore the six levels of public health leadership through the practices of current and past public health leaders, case studies, and personal experience.",
            "id": "NURSING/PHARMACY/PHYASST/PHYTHER/PUBLHLTH 758",
            "title": "INTERPROFESSIONAL PUBLIC HEALTH LEADERSHIP"
        }
    },
    {
        "data": {
            "description": "Covers the knowledge and skills required to diagnose and treat patient health problems. Topics addressed include cardiology, pulmonology, nephrology/urology, gastroenterology, rheumatology, geriatrics, and family medicine.",
            "id": "PHYASST 602",
            "parent": "PHYASST",
            "title": "CLINICAL MEDICINE II"
        }
    },
    {
        "data": {
            "description": "Covers the knowledge and skills required to diagnose and treat patient health problems. Topics include genomics, neurology, psychiatry, hematology/oncology, endocrinology, ophthalmology, otorhinolaryngology, and dermatology.",
            "id": "PHYASST 601",
            "parent": "PHYASST",
            "title": "CLINICAL MEDICINE I"
        }
    },
    {
        "data": {
            "description": "Directed study projects as arranged with instructor.",
            "id": "PHYASST 699",
            "parent": "PHYASST",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Emphasis will be on placed on refining the capstone project and writing an initial paper draft. Also includes instructional content on professional issues in preparation for clinical experiences and clinical practice.",
            "id": "PHYASST 716",
            "parent": "PHYASST",
            "title": "PROFESSIONAL SEMINAR IV"
        }
    },
    {
        "data": {
            "description": "Emphasis will be placed on completion of capstone projects with preparations for oral and poster presentation of the projects.  Also includes instructional content on professional issues in preparation for certification and clinical practice.",
            "id": "PHYASST 717",
            "parent": "PHYASST",
            "title": "PROFESSIONAL SEMINAR AND CAPSTONE I"
        }
    },
    {
        "data": {
            "description": "Emphasis will be placed on preparing poster and lecture presentation for completed capstone projects. Also includes instructional content on professional issues in preparation for certification and clinical practice.",
            "id": "PHYASST 718",
            "parent": "PHYASST",
            "title": "PROFESSIONAL SEMINAR AND CAPSTONE II"
        }
    },
    {
        "data": {
            "description": "Emphasizes an understanding of basic research methodology, project development, collaborative research, and project evaluation.",
            "id": "PHYASST 616",
            "parent": "PHYASST",
            "title": "PROFESSIONAL SEMINAR I"
        }
    },
    {
        "data": {
            "description": "Emphasizes an understanding of basic research methodology, project development, collaborative research, and project evaluation.",
            "id": "PHYASST 618",
            "parent": "PHYASST",
            "title": "PROFESSIONAL SEMINAR III"
        }
    },
    {
        "data": {
            "description": "Emphasizes medical ethics as well as fundamental principles of evidence-based medicine. Research and statistical concepts are taught within the framework of epidemiologic study to develop skills in evaluating and interpreting the medical literature.",
            "id": "PHYASST 617",
            "parent": "PHYASST",
            "title": "PROFESSIONAL SEMINAR II"
        }
    },
    {
        "data": {
            "description": "Emphasizes pharmacotherapeutics relative to disease processes of the cardiovascular, pulmonary, renal, urologic, gastrointestinal, and rheumatologic systems. Other topics addressed include geriatric pharmacology, pharmacoeconomics, complementary and alternative medicines, and treatment of sexually transmitted infections.",
            "id": "PHYASST 641",
            "parent": "PHYASST",
            "title": "CLINICAL PHARMACOLOGY II"
        }
    },
    {
        "data": {
            "description": "Emphasizes pharmacotherapeutics relative to disease processes of the neurologic, psychiatric, hematologic/oncologic, ophthalmologic, otolaryngologic, endocrinologic, and dermatologic systems. Antimicrobial and pain management principles will also be addressed.",
            "id": "PHYASST 640",
            "parent": "PHYASST",
            "title": "CLINICAL PHARMACOLOGY I"
        }
    },
    {
        "data": {
            "description": "Examines important aspects of primary care pediatrics including assessment of the child patient, preventive health, and pediatric diseases and conditions. The student will also learn examination techniques specific to the pediatric population.",
            "id": "PHYASST 603",
            "parent": "PHYASST",
            "title": "PEDIATRICS"
        }
    },
    {
        "data": {
            "description": "Fundamental concepts related to the provision of emergency medical care and urgent ambulatory care.",
            "id": "PHYASST 648",
            "parent": "PHYASST",
            "title": "EMERGENCY MEDICINE"
        }
    },
    {
        "data": {
            "description": "Gross human anatomy involving complete dissection of the human body. Major topic areas: Thorax; abdomen and pelvis; head and neck; limbs. Focus on anatomical organization of the trunk, head and neck, and limbs. Application of functional anatomical information to clinical practice/problems. Practice in teamwork and teaching.",
            "id": "PHYASST 629",
            "parent": "PHYASST",
            "title": "APPLIED HUMAN ANATOMY FOR PHYSICIAN ASSISTANTS"
        }
    },
    {
        "data": {
            "description": "Hands-on clinical skill laboratory that includes: dermatologic procedures, splinting, casting, suturing, IV access, venipuncture, injections, joint aspiration/injection, and advanced cardiac life support (ACLS).",
            "id": "PHYASST 660",
            "parent": "PHYASST",
            "title": "CLINICAL SKILLS LABORATORY"
        }
    },
    {
        "data": {
            "description": "Instruction in advanced skills in history and physical examination including comprehensive patient history and physical examination, focused history with related male genitalia and rectal exams, and focused history with female breast and pelvic exams.",
            "id": "PHYASST 621",
            "parent": "PHYASST",
            "title": "ADVANCED PATIENT EVALUATION IN THE PRIMARY CARE SETTING II"
        }
    },
    {
        "data": {
            "description": "Introduces information fundamental to understanding clinical medicine principles. Topics addressed include select areas of physiology-pathophysiology, pharmacology, laboratory medicine, and common systemic disease processes. There will also be instruction relative to cognitively approaching the patient.",
            "id": "PHYASST 550",
            "parent": "PHYASST",
            "title": "FUNDAMENTALS OF CLINICAL MEDICINE"
        }
    },
    {
        "data": {
            "description": "One-week service-learning field experience in rural Belize. Provide health care to the more remote, indigenous populations of Belize. Must have a valid passport that does not expire 6 months past your Belize field experience dates.",
            "id": "PHYASST 663",
            "parent": "PHYASST",
            "title": "INTERDISCIPLINARY FIELD EXPERIENCE IN RURAL BELIZE"
        }
    },
    {
        "data": {
            "description": "Preparation forPHY ASST 663. Examination of important and ever-changing topics related to global healthcare. Focus on the more remote, indigenous populations of Belize, their current healthcare system and their access-to-care. Content relates to historical, social, economic and cultural perspectives of the under-served Belizean populations, as well as medical-related topics from an interdisciplinary perspective. Activities and self-study exercises include team-building and self-reflection exercises. Specific topics will include; Belize anthropology, health care in a resource limiting setting, human trafficking, cervical cancer, etc.",
            "id": "PHYASST 662",
            "parent": "PHYASST",
            "title": "PREPARATION FOR INTERDISCIPLINARY HEALTH CARE IN BELIZE"
        }
    },
    {
        "data": {
            "description": "Primary focus is laboratory medicine assessments and ECG interpretation with additional content in imaging modalities, utilization of survey tools, screening assessments, as well as selected specialized examination techniques.",
            "id": "PHYASST 650",
            "parent": "PHYASST",
            "title": "DIAGNOSTIC METHODS I"
        }
    },
    {
        "data": {
            "description": "Primary focus is laboratory medicine assessments, heart sounds interpretation, and imaging modalities.",
            "id": "PHYASST 651",
            "parent": "PHYASST",
            "title": "DIAGNOSTIC METHODS II"
        }
    },
    {
        "data": {
            "description": "Provides a theoretical and clinical background for the assessment, diagnosis and management of problems in obstetrics and gynecology.",
            "id": "PHYASST 630",
            "parent": "PHYASST",
            "title": "WOMEN'S HEALTH FOR PHYSICIAN ASSISTANTS"
        }
    },
    {
        "data": {
            "description": "Provides direction to Physician Assistant (PA) Path of Distinction (PoD) students for the PoD capstone project and to provide an overview of public health, some of its current issues and tools to help become engaged in the communities in which clinical experiences and practice takes place.",
            "id": "PHYASST 787",
            "parent": "PHYASST",
            "title": "SEMINAR ON INTEGRATING PUBLIC HEALTH INTO PA PRACTICE"
        }
    },
    {
        "data": {
            "description": "Provides the primary care physician assistants with the knowledge and physical exam skills to evaluate patients in a variety of settings. Normal and pathological physical findings are discussed. Master interview skills and physical exam skills applicable to all patients. Selected physical exam techniques are emphasized.",
            "id": "PHYASST 619",
            "parent": "PHYASST",
            "title": "HISTORY AND PHYSICAL EXAMINATION FOR PHYSICIAN ASSISTANTS"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "PHYASST",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "PHYASST 662",
            "target": "PHYASST 663"
        }
    }
]