[
    {
        "data": {
            "description": "A preparation and introductory math course for students enrolled in the Summer Collegiate Experience program. Includes material from precalculus and calculus and related topics depending on students' results on the math placement exam.",
            "id": "MATH 118",
            "parent": "MATH",
            "title": "SUMMER COLLEGIATE EXPERIENCE MATHEMATICS COURSE"
        }
    },
    {
        "data": {
            "description": "Covers the graphs, properties and geometric significance of trigonometric functions of a real variable. Other topics include trigonometric equations and identities, application, trigonometric form of complex numbers, DeMoivre's theorem, and polar and parametric equations. The course also has a significant number of applications, especially related to other disciplines.",
            "id": "MATH 113",
            "parent": "MATH",
            "title": "TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "Electrostatic fields, capacitance, multi-pole expansion, dielectric theory; magnetostatics; electromagnetic induction; magnetic properties of matter; Maxwell's equations and electromagnetic waves; relativity and electromagmetism. Experiments for this course are covered in PHYSICS 308.",
            "id": "PHYSICS 322",
            "parent": "PHYSICS",
            "title": "ELECTROMAGNETIC FIELDS"
        }
    },
    {
        "data": {
            "description": "Electrostatics, magnetostatics, Green functions, boundary value problems, macroscopic media, Maxwell's equations, the stress tensor and conservation laws, electromagnetic waves, wave propagation, dispersion, waveguides, radiation, multipole expansions, diffraction and scattering, special relativity, covariance of Maxwell's equations, Lienard-Wiechert potentials, radiation by accelerated charges.  Knowledge of electrodynamics  (such asPHYSICS 322) strongly encouraged.",
            "id": "PHYSICS 721",
            "parent": "PHYSICS",
            "title": "THEORETICAL PHYSICS-ELECTRODYNAMICS"
        }
    },
    {
        "data": {
            "description": "General considerations of nonlinear wave phenomena; nonlinear hyperbolic waves; nonlinear dispersion; nonlinear geometrical optics; Whitham's variational theory; nonlinear and parametric instabilities; solitary waves; inverse scattering method. Knowledge of electromagnetics [such asE C E 320orPHYSICS 321] or mechanics [such asM E 340] encouraged.",
            "id": "ECE/PHYSICS 848",
            "title": "NONLINEAR WAVES"
        }
    },
    {
        "data": {
            "description": "Lagrange's equations, Principle of Least Action, orbits and scattering, kinematics of rotation, rigid body dynamics, small oscillations, special relativistic dynamics, Hamiltonian formulation, canonical transformations, Hamilton-Jacobi theory, canonical perturbation theory, chaos, continuum mechanics, introduction to general relativity.",
            "id": "PHYSICS 711",
            "parent": "PHYSICS",
            "title": "THEORETICAL PHYSICS-DYNAMICS"
        }
    },
    {
        "data": {
            "description": "Statistical foundations, Liouville's theorem, ensembles, classical and quantum distribution functions, entropy and temperature, connection with thermodynamics, partition functions, quantum gases, non-ideal gases, phase transitions and critical phenomena, non-equilibrium problems, Boltzmann equation and the H-theorem, transport properties, connections with quantum field theory, applications of statistical mechanics to selected problems.",
            "id": "PHYSICS 715",
            "parent": "PHYSICS",
            "title": "STATISTICAL MECHANICS"
        }
    },
    {
        "data": {
            "description": "Time harmonic fields and waves in linear media with applications to radiation, guiding and scattering; wave and surface impedance and admittance concepts; duality, uniqueness, image theory, equivalence principle, induction and compensation theorems, reciprocity, Green's functions, wave functions, potential and transform theory. Knowledge of electromagnetics [such asE C E 420] strongly encouraged.",
            "id": "ECE 740",
            "parent": "ECE",
            "title": "ELECTROMAGNETIC THEORY"
        }
    },
    {
        "data": {
            "description": "A detailed introduction to quantum computation and quantum information processing. Basic topics of quantum mechanics that are most relevant to quantum computing, particularly measurement theory. Specialized topics such as entanglement, other measures of quantum correlation and the Bell inequalities. Classical and quantum information theory, classical and quantum complexity theory. Qubits, quantum gates, quantum circuits. Teleportation, quantum dense coding, quantum cryptography. Quantum algorithms: Deustch, Simon, Shor, Grover, and adiabatic algorithms. Basic quantum error correction: 5-qubit, Steane and Shor codes. Completion of one undergraduate course in quantum mechanics recommended, such asPHYSICS 448or531.",
            "id": "PHYSICS 709",
            "parent": "PHYSICS",
            "title": "INTRODUCTION TO QUANTUM COMPUTING"
        }
    },
    {
        "data": {
            "description": "A detailed introduction to the use of machine learning techniques in physics. Topics will include basics of probability theory and statistics, basics of function fitting and parameter inference, basics of optimization, and machine learning techniques.  A selection of physics topics that are particularly amenable to analysis using machine learning will be discussed. These might include processing collider data, classifying astronomical images, solving the Ising model, parameter estimation from physics data sets, learning physical probability distributions, finding string theory compactifications, and finding symbolic physical laws.",
            "id": "PHYSICS 361",
            "parent": "PHYSICS",
            "title": "MACHINE LEARNING IN PHYSICS"
        }
    },
    {
        "data": {
            "description": "A general interest survey that introduces the principles and applications of medical physics. Topics include biomechanics, energy usage and temperature regulation, pressure, sound and hearing, ultrasound, electricity in the body, optics and the eye, ionizing radiation in diagnosis and therapy, radiobiology, and nuclear medicine.",
            "id": "MEDPHYS/PHYSICS 265",
            "title": "INTRODUCTION TO MEDICAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "A series of weekly presentations and discussions of current research topics in physics, by scientists directly involved in those studies. Provides undergraduates with access to the topics and excitement of the research frontier in a manner not possible in normal subject courses.",
            "id": "PHYSICS 301",
            "parent": "PHYSICS",
            "title": "PHYSICS TODAY"
        }
    },
    {
        "data": {
            "description": "A tenth of a second, a single inch, or a slightly different angle can make all the difference in a sporting event.  Application of physical principles to competitive sport, leading to a better understanding of performances in such sports as track and field, cycling, archery, golf, football and basketball.",
            "id": "PHYSICS 106",
            "parent": "PHYSICS",
            "title": "PHYSICS OF SPORTS"
        }
    },
    {
        "data": {
            "description": "Advanced experiments in classical and modern physics. Possible experiments include beta decay, muon lifetime, nuclear magnetic resonance, Stern-Gerlach atomic beam, Mossbauer scattering, velocity of light, Zeeman effect, and Compton scattering. Techniques for the statistical analysis of experimental data and keeping a proper research lab notebook are emphasized. Two (four) credit students will typically perform four (eight) experiments.",
            "id": "PHYSICS 407",
            "parent": "PHYSICS",
            "title": "ADVANCED LABORATORY"
        }
    },
    {
        "data": {
            "description": "Advanced-level mentored research project in physics.",
            "id": "PHYSICS 498",
            "parent": "PHYSICS",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Advanced-level mentored research project in physics.",
            "id": "PHYSICS 499",
            "parent": "PHYSICS",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "An introduction to linear algebra and differential equations with emphasis on the relationship between the theory of linear algebra and analytical and numerical techniques for solving differential equations. Linear algebra topics include linear systems, matrices and their algebra, vector spaces and linear transformations, eigenvalues and eigenvectors. Topics from differential equations include first order ODE, homogeneous and nonhomogeneous linear systems, and numerical methods.",
            "id": "MATH 320",
            "parent": "MATH",
            "title": "LINEAR ALGEBRA AND DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "description": "An introduction to the physical principles underlying solid-state electronic and photonic devices, including elements of quantum mechanics, crystal structure, semiconductor band theory, carrier statistics, and band diagrams. Offers examples of modern semiconductor structures. Prior experience with MATLAB [such asE C E 203] is strongly encouraged but not required.",
            "id": "ECE/PHYSICS 235",
            "title": "INTRODUCTION TO SOLID STATE ELECTRONICS"
        }
    },
    {
        "data": {
            "description": "An introduction to thermodynamics and statistical mechanics from a physics perspective. Thermodynamics, phase equilibrium, kinetic theory of gases, classical and quantum statistical mechanics.",
            "id": "PHYSICS 415",
            "parent": "PHYSICS",
            "title": "THERMAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Basic description of plasmas: collective phenomena and sheaths, collisional processes, single particle motions, fluid models, equilibria, waves, electromagnetic properties, instabilities, and introduction to kinetic theory and nonlinear processes. Examples from fusion, astrophysical and materials processing processing plasmas.",
            "id": "ECE/NE/PHYSICS 525",
            "title": "INTRODUCTION TO PLASMAS"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for Physics, AMEP, and Astronomy-Physics majors. Mechanics, waves, thermodynamics and statistical mechanics, topics in modern physics; with computation.  A more mathematically rigorous and in-depth introduction to physics than the other introductory physics sequences.",
            "id": "PHYSICS 247",
            "parent": "PHYSICS",
            "title": "A MODERN INTRODUCTION TO PHYSICS"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for engineering students. Electricity, magnetism, light, and sound.",
            "id": "PHYSICS 202",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for engineering students. Mechanics: kinematics, statics, dynamics; energy and momentum.",
            "id": "PHYSICS 201",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for students majoring in biological sciences. Mechanics: kinematics, statics, dynamics; energy and momentum. Heat and sound.",
            "id": "PHYSICS 207",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Classical and modern optics, including imaging, polarization optics, optical telescopes, optical microscopes, interference and interferometers, optical fibers and fiber-optic communication, optical resonators, lasers, optical modulators, introduction to quantum and nonlinear optics. Concepts covered in lecture reinforced by weekly laboratory experiments.",
            "id": "PHYSICS 325",
            "parent": "PHYSICS",
            "title": "OPTICS"
        }
    },
    {
        "data": {
            "description": "Continuation ofMATH 171. Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Completion ofMATH 217implies completion ofMATH 221and114.",
            "id": "MATH 217",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY II"
        }
    },
    {
        "data": {
            "description": "Continuation ofPHYSICS 103. Principles of electricity and magnetism, light, optics, and modern physics, with applications to a number of different fields. Not recommended for students in the physical sciences and engineering.",
            "id": "PHYSICS 104",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Continuation ofPHYSICS 207: calculus-based introduction to physics intended for students majoring in biological sciences. Electricity, magnetism, light, and modern physics.",
            "id": "PHYSICS 208",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Continuation ofPHYSICS 247. Electromagnetism, circuits, optics, additional topics in modern physics; with computation.",
            "id": "PHYSICS 248",
            "parent": "PHYSICS",
            "title": "A MODERN INTRODUCTION TO PHYSICS"
        }
    },
    {
        "data": {
            "description": "Continuation ofPHYSICS 248. Modern physics: introduction to quantum mechanics, topics from nuclear and particle physics, condensed matter physics, and atomic physics. Three lectures and one discussion per week.",
            "id": "PHYSICS 249",
            "parent": "PHYSICS",
            "title": "A MODERN INTRODUCTION TO PHYSICS"
        }
    },
    {
        "data": {
            "description": "Continuation ofPHYSICS 448. Review of atomic and other quantum phenomena and special relativity; introduction to quantum mechanics treating the more advanced topics of atomic physics and applications to molecular, solid state, nuclear, and elementary particle physics and quantum statistics.",
            "id": "PHYSICS 449",
            "parent": "PHYSICS",
            "title": "ATOMIC AND QUANTUM PHYSICS"
        }
    },
    {
        "data": {
            "description": "Continuation ofPHYSICS 831. Quantum theory of free and interacting fields, formal scattering theory, dispersion theory.",
            "id": "PHYSICS 832",
            "parent": "PHYSICS",
            "title": "ADVANCED QUANTUM MECHANICS"
        }
    },
    {
        "data": {
            "description": "Coulomb Collisions, Boltzmann equation, Fokker-Planck methods, dynamical friction, neoclassical diffusion, collision operators radiation processes and experimental applications. Basic knowledge of plasmas [such asPHYSICS/​E C E/​N E  525] and advanced electromagnetics [such asPHYSICS 721orE C E 740] strongly encouraged.",
            "id": "ECE/NE/PHYSICS 725",
            "title": "PLASMA KINETIC THEORY AND RADIATION PROCESSES"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Current topics in astrophysics.",
            "id": "ASTRON/PHYSICS 910",
            "title": "SEMINAR IN ASTROPHYSICS"
        }
    },
    {
        "data": {
            "description": "Current topics in plasma physics.",
            "id": "ECE/NE/PHYSICS 922",
            "title": "SEMINAR IN PLASMA PHYSICS"
        }
    },
    {
        "data": {
            "description": "Designed to give new students an introduction to the broad range of modern research going on at UW Physics, and to help students find research opportunities in the department. Each week, faculty from each major research area will present their research in a seminar setting. The research areas will include selected topics both in theory and experiment from biophysics; atomic, molecular, and optical physics; plasma; condensed matter; quantum information and computation; high energy and nuclear physics; particle physics, astrophysics, and cosmology.",
            "id": "PHYSICS 701",
            "parent": "PHYSICS",
            "title": "GRADUATE INTRODUCTORY SEMINARS"
        }
    },
    {
        "data": {
            "description": "Direct current circuits, circuit theorems, alternating current circuits, transients, non-sinusoidal sources, Fourier analysis, characteristics of semiconductor devices, typical electronic circuits, feedback, non-linear circuits; digital and logic circuits.",
            "id": "PHYSICS 321",
            "parent": "PHYSICS",
            "title": "ELECTRIC CIRCUITS AND ELECTRONICS"
        }
    },
    {
        "data": {
            "description": "Discussion, practice, and occasional lectures on various aspects of the teaching of physics. Course planning; course materials; lecture, demonstration, and discussion techniques; laboratory; problem solving; examinations, grading, and evaluation. Problems arising in the teaching of physics; levels of difficulty, differences in talents and backgrounds; methods of presentation of various specific topics.",
            "id": "PHYSICS 603",
            "parent": "PHYSICS",
            "title": "WORKSHOP IN COLLEGE PHYSICS TEACHING"
        }
    },
    {
        "data": {
            "description": "Elementary aspects of Lagrange theory of fields and field quantization; Bose, Fermi and Pauli operators; interaction of fields; quantum theory of damping and fluctuations; applications to lasers, nonlinear optics, and quantum optics. Knowledge of lasers [such as PHYSICS 546] and graduate-level electromagnetics [such asE C E 740orPHYSICS 721] strongly encouraged.",
            "id": "ECE/PHYSICS 746",
            "title": "QUANTUM ELECTRONICS"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "Experiments in modern physics, with discussion of statistical uncertainties and error analysis.  Propagation of error.  Available labs include gamma-ray spectroscopy, X-ray physics and diffraction, blackbody radiation, and Cavendish measurement of the gravitational constant G.",
            "id": "PHYSICS 307",
            "parent": "PHYSICS",
            "title": "INTERMEDIATE LABORATORY-MECHANICS AND MODERN PHYSICS"
        }
    },
    {
        "data": {
            "description": "Explores applications of quantum theory to both the hardware and the software that underpin modern quantum information technology. Advanced quantum circuit theory: Clifford group and Gottesman-Knill theorem, Mathematica code. Decoherence: density matrices, probability distributions, T1 and T2. Advanced error correction: master equation, Kraus operators, fault tolerance, quantum tomography. Hardware: Trapped ions, Paul traps, sideband cooling, CZ and MS gates, neutral atoms, superconductors, quantum dots.",
            "id": "PHYSICS 779",
            "parent": "PHYSICS",
            "title": "ADVANCED QUANTUM COMPUTING"
        }
    },
    {
        "data": {
            "description": "Explores topics in Physics at the elementary undergraduate level.",
            "id": "PHYSICS 120",
            "parent": "PHYSICS",
            "title": "SPECIAL TOPICS IN PHYSICS"
        }
    },
    {
        "data": {
            "description": "First order differential equations, introduction to multivariable calculus and constrained optimization, infinite sequences and series, methods of approximation, and a brief introduction to probability. Models and applications from business and the social sciences.",
            "id": "MATH 213",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 2"
        }
    },
    {
        "data": {
            "description": "Fundamental physics of ionizing radiation production and detection applied to medical science. Topics: scintillator/semiconductor detectors, ionizing radiation detectors, charged and neutral particles for external beam radiotherapy, production of radionuclides with cyclotron and linear accelerators for diagnostic and therapeutic applications, radiochemistry, and X-ray tube physics.",
            "id": "MEDPHYS/PHYSICS 588",
            "title": "RADIATION PRODUCTION AND DETECTION"
        }
    },
    {
        "data": {
            "description": "Fundamental theory and recent advances in coherent radiation charged particle beam sources (microwave to X-ray wavelengths) including free electron lasers, wiggler/wave-particle dynamics, Cerenkov masers, gyrotrons, coherent gain and efficiency, spontaneous emission, beam sources and quality, related accelerator concepts experimental results and applications.",
            "id": "ECE/NE/PHYSICS 749",
            "title": "COHERENT GENERATION AND PARTICLE BEAMS"
        }
    },
    {
        "data": {
            "description": "Fundamentals of electronics, electronic elements, basic circuits; combinations of these into measuring instruments.",
            "id": "PHYSICS 623",
            "parent": "PHYSICS",
            "title": "ELECTRONIC AIDS TO MEASUREMENT"
        }
    },
    {
        "data": {
            "description": "General considerations of linear wave phenomena; one dimensional waves; two and three dimensional waves; wave equations with constant coefficients; inhomogenous media; random media. Lagrangian and Hamiltonian formulations; asymptotic methods. Knowledge of electromagnetics [such asE C E 320orPHYSICS 321], mechanics [such asM E 340], or vibrations [such asM E 440] strongly encouraged.",
            "id": "ECE/PHYSICS 748",
            "title": "LINEAR WAVES"
        }
    },
    {
        "data": {
            "description": "Graduate-level mentored research project in physics.",
            "id": "PHYSICS 799",
            "parent": "PHYSICS",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Historical background and experimental basis of quantum mechanics; de Broglie waves, correspondence principle, uncertainty principle, Schrodinger equation, hydrogen atom, electron spin, Pauli principle; applications of wave mechanics.",
            "id": "PHYSICS 531",
            "parent": "PHYSICS",
            "title": "INTRODUCTION TO QUANTUM MECHANICS"
        }
    },
    {
        "data": {
            "description": "Intended for music students who wish to learn about physical basis of sound, sound perception, musical scales, musical instruments, and room acoustics.",
            "id": "PHYSICS 371",
            "parent": "PHYSICS",
            "title": "ACOUSTICS FOR MUSICIANS"
        }
    },
    {
        "data": {
            "description": "Interaction of electromagnetic radiation with matter, quantization of the electromagnetic field, spontaneous transitions, identical particles and spin, addition of angular momenta, tensor operators, complex atoms, Hartree approximation, molecules, Dirac equation, relativistic effects in atoms.",
            "id": "PHYSICS 732",
            "parent": "PHYSICS",
            "title": "QUANTUM MECHANICS"
        }
    },
    {
        "data": {
            "description": "Interaction of particles with matter; detector techniques at colliding beam machines, in nuclear and particle physics, astrophysics, and cosmology; experimental strategies in detector design; principles of simulation and Monte Carlo methods, error analysis and statistical techniques in data analysis. Knowledge of introductory particle physics  (such asPHYSICS 535) strongly encouraged.",
            "id": "PHYSICS 736",
            "parent": "PHYSICS",
            "title": "EXPERIMENTAL METHODS IN NUCLEAR-, PARTICLE-, AND ASTROPHYSICS"
        }
    },
    {
        "data": {
            "description": "Interactions among the particles, fields, and radiation of interstellar and intergalactic space. Gamma-ray, x-ray, and cosmic ray production, propagation, and detection. Knowledge of electrodynamics  (such asPHYSICS 322) strongly encouraged.",
            "id": "PHYSICS 772",
            "parent": "PHYSICS",
            "title": "HIGH ENERGY ASTROPHYSICS"
        }
    },
    {
        "data": {
            "description": "Interactions and energy deposition by ionizing radiation in matter; concepts, quantities and units in radiological physics; principles and methods of radiation dosimetry.",
            "id": "BME/HONCOL/MEDPHYS/PHYSICS 501",
            "title": "RADIATION PHYSICS AND DOSIMETRY"
        }
    },
    {
        "data": {
            "description": "Intermediate-level mentored research project in physics.",
            "id": "PHYSICS 298",
            "parent": "PHYSICS",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Intermediate-level mentored research project in physics.",
            "id": "PHYSICS 299",
            "parent": "PHYSICS",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Introduction to atomic, solid state, and nuclear physics.",
            "id": "PHYSICS 205",
            "parent": "PHYSICS",
            "title": "MODERN PHYSICS FOR ENGINEERS"
        }
    },
    {
        "data": {
            "description": "Introduction to calculus of functions of several variables; calculus on parameterized curves, derivatives of functions of several variables, multiple integrals, vector calculus.",
            "id": "MATH 234",
            "parent": "MATH",
            "title": "CALCULUS--FUNCTIONS OF SEVERAL VARIABLES"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Introduction to energy, focusing on energy sources and their impacts on humans and the environment, particularly through climate change. Develop basic physics skills to form opinions on energy-related issues affecting the world as well as your own use of energy. Apply the physical principles of mechanics, heat, electricity, and atomic nuclei to various energy sources (fossil fuels, renewables, and nuclear) and their impacts.",
            "id": "PHYSICS 115",
            "parent": "PHYSICS",
            "title": "ENERGY AND CLIMATE"
        }
    },
    {
        "data": {
            "description": "Introduction to physics at the non-calculus level. Principles of mechanics, heat, and waves, with applications to a number of different fields. Not recommended for students in the physical sciences and engineering.",
            "id": "PHYSICS 103",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Introductory-level mentored research project in physics.",
            "id": "PHYSICS 198",
            "parent": "PHYSICS",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Introductory-level mentored research project in physics.",
            "id": "PHYSICS 199",
            "parent": "PHYSICS",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Kinetic theory; relativity; experimental origin of quantum theory; atomic structure and spectral lines; topics in solid state, nuclear and particle physics.",
            "id": "PHYSICS 241",
            "parent": "PHYSICS",
            "title": "INTRODUCTION TO MODERN PHYSICS"
        }
    },
    {
        "data": {
            "description": "Lattice dynamics; band theory; Fermi surfaces; electrodynamics of metals; optical properties; transport properties. Knowledge of introductory solid state physics (such asPHYSICS 551) strongly encouraged.",
            "id": "PHYSICS 751",
            "parent": "PHYSICS",
            "title": "ADVANCED SOLID STATE PHYSICS"
        }
    },
    {
        "data": {
            "description": "Lectures by staff and visitors.",
            "id": "PHYSICS 900",
            "parent": "PHYSICS",
            "title": "COLLOQUIUM"
        }
    },
    {
        "data": {
            "description": "MHD equations and validity in hot plasmas; magnetic structure and magnetic flux coordinates; equilibrium in various configurations; stability formulation, energy principle, classification of instabilities; ideal and resistive instability in various configurations, evolution of nonlinear tearing modes; force-free equilibria, helicity, MHD dynamo; experimental applications. Basic knowledge of plasmas [such asPHYSICS/​E C E/​N E  525] and advanced electromagnetics [such asPHYSICS 721orE C E 740] strongly encouraged.",
            "id": "ECE/NE/PHYSICS 726",
            "title": "PLASMA MAGNETOHYDRODYNAMICS"
        }
    },
    {
        "data": {
            "description": "Mechanical, thermal, electric, and magnetic properties of solids; band theory; semiconductors; crystal imperfections.",
            "id": "PHYSICS 551",
            "parent": "PHYSICS",
            "title": "SOLID STATE PHYSICS"
        }
    },
    {
        "data": {
            "description": "Mentored individual research and study for students completing Physics Honors in the Major.",
            "id": "PHYSICS 681",
            "parent": "PHYSICS",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Mentored individual research and study for students completing Physics Honors in the Major.",
            "id": "PHYSICS 682",
            "parent": "PHYSICS",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Mentored individual research and study for students completing a thesis.",
            "id": "PHYSICS 691",
            "parent": "PHYSICS",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Mentored individual research and study for students completing a thesis.",
            "id": "PHYSICS 692",
            "parent": "PHYSICS",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Nuclear atom; hydrogen atom; Bohr-Sommerfeld model, wave model, electron spin, description of quantum electron spin, description of quantum electrodynamic effects; external fields; many-electron atoms; central field, Pauli principle, multiplets, periodic table, x-ray spectra, vector coupling, systematics of ground states; nuclear effects in atomic spectra; interaction with coherent radiation, optical forces, laser cooling and trapping.",
            "id": "PHYSICS 545",
            "parent": "PHYSICS",
            "title": "INTRODUCTION TO ATOMIC STRUCTURE"
        }
    },
    {
        "data": {
            "description": "Optical methods in research and technology. Reflection, refraction, absorption, scattering. Imaging. Sources and sensors. Schlieren methods. Interferometry. Instrumental spectroscopy. Fourier optics, image processing, holography. Laser technology, Gaussian beams, nonlinear optics.",
            "id": "PHYSICS 625",
            "parent": "PHYSICS",
            "title": "APPLIED OPTICS"
        }
    },
    {
        "data": {
            "description": "Origin and development of classical mechanics; mathematical techniques, especially vector analysis; conservation laws and their relation to symmetry principles; brief introduction to orbit theory and rigid-body dynamics; accelerated coordinate systems; introduction to the generalized-coordinate formalisms of Lagrange and Hamilton.",
            "id": "PHYSICS 311",
            "parent": "PHYSICS",
            "title": "MECHANICS"
        }
    },
    {
        "data": {
            "description": "Principles of magnetic confinement and heating of plasmas for controlled thermonuclear fusion: magnetic field structures, single particle orbits, equilibrium, stability, collisions, transport, heating, modeling and diagnostics. Discussion of current leading confinement concepts: tokamaks, tandem mirrors, stellarators, reversed field pinches, etc.",
            "id": "ECE/NE/PHYSICS 527",
            "title": "PLASMA CONFINEMENT AND HEATING"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Provides an intensive introduction to the experimental techniques of quantum computing. Students will do 8 experiments chosen from: Bell violation with entangled photons, Stern-Gerlach, Pulsed NMR, Optical pumping of Rb, Nanofabrication, Fiber optics communication, Diode pumped YAG laser, and Acousto-optic modulator.",
            "id": "PHYSICS 707",
            "parent": "PHYSICS",
            "title": "QUANTUM COMPUTING LABORATORY"
        }
    },
    {
        "data": {
            "description": "Quantum theory of free and interacting fields, formal scattering theory, dispersion theory.",
            "id": "PHYSICS 831",
            "parent": "PHYSICS",
            "title": "ADVANCED QUANTUM MECHANICS"
        }
    },
    {
        "data": {
            "description": "Research supervised by individual faculty members.",
            "id": "PHYSICS 990",
            "parent": "PHYSICS",
            "title": "RESEARCH"
        }
    },
    {
        "data": {
            "description": "Review of atomic and other quantum phenomena and special relativity; introduction to quantum mechanics treating the more advanced topics of atomic physics and applications to molecular, solid state, nuclear, and elementary particle physics and quantum statistics.",
            "id": "PHYSICS 448",
            "parent": "PHYSICS",
            "title": "ATOMIC AND QUANTUM PHYSICS"
        }
    },
    {
        "data": {
            "description": "Review of quantum physics; introduction to particles, antiparticles and fundamental interactions; detectors and accelerators; symmetries and conservation laws; electroweak and color interactions of quarks and leptons; unification theories.",
            "id": "PHYSICS 535",
            "parent": "PHYSICS",
            "title": "INTRODUCTION TO PARTICLE PHYSICS"
        }
    },
    {
        "data": {
            "description": "Schrodinger equation, operator theory, matrix mechanics, transformation theory, Heisenberg representation, orbital angular momentum, bound-state problems, scattering theory, stationary perturbation theory, degenerate systems, time-dependent perturbation theory, Born approximation, other approximation methods.  Knowledge of quantum mechanics and atomic physics  (such asPHYSICS 449or531) strongly encouraged.",
            "id": "PHYSICS 731",
            "parent": "PHYSICS",
            "title": "QUANTUM MECHANICS"
        }
    },
    {
        "data": {
            "description": "Selected topics in theoretical physics.",
            "id": "PHYSICS 801",
            "parent": "PHYSICS",
            "title": "SPECIAL TOPICS IN THEORETICAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Special and general theories of relativity, relativistic electrodynamics, cosmology, unified field theories.",
            "id": "PHYSICS 717",
            "parent": "PHYSICS",
            "title": "RELATIVITY"
        }
    },
    {
        "data": {
            "description": "Special relativity, electromagnetic momentum, electromagnetic waves: propagation, interference, scattering, reflection and refraction at a dielectric interface, waves in a conductor. Wave packets and group velocity, dispersion. Waveguides and transmission lines. Retarded potentials. Radiation.",
            "id": "PHYSICS 323",
            "parent": "PHYSICS",
            "title": "ELECTROMAGNETIC FIELDS"
        }
    },
    {
        "data": {
            "description": "Special topics in physics at the advanced undergraduate level.",
            "id": "PHYSICS 406",
            "parent": "PHYSICS",
            "title": "SPECIAL TOPICS IN PHYSICS"
        }
    },
    {
        "data": {
            "description": "Special topics in physics at the graduate level.",
            "id": "PHYSICS 805",
            "parent": "PHYSICS",
            "title": "SPECIAL TOPICS IN PHYSICS"
        }
    },
    {
        "data": {
            "description": "Special topics in physics at the intermediate undergraduate level.",
            "id": "PHYSICS 206",
            "parent": "PHYSICS",
            "title": "SPECIAL TOPICS IN PHYSICS"
        }
    },
    {
        "data": {
            "description": "Standard model. Application to e+e-, proton-antiproton, pp, and ep colliders. Jets. Weak boson, heavy-quark, and Higgs boson production and decay. Quarkonia. Neutral B meson mixing. Grand unification. Supersymmetry.",
            "id": "PHYSICS 835",
            "parent": "PHYSICS",
            "title": "COLLIDER PHYSICS PHENOMENOLOGY"
        }
    },
    {
        "data": {
            "description": "Structure of elementary particles, quarks and gluons, introduction to calculational techniques of particle interactions (Feynman diagrams), constituent models of electroweak and strong interactions and associated phenomenological techniques. Knowledge of introductory particle physics and quantum mechanics  (such asPHYSICS 535) strongly encouraged.",
            "id": "PHYSICS 735",
            "parent": "PHYSICS",
            "title": "PARTICLE PHYSICS"
        }
    },
    {
        "data": {
            "description": "Survey of state of the art microscopic, cellular and molecular imaging techniques, beginning with subcellular microscopy and finishing with whole animal imaging.",
            "id": "BME/MEDPHYS/PHMCOL-M/PHYSICS/RADIOL 619",
            "title": "MICROSCOPY OF LIFE"
        }
    },
    {
        "data": {
            "description": "Symmetries and symmetry breaking, phase transitions, mean field theory, critical exponents, scaling hypothesis, renormalization group, diagrammatic expansion, epsilon-expansion, exact solution of the 2d Ising model. Boltzman kinetic equation, H-theorem, Fokker-Planck and Langevin equations, Born-Markov master equation, Lindblad superoperators, classical and quantum noise, theory of amplifiers.",
            "id": "PHYSICS 716",
            "parent": "PHYSICS",
            "title": "STATISTICAL MECHANICS II"
        }
    },
    {
        "data": {
            "description": "Techniques of integration, improper integrals, first order ordinary differential equations, sequences and series, Taylor series, vector geometry in two and three dimensions.",
            "id": "MATH 222",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 2"
        }
    },
    {
        "data": {
            "description": "The nature of sound and sound perception; fundamentals of harmony, musical scales, and musical instruments. Studies of light including lenses, photography, color perception, and color mixing.",
            "id": "PHYSICS 109",
            "parent": "PHYSICS",
            "title": "PHYSICS IN THE ARTS"
        }
    },
    {
        "data": {
            "description": "The twentieth-century physical world picture and its origins. Selected topics in classical physics, relativity, and the quantum theory with emphasis on the meaning of basic concepts and their broader implications, rather than practical applications.",
            "id": "PHYSICS 107",
            "parent": "PHYSICS",
            "title": "THE IDEAS OF MODERN PHYSICS"
        }
    },
    {
        "data": {
            "description": "Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Part of a 2-semester sequence withMATH 217; these two courses together are equivalent toMATH 114and221.",
            "id": "MATH 171",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY I"
        }
    },
    {
        "data": {
            "description": "Vector analysis: algebra and geometry of vectors, vector differential and integral calculus, theorems of Green, Gauss, and Stokes; complex analysis: analytic functions, complex integrals and residues, Taylor and Laurent series.",
            "id": "MATH 321",
            "parent": "MATH",
            "title": "APPLIED MATHEMATICAL ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Waves in a cold plasma, wave-plasma interactions, waves in a hot plasma, Landau damping, cyclotron damping, magneto-hydrodynamic equilibria and instabilities, microinstabilities, introduction to nonlinear processes, and experimental applications. Basic knowledge of plasmas [such asPHYSICS/​E C E/​N E  525] and advanced electromagnetics [such asPHYSICS 721orE C E 740] strongly encouraged.",
            "id": "ECE/NE/PHYSICS 724",
            "title": "WAVES AND INSTABILITIES IN PLASMAS"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ECE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "PHYSICS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "BME/HONCOL/MEDPHYS/PHYSICS 501",
            "target": "MEDPHYS/PHYSICS 588"
        }
    },
    {
        "data": {
            "source": "ECE 740",
            "target": "ECE/NE/PHYSICS 749"
        }
    },
    {
        "data": {
            "source": "ECE/NE/PHYSICS 525",
            "target": "ECE/NE/PHYSICS 527"
        }
    },
    {
        "data": {
            "source": "ECE/PHYSICS 235",
            "target": "PHYSICS 551"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 113"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 113",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "MATH 217"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 213"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 213",
            "target": "MATH 222"
        }
    },
    {
        "data": {
            "source": "MATH 217",
            "target": "PHYSICS 206"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 222"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "PHYSICS 201"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "PHYSICS 202"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "PHYSICS 207"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "ECE/PHYSICS 235"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 234"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 320"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "PHYSICS 241"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "PHYSICS 247"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "MATH 321"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "PHYSICS 361"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "PHYSICS 623"
        }
    },
    {
        "data": {
            "source": "MATH 320",
            "target": "BME/HONCOL/MEDPHYS/PHYSICS 501"
        }
    },
    {
        "data": {
            "source": "MATH 320",
            "target": "MATH 321"
        }
    },
    {
        "data": {
            "source": "MATH 321",
            "target": "PHYSICS 311"
        }
    },
    {
        "data": {
            "source": "MATH 321",
            "target": "PHYSICS 322"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "MEDPHYS/PHYSICS 265",
            "target": "BME/MEDPHYS/PHMCOL-M/PHYSICS/RADIOL 619"
        }
    },
    {
        "data": {
            "source": "PHYSICS 103",
            "target": "PHYSICS 104"
        }
    },
    {
        "data": {
            "source": "PHYSICS 103",
            "target": "PHYSICS 106"
        }
    },
    {
        "data": {
            "source": "PHYSICS 103",
            "target": "PHYSICS 115"
        }
    },
    {
        "data": {
            "source": "PHYSICS 103",
            "target": "PHYSICS 206"
        }
    },
    {
        "data": {
            "source": "PHYSICS 201",
            "target": "PHYSICS 103"
        }
    },
    {
        "data": {
            "source": "PHYSICS 201",
            "target": "PHYSICS 202"
        }
    },
    {
        "data": {
            "source": "PHYSICS 201",
            "target": "PHYSICS 207"
        }
    },
    {
        "data": {
            "source": "PHYSICS 202",
            "target": "PHYSICS 104"
        }
    },
    {
        "data": {
            "source": "PHYSICS 202",
            "target": "PHYSICS 205"
        }
    },
    {
        "data": {
            "source": "PHYSICS 202",
            "target": "PHYSICS 208"
        }
    },
    {
        "data": {
            "source": "PHYSICS 202",
            "target": "PHYSICS 307"
        }
    },
    {
        "data": {
            "source": "PHYSICS 202",
            "target": "PHYSICS 311"
        }
    },
    {
        "data": {
            "source": "PHYSICS 205",
            "target": "PHYSICS 241"
        }
    },
    {
        "data": {
            "source": "PHYSICS 207",
            "target": "PHYSICS 201"
        }
    },
    {
        "data": {
            "source": "PHYSICS 207",
            "target": "PHYSICS 208"
        }
    },
    {
        "data": {
            "source": "PHYSICS 208",
            "target": "MEDPHYS/PHYSICS 265"
        }
    },
    {
        "data": {
            "source": "PHYSICS 208",
            "target": "PHYSICS 202"
        }
    },
    {
        "data": {
            "source": "PHYSICS 241",
            "target": "PHYSICS 205"
        }
    },
    {
        "data": {
            "source": "PHYSICS 241",
            "target": "PHYSICS 406"
        }
    },
    {
        "data": {
            "source": "PHYSICS 241",
            "target": "PHYSICS 415"
        }
    },
    {
        "data": {
            "source": "PHYSICS 241",
            "target": "PHYSICS 448"
        }
    },
    {
        "data": {
            "source": "PHYSICS 247",
            "target": "PHYSICS 248"
        }
    },
    {
        "data": {
            "source": "PHYSICS 248",
            "target": "ECE/PHYSICS 235"
        }
    },
    {
        "data": {
            "source": "PHYSICS 248",
            "target": "PHYSICS 241"
        }
    },
    {
        "data": {
            "source": "PHYSICS 248",
            "target": "PHYSICS 249"
        }
    },
    {
        "data": {
            "source": "PHYSICS 248",
            "target": "PHYSICS 301"
        }
    },
    {
        "data": {
            "source": "PHYSICS 248",
            "target": "PHYSICS 321"
        }
    },
    {
        "data": {
            "source": "PHYSICS 248",
            "target": "PHYSICS 322"
        }
    },
    {
        "data": {
            "source": "PHYSICS 248",
            "target": "PHYSICS 325"
        }
    },
    {
        "data": {
            "source": "PHYSICS 248",
            "target": "PHYSICS 361"
        }
    },
    {
        "data": {
            "source": "PHYSICS 248",
            "target": "PHYSICS 623"
        }
    },
    {
        "data": {
            "source": "PHYSICS 249",
            "target": "PHYSICS 531"
        }
    },
    {
        "data": {
            "source": "PHYSICS 307",
            "target": "PHYSICS 407"
        }
    },
    {
        "data": {
            "source": "PHYSICS 311",
            "target": "PHYSICS 415"
        }
    },
    {
        "data": {
            "source": "PHYSICS 311",
            "target": "PHYSICS 448"
        }
    },
    {
        "data": {
            "source": "PHYSICS 311",
            "target": "PHYSICS 531"
        }
    },
    {
        "data": {
            "source": "PHYSICS 311",
            "target": "PHYSICS 603"
        }
    },
    {
        "data": {
            "source": "PHYSICS 322",
            "target": "ECE/NE/PHYSICS 525"
        }
    },
    {
        "data": {
            "source": "PHYSICS 322",
            "target": "PHYSICS 323"
        }
    },
    {
        "data": {
            "source": "PHYSICS 322",
            "target": "PHYSICS 325"
        }
    },
    {
        "data": {
            "source": "PHYSICS 322",
            "target": "PHYSICS 448"
        }
    },
    {
        "data": {
            "source": "PHYSICS 322",
            "target": "PHYSICS 531"
        }
    },
    {
        "data": {
            "source": "PHYSICS 322",
            "target": "PHYSICS 603"
        }
    },
    {
        "data": {
            "source": "PHYSICS 322",
            "target": "PHYSICS 625"
        }
    },
    {
        "data": {
            "source": "PHYSICS 323",
            "target": "BME/HONCOL/MEDPHYS/PHYSICS 501"
        }
    },
    {
        "data": {
            "source": "PHYSICS 371",
            "target": "PHYSICS 109"
        }
    },
    {
        "data": {
            "source": "PHYSICS 448",
            "target": "PHYSICS 449"
        }
    },
    {
        "data": {
            "source": "PHYSICS 448",
            "target": "PHYSICS 545"
        }
    },
    {
        "data": {
            "source": "PHYSICS 449",
            "target": "BME/HONCOL/MEDPHYS/PHYSICS 501"
        }
    },
    {
        "data": {
            "source": "PHYSICS 531",
            "target": "PHYSICS 535"
        }
    },
    {
        "data": {
            "source": "PHYSICS 531",
            "target": "PHYSICS 707"
        }
    },
    {
        "data": {
            "source": "PHYSICS 709",
            "target": "PHYSICS 707"
        }
    },
    {
        "data": {
            "source": "PHYSICS 715",
            "target": "PHYSICS 716"
        }
    },
    {
        "data": {
            "source": "PHYSICS 731",
            "target": "PHYSICS 716"
        }
    },
    {
        "data": {
            "source": "PHYSICS 731",
            "target": "PHYSICS 779"
        }
    }
]