[
    {
        "data": {
            "description": "Nine-week physical therapy internship in a pre-determined clinical environment.",
            "id": "PHYTHER 705",
            "parent": "PHYTHER",
            "title": "CLINICAL INTERNSHIP VI"
        }
    },
    {
        "data": {
            "description": "Ethics, organization and administration of physical therapy departments. Planning and correlation of hospital and community health services. Study background, organization and responsibilities of health care team members in hospital services and programs.",
            "id": "PHYTHER 512",
            "parent": "PHYTHER",
            "title": "PRINCIPLES OF PROFESSIONAL PRACTICE AND ADMINISTRATION"
        }
    },
    {
        "data": {
            "description": "80-hour physical therapy internship in a pre-determined clinical environment.",
            "id": "PHYTHER 700",
            "parent": "PHYTHER",
            "title": "CLINICAL INTERNSHIP I"
        }
    },
    {
        "data": {
            "description": "An in-depth training in various aspects of research (e.g., literature review, understanding of study methodology, data collection, data reduction and analysis, dissemination of findings). Work independently under the supervision of a faculty member from the UW Doctor of Physical Therapy program and will participate in an on-going project for the semester.",
            "id": "PHYTHER 642",
            "parent": "PHYTHER",
            "title": "RESEARCH PRACTICUM"
        }
    },
    {
        "data": {
            "description": "Addresses the cardiovascular, pulmonary, neuromuscular and connective tissue properties and adaptations that influence human movement through the lifespan. Through an understanding of the system integration, gain an appreciation of the physiological complexities underlying human movement.",
            "id": "PHYTHER 627",
            "parent": "PHYTHER",
            "title": "CLINICAL DECISION-MAKING: TISSUE MECHANICS AND ADAPTATIONS"
        }
    },
    {
        "data": {
            "description": "Physical therapy internship in a pre-determined clinical environment.",
            "id": "PHYTHER 704",
            "parent": "PHYTHER",
            "title": "CLINICAL INTERNSHIP V"
        }
    },
    {
        "data": {
            "source": "PHYTHER 676",
            "target": "PHYTHER 679"
        }
    },
    {
        "data": {
            "description": "Course content is designed specifically for the individual student.",
            "id": "PHYTHER 799",
            "parent": "PHYTHER",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Professional attitudes, beliefs, behaviors relevant to physical therapy practice through the Guide to Physical Therapist Practice, APTA history, Generic Abilities, APTA Code of Ethics, APTA Core Values, PT roles and practice settings, professional autonomy, health care teams, professional learning opportunities.",
            "id": "PHYTHER 538",
            "parent": "PHYTHER",
            "title": "INTRODUCTION TO THE PHYSICAL THERAPY PROFESSION AND PROFESSIONALISM"
        }
    },
    {
        "data": {
            "description": "Students will explore their own backgrounds and will learn constructs of cultural competency; cultural beliefs and practices; impact of diversity issues such as SES, sexual preference, disability, educational level, ethnicity and race; and the culture of medicine.",
            "id": "PHYTHER 541",
            "parent": "PHYTHER",
            "title": "ISSUES OF CULTURE AND DIVERSITY IN HEALTH CARE"
        }
    },
    {
        "data": {
            "description": "Provides the the cognitive, affective and psychomotor skills for efficacious examination/evaluation and treatment of patients with conditions requiring orthotic, protective and supportive devices.  Specific orthotic topics include: material technology; biomechanics of orthoses; orthotic design and fabrication principles, lower limb orthoses (LLO); spinal orthoses (SO); upper limb orthoses (ULO); and wheelchair seating and propulsion.  Provides the foundation for clinical applications in the musculoskeletal (PHY THER  676/677) and neuromuscular clinical tracts (PHY THER 635/636).",
            "id": "PHYTHER 675",
            "parent": "PHYTHER",
            "title": "OTHOTICS: APPLICATIONS IN PHYSICAL THERAPY PRACTICE"
        }
    },
    {
        "data": {
            "description": "Modules in medical screening, pharmacological principles, diagnostic imaging, laboratory testing, psychological disorders, ENT, endocrinology, dermatology, and geriatrics are presented in the context of pathophysiology, differential diagnosis, prevention, and management. Lectures provided by physicians, physician assistants and physical therapists. Case studies are utilized for development of clinical problem solving skills.",
            "id": "PHYTHER 664",
            "parent": "PHYTHER",
            "title": "CLINICAL MEDICINE I"
        }
    },
    {
        "data": {
            "description": "Learning experiences in a clinical setting under the direct guidance of a physical therapist (Clinical Instructor). Ability to perform physical therapy examinations of body structures and functions, and other evaluations, interventions, and outcomes assessed by evaluative tools, such as the Clinical Performance Instrument (CPI).",
            "id": "PHYTHER 706",
            "parent": "PHYTHER",
            "title": "CLINICAL INTERNSHIP VII"
        }
    },
    {
        "data": {
            "description": "Physical, psychological, spiritual, social, emotional, intellectual and vocational aspects of wellness. The physical therapist's role in primary, secondary and tertiary prevention; health promotion, and individual and community screening activities for wellness/fitness; and safety and environmental considerations for health and wellness.",
            "id": "PHYTHER 668",
            "parent": "PHYTHER",
            "title": "HEALTH PROMOTION AND WELLNESS"
        }
    },
    {
        "data": {
            "description": "Focuses on critical evaluation of published research relevant to physical therapy. In seminar format,  present the results of original research, and lead discussions of the strengths, weaknesses, and underlying theory of the research.",
            "id": "PHYTHER 643",
            "parent": "PHYTHER",
            "title": "CURRENT ISSUES IN REHABILITATION RESEARCH II"
        }
    },
    {
        "data": {
            "description": "Build skills in collaboration, problem solving, and reflection to approach complex community-based public health problems contribute to becoming a public leader. Explore the six levels of public health leadership through the practices of current and past public health leaders, case studies, and personal experience.",
            "id": "NURSING/PHARMACY/PHYASST/PHYTHER/PUBLHLTH 758",
            "title": "INTERPROFESSIONAL PUBLIC HEALTH LEADERSHIP"
        }
    },
    {
        "data": {
            "description": "Provides the cognitive, affective and psychomotor skills for efficacious examination/evaluation and treatment of patients/clients with amputation. Course topics include the management of patients/clients with congenital and/or acquired amputation and its subsequent prosthetic management. Functional training in self-care and home management including activities of daily living (ADLs) and instrumental activities of daily living (IADLs), as well as functional training in work (job/school/play) are covered in the context of patients with limb loss.",
            "id": "PHYTHER 679",
            "parent": "PHYTHER",
            "title": "PROSTHETICS: APPLICATIONS IN PHYSICAL THERAPY PRACTICE"
        }
    },
    {
        "data": {
            "source": "PHYTHER 679",
            "target": "PHYTHER 706"
        }
    },
    {
        "data": {
            "description": "160-hour physical therapy internship in a predetermined clinical environment.",
            "id": "PHYTHER 701",
            "parent": "PHYTHER",
            "title": "CLINICAL INTERNSHIP II"
        }
    },
    {
        "data": {
            "description": "Addresses the mechanics and control of the neuromuscular and skeletal systems as they relate to human movement. Neural control of movement is discussed in detail with specific emphasis on theories underlying recruitment of muscle in health and disease.",
            "id": "PHYTHER 628",
            "parent": "PHYTHER",
            "title": "CLINICAL DECISION MAKING: NEUROMUSCULAR MECHANICS AND CONTROL"
        }
    },
    {
        "data": {
            "description": "Application of motor control and motor learning principles to the examination, diagnosis, and management of people with movement disorders stemming from CNS pathology. Emphasis on neurological interventions across the lifespan.",
            "id": "PHYTHER 635",
            "parent": "PHYTHER",
            "title": "MOTOR DONTROL DYSFUNCTION : EXAMINATION, DIAGNOSIS, AND MANAGEMENT I"
        }
    },
    {
        "data": {
            "description": "Application of anatomy and palpatory skills in a clinically-oriented environment. Focus is on applied anatomy, kinesiology, posture, movement analysis, medical terminology.",
            "id": "PHYTHER 501",
            "parent": "PHYTHER",
            "title": "ANATOMICAL APPLICATIONS IN PHYSICAL THERAPY"
        }
    },
    {
        "data": {
            "description": "Examination for exercise design, implementation, and progression. Range of motion, flexibility, joint mobilization, balance/gait training, proprioceptive neuromuscular facilitation, balance, coordination, agility training, body mechanics, postural stabilization, resistive and endurance training, aquatic therapy, relaxation, manual traction, massage. Scientific rationale for treatment interventions.",
            "id": "PHYTHER 534",
            "parent": "PHYTHER",
            "title": "FOUNDATIONS OF PHYSICAL THERAPY INTERVENTION"
        }
    },
    {
        "data": {
            "id": "PHYTHER",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Instructional design, learning theories and styles throughout the lifespan, literacy issues, professional presentations and posters, the physical therapist as educator, professional behaviors and emotional preparation for the clinic.",
            "id": "PHYTHER 539",
            "parent": "PHYTHER",
            "title": "PHYSICAL THERAPY EDUCCATION AND LIFESPAN LEARNING ISSUES"
        }
    },
    {
        "data": {
            "description": "Provides the physical therapy student with the cognitive, affective, and psychomotor knowledge for effective examination, evaluation, diagnosis and management of patients/clients of all ages with various musculoskeletal dysfunctions related specifically to the extremities.",
            "id": "PHYTHER 677",
            "parent": "PHYTHER",
            "title": "MUSCULOSKELETAL DYSFUNCTION : EXAMINATION, DIAGNOSIS, & MANAGEMENT II"
        }
    },
    {
        "data": {
            "description": "Provides an introduction to medical ethics and jurisprudence as they apply to physical therapy. Includes information on health care regulatory agencies and health care regulations.",
            "id": "PHYTHER 542",
            "parent": "PHYTHER",
            "title": "MEDICAL ETHICS, JURISPRUDENCE, AND HEALTH CARE REGULATIONS"
        }
    },
    {
        "data": {
            "description": "Focuses on critical evaluation of research findings, a fundamental component of evidence-based practice. Examples from the rehabilitation literature are used to illustrate principles of measurement theory, research design, statistical analysis, and scientific inference.",
            "id": "PHYTHER 640",
            "parent": "PHYTHER",
            "title": "SCIENTIFIC INQUIRY IN PHYSICAL THERAPY"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Provides the cognitive, affective and psychomotor skills for efficacious examination/evaluation and treatment of specific integument system conditions. Topics include the management of patients/clients with wounds, burn, frostbite, insensate and/or diseased integument. Functional training in self-care and home management including activities of daily living and instrumental activities of daily living, as well as in the context of patients with specific integument conditions. Specific wound topics include: infection control in the health care environment, classification of wounds, examination and physical therapy and medical management of persons with wounds. Specific burn topics include: epidemiology of thermal injuries; classification of burn depth; determination of percentage burn; physiological effects of burn by body system; interdisciplinary medical management and physical therapy management for persons with burns/frostbite.",
            "id": "PHYTHER 678",
            "parent": "PHYTHER",
            "title": "PHYSICAL THERAPY MANAGEMENT OF INTEGUMENT CONDITIONS"
        }
    },
    {
        "data": {
            "description": "The scientific rationale for and the clinical application of thermal, electrical, and mechanical agents in physical therapy practice.",
            "id": "PHYTHER 521",
            "parent": "PHYTHER",
            "title": "PHYSICAL AGENTS"
        }
    },
    {
        "data": {
            "description": "Common pathological processes, risk factors, clinical manifestations, and pathogenesis of disease for the cardiovascular, pulmonary, hematology, neurology, gastrointestinal, urological, gynecological, musculoskeletal, and rheumatological systems. Medical tests and treatments including medications, diagnostic imaging, and pharmacology principles will also be covered.",
            "id": "PHYTHER 665",
            "parent": "PHYTHER",
            "title": "CLINICAL MEDICINE II"
        }
    },
    {
        "data": {
            "description": "Focuses on critical evaluation of published research relevant to physical therapy. In seminar format,  present the results of original research, and lead discussions of the strengths, weaknesses, and underlying theory of the research.",
            "id": "PHYTHER 641",
            "parent": "PHYTHER",
            "title": "CURRENT ISSUES IN REHABILITATION"
        }
    },
    {
        "data": {
            "description": "The final of six seminar courses, this course will present issues that will assist the physical therapist student transition into the profession during and following their final clinical internships.",
            "id": "PHYTHER 543",
            "parent": "PHYTHER",
            "title": "PROFESSIONAL PRACTICE ISSUES IN PHYSICAL THERAPY"
        }
    },
    {
        "data": {
            "description": "Development, structure, regions and function of the nervous system are covered with the purpose of providing insight into the clinical treatment of common neurological conditions. General principles of the development, connectivity and blood supply of both the central and peripheral nervous system (spinal cord, brainstem, and above the brainstem) are taught.",
            "id": "PHYTHER 500",
            "parent": "PHYTHER",
            "title": "FUNCTIONAL NEUROANATOMY FOR PHYSICAL THERAPY"
        }
    },
    {
        "data": {
            "description": "Nine-week physical therapy internship in a pre-determined clinical environment.",
            "id": "PHYTHER 702",
            "parent": "PHYTHER",
            "title": "CLINICAL INTERNSHIP III"
        }
    },
    {
        "data": {
            "description": "Lab-based course that introduces history taking and physical examination skills germane to assessment of patients with orthopedic and neurologic diagnoses in inpatient and outpatient settings. Introduces clinical decision-making and documentation skills with a focus on examination tests and measures. Labs involve the psychomotor application of exam skills. Outside activities with community partners are an integral part of the course.",
            "id": "PHYTHER 527",
            "parent": "PHYTHER",
            "title": "FOUNDATIONS OF PHYSICAL THERAPY: EXAMINATION AND EVALUATION"
        }
    },
    {
        "data": {
            "description": "Nine-week physical therapy internship in a pre-determined clinical environment.",
            "id": "PHYTHER 703",
            "parent": "PHYTHER",
            "title": "CLINICAL INTERNSHIP IV"
        }
    },
    {
        "data": {
            "source": "PHYTHER 677",
            "target": "PHYTHER 679"
        }
    },
    {
        "data": {
            "description": "Covers: 1) methods used in physical therapy (PT) management of cardiovascular and pulmonary disease, 2) influence of coexisting cardiovascular and pulmonary dysfunction on PT treatment for other primary diagnoses, and 3) screening for occult cardiovascular and pulmonary disease.",
            "id": "PHYTHER 523",
            "parent": "PHYTHER",
            "title": "CARDIOVASCULAR AND PULMONARY ASPECTS OF PHYSICAL THERAPY TREATMENT"
        }
    },
    {
        "data": {
            "description": "Provides the physical therapy student with the cognitive, affective, and psychomotor knowledge for effective examination, evaluation, diagnosis and management of patients/clients of all ages with various musculoskeletal dysfunctions related specifically to the spine.",
            "id": "PHYTHER 676",
            "parent": "PHYTHER",
            "title": "MUSCULOSKELETAL DYSFUNCTION : EXAMINATION, DIAGNOSIS, & MANAGEMENT I"
        }
    },
    {
        "data": {
            "description": "Application of motor control and motor learning principles to the examination, diagnosis, and management of people with movement disorders from spinal cord injuries, PNS dysfunction and progressive disorders of the CNS.",
            "id": "PHYTHER 636",
            "parent": "PHYTHER",
            "title": "MOTOR CONTROL DYSFUNCTION: EXAMINATION, DIAGNOSIS, AND MANAGEMENT II"
        }
    },
    {
        "data": {
            "description": "Professional attitudes, beliefs and behaviors relevant to physical therapy practice. Communication issues related to caregiving, multidisciplinary teams, conflict management, body image, psychosocial aspects of aging, stages of loss, collaborative care, and family-centered care.",
            "id": "PHYTHER 540",
            "parent": "PHYTHER",
            "title": "PSYCHOSOCIAL ASPECTS OF HEALTH CARE"
        }
    }
]