[
    {
        "data": {
            "description": "A preparation and introductory math course for students enrolled in the Summer Collegiate Experience program. Includes material from precalculus and calculus and related topics depending on students' results on the math placement exam.",
            "id": "MATH 118",
            "parent": "MATH",
            "title": "SUMMER COLLEGIATE EXPERIENCE MATHEMATICS COURSE"
        }
    },
    {
        "data": {
            "description": "Covers the graphs, properties and geometric significance of trigonometric functions of a real variable. Other topics include trigonometric equations and identities, application, trigonometric form of complex numbers, DeMoivre's theorem, and polar and parametric equations. The course also has a significant number of applications, especially related to other disciplines.",
            "id": "MATH 113",
            "parent": "MATH",
            "title": "TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "Isn't having enough food a basic human right? Exploration of the drivers of food insecurity: barriers to food production (pests, land availability, climate), barriers to food availability (politics, price, biofuels), and a greater need due to population growth. Examination of solutions to food insecurity.",
            "id": "PLPATH 311",
            "parent": "PLPATH",
            "title": "GLOBAL FOOD SECURITY"
        }
    },
    {
        "data": {
            "description": "Accelerated coverage of topics in general chemistry, including introduction to laboratory techniques. Topics include atomic and molecular structure, chemical equilibrium, acid-base chemistry, thermodynamics, kinetics, and electrochemistry.",
            "id": "CHEM 109",
            "parent": "CHEM",
            "title": "ADVANCED GENERAL CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Agroecology has blossomed across the world in recent decades as not only a science, but also a practice, and a movement. Employ the multiple disciplines and perspectives that Agroecology affords to analyze our agricultural and food systems wihin a broader context of dynamic social and ecological relationships.",
            "id": "AGROECOL/AGRONOMY/C&ESOC/ENTOM/ENVIRST 103",
            "title": "AGROECOLOGY: AN INTRODUCTION TO THE ECOLOGY OF FOOD AND AGRICULTURE"
        }
    },
    {
        "data": {
            "description": "An internship under guidance of a faculty or instructional academic staff member in Plant Pathology and internship site supervisor. Students are responsible for arranging the work and credits with the faculty or instructional academic staff member and the internship site supervisor.",
            "id": "PLPATH 399",
            "parent": "PLPATH",
            "title": "COORDINATIVE INTERNSHIP/COOPERATIVE EDUCATION"
        }
    },
    {
        "data": {
            "description": "Basic biology of microorganisms, including structure, function, physiology, genetics, ecology, diversity, and evolution.",
            "id": "MICROBIO 303",
            "parent": "MICROBIO",
            "title": "BIOLOGY OF MICROORGANISMS"
        }
    },
    {
        "data": {
            "description": "Basic principles of ecology and interrelations between individuals, populations, communities, ecosystems and their environment; transmission genetics and introduction to population genetics; origin of life, evolutionary mechanisms, ancestral relationships among species, and the diversity of life.",
            "id": "BIOCORE 381",
            "parent": "BIOCORE",
            "title": "EVOLUTION, ECOLOGY, AND GENETICS"
        }
    },
    {
        "data": {
            "description": "Biosynthesis of biological molecules, signal transduction mechanisms, chemistry and metabolism of nucleic acids, protein synthesis, and molecular and cellular biology.",
            "id": "BIOCHEM 508",
            "parent": "BIOCHEM",
            "title": "GENERAL BIOCHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Chemistry of biological materials, intermediary metabolism and protein structure.",
            "id": "BIOCHEM 507",
            "parent": "BIOCHEM",
            "title": "GENERAL BIOCHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Continuation ofMATH 171. Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Completion ofMATH 217implies completion ofMATH 221and114.",
            "id": "MATH 217",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY II"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Current topics in molecular and environmental toxicology and problems related to biologically active substances in the environment. Topics vary each semester. Lectures are by resident and visiting professors and other researchers.",
            "id": "ENTOM/F&WECOL/PLPATH/SOILSCI 606",
            "title": "COLLOQUIUM IN ENVIRONMENTAL TOXICOLOGY"
        }
    },
    {
        "data": {
            "description": "Descriptive statistics, distributions, one- and two-sample normal inference, power, one-way ANOVA, simple linear regression, categorical data, non-parametric methods; underlying assumptions and diagnostic work.",
            "id": "F&WECOL/STAT 571",
            "title": "STATISTICAL METHODS FOR BIOSCIENCE I"
        }
    },
    {
        "data": {
            "description": "Descriptive statistics, probability concepts and distributions, random variables. Hypothesis tests and confidence intervals for one- and two-sample problems. Linear regression, model checking, and inference. Analysis of variance and basic ideas in experimental design. Utilizes the R programming language.",
            "id": "STAT 324",
            "parent": "STAT",
            "title": "INTRODUCTORY APPLIED STATISTICS FOR ENGINEERS"
        }
    },
    {
        "data": {
            "description": "Economic importance, symptoms, causes, and methods of control of representative plant diseases.",
            "id": "PLPATH 300",
            "parent": "PLPATH",
            "title": "INTRODUCTION TO PLANT PATHOLOGY"
        }
    },
    {
        "data": {
            "description": "Environmental factors in the development and spread of diseases, pathogen variability, genetics of disease resistance, and principles of disease control.",
            "id": "PLPATH 602",
            "parent": "PLPATH",
            "title": "ECOLOGY, EPIDEMIOLOGY AND CONTROL OF PLANT DISEASES"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "Explore plant associated microbial communities (the plant microbiome), methods used to study them, and how we can use them to improve plant and ecosystem health in the face of challenges to agricultural and natural systems. Examples will be drawn from annual crop, grassland, and forested ecosystems. Use current molecular, bioinformatic, and statistical approaches to characterize rhizosphere microbiomes from samples collected as part of on-going research projects.",
            "id": "PLPATH 315",
            "parent": "PLPATH",
            "title": "PLANT MICROBIOMES"
        }
    },
    {
        "data": {
            "description": "Explores a detailed atomic and molecular view of matter and its interactions, with a specific focus on quantum theory, molecular structure, and chemical bonding. Application required for enrollment.",
            "id": "CHEM 115",
            "parent": "CHEM",
            "title": "CHEMICAL PRINCIPLES I"
        }
    },
    {
        "data": {
            "description": "Explores the interaction between society and plant-associated microbes. Topics include: the Irish potato famine, pesticides in current agriculture, role of economics and consumer preference in crop disease management and the release of genetically engineered organisms.",
            "id": "BOTANY/PLPATH 123",
            "title": "PLANTS, PARASITES, AND PEOPLE"
        }
    },
    {
        "data": {
            "description": "Fungal genetics, genomics, and physiology using plant pathogenic fungi and the genetic models Aspergillus nidulans and Neurospora crassa as model systems to explore the current knowledge of fungal genetics and plant/fungal interactions.",
            "id": "BOTANY/GENETICS/MM&I/PLPATH 655",
            "title": "BIOLOGY AND GENETICS OF FUNGI"
        }
    },
    {
        "data": {
            "description": "General biological principles. Topics include: evolution, ecology, animal behavior, cell structure and function, genetics and molecular genetics and the physiology of a variety of organ systems emphasizing function in humans.",
            "id": "BIOLOGY/ZOOLOGY 101",
            "title": "ANIMAL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Genetics in eukaryotes and prokaryotes.  Includes transmission genetics, molecular genetics, evolutionary genetics, genetic engineering, and societal issues associated with genetics.  Illustrative material includes bacteria, plants, insects, and vertebrates.",
            "id": "GENETICS 466",
            "parent": "GENETICS",
            "title": "PRINCIPLES OF GENETICS"
        }
    },
    {
        "data": {
            "description": "Genetics of eukaryotes and prokaryotes. Includes transmission genetics, probability and hypothesis testing, genetic mapping, molecular genetics, gene expression, and genetic engineering. Illustrative material includes viruses, bacteria, plants, fungi, insects, and humans.",
            "id": "GENETICS 467",
            "parent": "GENETICS",
            "title": "GENERAL GENETICS 1"
        }
    },
    {
        "data": {
            "description": "Growth, development, variability and dispersal of saprophytic, parasitic, and symbiotic fungi, with a consideration of their ecological and economic significance. Develop skills in microscopy with live fungal materials.",
            "id": "BOTANY/PLPATH 332",
            "title": "FUNGI"
        }
    },
    {
        "data": {
            "description": "Growth, development, variability and dispersal of saprophytic, parasitic, and symbiotic fungi, with a consideration of their ecological and economic significance.",
            "id": "BOTANY/PLPATH 333",
            "title": "BIOLOGY OF THE FUNGI"
        }
    },
    {
        "data": {
            "description": "Hands-on turf establishment, cool- and warm-season grass, seed and weed identification, chemical application, and turf cultivation techniques and equipment use, plus field trips to major league sport facilities and golf courses.",
            "id": "HORT/PLPATH 262",
            "title": "TURFGRASS MANAGEMENT LABORATORY"
        }
    },
    {
        "data": {
            "description": "Host resistance in plant disease control.  Conceptual and applied aspects of resistance: how it works, why it sometimes fails, and the traditional and modern techniques used for evaluating host resistance and incorporating resistance factors into new plant varieties.",
            "id": "PLPATH 517",
            "parent": "PLPATH",
            "title": "PLANT DISEASE RESISTANCE"
        }
    },
    {
        "data": {
            "description": "Independent laboratory research in preparation of a graduate thesis under supervision of a faculty member",
            "id": "PLPATH 990",
            "parent": "PLPATH",
            "title": "RESEARCH"
        }
    },
    {
        "data": {
            "description": "Individual advanced work in an area of Plant Pathology under the direct guidance of a faculty member.",
            "id": "PLPATH 699",
            "parent": "PLPATH",
            "title": "SPECIAL PROBLEMS"
        }
    },
    {
        "data": {
            "description": "Individual study for undergraduate students in an Honors program completing a thesis in the area of Plant Pathology, as arranged with a faculty member.",
            "id": "PLPATH 681",
            "parent": "PLPATH",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Instructional orientation to teaching at the higher education level in the agricultural and life sciences, direct teaching experience under faculty supervision, experience in testing and evaluation of students, and the analysis of teaching performance.",
            "id": "PLPATH 799",
            "parent": "PLPATH",
            "title": "PRACTICUM IN PLANT PATHOLOGY TEACHING"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Introduction to modern statistical practice in the life sciences, using the R programming language. Topics include: exploratory data analysis, probability and random variables; one-sample testing and confidence intervals, role of assumptions, sample size determination, two-sample inference; basic ideas in experimental design, analysis of variance, linear regression, goodness-of fit; biological applications.",
            "id": "STAT 371",
            "parent": "STAT",
            "title": "INTRODUCTORY APPLIED STATISTICS FOR THE LIFE SCIENCES"
        }
    },
    {
        "data": {
            "description": "Introduction to the basic principles and concepts of the biology of plants. an integrative approach stressing evolutionary sequences and the relationship between structure and function at succeeding levels of organization: molecule, cell, organism, population, community. Correlated lectures, laboratories, and discussions.",
            "id": "BIOLOGY/BOTANY 130",
            "title": "GENERAL BOTANY"
        }
    },
    {
        "data": {
            "description": "Learn basic methodology in scientific research and discovery, including laboratory techniques, quantitative reasoning, scientific communication, and collaboration. Gain hands-on laboratory experience working with microbes to test original hypotheses concerning the discovery of potential antibiotic compounds while addressing the world's antibiotic resistance crisis by contributing data to the global \"Tiny Earth\" network of researchers to advance potential drug development. Tiny Earth seeks to encourage students to pursue careers in science through real-world, applied research experiences and aims to address a worldwide health threat of the diminishing supply of effective antibiotics by \"student-sourcing antibiotic discovery.\" Concurrent enrollment inBIOLOGY/​BOTANY/​ZOOLOGY  152is required for permission to enroll.",
            "id": "PLPATH/ZOOLOGY 154",
            "title": "TINY EARTH: ANTIBIOTIC DISCOVERY RESEARCH"
        }
    },
    {
        "data": {
            "description": "Molecular and ecological aspects of the interactions between plants and microorganisms. Explores many of the themes, from genetic to integrative, of modern biology, and illustrates how study of plant-microbe interactions contributes to understanding of fundamental plant science.",
            "id": "BOTANY/ENTOM/PLPATH 505",
            "title": "PLANT-MICROBE INTERACTIONS: MOLECULAR AND ECOLOGICAL ASPECTS"
        }
    },
    {
        "data": {
            "description": "Nature, activities and role of organisms inhabiting soil. Effects of soil biota on ecosystem function, response to cultural practices, and impacts on environmental quality, including bioremediation of contaminated soils.",
            "id": "PLPATH/SOILSCI 323",
            "title": "SOIL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Physiology, genetics, taxonomy, and ecology of bacterial pathogens, epiphytes, and symbionts of plants.",
            "id": "PLPATH 622",
            "parent": "PLPATH",
            "title": "PLANT-BACTERIAL INTERACTIONS"
        }
    },
    {
        "data": {
            "description": "Principles and application of chemical equilibrium, coordination chemistry, oxidation-reduction and electrochemistry, kinetics, nuclear chemistry, introduction to organic chemistry, and chemistry laboratory skills.",
            "id": "CHEM 104",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Principles of molecular structure and bonding applied to predict and explain the reactivity of alkanes, alkenes, alkynes, alkyl halides, alcohols, and thiols. Emphasis placed on rationalizing the stereochemical and regiochemical outcome of chemical processes.",
            "id": "CHEM 343",
            "parent": "CHEM",
            "title": "ORGANIC CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Principles of molecular structure and bonding applied to predict and explain the reactivity of aromatic systems, benzylic and allylic systems, aryl and vinyl halides, and carbonyl-containing compounds (e.g., ketones, carboxylic acids, esters, acid chlorides, amides). Emphasis placed on rationalizing the stereochemical and regiochemical outcome of chemical processes as well as arguing reaction outcomes from spectroscopic evidence.",
            "id": "CHEM 345",
            "parent": "CHEM",
            "title": "ORGANIC CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Provide students research and/or hands-on experiences within the organic sector in order to gain scientific knowledge and/or an in-depth understanding of the research and science of organic agriculture, its production, processing, marketing, and social dimensions, and its impact on environmental, community, and human health. Declared in the Certificate in Organic Agriculture",
            "id": "PLPATH 499",
            "parent": "PLPATH",
            "title": "INDEPENDENT STUDY IN ORGANIC AGRICULTURE"
        }
    },
    {
        "data": {
            "description": "Provides an area equivalency for courses taken on Madison Study Abroad Programs that do not equate to existing UW courses. Current enrollment in a UW-Madison study abroad program",
            "id": "PLPATH 400",
            "parent": "PLPATH",
            "title": "STUDY ABROAD IN PLANT PATHOLOGY"
        }
    },
    {
        "data": {
            "description": "Provides an in-depth understanding of the history of organic agriculture, its production, processing, marketing, and social dimensions, and its impact on environmental, community, and human health.",
            "id": "AAE/AGRONOMY/HORT/PLPATH 367",
            "title": "INTRODUCTION TO ORGANIC AGRICULTURE: PRODUCTION, MARKETS, AND POLICY"
        }
    },
    {
        "data": {
            "description": "Research work for Honors students under direct guidance of a faculty member in an area of Plant Pathology.  Students are responsible for arranging the work and credits with the supervising instructor.",
            "id": "PLPATH 289",
            "parent": "PLPATH",
            "title": "HONORS INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Research work for students under direct guidance of a faculty member in an area of Plant Pathology.  Students are responsible for arranging the work and credits with the supervising instructor.",
            "id": "PLPATH 299",
            "parent": "PLPATH",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Second semester of individual study for undergraduate students in an Honors program completing a thesis in the area of Plant Pathology, as arranged with a faculty member.",
            "id": "PLPATH 682",
            "parent": "PLPATH",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Seminar series on topics related to plant pathology",
            "id": "PLPATH 923",
            "parent": "PLPATH",
            "title": "SEMINAR"
        }
    },
    {
        "data": {
            "description": "Stoichiometry and the mole concept, the behavior of gases, liquids and solids, thermochemistry, electronic structure of atoms and chemical bonding, descriptive chemistry of selected elements and compounds, intermolecular forces, and chemistry laboratory skills.",
            "id": "CHEM 103",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Subjects of current interest to undergrads.",
            "id": "PLPATH 375",
            "parent": "PLPATH",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "Sustainable use and management of turfgrass landscapes in urban and suburban environments, including home lawns, golf courses, and sports fields. Focus is on creating sustainable and attractive turfgrass landscapes through proper species selection, use of slow-release or organic fertilizer practices, and minimizing the use of pesticides and supplemental irrigation.",
            "id": "HORT/PLPATH 261",
            "title": "SUSTAINABLE TURFGRASS USE AND MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Symptoms, epidemiology and control of diseases of crop plants; emphasis on disease diagnosis.",
            "id": "PLPATH 559",
            "parent": "PLPATH",
            "title": "DISEASES OF ECONOMIC PLANTS"
        }
    },
    {
        "data": {
            "description": "Synthesizing research-based capstone experience in Plant Pathology. Develop problem-solving skills, be exposed to multidisciplinary approaches, develop teamwork and interpersonal skills, develop information resources, consider societal, economic, ethical, scientific and professional aspects of the field, and prepare and present written and/or oral reports.",
            "id": "PLPATH 590",
            "parent": "PLPATH",
            "title": "CAPSTONE IN PLANT PATHOLOGY"
        }
    },
    {
        "data": {
            "description": "The structure, multiplication, genetics, pathology and control of animal and plant viruses.",
            "id": "MM&I/ONCOLOGY/PLPATH 640",
            "title": "GENERAL VIROLOGY-MULTIPLICATION OF VIRUSES"
        }
    },
    {
        "data": {
            "description": "The two semester sequenceMATH 112-MATH 113covers similar material asMATH 114, but in a slower pace. Not recommended for students with less than an AB inMATH 96.",
            "id": "MATH 114",
            "parent": "MATH",
            "title": "ALGEBRA AND TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "Theory and practice of phylogenetic inference from DNA sequence data.",
            "id": "BOTANY/PLPATH 563",
            "title": "PHYLOGENETIC ANALYSIS OF MOLECULAR DATA"
        }
    },
    {
        "data": {
            "description": "Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Part of a 2-semester sequence withMATH 217; these two courses together are equivalent toMATH 114and221.",
            "id": "MATH 171",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY I"
        }
    },
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics and selected topics in Animal Physiology.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Topics include: selected topics in plant physiology, a survey of the five major kingdoms of organisms, speciation and evolutionary theory, and ecology at multiple levels of the biological hierarchy.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Topics of current interest to Grad students.",
            "id": "PLPATH 875",
            "parent": "PLPATH",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "Topics, recent advances  literature in the area of Mycology.",
            "id": "BOTANY/PLPATH 930",
            "title": "SEMINAR-MYCOLOGY"
        }
    },
    {
        "data": {
            "id": "BIOCHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "BIOCORE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "GENETICS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MICROBIO",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "PLPATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "STAT",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "AGROECOL/AGRONOMY/C&ESOC/ENTOM/ENVIRST 103",
            "target": "AAE/AGRONOMY/HORT/PLPATH 367"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 507",
            "target": "BIOCHEM 508"
        }
    },
    {
        "data": {
            "source": "BIOCHEM 508",
            "target": "MM&I/ONCOLOGY/PLPATH 640"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "GENETICS 466"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "BOTANY/PLPATH 332"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "BOTANY/PLPATH 333"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "BOTANY/PLPATH 563"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "PLPATH 300"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "PLPATH 315"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 152"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 101"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "ENTOM/F&WECOL/PLPATH/SOILSCI 606"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "GENETICS 467"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "target": "PLPATH/SOILSCI 323"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 151"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "MICROBIO 303"
        }
    },
    {
        "data": {
            "source": "BOTANY/PLPATH 332",
            "target": "PLPATH 559"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 109"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 343"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "GENETICS 467"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "MICROBIO 303"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "PLPATH/SOILSCI 323"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 115",
            "target": "GENETICS 466"
        }
    },
    {
        "data": {
            "source": "CHEM 343",
            "target": "CHEM 345"
        }
    },
    {
        "data": {
            "source": "CHEM 345",
            "target": "BIOCHEM 507"
        }
    },
    {
        "data": {
            "source": "F&WECOL/STAT 571",
            "target": "PLPATH 602"
        }
    },
    {
        "data": {
            "source": "GENETICS 466",
            "target": "GENETICS 467"
        }
    },
    {
        "data": {
            "source": "GENETICS 466",
            "target": "PLPATH 622"
        }
    },
    {
        "data": {
            "source": "GENETICS 467",
            "target": "GENETICS 466"
        }
    },
    {
        "data": {
            "source": "GENETICS 467",
            "target": "MM&I/ONCOLOGY/PLPATH 640"
        }
    },
    {
        "data": {
            "source": "HORT/PLPATH 261",
            "target": "HORT/PLPATH 262"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 113"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 113",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 114",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 114"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "MATH 217"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "STAT 324"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "source": "MATH 217",
            "target": "PLPATH 602"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "CHEM 109"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 114"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "MICROBIO 303",
            "target": "BOTANY/ENTOM/PLPATH 505"
        }
    },
    {
        "data": {
            "source": "MICROBIO 303",
            "target": "PLPATH 622"
        }
    },
    {
        "data": {
            "source": "PLPATH 300",
            "target": "PLPATH 517"
        }
    },
    {
        "data": {
            "source": "PLPATH 300",
            "target": "PLPATH 559"
        }
    },
    {
        "data": {
            "source": "PLPATH 300",
            "target": "PLPATH 602"
        }
    },
    {
        "data": {
            "source": "STAT 324",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "source": "STAT 371",
            "target": "BOTANY/PLPATH 563"
        }
    },
    {
        "data": {
            "source": "STAT 371",
            "target": "PLPATH 315"
        }
    },
    {
        "data": {
            "source": "STAT 371",
            "target": "STAT 324"
        }
    }
]