[
    {
        "data": {
            "description": "Introduction to the legal process. Examination of the various concepts of law, the perennial problems of the law, legal reasoning, and the nature and function of law and the courts.",
            "id": "LEGALST/POLISCI 217",
            "title": "LAW, POLITICS AND SOCIETY"
        }
    },
    {
        "data": {
            "source": "POLISCI 104",
            "target": "POLISCI 411"
        }
    },
    {
        "data": {
            "description": "For students writing a thesis in consultation with a faculty member.",
            "id": "POLISCI 692",
            "parent": "POLISCI",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "source": "ILS 205",
            "target": "POLISCI 364"
        }
    },
    {
        "data": {
            "source": "POLISCI 140",
            "target": "POLISCI 347"
        }
    },
    {
        "data": {
            "description": "This course explores the socio-economic and political outcomes across India. This course will employ the major theories of comparative politics that explain political outcomes such as regime type, economic development and conflict. This course explores why some countries are democracies, while others are dictatorships; why some countries are poor, while others are rich; and why some countries experience high levels of violence, while others are peaceful. The course considers how India comports with standard theories in comparative politics and how standard theories might be revised in light of the Indian case. The course maps variation on the sub-national and regional level. The course will ultimately consider reforms proposed by the Indian state to further democratic and economic development and to reduce conflict. Students will learn about India's politics in a structured manner, and will gain an appreciation of the power and limitations of the political science method.",
            "id": "INTLST/POLISCI 327",
            "title": "INDIAN POLITICS IN COMPARATIVE PERSPECTIVE"
        }
    },
    {
        "data": {
            "description": "Current topics of research interest on the American presidency. Alternative approaches and methods for the study of the presidency.",
            "id": "POLISCI 828",
            "parent": "POLISCI",
            "title": "THE CONTEMPORARY PRESIDENCY: ISSUES AND APPROACHES"
        }
    },
    {
        "data": {
            "description": "",
            "id": "FRENCH/GERMAN/HISTORY/POLISCI/SOC 804",
            "title": "INTERDISCIPLINARY WESTERN EUROPEAN AREA STUDIES SEMINAR"
        }
    },
    {
        "data": {
            "description": "As an introduction to Southeast Asia, covers the ethnic, cultural, religious, and political histories of the region from the classical states period to the present, with an emphasis on colonialism, nationalism, decolonization, and the emergence of modern political and social systems into the 21st century, including an exposure to region's contemporary literature. Not open to students who completed LCA 244 prior to Fall 2019.",
            "id": "ASIAN/GEOG/HISTORY/POLISCI/SOC 244",
            "title": "INTRODUCTION TO SOUTHEAST ASIA:  VIETNAM TO THE PHILIPPINES"
        }
    },
    {
        "data": {
            "source": "POLISCI 104",
            "target": "POLISCI 470"
        }
    },
    {
        "data": {
            "description": "Analysis of the role of race, class and ethnicity in the political process. Evaluation of theories from political science, economics and sociology. Topics may include policy analysis, political organizations, immigration, political behavior and culture.",
            "id": "POLISCI 825",
            "parent": "POLISCI",
            "title": "RACE AND POLITICS IN THE UNITED STATES"
        }
    },
    {
        "data": {
            "source": "INTLST 101",
            "target": "POLISCI 343"
        }
    },
    {
        "data": {
            "description": "Examines causes and consequences of the Russian invasion and war on Ukraine. Analyzes the war using concepts in comparative politics (e.g., regime type, national identity, and domestic politics in Ukraine and Russia) and international relations (e.g., international security, institutions and norms, sanctions and trade, migration and human rights).",
            "id": "POLISCI 344",
            "parent": "POLISCI",
            "title": "THE RUSSIAN WAR ON UKRAINE: CAUSES AND CONSEQUENCES"
        }
    },
    {
        "data": {
            "description": "Introduces students to the major works of Machiavelli through the close reading of his writings in cultural and historical contexts. Discussion and targeted writing assignments will aim at cultivating in students 1) a broad understanding of Machiavelli's principal intellectual attitudes, 2) a deeper understanding of his literary sensibility, and 3) the ability to articulate controversies and complexities surrounding his thought.",
            "id": "ILS/ITALIAN/LITTRANS/POLISCI 365",
            "title": "MACHIAVELLI AND HIS WORLD"
        }
    },
    {
        "data": {
            "source": "POLISCI 184",
            "target": "POLISCI 411"
        }
    },
    {
        "data": {
            "source": "POLISCI 104",
            "target": "POLISCI 408"
        }
    },
    {
        "data": {
            "description": "An umbrella course for variable credit American government courses taken on study abroad programs.",
            "id": "POLISCI 490",
            "parent": "POLISCI",
            "title": "STUDY ABROAD TOPICS IN POLITICAL SCIENCE: AMERICAN GOVERNMENT"
        }
    },
    {
        "data": {
            "description": "",
            "id": "POLISCI 960",
            "parent": "POLISCI",
            "title": "SEMINAR-INTERNATIONAL RELATIONS"
        }
    },
    {
        "data": {
            "source": "POLISCI 120",
            "target": "POLISCI 182"
        }
    },
    {
        "data": {
            "description": "Chinese foreign policy as seen from Beijing--the need for national security, the desire for revolution; and the impact of China on the rest of the world.",
            "id": "POLISCI 346",
            "parent": "POLISCI",
            "title": "CHINA IN WORLD POLITICS"
        }
    },
    {
        "data": {
            "source": "POLISCI 182",
            "target": "POLISCI 120"
        }
    },
    {
        "data": {
            "description": "Introduces the field of international studies, and performs an interdisciplinary examination of the cultural, political, economic, and social patterns that have defined the modern world.",
            "id": "INTLST 101",
            "parent": "INTLST",
            "title": "INTRODUCTION TO INTERNATIONAL STUDIES"
        }
    },
    {
        "data": {
            "source": "POLISCI 120",
            "target": "INTLST/POLISCI 325"
        }
    },
    {
        "data": {
            "source": "POLISCI 184",
            "target": "POLISCI 311"
        }
    },
    {
        "data": {
            "description": "Race, ethnicity, and religion as political factors; cultural pluralism, politics, and policy in the United States and selected other multi-cultural politics.",
            "id": "CHICLA/POLISCI 231",
            "title": "POLITICS IN MULTI-CULTURAL SOCIETIES"
        }
    },
    {
        "data": {
            "source": "POLISCI 184",
            "target": "POLISCI 470"
        }
    },
    {
        "data": {
            "description": "Provides structured support and mentorship for political science dissertation proposal writing. Includes topics such as defining relevant research questions, incorporating existing scholarship, developing a theory and research design and drafting a full prospectus.",
            "id": "POLISCI 801",
            "parent": "POLISCI",
            "title": "DISSERTATION PROPOSAL RESEARCH AND WRITING SEMINAR"
        }
    },
    {
        "data": {
            "description": "Investigation at an advanced level of selected problems in political philosophy.",
            "id": "POLISCI 460",
            "parent": "POLISCI",
            "title": "TOPICS IN POLITICAL PHILOSOPHY"
        }
    },
    {
        "data": {
            "source": "POLISCI 683",
            "target": "POLISCI 684"
        }
    },
    {
        "data": {
            "description": "Introduction to Comparative Politics, one of the four sub-fields in Political Science, which involves the comparative analysis of political institutions, processes, and outcomes at the national level. Examines how to usefully compare politics in a variety of countries and makes comparisons explicit and systematic in order to determine how governments work, how power is organized and contested at the national level, and how regular people can participate and pursue their interests in different political settings. Includes key concepts, theories, methods, issues, and language.",
            "id": "POLISCI 120",
            "parent": "POLISCI",
            "title": "INTRODUCTION TO COMPARATIVE POLITICS"
        }
    },
    {
        "data": {
            "description": "Comprehensive interdisciplinary survey of Russian civilization from its beginnings through the present day.",
            "id": "GEOG/HISTORY/POLISCI/SLAVIC 253",
            "title": "RUSSIA: AN INTERDISCIPLINARY SURVEY"
        }
    },
    {
        "data": {
            "description": "Focuses on the causes and effects of racial and ethnic diversity in a range of contexts across different countries. Includes the following topics: 1) definitions of diversity and how ethnic and racial diversity is measured; 2) the causes of diversity including migrations and state actions such as ethnic cleansing and colonialism, and later processes of immigration and segregation; 3) the effects of diversity or segregation, including on social relations, conflict, public good provision, and political behavior; and the effects of ethnic and racial diversity in organizations; and 4) considers ways of increasing diversity including affirmative action and quotas, and the effectiveness of diversity training. Readings will include cases studies from different countries and different time periods and will include a range of different racial and ethnic groups around the world.",
            "id": "POLISCI 846",
            "parent": "POLISCI",
            "title": "RACIAL AND ETHNIC DIVERSITY: CAUSES AND EFFECTS"
        }
    },
    {
        "data": {
            "description": "Exploration of themes in contemporary political theory.",
            "id": "POLISCI 935",
            "parent": "POLISCI",
            "title": "SEMINAR IN CONTEMPORARY POLITICAL THEORY"
        }
    },
    {
        "data": {
            "description": "Exploration of themes central to study of continental political thought.",
            "id": "POLISCI 936",
            "parent": "POLISCI",
            "title": "SEMINAR IN CONTINENTAL POLITICAL THOUGHT"
        }
    },
    {
        "data": {
            "description": "A broad overview of politics in Germany, Europe's politically and economically most powerful country. Several broad themes are covered: political institutions, electoral system and elections, parties and party system, interest representation, political participation, political economy, the legacies of Germany's past, social policy, European and foreign policy, and current and future challenges. Learn to relate the German experience to broader issues, problems, and concepts used in the comparative study of domestic politics.",
            "id": "POLISCI 332",
            "parent": "POLISCI",
            "title": "GERMAN POLITICS"
        }
    },
    {
        "data": {
            "source": "AAE/POLISCI 835",
            "target": "POLISCI 837"
        }
    },
    {
        "data": {
            "source": "POLISCI 140",
            "target": "POLISCI 529"
        }
    },
    {
        "data": {
            "description": "",
            "id": "POLISCI 959",
            "parent": "POLISCI",
            "title": "SEMINAR-INTERNATIONAL ORGANIZATION"
        }
    },
    {
        "data": {
            "description": "Extensive treatment of multiple regression and its variants.",
            "id": "POLISCI 813",
            "parent": "POLISCI",
            "title": "MULTIVARIABLE STATISTICAL INFERENCE FOR POLITICAL RESEARCH"
        }
    },
    {
        "data": {
            "source": "INTLST 101",
            "target": "POLISCI 354"
        }
    },
    {
        "data": {
            "description": "Covers the major issues in international relations since the end of World War II including: the causes of war; civil wars and ethnic conflict; economic development; international trade; exchange rates and international monetary relations; international capital flows and financial crises; foreign direct investment; globalization and the environment; the UN, the IMF, World Bank, WTO, and other international organizations; and international law and human rights. The focus is on states' relations with each other and the factors determining the nature and outcomes of these international interactions. The course seeks to develop analytical tools for thinking about important questions in world politics regardless of the countries or issues involved, to examine international affairs in a systematic way. Students who have taken POLI SCI 103 prior to Fall 2017 may not enroll in this course.",
            "id": "POLISCI 140",
            "parent": "POLISCI",
            "title": "INTRODUCTION TO INTERNATIONAL RELATIONS"
        }
    },
    {
        "data": {
            "description": "Basic institutions and processes of American government. The role of constitutional structures, parties, interest groups and elections in the system; policy formation and policy content.",
            "id": "POLISCI 104",
            "parent": "POLISCI",
            "title": "INTRODUCTION TO AMERICAN POLITICS AND GOVERNMENT"
        }
    },
    {
        "data": {
            "description": "Exploration of themes from modern political thought.",
            "id": "POLISCI 930",
            "parent": "POLISCI",
            "title": "SEMINAR IN MODERN POLITICAL THOUGHT"
        }
    },
    {
        "data": {
            "description": "Reviews a range of approaches that focus on civil society, social movements, ethnic and religious based mobilization, as well as gender and class based approaches to state-society relations.",
            "id": "POLISCI 862",
            "parent": "POLISCI",
            "title": "STATE AND SOCIETY IN COMPARATIVE PERSPECTIVE"
        }
    },
    {
        "data": {
            "description": "Major issues of public policy in such fields as economic management, welfare, education, health, energy and the environment. How public problems develop, approaches to policy-making, why programs succeed and fail. Not open to students with credit for POLI SCI 219 prior to fall 2017",
            "id": "POLISCI 272",
            "parent": "POLISCI",
            "title": "INTRODUCTION TO PUBLIC POLICY"
        }
    },
    {
        "data": {
            "description": "This course examines the sources and policy implications of racial division in American politics by analyzing a range of issues, such as affirmative action in the workplace and in higher education, the use of black majority districts as a means of enhancing representation of minority interests in Congress, differences in public opinion between whites and blacks, and issues concerning multi-racial and ethnic tensions. We will examine the historical background of race relations and the current policy debates, with a focus on trying to find common-ground solutions. The goal of this seminar is to stimulate critical thinking on this important issue, causing students to think about race and politics in new ways.",
            "id": "POLISCI 481",
            "parent": "POLISCI",
            "title": "HONORS SEMINAR ON RACE AND POLITICS IN THE UNITED STATES"
        }
    },
    {
        "data": {
            "description": "Examination of campaign finance, including: the philosophical rationale behind campaign finance regulations, the history of regulatory frameworks, the influence of campaign contributions on decision making, campaign finance laws in other countries, and reform proposals. Not open to students with credit for POLI SCI 466 prior to fall 2017",
            "id": "POLISCI 511",
            "parent": "POLISCI",
            "title": "CAMPAIGN FINANCE"
        }
    },
    {
        "data": {
            "description": "Examines how managers in public and not-for-profit agencies can secure and utilize legal authority, human resources, and funds to accomplish organizational goals. Includes strategies for establishing and maintaining effective external relations and for working through other organizations to accomplish objectives.",
            "id": "POLISCI/PUBAFFR 885",
            "title": "ADVANCED PUBLIC MANAGEMENT: CRAFT, CONSTRAINTS AND ACCOUNTABILITY"
        }
    },
    {
        "data": {
            "description": "Covers the political economy, political culture, and the politics of identity (nationalism, race, ethnicity, social class, religion, and gender) that is usually associated with sport at both the highest and lowest levels of competition. Not open to students with credit for POLI SCI 616 prior to fall 2017",
            "id": "POLISCI 635",
            "parent": "POLISCI",
            "title": "COMPARATIVE POLITICS OF SPORT"
        }
    },
    {
        "data": {
            "source": "POLISCI 160",
            "target": "POLISCI 360"
        }
    },
    {
        "data": {
            "source": "LEGALST/POLISCI 217",
            "target": "POLISCI/PUBAFFR 419"
        }
    },
    {
        "data": {
            "description": "Problems of public policy and administration for development and use of natural resources.",
            "id": "ECON/ENVIRST/POLISCI/URBRPL 449",
            "title": "GOVERNMENT AND NATURAL RESOURCES"
        }
    },
    {
        "data": {
            "description": "Asia is a vibrant region politically and economically, and is very important to the United States for international security and economic stability. Given its importance, this course provides broad and essential knowledge about Asian nations with a particular focus on China, South Korea, North Korea, Indonesia, Thailand, and the Philippines. Country studies are intended to introduce major issues in comparative politics such as democratization, elections, economic development, security, religion and politics. This course will enable students to (1) gain an empirical and analytical understanding of the political dynamics of the region; (2) think comparatively within the regime and across the developing world more generally; and (3) address and debate theoretical questions in political science through Asian politics materials.",
            "id": "POLISCI 328",
            "parent": "POLISCI",
            "title": "POLITICS OF EAST AND SOUTHEAST ASIA"
        }
    },
    {
        "data": {
            "description": "Develops the theory of maximum likelihood estimation and applies it to models for discrete and limited dependent variables common to political and social science data.",
            "id": "POLISCI 818",
            "parent": "POLISCI",
            "title": "MAXIMUM LIKELIHOOD ESTIMATION"
        }
    },
    {
        "data": {
            "description": "Directed study projects for juniors and seniors as arranged with a faculty member.",
            "id": "POLISCI 699",
            "parent": "POLISCI",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "This course will prepare students to participate in the Wisconsin in Washington Internship Semester. The course focuses on internship searches, applications, and decisions on where to work. The course also sets academic, professional and personal goals for the upcoming term in DC. Students will also identify a tentative public policy topic that they will initiate this term and research and complete during the semester in DC. The course will spend time on reviewing general and DC-specific standards of professional conduct. Successful completion of this course is required for final admission to the Wisconsin in Washington Program.",
            "id": "POLISCI 202",
            "parent": "POLISCI",
            "title": "PREPARATION FOR THE WISCONSIN IN WASHINGTON PROGRAM"
        }
    },
    {
        "data": {
            "description": "An empirical analysis of the role of mass publics in political life and the factors which determine the formation and expression of political beliefs and attitudes.",
            "id": "POLISCI 821",
            "parent": "POLISCI",
            "title": "MASS POLITICAL BEHAVIOR"
        }
    },
    {
        "data": {
            "description": "A class for honors students writing their senior honors thesis within a seminar format. Focus is on conceptualization, research design, writing of the thesis, and relevant issues of political science. Continuation of 683. Seniors only.",
            "id": "POLISCI 684",
            "parent": "POLISCI",
            "title": "SENIOR HONORS THESIS SEMINAR"
        }
    },
    {
        "data": {
            "description": "Examines the causes of terrorism, goals and strategies pursued by terrorist groups, the consequences of terrorism, and counterterrorism policies adopted by governments. Not open to students with credit for POLI SCI 319 prior to fall 2017",
            "id": "POLISCI 347",
            "parent": "POLISCI",
            "title": "TERRORISM"
        }
    },
    {
        "data": {
            "description": "An examination of the basic principles, purposes, and assumptions of First Amendment cases and literature, with attention to both historical and contemporary controversies.",
            "id": "POLISCI 470",
            "parent": "POLISCI",
            "title": "THE FIRST AMENDMENT"
        }
    },
    {
        "data": {
            "description": "Analyzes the concept of social identities with a focus on definition, comparison, and measurement. Explores a range of theories as well as methodological techniques for measurement. Examines classic works on race, ethnic, national, class, gender, and religious identities.",
            "id": "POLISCI 814",
            "parent": "POLISCI",
            "title": "SOCIAL IDENTITIES: DEFINITION AND MEASUREMENT"
        }
    },
    {
        "data": {
            "description": "Describes and evaluates major approaches used in political science. Explores issues related to professional development and political science careers.",
            "id": "POLISCI 800",
            "parent": "POLISCI",
            "title": "POLITICAL SCIENCE AS A DISCIPLINE AND PROFESSION"
        }
    },
    {
        "data": {
            "description": "Psychological and social components of voting behavior, current electoral trends, role of voters in the governing process. Not open to students with credit for POLI SCI 467 prior to fall 2017",
            "id": "POLISCI 305",
            "parent": "POLISCI",
            "title": "ELECTIONS AND VOTING BEHAVIOR"
        }
    },
    {
        "data": {
            "source": "POLISCI 813",
            "target": "POLISCI 818"
        }
    },
    {
        "data": {
            "description": "Design of research and adaptation of advanced methods to solve particular methodological problems in original analyses of political data.",
            "id": "POLISCI 919",
            "parent": "POLISCI",
            "title": "SEMINAR-ADVANCED METHODOLOGY"
        }
    },
    {
        "data": {
            "description": "Covers the origins of nuclear weapons, the reasons states seek them, the strategies developed for their use, the consequences of their development, and efforts to control and reverse their spread.",
            "id": "POLISCI 377",
            "parent": "POLISCI",
            "title": "NUCLEAR WEAPONS AND WORLD POLITICS"
        }
    },
    {
        "data": {
            "description": "Foundational and thematic approaches in the academic study of religion applied across global religious systems.",
            "id": "RELIGST 101",
            "parent": "RELIGST",
            "title": "RELIGION IN GLOBAL PERSPECTIVE"
        }
    },
    {
        "data": {
            "description": "Latin American culture and society from an interdisciplinary perspective; historical developments from pre-Columbian times to the present; political movements; economic problems; social change; ecology in tropical Latin America; legal systems; literature and the arts; cultural contrasts involving the US and Latin America; land reform; labor movements; capitalism, socialism, imperialism; mass media.",
            "id": "AFROAMER/ANTHRO/C&ESOC/GEOG/HISTORY/LACIS/POLISCI/SOC/SPANISH 260",
            "title": "LATIN AMERICA: AN INTRODUCTION"
        }
    },
    {
        "data": {
            "description": "Introductory statistics course for Ph.D. students.  Emphasis on probability theory, inference, and the foundations of multivariate least squares and maximum likelihood.",
            "id": "POLISCI 812",
            "parent": "POLISCI",
            "title": "INTRODUCTION TO STATISTICAL METHODS IN POLITICAL SCIENCE"
        }
    },
    {
        "data": {
            "description": "This course undertakes an historical examination of the development of American constitutional thinking about individual rights and civil liberties from the founding era to the present day. Issue that are considered include freedoms guaranteed by the original Articles, the Bill of Rights, and the Civil War Amendments (XIII, XIV, and XV) as these issues appear in constitutional law, constitutional politics, and social and economic developments. The role of the federal courts, the nature and operation of principles of federalism, and the authority of Congress to protect constitutionally guaranteed rights are also major topics of consideration.",
            "id": "POLISCI 412",
            "parent": "POLISCI",
            "title": "THE AMERICAN CONSTITUTION: RIGHTS AND CIVIL LIBERTIES"
        }
    },
    {
        "data": {
            "id": "PUBAFFR",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "In-depth examination of the political and policy challenges posed by global environmental degradation. Analysis of international institutions for managing the global environment.",
            "id": "ENVIRST/POLISCI/PUBAFFR 866",
            "title": "GLOBAL ENVIRONMENTAL GOVERNANCE"
        }
    },
    {
        "data": {
            "source": "POLISCI 160",
            "target": "POLISCI 361"
        }
    },
    {
        "data": {
            "source": "POLISCI 120",
            "target": "POLISCI 339"
        }
    },
    {
        "data": {
            "source": "POLISCI 184",
            "target": "POLISCI 511"
        }
    },
    {
        "data": {
            "description": "Analyzes the interaction of politics and economics in the international arena, both historically and in the contemporary era of globalization. Focuses on international trade, monetary, and financial relations in both developed and developing economies. Not open to students with credit for POLI SCI 371 prior to fall 2017",
            "id": "POLISCI 350",
            "parent": "POLISCI",
            "title": "INTERNATIONAL POLITICAL ECONOMY"
        }
    },
    {
        "data": {
            "source": "RELIGST 101",
            "target": "POLISCI/RELIGST 433"
        }
    },
    {
        "data": {
            "description": "Exploration of core problems of political life, such as the nature and limits of obligation, the concept of justice and its political implications, and the relationship between equality and liberty, through a selection of ancient and modern sources. Not open to students with credit for POLI SCI 209 prior to fall 2017",
            "id": "POLISCI 160",
            "parent": "POLISCI",
            "title": "INTRODUCTION TO POLITICAL THEORY"
        }
    },
    {
        "data": {
            "description": "Examines the meanings of, and interactions between, religion and politics in comparative politics, international relations, and American politics. Explores the impact religion has on wide range of politically relevant outcomes and the mechanisms through which religion shapes those outcomes. Provides an overview of the main theoretical, conceptual, and empirical studies of religion and politics.",
            "id": "POLISCI 850",
            "parent": "POLISCI",
            "title": "RELIGION AND POLITICS"
        }
    },
    {
        "data": {
            "source": "POLISCI 104",
            "target": "POLISCI 359"
        }
    },
    {
        "data": {
            "source": "ILS 205",
            "target": "POLISCI 360"
        }
    },
    {
        "data": {
            "description": "A class for honors students writing their senior honors thesis within a seminar format. Focus is on conceptualization, research design, writing of the thesis, and relevant issues of political science. Only senior majors writing honor thesis.",
            "id": "POLISCI 683",
            "parent": "POLISCI",
            "title": "SENIOR HONORS THESIS SEMINAR"
        }
    },
    {
        "data": {
            "source": "INTLST 101",
            "target": "POLISCI 377"
        }
    },
    {
        "data": {
            "source": "POLISCI 160",
            "target": "POLISCI 460"
        }
    },
    {
        "data": {
            "description": "Exploration of themes in legal and/or constitutional theory.",
            "id": "POLISCI 937",
            "parent": "POLISCI",
            "title": "SEMINAR IN LEGAL AND CONSTITUTIONAL THEORY"
        }
    },
    {
        "data": {
            "source": "POLISCI 812",
            "target": "POLISCI 917"
        }
    },
    {
        "data": {
            "description": "Lawyers are present in all countries, but their roles vary tremendously. In some countries, lawyers are greatly respected and are seen as making an important contribution by representing their clients and participating in the political process. In other countries, lawyers are viewed as less essential, perhaps even as a nuisance. Study lawyers in many different countries in an effort to explain the variation in their status and the consequent impact on citizens' access to justice.",
            "id": "POLISCI 349",
            "parent": "POLISCI",
            "title": "GLOBAL ACCESS TO JUSTICE"
        }
    },
    {
        "data": {
            "description": "Inter-state conflict and cooperation in Africa. Topics include Pan-Africanism, African Union, and regional integration; the international dimensions of regional crises; relations with great powers and with international financial institutions; and the role of non-state actors in international politics. Not open to students with credit forPOLI SCI/​CLASSICS/​HISTORY  362prior to fall 2017",
            "id": "POLISCI 455",
            "parent": "POLISCI",
            "title": "AFRICAN INTERNATIONAL RELATIONS"
        }
    },
    {
        "data": {
            "description": "Comparative analysis of nationalism, national identity, and ethnicity and their impact on domestic and international conflict. Examines relationship between nationality, citizenship, and minority rights; territoriality and identity, contemporary religious nationalism; relationship between globalization and nationalism.",
            "id": "POLISCI 854",
            "parent": "POLISCI",
            "title": "NATIONALISM AND ETHNIC CONFLICT"
        }
    },
    {
        "data": {
            "description": "Focuses on how specific schools of feminist thought redefine the political, spanning historical and contemporary feminist political theory.",
            "id": "GEN&WS/POLISCI 933",
            "title": "FEMINIST POLITICAL THEORY"
        }
    },
    {
        "data": {
            "source": "LEGALST/POLISCI 217",
            "target": "POLISCI 511"
        }
    },
    {
        "data": {
            "description": "Social movements, revolutions, and riots continually shape and re-shape the world around us. The course will evaluate and apply dominant theoretical approaches to understanding contention through careful attention to empirical cases throughout the world.",
            "id": "INTLST/POLISCI 431",
            "title": "CONTENTIOUS POLITICS"
        }
    },
    {
        "data": {
            "source": "POLISCI 104",
            "target": "POLISCI 417"
        }
    },
    {
        "data": {
            "description": "Examination of the electoral, organizational, and governmental roles of political parties at the national and state levels in the U.S. Emphasis on changes in response to historical and contemporary circumstances.",
            "id": "POLISCI 306",
            "parent": "POLISCI",
            "title": "AMERICAN POLITICAL PARTIES"
        }
    },
    {
        "data": {
            "description": "Survey of field of comparative political economy and in-depth study of political economy of democratic and non-democratic capitalist systems. Key themes include: business and labor relations, globalization and its impact on domestic political economies, rise of emergent powers.",
            "id": "POLISCI 840",
            "parent": "POLISCI",
            "title": "COMPARATIVE POLITICAL ECONOMY"
        }
    },
    {
        "data": {
            "description": "Introduction to the politics, political economy, history, and theory of European integration. Topics include the workings of EU institutions and law, the effect of the EU on national politics and economies, economic politics and policy-making in the EU, the EU as an actor in the world economy.",
            "id": "POLISCI 340",
            "parent": "POLISCI",
            "title": "THE EUROPEAN UNION: POLITICS AND POLITICAL ECONOMY"
        }
    },
    {
        "data": {
            "source": "AFRICAN/AFROAMER/ANTHRO/GEOG/HISTORY/POLISCI/SOC 277",
            "target": "POLISCI 329"
        }
    },
    {
        "data": {
            "description": "An introduction to the political economy of development. Why are some countries more economically developed than others?  To help answer this question, examine leading theories of economic development.  In light of these theories, then examine the development experiences of three major regions of the world. Consider a series of issues about development, including the effect of ethnic diversity, corruption, natural resources, and women's empowerment on economic development. Conclude with an examination of the effects of international interactions-via trade, foreign aid, migration, and war-on economic development.",
            "id": "POLISCI 330",
            "parent": "POLISCI",
            "title": "POLITICAL ECONOMY OF DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Contemporary military strategy, the interaction of military and political factors in international politics, and the processes and content of defense policies, with emphasis on the United States.",
            "id": "POLISCI 945",
            "parent": "POLISCI",
            "title": "SEMINAR-NATIONAL SECURITY AFFAIRS"
        }
    },
    {
        "data": {
            "source": "LEGALST/POLISCI 217",
            "target": "POLISCI 311"
        }
    },
    {
        "data": {
            "description": "In addition to political culture as conventionally defined, this course examines alternative political realities and the different understandings of politics that flow from them. It explores in detail the intersections between the realms of politics and culture in various selected regions of the world. Not open to students with credit for POLI SCI 657 prior to fall 2017",
            "id": "POLISCI 438",
            "parent": "POLISCI",
            "title": "COMPARATIVE POLITICAL CULTURE"
        }
    },
    {
        "data": {
            "description": "Race in relation to American economic development. Problems of racial minorities in the American political and economic system. Not open to students with credit for POLI SCI 462 prior to fall 2017",
            "id": "POLISCI 304",
            "parent": "POLISCI",
            "title": "THE POLITICAL ECONOMY OF RACE IN THE UNITED STATES"
        }
    },
    {
        "data": {
            "description": "Analysis of the major theories on the functioning of the international political system and the behavior of nations within it.",
            "id": "POLISCI 857",
            "parent": "POLISCI",
            "title": "INTERNATIONAL RELATIONS THEORIES"
        }
    },
    {
        "data": {
            "description": "Survey of the characteristics and problems of African Americans in contemporary society.",
            "id": "AFROAMER 151",
            "parent": "AFROAMER",
            "title": "INTRODUCTION TO CONTEMPORARY AFRO-AMERICAN SOCIETY"
        }
    },
    {
        "data": {
            "description": "How numbers and statistics are used in electoral strategies, political debates and legal proceedings. Presents basic tools of analysis and how to use them. Not open to students with credit for POLI SCI 218 prior to fall 2017",
            "id": "POLISCI 270",
            "parent": "POLISCI",
            "title": "UNDERSTANDING POLITICAL NUMBERS"
        }
    },
    {
        "data": {
            "source": "POLISCI 140",
            "target": "INTLST/POLISCI 431"
        }
    },
    {
        "data": {
            "source": "POLISCI 120",
            "target": "POLISCI 437"
        }
    },
    {
        "data": {
            "description": "An advanced undergraduate seminar on the European Union that introduces students to the academic literature on EU politics and current debates in the field of EU studies. Topics covered include political institutions, decision- and policy-making, parties, elections, interest representation, political contestation, public opinion, enlargement, the \"democratic deficit,\" and current events- most importantly the ongoing Euro crisis.",
            "id": "POLISCI 538",
            "parent": "POLISCI",
            "title": "POLITICS AND POLICIES IN THE EUROPEAN UNION"
        }
    },
    {
        "data": {
            "description": "Basic institutions and processes of state government in the United States; the role of parties, pressure groups, and elections in the system; the policy process, its outputs and outcomes; the role of states in the federal system, and the diversity of state politics and policy.",
            "id": "POLISCI 205",
            "parent": "POLISCI",
            "title": "INTRODUCTION TO STATE GOVERNMENT"
        }
    },
    {
        "data": {
            "source": "POLISCI 160",
            "target": "AFROAMER/POLISCI 519"
        }
    },
    {
        "data": {
            "source": "POLISCI 120",
            "target": "POLISCI 349"
        }
    },
    {
        "data": {
            "source": "INTLST 101",
            "target": "POLISCI 348"
        }
    },
    {
        "data": {
            "description": "Protecting a democratic nation from foreign threats often requires that nation to create a powerful military. Yet the creation of a powerful military may undermine the democracy that it is designed to protect. How do, and how should, democracies manage the paradoxical relationship between civilian authority and military institutions. Explores civilian and military perspectives in U.S. civil-military relations; address issues such as the use of military advice by civilian leaders, military challenges to civil authority, and tensions generated by shared responsibility for national security between the executive, legislative, and judicial branches. Studies how civil-military relations impact wider American society by examining the garrison state hypothesis; debates centered upon the draft versus an all-volunteer force; issues of equity and inclusion; and current concerns regarding a civil-military \"gap.\"",
            "id": "POLISCI 338",
            "parent": "POLISCI",
            "title": "THE CIVIL-MILITARY PARADOX IN U.S. POLITICS AND SOCIETY"
        }
    },
    {
        "data": {
            "source": "POLISCI 140",
            "target": "POLISCI 354"
        }
    },
    {
        "data": {
            "description": "Examines the gendered nature of political institutions around the world, including implications of women's exclusions from public life in a global context; the obstacles to women's greater participation; how women have gained greater voice in political leadership in some countries; and the differences women make in the political arena. Not open to students with credit for POLI SCI 643 prior to fall 2017",
            "id": "GEN&WS/POLISCI 429",
            "title": "GENDER AND POLITICS IN COMPARATIVE PERSPECTIVE"
        }
    },
    {
        "data": {
            "source": "POLISCI 140",
            "target": "POLISCI 377"
        }
    },
    {
        "data": {
            "description": "Introduction to legal reasoning, writing, and research. Draft memos and briefs based on fictional case files and independent legal research, simulating the practice of law. Topics include precedent, sources of law, reading and interpreting legal texts, objective legal analysis, persuasion, and oral argument.",
            "id": "LEGALST/POLISCI 445",
            "title": "LEGAL WRITING, FROM COUNSELOR TO ADVOCATE"
        }
    },
    {
        "data": {
            "source": "POLISCI 160",
            "target": "POLISCI 364"
        }
    },
    {
        "data": {
            "description": "Facilitates transitions from undergraduate academic learning related to Political Science to meaningful and rewarding professional opportunities including jobs, paid internships, graduate study, and post-graduate fellowships. Building on core coursework in Political Science and related disciplines, addresses how to utilize existing academic learning and completed readings and assignments, extra-curricular activities, student research, for-pay work, internships, and interaction with alumni and other personal networks to further develop career options. Also provides practical ways to explore and pursue a wide range of career pathways related to Political Science. Develop essential professional development materials and self-promotional skills.",
            "id": "POLISCI 316",
            "parent": "POLISCI",
            "title": "CAREERS IN POLITICAL SCIENCE"
        }
    },
    {
        "data": {
            "description": "Explores a range of theories that African Americans have drawn upon to cope with and ameliorate their political circumstances in the United States within the specific parameters of political theory.",
            "id": "AFROAMER/POLISCI 519",
            "title": "AFRICAN AMERICAN POLITICAL THEORY"
        }
    },
    {
        "data": {
            "description": "Why do people mobilize outside of routine political channels or institutions to pursue political change? How do we explain moments when people take to the streets or take up arms to accomplish their political goals?  At the heart of these questions is one that has long formed a core of social science inquiry: how do scholars explain collective action, particularly in the face of often serious risks. Examine these questions through exploring leading theoretical themes in the study of social movements, revolutions, and riots.   Explore how a variety of factors affect the where's, why's and how's of movement dynamics.",
            "id": "POLISCI 851",
            "parent": "POLISCI",
            "title": "CONTENTIOUS POLITICS"
        }
    },
    {
        "data": {
            "description": "Explores the relationships and interactions between religion and politics from a comparative perspective. Discuss the appropriate relationship between religion and state. Investigate the implications of the various ways in which the religion-state relationship have been involved in political conflict. Building on this, turn to several of the current issues in religion and politics asking: Why is religion apparently more important than ever despite an increasingly secular world? What is religious nationalism? What is fundamentalism? How can we explain the similarities and differences between religious fundamentalist movements across the globe? How should democratic states cope with the emergence of fundamentalist movements? In order to begin answering these questions,  integrate the theoretical frameworks we develop with explorations of the historical and local context of relevant case-studies from around the world.",
            "id": "POLISCI/RELIGST 433",
            "title": "RELIGION AND POLITICS"
        }
    },
    {
        "data": {
            "description": "We examine why some countries are rich, and others are poor. Selected topics include the role of institutions, regime type, corruption, the resource curse, ethnic differences and state capacity. We focus on the cutting edge of the empirical literature on development, and pay close attention to measurement and causal inference.",
            "id": "POLISCI 843",
            "parent": "POLISCI",
            "title": "THE POLITICAL ECONOMY OF DEVELOPMENT"
        }
    },
    {
        "data": {
            "source": "POLISCI 184",
            "target": "POLISCI 304"
        }
    },
    {
        "data": {
            "source": "POLISCI 812",
            "target": "POLISCI 818"
        }
    },
    {
        "data": {
            "description": "Every war comes to an end, but some end sooner than others. This course analyzes why and how conflicts come to an end, discussion relevant theories of conflict and conflict resolution, and important cases. Not open to students with credit for POLI SCI 378 prior to fall 2017",
            "id": "POLISCI 345",
            "parent": "POLISCI",
            "title": "CONFLICT RESOLUTION"
        }
    },
    {
        "data": {
            "description": "This course examines the role of communication in American politics. Topics covered include the communication of politics (e.g., communication by politics elites, effects of mass media and interpersonal communication on political attitudes) as well as the politics of communications (regulation of political communication, policy issues, etc.).",
            "id": "JOURN/POLISCI 829",
            "title": "POLITICAL COMMUNICATION"
        }
    },
    {
        "data": {
            "source": "POLISCI 184",
            "target": "POLISCI/PUBAFFR 419"
        }
    },
    {
        "data": {
            "description": "Comparative analysis of the countries of contemporary Eastern Europe, including issues of democratization, economic transition, and social change; political crises and institutional adjustments; interactions between regimes and domestic social forces; prospect for future systemic change.",
            "id": "POLISCI 659",
            "parent": "POLISCI",
            "title": "POLITICS AND SOCIETY: CONTEMPORARY EASTERN EUROPE"
        }
    },
    {
        "data": {
            "description": "Focuses on national budget and tax policy and administration, and the parallel processes at the state and local levels. Included are discussions of: decision-making theories; budget and tax policy; and analysis of normative and empirical criteria and analytical techniques for assessing alternative policy proposals.",
            "id": "POLISCI/PUBAFFR/URBRPL 890",
            "title": "FEDERAL BUDGET AND TAX POLICY AND ADMINISTRATION"
        }
    },
    {
        "data": {
            "source": "LEGALST/POLISCI 217",
            "target": "POLISCI 417"
        }
    },
    {
        "data": {
            "description": "Presentation and evaluation of American politics research in progress by members of the workshop and invited speakers.",
            "id": "POLISCI 989",
            "parent": "POLISCI",
            "title": "AMERICAN POLITICS WORKSHOP"
        }
    },
    {
        "data": {
            "description": "This course uses a social science approach to analyze theories of judicial decision making and to learn how law is made in a political context. Students will understand how the Supreme Court and justices operate in an interdependent political environment.",
            "id": "POLISCI 414",
            "parent": "POLISCI",
            "title": "THE SUPREME COURT AS A POLITICAL INSTITUTION"
        }
    },
    {
        "data": {
            "description": "For students writing a thesis in consultation with a faculty member.",
            "id": "POLISCI 691",
            "parent": "POLISCI",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "source": "POLISCI 813",
            "target": "POLISCI 917"
        }
    },
    {
        "data": {
            "description": "Introduction to political science as a discipline that focuses on the development of research questions, research designs, and the quantitative and qualitative tools commonly used to implement research designs.",
            "id": "POLISCI 170",
            "parent": "POLISCI",
            "title": "RESEARCH METHODS IN POLITICAL SCIENCE"
        }
    },
    {
        "data": {
            "id": "AFROAMER",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "AFROAMER 151",
            "target": "AFROAMER/POLISCI 519"
        }
    },
    {
        "data": {
            "description": "This course deals with deception and truth telling as matters of fundamental political concern. Writers ranging from Plato to John Rawls have grappled with the problem of deception and truth-telling in politics. Flattery, hypocrisy, lying as a matter of state, lying as a matter of policy: philosophical explorations of these and related phenomena are at the center of this course.",
            "id": "POLISCI 463",
            "parent": "POLISCI",
            "title": "DECEPTION AND POLITICS"
        }
    },
    {
        "data": {
            "description": "Formation of opinions within and among the political publics; their role in the development and practice of governmental policy. Not open to students with credit for POLI SCI 473 prior to fall 2017",
            "id": "POLISCI 515",
            "parent": "POLISCI",
            "title": "PUBLIC OPINION"
        }
    },
    {
        "data": {
            "description": "The study of international cooperation and the analysis of regional, functional, and universal regimes and institutions. Not open to students with credit for POLI SCI 337 prior to fall 2017",
            "id": "POLISCI 354",
            "parent": "POLISCI",
            "title": "INTERNATIONAL INSTITUTIONS AND WORLD ORDER"
        }
    },
    {
        "data": {
            "source": "POLISCI 184",
            "target": "POLISCI 359"
        }
    },
    {
        "data": {
            "source": "POLISCI 104",
            "target": "POLISCI/PUBAFFR 419"
        }
    },
    {
        "data": {
            "source": "POLISCI 104",
            "target": "POLISCI 347"
        }
    },
    {
        "data": {
            "source": "POLISCI 140",
            "target": "POLISCI 345"
        }
    },
    {
        "data": {
            "description": "Directed Study restricted to graduate students. Intended for master's level students.",
            "id": "POLISCI 799",
            "parent": "POLISCI",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Provides an overview of formal, i.e., game-theoretic, models of domestic politics. This course builds directly upon the material presented in Political Science 835.",
            "id": "POLISCI 836",
            "parent": "POLISCI",
            "title": "FORMAL MODELS OF DOMESTIC POLITICS"
        }
    },
    {
        "data": {
            "description": "In the early twentieth century, a series of movements arose in the Middle East and South Asia, calling Muslims to return to Islam. Today, leaders and members of such groups -now known as Islamists -insist that one cannot live a fully Islamic life in the absence of an Islamic state. How and why did these movements come to focus on building an Islamic state? How do they pursue this goal?",
            "id": "POLISCI 370",
            "parent": "POLISCI",
            "title": "ISLAM AND POLITICS"
        }
    },
    {
        "data": {
            "description": "Multidisciplinary and historical perspectives on the East Asian civilizations of China, Japan, Korea, Tibet and Mongolia from prehistory to the present, including developments in philosophy, economy, governance, social structure, kinship, geography, etc.",
            "id": "ASIAN/HISTORY/POLISCI 255",
            "title": "INTRODUCTION TO EAST ASIAN CIVILIZATIONS"
        }
    },
    {
        "data": {
            "description": "Examines the phenomenon of genocide in the modern world. The class covers the concept of genocide, theories of why genocide occurs, and particular cases in the 20th and 21st centuries. Not open to students with credit for POLI SCI 318 prior to fall 2017",
            "id": "INTLST/POLISCI 439",
            "title": "THE COMPARATIVE STUDY OF GENOCIDE"
        }
    },
    {
        "data": {
            "description": "Principles, procedures and problems of the legislative process of the United States Congress. Not open to students with credit for POLI SCI 426",
            "id": "POLISCI 311",
            "parent": "POLISCI",
            "title": "UNITED STATES CONGRESS"
        }
    },
    {
        "data": {
            "source": "POLISCI 184",
            "target": "POLISCI 104"
        }
    },
    {
        "data": {
            "source": "INTLST 101",
            "target": "POLISCI 350"
        }
    },
    {
        "data": {
            "description": "This course offers the opportunity to apply many things learned in the classroom to the professional world and to apply things learned in the professional world to a student's liberal arts education. Interning will introduces students to the professional world of political organizations giving them the chance to enhance professional skills, build a network of contacts, and explore possible career choices. This class stresses active reflection, self-assessment, and the honing of critical thinking and writing. The internship course builds structure with written assignments, activities, reflections, and readings to help students to make the most of their internships. Analytical work in this course will allow students to systematically analyze the workplace in ways that help them recognize prevailing office dynamics, adapt to accepted organizational standards, and to identify opportunities to be a more effective colleague. The course will ask students to analyze their current experiences and to relate them to their past learning and future possibilities.",
            "id": "POLISCI 402",
            "parent": "POLISCI",
            "title": "WISCONSIN IN WASHINGTON INTERNSHIP COURSE"
        }
    },
    {
        "data": {
            "source": "POLISCI 182",
            "target": "POLISCI 529"
        }
    },
    {
        "data": {
            "description": "The President as chief administrative leader, political leader, foreign policy initiator, commander-in-chief, and head of state.",
            "id": "POLISCI 408",
            "parent": "POLISCI",
            "title": "THE AMERICAN PRESIDENCY"
        }
    },
    {
        "data": {
            "source": "POLISCI 182",
            "target": "POLISCI 659"
        }
    },
    {
        "data": {
            "description": "Presentation and evaluation of comparative politics research in progress by members of the workshop and invited speakers.",
            "id": "POLISCI 987",
            "parent": "POLISCI",
            "title": "COMPARATIVE POLITICS COLLOQUIUM"
        }
    },
    {
        "data": {
            "description": "African society and culture, polity and economy in multidisciplinary perspectives from prehistory and ancient kingdoms through the colonial period to contemporary developments, including modern nationalism, economic development and changing social structure.",
            "id": "AFRICAN/AFROAMER/ANTHRO/GEOG/HISTORY/POLISCI/SOC 277",
            "title": "AFRICA: AN INTRODUCTORY SURVEY"
        }
    },
    {
        "data": {
            "source": "INTLST 101",
            "target": "INTLST/POLISCI 325"
        }
    },
    {
        "data": {
            "description": "Examines the origins and development of human rights in international politics. The course discusses what human rights are, international human rights movements, the international search for justice after mass crimes, and international humanitarian intervention. Not open to students with credit for POLI SCI 317 prior to fall 2017",
            "id": "INTLST/POLISCI 434",
            "title": "THE POLITICS OF HUMAN RIGHTS"
        }
    },
    {
        "data": {
            "description": "This course undertakes a historical and analytical approach to U.S. foreign policy since World War II. The course is divided into three main topics: U.S. Foreign Policy since World War II and the evolution of U.S. policy and the impetus behind important foreign policy choices; The people and institutions and processes that guide foreign policy formation and implementation; And the more salient foreign policy challenges facing the U.S. in the 21st century including how the US has responded to the attacks of September 11, 2001, the effectiveness of foreign aid policy.",
            "id": "POLISCI 359",
            "parent": "POLISCI",
            "title": "AMERICAN FOREIGN POLICY"
        }
    },
    {
        "data": {
            "source": "POLISCI 184",
            "target": "POLISCI 347"
        }
    },
    {
        "data": {
            "description": "Delegation of powers, elements of fair administrative procedure, judicial control over administrative determination. Not open to students with credit for POLI SCI 420 prior to fall 2017",
            "id": "POLISCI/PUBAFFR 419",
            "title": "ADMINISTRATIVE LAW"
        }
    },
    {
        "data": {
            "source": "POLISCI 857",
            "target": "POLISCI 940"
        }
    },
    {
        "data": {
            "description": "An umbrella course for variable credit international relations courses taken on study abroad programs.",
            "id": "POLISCI 390",
            "parent": "POLISCI",
            "title": "STUDY ABROAD TOPICS IN POLITICAL SCIENCE: INTERNATIONAL RELATIONS"
        }
    },
    {
        "data": {
            "description": "Examines how domestic institutions and processes influence the international system. Also examines how international forces influence domestic politics in the areas of foreign policy, international political economy and security.",
            "id": "POLISCI 940",
            "parent": "POLISCI",
            "title": "DOMESTIC POLITICS OF INTERNATIONAL RELATIONS"
        }
    },
    {
        "data": {
            "description": "Study of selected topics or themes in early modern (c. 1500-1750 CE) political thought.",
            "id": "POLISCI 932",
            "parent": "POLISCI",
            "title": "SEMINAR IN EARLY MODERN POLITICAL THEORY"
        }
    },
    {
        "data": {
            "description": "This course undertakes an historical examination of the development of American constitutional thinking about powers and structures of government from the founding era to the present day. Issue that are considered include separation of powers, executive war powers, the powers of Congress, judicial review and the role of courts, and federalism. The course focuses on the development of constitutional law, constitutional politics, and American political development.",
            "id": "POLISCI 411",
            "parent": "POLISCI",
            "title": "THE AMERICAN CONSTITUTION : POWERS AND STRUCTURES OF GOVERNMENT"
        }
    },
    {
        "data": {
            "source": "POLISCI 140",
            "target": "INTLST/POLISCI 325"
        }
    },
    {
        "data": {
            "source": "POLISCI 120",
            "target": "POLISCI 438"
        }
    },
    {
        "data": {
            "description": "Presentation and evaluation of International Relations research in progress by members of the workshop and invited speakers.",
            "id": "POLISCI 988",
            "parent": "POLISCI",
            "title": "INTERNATIONAL RELATIONS COLLOQUIUM"
        }
    },
    {
        "data": {
            "description": "In-depth examination of selected topics on American politics and governmental institutions.",
            "id": "POLISCI 904",
            "parent": "POLISCI",
            "title": "SEMINAR-AMERICAN POLITICS"
        }
    },
    {
        "data": {
            "description": "Theory and practice of Russian States, emphasis on politics, economic and institutional developments since 1991. Not open to students with credit for POLI SCI 633 prior to fall 2017",
            "id": "POLISCI 334",
            "parent": "POLISCI",
            "title": "RUSSIAN POLITICS"
        }
    },
    {
        "data": {
            "source": "POLISCI 120",
            "target": "POLISCI 329"
        }
    },
    {
        "data": {
            "description": "Explores the intertwined relationship between gender and politics in contemporary Middle East and North Africa. Situates the region's historical, socio-political, and cultural context that have particularly contributed to shaping the current discourse on gender in the Arab World. Explores - both theoretically and empirically - the role of Arab women in influencing the political processes across the Middle East. Examines real-world examples of Middle Eastern women from different parts of the region who have succeeded to challenge the status quo and push for genuine change.",
            "id": "GEN&WS/POLISCI 435",
            "title": "POLITICS OF GENDER AND WOMEN'S RIGHTS IN THE MIDDLE EAST"
        }
    },
    {
        "data": {
            "description": "Examines the issues currently facing Israeli society and the ongoing debates in Israeli politics. Provides historical background and analytical understanding of contemporary Israeli politics. Attention will be paid to political history, institutions, economic development, coalition formation, ethnic politics, and religious-secular divisions as they are manifested in Israeli politics.",
            "id": "JEWISH/POLISCI 341",
            "title": "ISRAELI POLITICS AND SOCIETY"
        }
    },
    {
        "data": {
            "description": "Presentation and evaluation of political theory research in progress by members of the workshop and invited speakers.",
            "id": "POLISCI 986",
            "parent": "POLISCI",
            "title": "POLITICAL THEORY WORKSHOP"
        }
    },
    {
        "data": {
            "source": "INTLST 101",
            "target": "POLISCI 359"
        }
    },
    {
        "data": {
            "description": "Directed study projects for juniors and seniors as arranged with a faculty member.",
            "id": "POLISCI 698",
            "parent": "POLISCI",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Honors in the Major in Political Science thesis research and writing (continuation ofPOLI SCI 681).",
            "id": "POLISCI 682",
            "parent": "POLISCI",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "The development of Western political, economic and social thought, from its origins in classic Greece and the Judaeo-Christian tradition, through Rome and the Medieval period, to the Renaissance and Reformation.",
            "id": "ILS 205",
            "parent": "ILS",
            "title": "WESTERN CULTURE: POLITICAL, ECONOMIC, AND SOCIAL THOUGHT I"
        }
    },
    {
        "data": {
            "description": "Theory and practice of survey research; questionnaire design, sampling, data visualization, statistical analysis.",
            "id": "JOURN/POLISCI/URBRPL 373",
            "title": "INTRODUCTION TO SURVEY RESEARCH"
        }
    },
    {
        "data": {
            "source": "INTLST 101",
            "target": "POLISCI 345"
        }
    },
    {
        "data": {
            "source": "POLISCI 120",
            "target": "POLISCI 635"
        }
    },
    {
        "data": {
            "description": "Under the direction of a staff member.",
            "id": "POLISCI 999",
            "parent": "POLISCI",
            "title": "INDEPENDENT WORK"
        }
    },
    {
        "data": {
            "description": "Students will examine the historical, social, political, economic, and cultural experiences and conditions of Latinos, one of the largest US racial/ethnic minority groups. Course focus is on people who trace their origins to Mexico, the Caribbean, and countries of Latin America.",
            "id": "CHICLA/HISTORY/POLISCI 422",
            "title": "LATINO HISTORY AND POLITICS"
        }
    },
    {
        "data": {
            "description": "The public policy process is structured argument and decision making within institutional contexts. This class introduces students to analytic frameworks for thinking about various aspects of this process. We do not study a single context or policy, but, rather, seek to understand how policies might succeed (or fail) in one context or another. The principal framework is institutional analysis, or the way in which formal and informal rules shape policies and their outcomes. Students will learn to perform institutional analysis as well as write a memorandum presenting such an analysis to a policymaker. Students will align their final projects to their personal and professional activities and/or their internship. The course will help students understand how policies can achieve durable impact, and how progress made through policies can be defended amid institutional pitfalls.",
            "id": "POLISCI 602",
            "parent": "POLISCI",
            "title": "WISCONSIN IN WASHINGTON ADVANCED PUBLIC POLICY COURSE"
        }
    },
    {
        "data": {
            "description": "Explores key issues in the ideology and practice of Athenian democracy. Examines democratic values, institutions, rhetoric, and sociology in order to provide the basic tools to understand democracy in its ancient context.  Engages with a variety of source material (literary, archaeological, epigraphic) in order to develop multiple skills of interpretation. Some questions examined include: What are the key features of Athenian democracy, how did it change over time, and how did it differ from modern democracy? How did the Athenians justify and critique this political system? How did they reconcile citizen egalitarianism with social inequalities of wealth, gender, and status? To what extent were women, foreigners, slaves, or the poor included or excluded from politics? Was Athenian democracy a robust political system or a system in crisis?",
            "id": "CLASSICS/HISTORY/POLISCI 362",
            "title": "ATHENIAN DEMOCRACY"
        }
    },
    {
        "data": {
            "description": "Honors in the major in Political Science thesis research and writing.",
            "id": "POLISCI 681",
            "parent": "POLISCI",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Experimental methods in the social sciences, with specific application to political science. Covers the logic of experimentation and how experiments can be used to investigate social phenomena. Interpret, design, execute and analyze experiments.",
            "id": "POLISCI 820",
            "parent": "POLISCI",
            "title": "EXPERIMENTAL METHODS"
        }
    },
    {
        "data": {
            "description": "Analysis of and research on problems of theorizing in and about political life.",
            "id": "POLISCI 931",
            "parent": "POLISCI",
            "title": "SEMINAR-POLITICAL THEORY"
        }
    },
    {
        "data": {
            "source": "POLISCI 104",
            "target": "POLISCI 306"
        }
    },
    {
        "data": {
            "description": "The structure of state government and the politics of public policy-making in the fifty states.",
            "id": "POLISCI 405",
            "parent": "POLISCI",
            "title": "STATE GOVERNMENT AND PUBLIC POLICY"
        }
    },
    {
        "data": {
            "description": "An interdisciplinary seminar focusing on current policy debates designed to incorporate concepts and approaches from philosophy, political science, and economics.",
            "id": "POLISCI 461",
            "parent": "POLISCI",
            "title": "INTERDISCIPLINARY SEMINAR IN POLITICAL ECONOMY, PHILOSOPHY, & POLITICS"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Interdisciplinary inquiry in African societies and cultures.",
            "id": "AFRICAN/ANTHRO/ECON/GEOG/HISTORY/POLISCI 983",
            "title": "INTERDEPARTMENTAL SEMINAR IN AFRICAN STUDIES TOPICS"
        }
    },
    {
        "data": {
            "description": "An umbrella course for variable credit topic courses, such as colloquia series, workshops, intensive summer courses, half-semester courses, etc.",
            "id": "POLISCI 900",
            "parent": "POLISCI",
            "title": "TOPICS IN POLITICAL SCIENCE"
        }
    },
    {
        "data": {
            "description": "Basic institutions and processes of American government. The role of constitutional structures, parties, interest groups and elections in the system; policy formation and policy comment.",
            "id": "POLISCI 184",
            "parent": "POLISCI",
            "title": "INTRODUCTION TO AMERICAN POLITICS"
        }
    },
    {
        "data": {
            "description": "Provides a critical examination of the history of labor and working people in the Americas, from the colonial era to the present. It focuses on the experience of the United States and Mexico, offering a comparative perspective on their distinct but also shared (and increasingly linked) histories. The seminar proceeds chronologically, highlighting major episodes in the evolution of labor systems in the two countries, beginning with the colonial labor systems implemented by the Spanish and British empires following the European conquest of the Western Hemisphere. Among other topics, we will examine the pivotal role of slavery and other forms of forced labor, the impact of the industrial revolution, the emergence and expansion of corporate capitalism and the labor unrest it provoked in the post-civil war U.S., the role of labor in the Mexican Revolution and its aftermath, the impact of the Great Depression and labor incorporation on the post-WWII social and political order of both countries, the breakdown of that order and the move to neo-liberalism in the 1970s and 1980s, and the emergence of an increasingly integrated North American production system and its consequences for labor and working people on both sides of the US-Mexico border.",
            "id": "CHICLA/HISTORY/LACIS/POLISCI 355",
            "title": "LABOR IN THE AMERICAS: US & MEXICO IN COMPARATIVE & HISTORICAL PERSPECTIVE"
        }
    },
    {
        "data": {
            "description": "Acquaints students with a wide variety of research methods used to analyze political phenomena, emphasizing both quantitative and qualitative approaches.",
            "id": "POLISCI 817",
            "parent": "POLISCI",
            "title": "EMPIRICAL METHODS OF POLITICAL INQUIRY"
        }
    },
    {
        "data": {
            "description": "Interdisciplinary inquiry in Latin American society and culture.",
            "id": "AAE/ANTHRO/C&ESOC/GEOG/HISTORY/LACIS/POLISCI/PORTUG/SOC/SPANISH 982",
            "title": "INTERDEPARTMENTAL SEMINAR IN THE LATIN-AMERICAN AREA"
        }
    },
    {
        "data": {
            "source": "POLISCI 104",
            "target": "POLISCI 414"
        }
    },
    {
        "data": {
            "id": "INTLST",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "POLISCI 182",
            "target": "POLISCI 438"
        }
    },
    {
        "data": {
            "source": "POLISCI 140",
            "target": "POLISCI/RELIGST 433"
        }
    },
    {
        "data": {
            "description": "How do states make foreign policy decisions? What kinds of factors most influence states' international behavior on security, economic, and humanitarian questions? What explains the foreign policies of different states? Develop skills in analyzing foreign policy from a social scientific standpoint. Examine the logic of theories and evaluate the evidence for and against different explanations for how states behave internationally. Develop knowledge of specific countries and foreign policy topics.",
            "id": "POLISCI 358",
            "parent": "POLISCI",
            "title": "STATES IN THE WORLD: COMPARATIVE FOREIGN POLICY"
        }
    },
    {
        "data": {
            "description": "An umbrella course for variable credit political theory courses taken on study abroad programs.",
            "id": "POLISCI 590",
            "parent": "POLISCI",
            "title": "STUDY ABROAD TOPICS IN POLITICAL SCIENCE: POLITICAL THEORY"
        }
    },
    {
        "data": {
            "description": "Exploration of key themes, developments, and figures in Christian political and ethical traditions.",
            "id": "POLISCI 364",
            "parent": "POLISCI",
            "title": "CHRISTIAN POLITICAL THOUGHT"
        }
    },
    {
        "data": {
            "description": "Changing political roles, status, attitudes, and behaviors of women in contemporary society and of the political implications of changing female/male relationships.",
            "id": "GEN&WS/POLISCI 469",
            "title": "WOMEN AND POLITICS"
        }
    },
    {
        "data": {
            "source": "POLISCI 140",
            "target": "POLISCI 348"
        }
    },
    {
        "data": {
            "description": "Interactions between literature and politics, and the role of literature more generally in the functioning of the political systems. Not open to students with credit for POLI SCI 570 prior to fall 2017",
            "id": "POLISCI 363",
            "parent": "POLISCI",
            "title": "LITERATURE AND POLITICS"
        }
    },
    {
        "data": {
            "description": "An overview of  approaches to interpreting, teaching, and writing about political theory.",
            "id": "POLISCI 839",
            "parent": "POLISCI",
            "title": "FIELD SEMINAR IN POLITICAL THEORY"
        }
    },
    {
        "data": {
            "source": "POLISCI 104",
            "target": "POLISCI 412"
        }
    },
    {
        "data": {
            "description": "Provides an overview of the formal theory literature in international relations, including international security and international political economy.",
            "id": "POLISCI 837",
            "parent": "POLISCI",
            "title": "FORMAL MODELS OF INTERNATIONAL RELATIONS"
        }
    },
    {
        "data": {
            "source": "INTLST 101",
            "target": "INTLST/POLISCI 431"
        }
    },
    {
        "data": {
            "source": "POLISCI 120",
            "target": "POLISCI/RELIGST 433"
        }
    },
    {
        "data": {
            "description": "Comprehensive interdisciplinary survey of East European culture, society, politics, and literature from its beginnings to the present day.",
            "id": "GEOG/HISTORY/POLISCI/SLAVIC 254",
            "title": "EASTERN EUROPE: AN INTERDISCIPLINARY SURVEY"
        }
    },
    {
        "data": {
            "description": "An introduction to the statistical methods used in public policy. Covers the basics of probability, statistics, and quantitative methods in public policy analysis. Stresses interpretation and presentation of data as well as theory.",
            "id": "PUBAFFR 818",
            "parent": "PUBAFFR",
            "title": "INTRODUCTION TO STATISTICAL METHODS FOR PUBLIC POLICY ANALYSIS"
        }
    },
    {
        "data": {
            "source": "POLISCI 184",
            "target": "POLISCI 412"
        }
    },
    {
        "data": {
            "id": "RELIGST",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "The intellectual origins and evolution of American political thought as seen through the lens of leading politicians, novelists and social critics from the Puritans to the Civil War; consideration of the central tensions of American political thought from a contemporary perspective. Not open to students with credit for POLI SCI 565 prior to fall 2017",
            "id": "POLISCI 360",
            "parent": "POLISCI",
            "title": "HISTORY OF AMERICAN POLITICAL THOUGHT"
        }
    },
    {
        "data": {
            "source": "POLISCI 104",
            "target": "POLISCI 320"
        }
    },
    {
        "data": {
            "source": "POLISCI 182",
            "target": "POLISCI 437"
        }
    },
    {
        "data": {
            "description": "An umbrella course for variable credit comparative politics courses taken on study abroad programs.",
            "id": "POLISCI 690",
            "parent": "POLISCI",
            "title": "STUDY ABROAD TOPICS IN POLITICAL SCIENCE: COMPARATIVE POLITICS"
        }
    },
    {
        "data": {
            "source": "POLISCI 104",
            "target": "POLISCI 311"
        }
    },
    {
        "data": {
            "description": "Analysis of key classical and contemporary theories in international political economy.",
            "id": "POLISCI 864",
            "parent": "POLISCI",
            "title": "INTERNATIONAL POLITICAL ECONOMY"
        }
    },
    {
        "data": {
            "id": "ILS",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "POLISCI 120",
            "target": "POLISCI 659"
        }
    },
    {
        "data": {
            "description": "Directed study projects for freshmen and sophomores as arranged with a faculty member; students should have completed at least one course in POLI SCI.",
            "id": "POLISCI 199",
            "parent": "POLISCI",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "source": "POLISCI 104",
            "target": "POLISCI 184"
        }
    },
    {
        "data": {
            "source": "POLISCI 184",
            "target": "POLISCI 417"
        }
    },
    {
        "data": {
            "description": "Examines the psychological aspects of the political behavior of individuals--whether elites, activists or members of general publics--and their consequent political behaviors in various groups and institutional contexts. Not open to students with credit for POLI SCI 267 prior to fall 2017",
            "id": "POLISCI 206",
            "parent": "POLISCI",
            "title": "INTRODUCTION TO POLITICAL PSYCHOLOGY"
        }
    },
    {
        "data": {
            "description": "Examines the political, social, and economic aspects of the evolution of the Arab-Israeli conflict over time, and the theoretical and policy issues it raises. Not open to students with credit for POLI SCI 631 prior to fall 2017",
            "id": "POLISCI 529",
            "parent": "POLISCI",
            "title": "ARAB-ISRAELI CONFLICT"
        }
    },
    {
        "data": {
            "source": "LEGALST/POLISCI 217",
            "target": "POLISCI 470"
        }
    },
    {
        "data": {
            "description": "A topics course for the exploration of current issues in Political Science.",
            "id": "POLISCI 401",
            "parent": "POLISCI",
            "title": "SELECTED TOPICS IN POLITICAL SCIENCE"
        }
    },
    {
        "data": {
            "description": "Studies the varieties and characteristics of non-democratic regimes from around the world: how they form, why they endure, and when they collapse, engaging along the way with theories of electoral behavior, political psychology, political violence, popular mobilization, and democratization.",
            "id": "POLISCI 339",
            "parent": "POLISCI",
            "title": "NON-DEMOCRACIES"
        }
    },
    {
        "data": {
            "source": "POLISCI 184",
            "target": "POLISCI 408"
        }
    },
    {
        "data": {
            "description": "Examine three questions about Chinese politics through a comparative perspective. First, what functions do formal institutions such as the political party, legislature, courts, and bureaucracy serve in an authoritarian regime? Second, what are the political forces that lay a good foundation for China to successfully transition from a planning economy to a robust market economy and sustain high-speed growth for more than four decades? Finally, how does the Chinese government deal with pressing social problems and threats to its authoritarian leadership in this new era?",
            "id": "POLISCI 324",
            "parent": "POLISCI",
            "title": "CHINESE POLITICS"
        }
    },
    {
        "data": {
            "id": "POLISCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ILS 205",
            "target": "POLISCI 361"
        }
    },
    {
        "data": {
            "description": "Examines the political, social, and economic contexts that shape and are shaped by policy making processes. Though the focus is on the US, international comparisons will be made, and students are encouraged to think about the American context through comparative and international perspectives. Familiarizes students with dominant theories and models of policymaking process and policy change, starting with the model of the policy cycle. Focuses in on key topics and issues in policy making, specifically, agenda setting, implementation, and the relationships between policymaking and democracy. Reflects on contemporary and emerging issues and dilemmas of the politics of policy making.",
            "id": "POLISCI/PUBAFFR/URBRPL 874",
            "title": "POLICY-MAKING PROCESS"
        }
    },
    {
        "data": {
            "description": "Democracy has come under stress, both at home and across the world. The global decline of democracy has accelerated over the past decade, and levels of democracy enjoyed by the average global citizen today are down to levels last found around 1990. The promise of democracy's inevitable ascent and dominance after the end of the Cold War has proven shortlived. Examines the state and future of a political system we tend to take for granted but should not. Starts with a brief overview of the evolution of the concept of democracy over time. Examines the relationship between democracy and economic development, culture, identity, and religion. Considers and compares core democratic institutions. Investigates current challenges to democracy and democratization and offers an overview of the state of democracy across different world regions.",
            "id": "POLISCI 336",
            "parent": "POLISCI",
            "title": "DEMOCRACY (AND ITS UNCERTAIN FUTURE)"
        }
    },
    {
        "data": {
            "source": "LEGALST/POLISCI 217",
            "target": "POLISCI 414"
        }
    },
    {
        "data": {
            "description": "This class examines the major problems and issues in Mexican-American politics since World War II. An emphasis will be placed on the ways in which race, class and culture have structured politics for the Mexican origin people. Not open to students with credit for POLI SCI 464 prior to fall 2017",
            "id": "CHICLA/POLISCI 302",
            "title": "MEXICAN-AMERICAN POLITICS"
        }
    },
    {
        "data": {
            "description": "Examines the multifaceted nature of political Islam in the contemporary world. Starting with the basic tenants of Islam, and key concepts and theoretical understandings of the relationships between Islam and politics, the course builds on the approaches developed in the first part of the course examining how Islam has influenced politics differently in various parts of the world including the Middle East, Southeast Asia, and South Asia. Students will familiarize themselves with theoretical debates about the roles of Islam in politics; analyze the impact of Islam on politics in the contemporary world; and gain empirical knowledge about how Islam functions differently in various countries.",
            "id": "POLISCI 323",
            "parent": "POLISCI",
            "title": "ISLAM AND WORLD POLITICS"
        }
    },
    {
        "data": {
            "description": "An experimental topics course that introduces students to compelling recent events and to the current research of political scientists. This course can be repeated by students, but not with the same content.",
            "id": "POLISCI 201",
            "parent": "POLISCI",
            "title": "SPECIAL TOPICS IN POLITICAL SCIENCE"
        }
    },
    {
        "data": {
            "description": "This course introduces students to time series methods and applications, including ARMA models, error corrections models and reduced form specifications. Course also discusses co-integration and fractional integration.",
            "id": "POLISCI 917",
            "parent": "POLISCI",
            "title": "TIME SERIES ANALYSIS"
        }
    },
    {
        "data": {
            "source": "POLISCI 184",
            "target": "POLISCI 414"
        }
    },
    {
        "data": {
            "description": "An introduction to decision analysis, strategic interaction, and voting systems and their manipulation. Examines a wide range of institutions for making social choices and the opportunities for the exercise of political strategy.",
            "id": "POLISCI 274",
            "parent": "POLISCI",
            "title": "POLITICAL CHOICE AND STRATEGY"
        }
    },
    {
        "data": {
            "description": "Role of administration in American government; problems of organization, bureaucracy and control; public policy as the output of the administrative process.",
            "id": "POLISCI/PUBAFFR/URBRPL 878",
            "title": "PUBLIC MANAGEMENT"
        }
    },
    {
        "data": {
            "source": "POLISCI 182",
            "target": "POLISCI 329"
        }
    },
    {
        "data": {
            "source": "LEGALST/POLISCI 217",
            "target": "POLISCI 347"
        }
    },
    {
        "data": {
            "description": "Under the direction of faculty.",
            "id": "POLISCI 990",
            "parent": "POLISCI",
            "title": "RESEARCH AND THESIS"
        }
    },
    {
        "data": {
            "source": "POLISCI 120",
            "target": "POLISCI 538"
        }
    },
    {
        "data": {
            "description": "This course considers central themes and controversies in American political thinking during the 20th and early 21st centuries. Topics include the development of liberalism from the Progressive Era to the New Deal to the Great Society and beyond; the emergence of new strands of conservatism after World War II and the tensions between those strands; challenges by excluded and marginalized groups to the traditional social and political order; and the revival of concerns about \"community\" in America. As a topic of study, \"American Political Thought\" combines philosophy, political theory, history, and practical politics. The course covers a wide variety of texts, ranging from philosophical treatises to newspaper articles, from presidential addresses to works of social science with ultimate goal to become more knowledgeable and more critical students of the American political experience. Not open to students with credit for POLI SCI 566 prior to fall 2017",
            "id": "POLISCI 361",
            "parent": "POLISCI",
            "title": "CONTEMPORARY AMERICAN POLITICAL THOUGHT"
        }
    },
    {
        "data": {
            "source": "INTLST 101",
            "target": "POLISCI 529"
        }
    },
    {
        "data": {
            "source": "POLISCI 120",
            "target": "POLISCI 529"
        }
    },
    {
        "data": {
            "description": "An introduction to the major empirical and theoretical themes in the study of social movements and politics in Latin America. While it is impossible to cover every theoretical approach or Latin American case during the semester, the course should give students the tools to begin to think critically about where and why people engage in collective action. We will develop and hone these tools through thinking about Latin American cases, paying specific attention to revolutions, social movements, and riots. The course is designed in three parts. It begins by exposing students to the dominant theoretical paradigms in the study of contentious politics as well as some prominent critiques. The course then turns to empirical themes in Latin American revolutions, challenging students to use and question the theoretical tools to which they have already been exposed. The final part of the course looks to social movements in Latin America. Cases will focus on challenges to dictatorships, identity-based movements, and resistance to globalization.",
            "id": "INTLST/POLISCI 325",
            "title": "SOCIAL MOVEMENTS AND REVOLUTIONS IN LATIN AMERICA"
        }
    },
    {
        "data": {
            "description": "Research seminar on specific topics in comparative politics.",
            "id": "POLISCI 948",
            "parent": "POLISCI",
            "title": "SEMINAR: TOPICS IN COMPARATIVE POLITICS"
        }
    },
    {
        "data": {
            "source": "POLISCI 182",
            "target": "POLISCI 538"
        }
    },
    {
        "data": {
            "source": "ILS 205",
            "target": "POLISCI 460"
        }
    },
    {
        "data": {
            "description": "An introduction to the tools of game theoretic analysis, with reference to the use of game theory in political science. Intended for those desiring a basic familiarity with the theory, and  for those planning further work in formal modeling.",
            "id": "AAE/POLISCI 835",
            "title": "GAME THEORY AND POLITICAL ANALYSIS"
        }
    },
    {
        "data": {
            "description": "An introduction to the most pertinent themes to the study of politics and governance in the Middle East. Main topics to be covered: political economy of the region; link between Islam, culture and democracy; the politics of authoritarianism; and political Islam.",
            "id": "POLISCI 320",
            "parent": "POLISCI",
            "title": "GOVERNMENTS AND POLITICS OF THE MIDDLE EAST AND NORTH AFRICA"
        }
    },
    {
        "data": {
            "description": "Compares the conceptual, statistical, and ethical issues of experimental, quasi-experimental and non-experimental designs for program evaluation. Definitions of outcomes, sample size issues, statistical biases in measuring causal effects of programs, and the reliability of findings will be emphasized using case studies selected from current public programs.",
            "id": "POLISCI/PUBAFFR 871",
            "title": "PUBLIC PROGRAM EVALUATION"
        }
    },
    {
        "data": {
            "description": "Comparative theoretical and empirical analysis of political institutions, including electoral systems, legislatures, executives, executive-legislative relationships, political parties, party systems, federalism, economic governance, and link between institutions and internationalization.",
            "id": "POLISCI 853",
            "parent": "POLISCI",
            "title": "COMPARATIVE POLITICAL INSTITUTIONS"
        }
    },
    {
        "data": {
            "description": "Practical experience in a legislative office. Policy research. Readings in legislative process.",
            "id": "POLISCI 315",
            "parent": "POLISCI",
            "title": "LEGISLATIVE INTERNSHIP"
        }
    },
    {
        "data": {
            "description": "Intensive study and research in selected problems within the constituent fields of political science.",
            "id": "POLISCI 601",
            "parent": "POLISCI",
            "title": "PROSEMINAR: TOPICS IN POLITICAL SCIENCE"
        }
    },
    {
        "data": {
            "source": "POLISCI 140",
            "target": "POLISCI 320"
        }
    },
    {
        "data": {
            "description": "Analysis of retention of African elements in African-American oral, written, and material culture. Social, cultural, and political issues regarding race, self-definition, and self-determination in both Africa and North America will be examined.",
            "id": "AFRICAN/AFROAMER/HISTORY/POLISCI 297",
            "title": "AFRICAN AND AFRICAN-AMERICAN LINKAGES: AN INTRODUCTION"
        }
    },
    {
        "data": {
            "source": "PUBAFFR 818",
            "target": "POLISCI/PUBAFFR 871"
        }
    },
    {
        "data": {
            "source": "POLISCI 140",
            "target": "POLISCI 359"
        }
    },
    {
        "data": {
            "description": "Introduction to leading concepts and theories in the field of comparative politics, including those relating to states, nations, regimes and development. Includes work on many different regions and countries employing a range of research strategies and methodologies.",
            "id": "POLISCI 856",
            "parent": "POLISCI",
            "title": "FIELD SEMINAR IN COMPARATIVE POLITICS"
        }
    },
    {
        "data": {
            "description": "A critical examination of US-Latin American relations from the colonial era to the present, tracing the emergence and evolution of the United States as a hemispheric and global power and its political and economic impact on Latin America. Primary attention will be focused on US relations with Mexico, Central America and the Caribbean, but other Latin American countries will figure prominently during certain episodes.",
            "id": "CHICLA/HISTORY/LACIS/POLISCI 268",
            "title": "THE U.S. & LATIN AMERICA FROM THE COLONIAL ERA TO THE PRESENT: A CRITICAL SURVEY"
        }
    },
    {
        "data": {
            "description": "Process of rapid political change in contemporary Africa with special emphasis on the emergence of new states. Not open to students with credit for POLI SCI 660 prior to fall 2017",
            "id": "POLISCI 329",
            "parent": "POLISCI",
            "title": "AFRICAN POLITICS"
        }
    },
    {
        "data": {
            "description": "Substantive and procedural aspects of criminal law, including the purposes of criminal justice, specific crimes, criminal responsibility and punishment, legal concepts of proof, and 4th, 5th, and 6th Amendment issues. The case approach is used. Not open to students with credit for POLI SCI 452 prior to fall 2017",
            "id": "POLISCI 314",
            "parent": "POLISCI",
            "title": "CRIMINAL LAW AND JUSTICE"
        }
    },
    {
        "data": {
            "description": "Introduction to Comparative Politics, one of the four sub-fields in Political Science, which involves the comparative analysis of political institutions, processes, and outcomes at the national level. Examines how to usefully compare politics in a variety of countries and makes comparisons explicit and systematic in order to determine how governments work, how power is organized and contested at the national level, and how people can participate and pursue their interests in different political settings. Includes key concepts, theories, methods, and country case studies.",
            "id": "POLISCI 182",
            "parent": "POLISCI",
            "title": "INTRODUCTION TO COMPARATIVE POLITICS (HONORS)"
        }
    },
    {
        "data": {
            "source": "POLISCI 140",
            "target": "POLISCI 349"
        }
    },
    {
        "data": {
            "description": "Reviews major approaches to analyzing political parties and understanding their developmental changes.  Examines the parties in operation and the relationship of parties to the state and society.",
            "id": "POLISCI 873",
            "parent": "POLISCI",
            "title": "AMERICAN POLITICAL PARTIES"
        }
    },
    {
        "data": {
            "description": "Nationalist conflict and ethnic contestation remain major components of global politics. Drawing on cases from around the world, this course explores why this is the case. In the process, we will address a number of crucial questions: What are nations and ethnic groups? Where do they come from? Why do they pick particular territories? How do they define who can be part of the group? Why are they so successful in mobilizing people to kill and be killed? In the course of answering these questions, the course investigates the interactions between nations and states, religion and nationalism, globalization, citizenship and minority rights, and the causes and solutions for national and ethnic conflict.",
            "id": "POLISCI 437",
            "parent": "POLISCI",
            "title": "NATIONALISM AND ETHNIC CONFLICT"
        }
    },
    {
        "data": {
            "description": "Role of alliances in contemporary and historical international political systems. Purpose of alliance formation; reasons for their dissolution; relationship of alliance activity with international war and with political integration. Role of alliances in future international systems. Not open to students with credit for POLI SCI 367 prior to fall 2017",
            "id": "POLISCI 343",
            "parent": "POLISCI",
            "title": "THEORIES OF INTERNATIONAL SECURITY"
        }
    },
    {
        "data": {
            "description": "Introduction to the issues of statistical computing in political science using statistical packages such as STATA and R with emphasis on developing sound practices for organizing data, protocols, and results in empirical research. Not open to students with credit for POLI SCI 553 prior to fall 2017",
            "id": "POLISCI 811",
            "parent": "POLISCI",
            "title": "INTRODUCTION TO STATISTICAL COMPUTING IN POLITICAL SCIENCE"
        }
    },
    {
        "data": {
            "description": "Structure, process, and personnel of American courts; emphasis on the governmental and political consequences of court decisions for public policy-making.",
            "id": "POLISCI 417",
            "parent": "POLISCI",
            "title": "THE AMERICAN JUDICIAL SYSTEM"
        }
    },
    {
        "data": {
            "description": "Engage in ongoing reflection and dialogue on the Wisconsin Idea and how it informs the mission of the University of Wisconsin. Consider the Wisconsin Idea as it has developed since its beginnings, with a focus on what it means today and what it can mean in the future.",
            "id": "C&ESOC/HISTORY/POLISCI/SOC 259",
            "title": "FORWARD? THE WISCONSIN IDEA, PAST AND PRESENT"
        }
    },
    {
        "data": {
            "description": "An introduction to theories and empirical work on social identities, focusing in particular on definitions and measurement. It has three main goals: First, examine various definitions of social identities and different types of identities (ethnicity, race, nationality, gender, class, and religion). Second, look at techniques and strategies that have been developed to measure identities (content and discourse analysis, surveys, interviews and ethnography, censuses). Third, examine empirical works on identities from a variety of geographical areas and methodological perspectives.",
            "id": "POLISCI 335",
            "parent": "POLISCI",
            "title": "SOCIAL IDENTITIES"
        }
    },
    {
        "data": {
            "source": "POLISCI/PUBAFFR/URBRPL 878",
            "target": "POLISCI/PUBAFFR 885"
        }
    },
    {
        "data": {
            "description": "An umbrella course for variable credit topic courses, such as summer forum, intensive summer courses, half-semester courses, etc.",
            "id": "POLISCI 400",
            "parent": "POLISCI",
            "title": "TOPICS IN POLITICAL SCIENCE"
        }
    },
    {
        "data": {
            "description": "Democracies frequently depart from their ideal type. We focus on select problems with democracy, and examine their causes and effects, and remedies for them. Topics vary from year-to-year, and include inequalities in political representation and participation, a lack of accountability and ethnic voting.",
            "id": "POLISCI 844",
            "parent": "POLISCI",
            "title": "DEMOCRATIC IMPERFECTIONS"
        }
    },
    {
        "data": {
            "source": "POLISCI 182",
            "target": "POLISCI 635"
        }
    },
    {
        "data": {
            "description": "Designed around substantive topic areas, including reputation, personality, and emotions. Covers the broad patterns of scholarship in political psychology over the last 50 years. The larger methodological issues around political psychology and International Relations (IR) (how do you study this? what tradeoffs do the various approaches entail?) will form a backdrop to most of our discussions.",
            "id": "POLISCI 950",
            "parent": "POLISCI",
            "title": "PSYCHOLOGICAL APPROACHES TO INTERNATIONAL RELATIONS"
        }
    },
    {
        "data": {
            "source": "POLISCI 140",
            "target": "POLISCI 350"
        }
    },
    {
        "data": {
            "description": "A survey course that focuses on interactions among the primary entities in the international system; namely, states, inter- governmental and non-governmental organizations, and other international actors governed by international law. The study of international relations and international law is absolutely critical to understanding contemporary politics, both domestic and foreign. This course addresses both structural and substantive issues related to international law. In other words, it should provide basic tools for understanding the way in which international law works, as well as introduce substantive issues of interest to students of world politics. The course will place special emphasis on the role of international organizations in the international legal system, and special attention will be paid to the European Union as an international actor within this system of law. Not open to students with credit forPOLI SCI 316prior to fall 2017",
            "id": "POLISCI 356",
            "parent": "POLISCI",
            "title": "PRINCIPLES OF INTERNATIONAL LAW"
        }
    },
    {
        "data": {
            "source": "POLISCI 140",
            "target": "POLISCI 343"
        }
    },
    {
        "data": {
            "description": "Analysis of legislative process and the role of the legislature in the political system, emphasizing current research.",
            "id": "POLISCI 826",
            "parent": "POLISCI",
            "title": "THE LEGISLATIVE PROCESS"
        }
    },
    {
        "data": {
            "source": "POLISCI 104",
            "target": "POLISCI 511"
        }
    },
    {
        "data": {
            "description": "In depth study of key works of Roman political thought, along with recent and classic scholarship in political theory, history, philosophy, classics, and literature.",
            "id": "CLASSICS/POLISCI 834",
            "title": "ROMAN POLITICAL THOUGHT"
        }
    },
    {
        "data": {
            "description": "Focuses on how to analyze problems in international politics by the use of game theory. Examples include governments making choices about the size of their military forces, barriers to trade, or international agreements on environmental issues. Analysts study strategic interaction using both informal and mathematical methods. Provides a good introduction to the basics of game theory -- a tool useful in many different settings -- as well as an introduction to the study of world politics. From the perspective of quantitative reasoning, one of the most important set of lessons center on the logic of strategic interaction and the notion of equilibrium. Along with basic game theory students will also be introduced to the pragmatic use of mathematical tools including algebra, set theory, functions, and probability theory. Not open to students with credit for POLI SCI 376 prior to fall 2017",
            "id": "POLISCI 348",
            "parent": "POLISCI",
            "title": "ANALYSIS OF INTERNATIONAL RELATIONS"
        }
    },
    {
        "data": {
            "description": "Introduces students involved in volunteer or community activism in the Madison area to the literature on political power and community organizing. Conduct field research and write an analysis of activities.",
            "id": "POLISCI 416",
            "parent": "POLISCI",
            "title": "COMMUNITY POWER AND GRASS ROOTS POLITICS"
        }
    }
]