[
    {
        "data": {
            "description": "Behavioral medicine clinical patient care, under faculty supervision. All members of the department interact with the student who is typically assigned primarily to one member, depending upon the student's interests. Spend time with the Psychiatric Unit nursing staff to learn how the Unit itself is used as a treatment modality.",
            "id": "PSYCHIAT 921",
            "parent": "PSYCHIAT",
            "title": "BEHAVIORAL HEALTH CLINICAL ELECTIVE"
        }
    },
    {
        "data": {
            "description": "Clinical care of persons living with dementia and their caregivers. Public health approaches to assisting persons living with dementia in the community via Wisconsin Alzheimer's Institute. Assessment and management of dementia, including  behavioral and psychological symptoms.",
            "id": "PSYCHIAT 931",
            "parent": "PSYCHIAT",
            "title": "DEMENTIA AND PUBLIC HEALTH"
        }
    },
    {
        "data": {
            "description": "Continued advancement in reflective practices through case discussion, infant and family observations, mindfulness and self-compassion experiences as applied to their work with infants, young children and families. Additional strategies and in-depth opportunities for introspection and self-awareness.  Discussion of relationship-based therapeutic consultation and interventions and attention to the parallel process between the nature of their relationship with a parent and the parent's relationship with their child. Focus will be on underserved populations and contribution of maternal depression, substance abuse disorders and trauma on the parent-child relationship and the child's development. Complex ethical decision making and policy issues will be addressed. Inclusion of a self-assessment process that will support students in appraising their competencies and readiness to apply for the WI Alliance for Infant Mental Health Endorsement.",
            "id": "PSYCHIAT 716",
            "parent": "PSYCHIAT",
            "title": "SEMINAR IN REFLECTIVE PRACTICES AND MINDFULNESS IN INFANT, EARLY CHILDHOOD AND FAM MENTAL HEALTH II"
        }
    },
    {
        "data": {
            "description": "Focus on assessing patients with urgent medical conditions, providing acute inpatient care, and transitioning patients to other care settings or home under the care of other professionals. Provide acute care in inpatient and outpatient urgent care settings as well as on the inpatient wards, and develop acute management plans and subsequent transition of care plans. Clinical experiences in acute care settings such as the emergency department and inpatient medicine (both general and subspecialty), psychiatry, and neurology. Builds upon fundamental science concepts introduced in Body in Balance and Mind and Motion, including Ohm's Law, acid-base balance, and volume regulation. Organ system-based approach employing varied modalities. Complete an integrated patient-centered experience by participating in the care of a patient from an urgent admission through inpatient treatment and discharge.",
            "id": "MEDSC-M 812",
            "parent": "MEDSC-M",
            "title": "ACUTE CARE"
        }
    },
    {
        "data": {
            "description": "Introduction to common psychiatric diagnoses (mood disorders, psychotic disorders and personality disorders) in the hospital setting. Actively participate in patient care under the supervision of 2 Inpatient Attending Faculty and 3 Psychiatry Residents. During daily multidisciplinary rounds, present detailed clinical information about new patients. Provide updates on the patients you are following. Each student is assigned 2 or 3 patients. You are included in all aspects of patients' care and have ample time for in-depth interviews. Attend family meetings and play an integral role in obtaining collateral information from family or outside sources. Daily progress notes are reviewed by attendings and residents.",
            "id": "PSYCHIAT 934",
            "parent": "PSYCHIAT",
            "title": "PSYCHIATRY INPATIENT CLINICAL ELECTIVE"
        }
    },
    {
        "data": {
            "description": "Provides a foundation in reflective practices through discussion of cases, infant and family observations and mindfulness experiences as applied to students' work with infants, young children and families. Explore and experience ways in which reflective practices may be applied to parent-infant/early childhood mental health. Learn mindfulness strategies for developing self-awareness and regulation that may be brought to their work with families of infants and young children. In small Reflective Mentoring Groups, students will experience both descriptive and in-vivo examples of reflective practice through case based presentations, deeper introspection and supportive discussion to increase clarity and engagement in work with families of young children. Consider boundaries and ethical decision making related to the dilemmas faced by professionals working with families during the perinatal period and in early childhood, especially those in high risk and challenging circumstances.",
            "id": "PSYCHIAT 713",
            "parent": "PSYCHIAT",
            "title": "SEMINAR IN REFLECTIVE PRACTICES AND MINDFULNESS IN INFANT, EARLY CHILDHOOD & FAMILY MENTAL HEALTH I"
        }
    },
    {
        "data": {
            "description": "Self-directed work under the supervision and guidance of a faculty member or instructional staff, and often in conjunction with a day-to-day mentor that is a graduate student or postdoc researcher in the faculty member's or instructor's group. Students normally participate in aspects of ongoing research projects.",
            "id": "PSYCHIAT 699",
            "parent": "PSYCHIAT",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "This small group and individualized course offers students an opportunity to reflect upon their work with mothers and partners in the prenatal and postpartum period, infants, young children and their families. Course faculty and a senior, clinical consultant will guide students in exploring their individual responses to the literature, course content and issues raised in their work including personal experience and reactions as well reflecting on the parallel process. The intent is to support the student's professional development in ways that broaden and deepen the effectiveness of their work.",
            "id": "PSYCHIAT 714",
            "parent": "PSYCHIAT",
            "title": "CONSULTATION IN INFANT, EARLY CHILDHOOD AND FAMILY MENTAL HEALTH: ADVANCED CLINICAL PRACTICE I"
        }
    },
    {
        "data": {
            "description": "This small group and individualized course offers students an opportunity to reflect upon their work with mothers and partners in the prenatal and postpartum period, infants, young children and their families. Course faculty and a senior, clinical consultant will guide students in exploring their individual responses to the literature, course content and issues raised in their work including personal experience and reactions as well reflecting on the parallel process. The intent is to support the student's professional development in ways that broaden and deepen the effectiveness of their work.",
            "id": "PSYCHIAT 717",
            "parent": "PSYCHIAT",
            "title": "CONSULTATION IN INFANT, EARLY CHILDHOOD AND FAMILY MENTAL HEALTH: ADVANCED CLINICAL PRACTICE II"
        }
    },
    {
        "data": {
            "description": "Broad set of experiences in public health service and public health advocacy, and exposure to a number of community resources and organizations. Spend time within a mental health integrated care setting under faculty supervision. These models of care have been shown to be cost-effective ways of delivering mental health care to large numbers of patients, thereby addressing a public health need given the serious shortage of Psychiatrists. Work with the Wisconsin Medical Society to receive media training and write and record a public service announcement on a Psychiatric public health issue.  Receive Advocacy training. Attend meetings of local professional advocacy organizations (e.g., the Wisconsin Medical Society, Dane County Medical Society) with the Course Director, dependent on time of enrollment.",
            "id": "PSYCHIAT 933",
            "parent": "PSYCHIAT",
            "title": "PUBLIC HEALTH ADVOCACY AND SERVICE IN PSYCHIATRY"
        }
    },
    {
        "data": {
            "description": "Care of older adults with mental illness, including late-life depression and anxiety, suicidality, dementia, and substance use disorders. Under the supervision of clinicians with extensive experience in the care of older adults, help care for patients in inpatient, outpatient and long-term care settings. Have the opportunity to experience public health approaches to improving the mental health of older adults, for example, by attending caregiver support groups.",
            "id": "PSYCHIAT 930",
            "parent": "PSYCHIAT",
            "title": "PSYCHIATRY GERIATRIC CLINICAL ELECTIVE"
        }
    },
    {
        "data": {
            "description": "Develop a customized experience with relevant faculty not offered by our already established electives.",
            "id": "PSYCHIAT 919",
            "parent": "PSYCHIAT",
            "title": "PSYCHIATRY INDIVIDUALIZED CLINICAL ELECTIVE"
        }
    },
    {
        "data": {
            "description": "Etiology, assessment, and treatment of substance use disorders and psychiatric co-morbidity.",
            "id": "PSYCHIAT 932",
            "parent": "PSYCHIAT",
            "title": "PSYCHIATRY ADDICTION CLINICAL ELECTIVE"
        }
    },
    {
        "data": {
            "description": "Identify the roles of physicians, interdisciplinary providers, health care systems, and communities in screening, treating, and preventing common, chronic conditions. Activities are centered on health promotion, outpatient-based chronic disease management, and community health. Clinical experiences will occur in primary care, behavioral health, and other ambulatory and community-based settings that focus on chronic disease management.",
            "id": "MEDSC-M 811",
            "parent": "MEDSC-M",
            "title": "CHRONIC AND PREVENTIVE CARE"
        }
    },
    {
        "data": {
            "description": "Immersive experience in community mental health while embedded within a community support team, either at Gateway or Community Treatment Alternatives (CTA).  Gateway is an assertive community treatment team serving Dane County residents who have severe mental illness and substance abuse issues.  CTA is an assertive community treatment team that works exclusively with adults involved in the criminal justice system. Patients must be either diverted from the Dane County Jail or be conditionally released after being found \"not guilty by reason of mental disease or defect\" (NGI).",
            "id": "PSYCHIAT 925",
            "parent": "PSYCHIAT",
            "title": "COMMUNITY PSYCHIATRY ELECTIVE"
        }
    },
    {
        "data": {
            "description": "Improve skills in providing psychiatric health care to athlete populations. Sports psychiatry as a sub-specialty within psychiatry focuses on diagnosis and treatment of psychiatric illness in athletes. While utilization of psychological approaches to enhance performance can be part of the work of the sports psychiatrist, the emphasis is more on addressing actual mental illness in this population. Sports psychiatry may also involve the use of exercise as a therapeutic or preventative intervention for mental illness. Sports psychiatry typically focuses on mental health care for individual athletes, but systems-wide initiatives (e.g., at the level of the team or university) are also often important.",
            "id": "PSYCHIAT 901",
            "parent": "PSYCHIAT",
            "title": "SPORTS PSYCHIATRY: IMPROVING THE MENTAL HEALTH OF ATHLETES AT THE INDIVIDUAL AND SYSTEMS LEVELS"
        }
    },
    {
        "data": {
            "description": "Independent exposure to research methodology as it pertains to psychiatry and/or affective neuroscience.",
            "id": "PSYCHIAT 910",
            "parent": "PSYCHIAT",
            "title": "PSYCHIATRY INDEPENDENT READING AND RESEARCH ELECTIVE"
        }
    },
    {
        "data": {
            "description": "Interact with and learn from multiple staff at Mendota Mental Health Institute (MMHI), including forensic psychiatrists, psychologists, nurses, and occupational therapists. Interact with patients who have been committed to MMHI usually for forensic purposes- the patient has been found not guilty by reason of insanity, they are incompetent to stand trial, and/or their conditional release in the community has been revoked. Opportunity to see patients who have been civilly committed. Rotate with multiple psychiatrists, some of whom are specially trained in forensic psychiatry. Learn more about the forensic/legal system, the structure of medium and maximum security forensic psychiatry units, treatment of refractory psychotic and mood disorders, and the basics of forensic assessments. The student is given as much autonomy as possible with individual supervision and discussion.",
            "id": "PSYCHIAT 947",
            "parent": "PSYCHIAT",
            "title": "PSYCHIATRY ASSESSMENT & TREATMENT IN A FORENSIC HOSPITAL SETTING"
        }
    },
    {
        "data": {
            "description": "Introduction to core knowledge and skills in child and adolescent psychiatry including assessment, diagnoses, and treatment of children and adolescents through exposure to inpatient, outpatient, and consultation/liaison settings. Exposure to the intricacies of working with families and systems providing care to child and adolescent patients. Designed for students considering careers in psychiatry, pediatrics, and family practice.",
            "id": "PSYCHIAT 946",
            "parent": "PSYCHIAT",
            "title": "CHILD AND ADOLESCENT PSYCHIATRY CLINICAL ELECTIVE"
        }
    },
    {
        "data": {
            "description": "Learn psychiatric assessment of patients admitted to University Hospital medical and surgical floors (including burn unit, trauma service and transplant services). Learn emergency psychiatric assessment through consultation to the University Hospital emergency department.",
            "id": "PSYCHIAT 922",
            "parent": "PSYCHIAT",
            "title": "PSYCHIATRY CONSULTATION AND LIAISON CLINICAL ELECTIVE"
        }
    },
    {
        "data": {
            "description": "Offers students the opportunity to apply knowledge of Infant, Early Childhood and Family Mental Health concepts, assessment and diagnosis to planning and implementation of relationship-based and individual treatment approaches as well as to program development and policy. Students will be introduced to best practices and evidence based multi-disciplinary treatment approaches to address a range of presenting issues, settings, and cultural contexts for vulnerable children who are evidencing social, emotional, behavioral or attentional disturbances and parents with psychiatric disorders. Implications for informing policy across systems of care will be addressed. During the course of the semester, students will benefit from invited state and national speakers and guest faculty and instructors from the UW speaking on their areas of expertise.",
            "id": "PSYCHIAT 715",
            "parent": "PSYCHIAT",
            "title": "THERAPEUTIC INTERVENTIONS, PRACTICES AND POLICY IN INFANT, EARLY CHILDHOOD AND FAMILY MENTAL HEALTH"
        }
    },
    {
        "data": {
            "description": "Provides a comprehensive understanding of the underpinnings of Infant, Early Childhood and Family Mental Health. Learn about pregnancy, transition to parenthood and typical/atypical development and attachment relationships. Become familiar with reliable and valid screening and assessment tools of social, emotional, cognitive, communication, motor and regulatory capacities in infants and young children in the context of their caregiving relationships;  developmentally appropriate diagnostic nosologies; methods of conceptualizing risk and protective factors; and planning for therapeutic interventions that build on strengths and address vulnerabilities. Unique features include assessment of early parent-child relationships and the use of video replay to engage parents in assessing their relationship with their child and the benefit of faculty from multiple departments at UW and luminary national guest instructors.",
            "id": "PSYCHIAT 712",
            "parent": "PSYCHIAT",
            "title": "FOUNDATIONS IN INFANT, EARLY CHILDHOOD AND FAMILY MENTAL HEALTH: DEV, SCREENING, ASSESSMENT AND DIAG"
        }
    },
    {
        "data": {
            "description": "Sleep occupies a third of our life, and is found in all animal species. Loss of sleep has both acute and long-term negative consequences on the brain and the body. Still, why we sleep remains unclear, and hypotheses on the role of sleep for synaptic homeostasis, learning and memory, cardiovascular and metabolic health, are being tested in humans and animal models. Learn how the sleeping brain can either support vivid conscious experiences (dreaming) or not (deep slow wave sleep); brain structures involved in wake and sleep; how sleep pressure increases during waking; effects of sleep deprivation; causes of narcolepsy and other sleep disorders. How to study sleep in genetic models like flies; electron microscopy to assess effects of sleep loss on synapses; enhancement of sleep slow waves in humans; development and testing of theoretical models; methods to assess levels of consciousness in humans. During time at the WI Sleep Clinic, learn how sleep disorders are diagnosed and treated.",
            "id": "PSYCHIAT 902",
            "parent": "PSYCHIAT",
            "title": "THE BASIC SCIENCE OF SLEEP AND CONSCIOUSNESS"
        }
    },
    {
        "data": {
            "id": "MEDSC-M",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "PSYCHIAT",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 811",
            "target": "PSYCHIAT 931"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 812",
            "target": "PSYCHIAT 931"
        }
    }
]