[
    {
        "data": {
            "description": "Special topics in public health.",
            "id": "PUBLHLTH 700",
            "parent": "PUBLHLTH",
            "title": "TOPICS IN PUBLIC HEALTH"
        }
    },
    {
        "data": {
            "source": "PUBLHLTH 783",
            "target": "PUBLHLTH 784"
        }
    },
    {
        "data": {
            "description": "Gain knowledge about theory, concepts, and methods of program planning and evaluation in the context of health care and community health organizations. Covers content and case studies on planning, designing, and implementing health services and quality improvement projects. Basic principles of tools for budget development and resource management related to grants or projects are included. Class projects provide the opportunity to collaborate in the creation of program plans, logic models, and grant proposals.",
            "id": "PUBLHLTH 786",
            "parent": "PUBLHLTH",
            "title": "PLANNING AND MANAGEMENT TO PROMOTE HEALTH"
        }
    },
    {
        "data": {
            "source": "PUBLHLTH 787",
            "target": "PUBLHLTH 788"
        }
    },
    {
        "data": {
            "description": "Integrate public health knowledge, skills and practice acquired through didactic and experiential courses to find solutions to complex public health issues using public health tools and models that apply systems thinking, cultural humility and evidence-based decision making, framed within a social justice perspective.",
            "id": "PUBLHLTH 790",
            "parent": "PUBLHLTH",
            "title": "PUBLIC HEALTH AND SOCIAL JUSTICE: TOOLS AND MODELS"
        }
    },
    {
        "data": {
            "description": "Provides opportunities that facilitate learning in the areas of communicable disease surveillance, prevention strategies, and management, including AIDS, tuberculosis, malaria; dengue and other vectorborne diseases; neglected tropical diseases; vaccine preventable diseases; One Health and zoonotic diseases; novel disease emergence; WASH programs (water, sanitation, and hygiene); and bioterrorism.  Presumes some background and understanding of basic principles of health and addresses topics at a graduate level.",
            "id": "PUBLHLTH 712",
            "parent": "PUBLHLTH",
            "title": "GLOBAL HEALTH: INFECTIOUS DISEASES, ONE HEALTH, AND PREVENTION STRATEGIES"
        }
    },
    {
        "data": {
            "description": "Prepares Master of Public Health students for applied practice experience in a community setting.",
            "id": "PUBLHLTH 787",
            "parent": "PUBLHLTH",
            "title": "MPH APPLIED PRACTICE EXPERIENCE SEMINAR"
        }
    },
    {
        "data": {
            "description": "Provides opportunities that facilitate learning in the areas of globally important non-communicable diseases, including but not limited to type 2 diabetes, hypertension, and developmental and acquired disabilities;  the global epidemiology of non-communicable diseases; health determinants and indigenous health beliefs and practices; mental health and wellness, including interpersonal violence and opioid abuse;  and, food security, nutrition, and obesity.  Presumes some background and understanding of basic principles of health and addresses topics at a graduate level.",
            "id": "PUBLHLTH 713",
            "parent": "PUBLHLTH",
            "title": "GLOBAL HEALTH: NON-COMMUNICABLE DISEASES, POVERTY, ENVIRONMENTAL HEALTH, AND FOOD SECURITY"
        }
    },
    {
        "data": {
            "description": "Gain the fundamental principles of epidemiology and biostatistics with an emphasis on those elements most relevant to applied public health practice. Provides training in epidemiology and biostatistical theory and methods through applied case examples that blend epidemiology principles with foundational statistical knowledge needed to collect and analyze public health data.",
            "id": "PUBLHLTH 783",
            "parent": "PUBLHLTH",
            "title": "QUANTITATIVE APPROACHES TO PUBLIC HEALTH"
        }
    },
    {
        "data": {
            "description": "Gain an understanding of the fundamental principles of epidemiology and biostatistics with an emphasis on essential aspects in applied public health practice. Case studies provide training in epidemiology and biostatistical theory and methods that blend epidemiology principles with foundational statistical knowledge needed to collect and analyze public health data.",
            "id": "PUBLHLTH 784",
            "parent": "PUBLHLTH",
            "title": "QUANTITATIVE APPROACHES TO PUBLIC HEALTH II"
        }
    },
    {
        "data": {
            "description": "Provides opportunities that facilitate learning in the areas of global health systems, organizations, governance, and financing; global health security; emergency medical services and injury epidemiology; health in complex emergencies, and, health issues in refugee, immigrant, and internally-displaced persons. Presumes some background and understanding of basic principles of health and addresses topics at a graduate level.",
            "id": "PUBLHLTH 711",
            "parent": "PUBLHLTH",
            "title": "GLOBAL PUBLIC HEALTH AND HEALTHCARE SYSTEMS: ORGANIZATIONS, GOVERNANCE, FINANCING, AND WORKFORCE"
        }
    },
    {
        "data": {
            "description": "Build skills in collaboration, problem solving, and reflection to approach complex community-based public health problems contribute to becoming a public leader. Explore the six levels of public health leadership through the practices of current and past public health leaders, case studies, and personal experience.",
            "id": "NURSING/PHARMACY/PHYASST/PHYTHER/PUBLHLTH 758",
            "title": "INTERPROFESSIONAL PUBLIC HEALTH LEADERSHIP"
        }
    },
    {
        "data": {
            "description": "The social determinants of health, determined by deep rooted and inequitably distributed resources via institutions and systems that shape our communities and the world that we live in, are the key factors that shape ill health and exacerbate inequities in the health and well being of populations. Provides grounding in the social determinants of health through a health equity framework. Students will learn about health equity frameworks and how to integrate them into their public health practice and research.",
            "id": "PUBLHLTH 782",
            "parent": "PUBLHLTH",
            "title": "DETERMINANTS OF HEALTH AND HEALTH EQUITY: A SYSTEMS APPROACH"
        }
    },
    {
        "data": {
            "description": "An interprofessional course addressing evidence-based approaches to public health needs and issues and community health improvement. Features problem-based learning with a focus on emerging issues and opportunities to work with community-based public health practitioners.",
            "id": "PUBLHLTH 780",
            "parent": "PUBLHLTH",
            "title": "EVIDENCE-BASED DECISION-MAKING"
        }
    },
    {
        "data": {
            "description": "Addresses the interface between the practice of clinical medicine and evidence-based approaches to public health needs and issues and community health improvement.  A focus on emerging issues and opportunities to work with community-based public health practitioners while exploring career goals and the intersection between clinical medicine and public health.",
            "id": "PUBLHLTH 777",
            "parent": "PUBLHLTH",
            "title": "CLINICAL MEDICINE AND PUBLIC HEALTH"
        }
    },
    {
        "data": {
            "description": "Provides opportunities that facilitate learning in the areas of global health studies, engagement, and health data; ethics of global health engagement and international aid; global health research and quality improvement, including human subjects research and the IRB processes; and, international travel planning.  Presumes some background and understanding of basic principles of health and addresses topics at a graduate level.",
            "id": "PUBLHLTH 714",
            "parent": "PUBLHLTH",
            "title": "GLOBAL HEALTH FIELD WORK FUNDAMENTALS: ENGAGEMENT, ETHICS, POLICY, AND METHODS"
        }
    },
    {
        "data": {
            "source": "PUBLHLTH 780",
            "target": "PUBLHLTH 786"
        }
    },
    {
        "data": {
            "description": "Focuses on the fundamental characteristics of the public health and health care systems, including key factors in performance, organization, financing, and delivery of services in major sectors of the U.S. health care system.",
            "id": "PUBLHLTH 785",
            "parent": "PUBLHLTH",
            "title": "PUBLIC HEALTH AND HEALTH CARE SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Provides opportunities that facilitate learning in the areas of global health history and contemporary issues; global health frameworks, policies, and assessing and critically evaluating data; the socioecological model for global health, health equity and disparities; and, global health communication.  Presumes some background and understanding of basic principles of health and addresses topics at a graduate level.",
            "id": "PUBLHLTH 710",
            "parent": "PUBLHLTH",
            "title": "INTRODUCTION TO GLOBAL HEALTH: HISTORY, CURRENT ISSUES, AND HEALTH STATISTICS"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "A course carried with a UW-Madison study abroad program which has no equivalent on this campus. Current enrollment in a UW-Madison study abroad program.",
            "id": "PUBLHLTH 716",
            "parent": "PUBLHLTH",
            "title": "STUDY ABROAD GLOBAL HEALTH FIELD EXPERIENCE"
        }
    },
    {
        "data": {
            "id": "PUBLHLTH",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Exploration of current public health issues, interprofessional approaches and modes of communication within the MPH Program and the public health practice community. Content will advance students' analytic assessment, communication, and systems-thinking skills.",
            "id": "PUBLHLTH 781",
            "parent": "PUBLHLTH",
            "title": "COMMUNICATING PUBLIC HEALTH EFFECTIVELY I"
        }
    },
    {
        "data": {
            "description": "Master of Public Health students gain practical experience in a public health setting as outlined in their learning agreement.",
            "id": "PUBLHLTH 788",
            "parent": "PUBLHLTH",
            "title": "APPLIED PRACTICE EXPERIENCE"
        }
    },
    {
        "data": {
            "description": "Effective health information communication strategy. Using a theoretical foundation for communication, better understand the factors that influence how individuals form attitudes and beliefs about health topics. Strategically plan health messaging for diverse audiences. Lead small group discussions and provide constructive peer feedback.",
            "id": "PUBLHLTH 791",
            "parent": "PUBLHLTH",
            "title": "STRATEGIC HEALTH COMMUNICATION- THEORY AND PRACTICE"
        }
    },
    {
        "data": {
            "description": "Gain an understanding of the process of public policy development and an understanding of how and why health policies reflect the political system in which they are developed and implemented.",
            "id": "PUBLHLTH 792",
            "parent": "PUBLHLTH",
            "title": "PUBLIC HEALTH POLICY AND POLITICS"
        }
    },
    {
        "data": {
            "description": "Gain knowledge and skills in public health leadership attributes and style, communication, collaboration, negotiation, and advocacy, and a framework for advancing population health improvement within and across organizations. Explore the theories and principles of leadership, leadership styles and practices, and the skills and knowledge needed to be a public health leader.",
            "id": "PUBLHLTH 793",
            "parent": "PUBLHLTH",
            "title": "PUBLIC HEALTH LEADERSHIP"
        }
    },
    {
        "data": {
            "description": "A structured independent study experience to research a major global health issue, including interviews with local key informants, integrating previous educational experiences in global health.",
            "id": "PUBLHLTH 715",
            "parent": "PUBLHLTH",
            "title": "GLOBAL HEALTH ISSUE ANALYSIS"
        }
    }
]