[
    {
        "data": {
            "description": "A preparation and introductory math course for students enrolled in the Summer Collegiate Experience program. Includes material from precalculus and calculus and related topics depending on students' results on the math placement exam.",
            "id": "MATH 118",
            "parent": "MATH",
            "title": "SUMMER COLLEGIATE EXPERIENCE MATHEMATICS COURSE"
        }
    },
    {
        "data": {
            "description": "Covers the graphs, properties and geometric significance of trigonometric functions of a real variable. Other topics include trigonometric equations and identities, application, trigonometric form of complex numbers, DeMoivre's theorem, and polar and parametric equations. The course also has a significant number of applications, especially related to other disciplines.",
            "id": "MATH 113",
            "parent": "MATH",
            "title": "TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "A capstone course. In-depth exposure to the world of the residential builder/developer/subdivider and the necessary tools of analysis--market analysis, zoning/environmental and other entitlements, site planning and design, infrastructure/construction cost analysis, financing, feasibility analysis, deal structuring, renovation/rehabilitation, special needs housing.",
            "id": "REALEST 611",
            "parent": "REALEST",
            "title": "RESIDENTIAL PROPERTY DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "A capstone focused on advanced topics in commercial real estate finance. The course is broken into three parts: 1) Financial Derivatives, 2) Risk Management, and 3) Structured Finance. Lectures will address relevant topic areas and develop methodological skills. Industry professionals will provide real world markets perspective. case studies will be used to reinforce material presented in class.",
            "id": "REALEST 770",
            "parent": "REALEST",
            "title": "COMMERCIAL REAL ESTATE FINANCE"
        }
    },
    {
        "data": {
            "description": "A capstone focused on comprehensively underwriting commercial real estate. Investment analysis will be performed for a variety of real estate property types from the perspective of various real estate professionals, such as the property/asset manager, finance professional, leasing broker, acquisitions specialist, portfolio manager, and investment legal/risk team.  The investment analysis will emphasize the importance of value-creation through capital investment and effective income and expense management.",
            "id": "REALEST 530",
            "parent": "REALEST",
            "title": "REAL ESTATE INVESTMENT ANALYSIS"
        }
    },
    {
        "data": {
            "description": "A mathematical approach to the theory of consumption, production, pricing and resource allocation.",
            "id": "ECON 311",
            "parent": "ECON",
            "title": "INTERMEDIATE MICROECONOMIC THEORY - ADVANCED TREATMENT"
        }
    },
    {
        "data": {
            "description": "Advanced principles of real estate law related to ownership rights, negotiations, brokering, transfers, condominium law, financing, income tax law, real estate property taxation, bankruptcy law, construction and development contracts, and residential and commercial leases, and an overview of international legal systems.",
            "id": "REALEST 712",
            "parent": "REALEST",
            "title": "REAL ESTATE LAW"
        }
    },
    {
        "data": {
            "description": "An additional experiential learning in the areas of investment processes, guidelines, governance, underwriting, and portfolio analysis. Selected students will function as portfolio managers by investing real money (endowment to the real estate program) in listed real estate companies, primarily real estate investment trusts (REITs).",
            "id": "REALEST 842",
            "parent": "REALEST",
            "title": "APPLIED REAL ESTATE INVESTMENT TRACK (AREIT) II"
        }
    },
    {
        "data": {
            "description": "An overview of theoretical and empirical research on real estate, with a focus on real estate finance. The topics covered are intended to expose some of the major contributions in real estate research as well as a consideration of the current trends and methodological advances in recent papers.",
            "id": "REALEST 870",
            "parent": "REALEST",
            "title": "ADVANCED REAL ESTATE FINANCE THEORY"
        }
    },
    {
        "data": {
            "description": "Analysis of international real estate and related transaction issues, especially in foreign countries which are visited as part of the course; survey of land use patterns and regulations, ownership rights, types of leases, transfer procedures, mortgage system, tax matters, currency risks, and geographical diversification issues.",
            "id": "INTLBUS/REALEST 430",
            "title": "INTERNATIONAL REAL ESTATE"
        }
    },
    {
        "data": {
            "description": "Analysis of spatial relationships in the urban economy, including urban land, labor and housing markets; urban transport; city governance and finance; and regional models. Historical and applied focus. Interdisciplinary approach emphasizing economics, geography, and planning.",
            "id": "REALEST/URBRPL 720",
            "title": "URBAN ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Analyze current issues in real estate law with respect to the acquisition, leasing, financing, and development of real estate projects.  Explore topics in the context of specific development projects across the US.",
            "id": "REALEST 760",
            "parent": "REALEST",
            "title": "LAWYERING THE DEVELOPMENT DEAL: A PRACTICAL GUIDE TO REAL ESTATE LAW"
        }
    },
    {
        "data": {
            "description": "Analyzes current issues in real estate law with a focus on the acquisition, leasing, financing, and development of real estate projects.  Includes a big picture view of these topics as well as analyzing them in the specific context of various development deals underway across the United States.",
            "id": "REALEST 425",
            "parent": "REALEST",
            "title": "REAL ESTATE LAW"
        }
    },
    {
        "data": {
            "description": "Concepts and techniques in corporate finance and investments. Topics include the financial environment, securities markets, financial markets, financial statements and analysis, working capital management, capital budgeting, cost of capital, dividend policy, asset valuation, investments, decision-making under uncertainty, mergers, options, and futures.",
            "id": "ECON/FINANCE 300",
            "title": "INTRODUCTION TO FINANCE"
        }
    },
    {
        "data": {
            "description": "Contemporary theory of consumption, production, pricing and resource allocation.",
            "id": "ECON 301",
            "parent": "ECON",
            "title": "INTERMEDIATE MICROECONOMIC THEORY"
        }
    },
    {
        "data": {
            "description": "Continuation ofMATH 171. Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Completion ofMATH 217implies completion ofMATH 221and114.",
            "id": "MATH 217",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY II"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Creating industrial real estate, office space, shopping centers, and hotel/recreation facilities, including strategy, market and feasibility analysis, site planning/design, capital cost analysis, construction, and financial structuring. Emphasis on case studies and project analysis.",
            "id": "REALEST 750",
            "parent": "REALEST",
            "title": "COMMERCIAL PROPERTY DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Economic problems of individuals, firms and industries with emphasis on value, price, and distribution of income.",
            "id": "ECON 101",
            "parent": "ECON",
            "title": "PRINCIPLES OF MICROECONOMICS"
        }
    },
    {
        "data": {
            "description": "Economic theory (location and growth) applicable to community economic development; the role of private and public sector in local economic development, and techniques for economic analysis of community.",
            "id": "AAE/REALEST/URBRPL 520",
            "title": "COMMUNITY ECONOMIC ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "Evaluating the role of financing and leverage in real estate investment analysis; identifying alternative types of financing; valuation of financial structure; sources of equity financing for real estate; mortgage securitization and the operation of secondary mortgage markets.",
            "id": "REALEST 710",
            "parent": "REALEST",
            "title": "REAL ESTATE FINANCE"
        }
    },
    {
        "data": {
            "description": "Examines both financial and managerial accounting for business decisions. Emphasizes preparation and interpretation of financial statements, analysis of financial information, determination of costs for products and services, and use of accounting information for planning and control of business operations.",
            "id": "ACCTIS 300",
            "parent": "ACCTIS",
            "title": "ACCOUNTING PRINCIPLES"
        }
    },
    {
        "data": {
            "description": "Examines generally accepted accounting principles for measurement and reporting of financial information in a balance sheet, income statement, and statement of cash flows; introduction to analysis and interpretation of financial accounting data for decision-making purposes.",
            "id": "ACCTIS 100",
            "parent": "ACCTIS",
            "title": "INTRODUCTORY FINANCIAL ACCOUNTING"
        }
    },
    {
        "data": {
            "description": "Exploration of advanced subject areas possibly to be introduced into the business curriculum.",
            "id": "REALEST 765",
            "parent": "REALEST",
            "title": "CONTEMPORARY TOPICS"
        }
    },
    {
        "data": {
            "description": "Exploration of subject areas possibly to be introduced into the business curriculum.",
            "id": "REALEST 365",
            "parent": "REALEST",
            "title": "CONTEMPORARY TOPICS"
        }
    },
    {
        "data": {
            "description": "Explore cutting-edge research on urban economics and real estate being conducted across different universities. Invited speakers will describe current or past research, identify challenges involved in their work, and highlight research conceptualization, approaches, methods, and/or data analysis, to better understand how to execute a research project.",
            "id": "REALEST 978",
            "parent": "REALEST",
            "title": "RESEARCH SEMINAR IN REAL ESTATE AND URBAN LAND ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Focuses heavily on building the investment pipeline, analyzing and underwriting new real estate private placement investments, understanding the governance structures, and benchmarking Fund investment returns to industry standards. Investments opportunities that meet investment criteria expectations will be presented to an external Investment Committee of the Wisconsin Real Estate Alumni Association.",
            "id": "REALEST 852",
            "parent": "REALEST",
            "title": "PRIVATE REAL ESTATE EQUITY INVESTMENT III: GUIDELINES, GOVERNANCE, AND PORTFOLIOS"
        }
    },
    {
        "data": {
            "description": "Focuses on investment processes, guidelines, governance, underwriting, company valuation, sector analysis and portfolio analysis.  Allows selected students to function as portfolio managers by investing real money (endowment to the real estate program) in listed real estate companies, primarily real estate investment trusts (REITs).",
            "id": "REALEST 841",
            "parent": "REALEST",
            "title": "APPLIED REAL ESTATE INVESTMENT TRACK (AREIT) I"
        }
    },
    {
        "data": {
            "description": "Focuses on the real estate private equity organization through constructing investment criteria statements, vetting investment opportunities, implementing investment processes, and presenting the opportunities to the WREAA Fund Investment Committee.",
            "id": "REALEST 851",
            "parent": "REALEST",
            "title": "PRIVATE REAL ESTATE EQUITY INVESTMENT II:  UNDERWRITING AND INVESTMENT PROCESSES"
        }
    },
    {
        "data": {
            "description": "Focuses on the study of the allocation of scarce resources across space. Uses economic methods to analyze urban real  estate. Topics covered include the determinants of real estate values, the location decisions  of households and firms, land use, urban growth and agglomeration, real estate pricing, cycles, development, housing market and policies, and sustainable development.",
            "id": "ECON/REALEST/URBRPL 420",
            "title": "URBAN AND REGIONAL ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Fundamentals of real estate finance and investment. Qualitative and quantitative characteristics of commercial real estate. Developing and analyzing commercial property cash flow projections. Introduction to three approaches to valuation with emphasis on investing in commercial real estate. In-depth exposure to debt and equity investor returns.",
            "id": "REALEST 410",
            "parent": "REALEST",
            "title": "REAL ESTATE FINANCE"
        }
    },
    {
        "data": {
            "description": "Individual work suited to the needs of Ph.D. students may be arranged both during regular sessions and during the intersession periods.",
            "id": "REALEST 999",
            "parent": "REALEST",
            "title": "READING AND RESEARCH-REAL ESTATE PHD"
        }
    },
    {
        "data": {
            "description": "Individual work suited to the needs of graduate students may be arranged both during regular sessions and the intersession periods.",
            "id": "REALEST 799",
            "parent": "REALEST",
            "title": "READING AND RESEARCH-URBAN LAND ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Individual work suited to the needs of undergraduate students.",
            "id": "REALEST 399",
            "parent": "REALEST",
            "title": "READING AND RESEARCH-URBAN LAND ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Individual work to complete dissertation requirement of Ph.D. program.",
            "id": "REALEST 990",
            "parent": "REALEST",
            "title": "REAL ESTATE INDEPENDENT RESEARCH PHD THESIS"
        }
    },
    {
        "data": {
            "description": "Institutional background of real property; economics of urbanization, supply and demand; building industry, real estate credit, cyclical fluctuation, rents and prices, real estate market analysis; city growth, structure and planning, land use control, urban redevelopment and real estate investment analysis.",
            "id": "REALEST 706",
            "parent": "REALEST",
            "title": "THE REAL ESTATE PROCESS"
        }
    },
    {
        "data": {
            "description": "Integrated treatment of macroeconomics and microeconomics (seeECON 101andECON 102). Accelerated approach to economics training, especially for Economics: Math Emphasis majors.",
            "id": "ECON 111",
            "parent": "ECON",
            "title": "PRINCIPLES OF ECONOMICS-ACCELERATED TREATMENT"
        }
    },
    {
        "data": {
            "description": "Intended for students who have an interest in Green and Sustainable aspects of housing and commercial property development and operation, the re-use and/or rehabilitation of existing structures, redevelopment of historic buildings into housing or commercial space and related special topics such as financing sources, tax issues, financial structuring, legal issues and energy cost management.",
            "id": "REALEST 651",
            "parent": "REALEST",
            "title": "GREEN - SUSTAINABLE DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Introduction to analysis of economic data. The techniques of descriptive statistics and statistical inference (hypothesis testing and estimation) as directed toward application in economic research.",
            "id": "ECON 310",
            "parent": "ECON",
            "title": "STATISTICS: MEASUREMENT IN ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Introduction to economic ways of thinking about a wide range of problems and issues. Topics include consumption, production, prices, markets, finance, trade, pollution, growth, farms, taxes, and development.",
            "id": "AAE 101",
            "parent": "AAE",
            "title": "INTRODUCTION TO AGRICULTURAL AND APPLIED ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Introduction to real estate modeling using ARGUS. ARGUS will be used to build a real estate model for acquisition transactions for office and retail mall properties. In addition, learn how to input assumptions, make decisions using reports, perform sensitivity analysis on model inputs and explain terminology used in Office and Retail real estate.",
            "id": "REALEST 412",
            "parent": "REALEST",
            "title": "REAL ESTATE ARGUS MODELING"
        }
    },
    {
        "data": {
            "description": "Introduction to real estate modeling. Building a real estate model for acquisition and development transactions for residential and commercial real estate using Excel.  How to source market data, draw assumptions from market data, input assumptions, make decisions using reports, perform sensitivity analysis on model inputs, and explain terminology used in residential and commercial real estate.",
            "id": "REALEST 411",
            "parent": "REALEST",
            "title": "REAL ESTATE EXCEL MODELING"
        }
    },
    {
        "data": {
            "description": "Introduction to real estate private equity investment focused on the analysis, terms, return metrics, and structures used to make real estate private equity investment decisions.",
            "id": "REALEST 550",
            "parent": "REALEST",
            "title": "PRIVATE REAL ESTATE EQUITY INVESTMENT I: ANALYSIS AND STRUCTURES"
        }
    },
    {
        "data": {
            "description": "Introduction to static property income proforma and dynamic property discounted cash flow analysis. Applied learning from active real estate private equity offering memoranda. Analyze capital investments across the real estate risk spectrum from low-risk core income-producing properties to value-add opportunities to high-risk development and redevelopment investments.",
            "id": "REALEST 703",
            "parent": "REALEST",
            "title": "REAL ESTATE INVESTMENT ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Introduction to the survey of institutional context, economics of urbanization, historical pattern and structure of city growth, and public policy issues regarding urban environment and business management. Decision-making processes for the manufacture, marketing, management, and financing of real estate space.",
            "id": "REALEST 701",
            "parent": "REALEST",
            "title": "THE REAL ESTATE PROCESS"
        }
    },
    {
        "data": {
            "description": "Introduction to various techniques to analyze commercial real estate value and investment risks. Analysis of real property through an understanding of the legal, physical, and economic characteristics of a site and building. Analyze real estate markets to forecast future rental income and vacancies. Develop an operating pro forma and basic investment model, forecast future cash flows, and learn to estimate the market value of commercial properties.",
            "id": "REALEST 702",
            "parent": "REALEST",
            "title": "COMMERCIAL PROPERTY ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Introductory overview focused on the key aspects of the real estate process: developing real estate, permitting real estate, buying and selling real estate, understanding the economics of real estate, financing real estate, valuing real estate, leasing real estate, and managing real estate.",
            "id": "AAE/ECON/REALEST/URBRPL 306",
            "title": "THE REAL ESTATE PROCESS"
        }
    },
    {
        "data": {
            "description": "Macroeconomic measurement and models of aggregate demand and supply; fiscal and monetary policy for unemployment, inflation, and growth.",
            "id": "ECON 102",
            "parent": "ECON",
            "title": "PRINCIPLES OF MACROECONOMICS"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Provides an overview of theoretical and empirical research on real estate and urban economics, with a focus on asset liquidity and place-based policies.",
            "id": "REALEST 875",
            "parent": "REALEST",
            "title": "ADVANCED URBAN LAND ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Real-world capstone experience of the real estate investment process from project conception to asset disposition with particular focus on analysis and presentation. Provides exposure to best known methods and practices that private equity and development firms use to conduct market research, project selection, financial feasibility, regulatory review, design considerations, construction management, debt financing, equity placements, equity waterfalls, property management, asset management and disposition. Develop an interdisciplinary understanding of the many facets of the acquisition and development process in the U.S. and have an insightful understanding of the risks and rewards along each step of the process.",
            "id": "REALEST 661",
            "parent": "REALEST",
            "title": "REAL ESTATE INVESTMENT ANALYSIS AND PRESENTATION"
        }
    },
    {
        "data": {
            "description": "Techniques of real estate valuation. Property analysis, market analysis, legal and political analysis, and highest and best use analysis; in-depth exposure to the three approaches to valuation; sales comparison, income, and cost; application to main commercial property types; the role of valuation in real estate investment.",
            "id": "REALEST 415",
            "parent": "REALEST",
            "title": "VALUATION OF REAL ESTATE"
        }
    },
    {
        "data": {
            "description": "The objective of this course is to refine the quantitative skills necessary to succeed in intermediate- and advanced-level economics courses. The principle focus will be on applying the skills acquired in your math courses to the questions, models, and optimization problems that are common in economics. Topics include specific economic applications of algebra, financial mathematics, and calculus.",
            "id": "ECON 205",
            "parent": "ECON",
            "title": "QUANTITATIVE TOOLS FOR ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Thorough discussion of how public real estate investment products such as Mortgage-Backed Securities (MBS) and Real Estate Investment Trusts (REIT) are structured and how investors price them. Exploration of key strategic considerations for institutional investors in their real estate investments. Analysis of the equity side of real estate, review of mortgage math, analysis of MBS and real estate equity investments by looking at specific REITs.",
            "id": "REALEST 640",
            "parent": "REALEST",
            "title": "REAL ESTATE CAPITAL MARKETS"
        }
    },
    {
        "data": {
            "description": "Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Part of a 2-semester sequence withMATH 217; these two courses together are equivalent toMATH 114and221.",
            "id": "MATH 171",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY I"
        }
    },
    {
        "data": {
            "description": "Topics include highest and best use and most probable use analysis, statistical methods for developing adjustment factors and comparable selection for the market comparison approach, discounted cash flow analysis and income capitalization, and cost approach methods. Issues in appraisal ethics and federal requirements for appraisal practice.",
            "id": "REALEST 715",
            "parent": "REALEST",
            "title": "TECHNIQUES OF REAL ESTATE VALUATION"
        }
    },
    {
        "data": {
            "description": "Understanding and applying both investment and real estate concepts to the Real Estate Investment Trust (REIT) market.  Emphasis is on applying investment and real estate concepts to a specific REIT.",
            "id": "REALEST 540",
            "parent": "REALEST",
            "title": "PUBLIC REAL ESTATE EQUITY INVESTMENT"
        }
    },
    {
        "data": {
            "id": "AAE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ACCTIS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ECON",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "REALEST",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "AAE 101",
            "target": "AAE/ECON/REALEST/URBRPL 306"
        }
    },
    {
        "data": {
            "source": "AAE/ECON/REALEST/URBRPL 306",
            "target": "INTLBUS/REALEST 430"
        }
    },
    {
        "data": {
            "source": "AAE/ECON/REALEST/URBRPL 306",
            "target": "REALEST 410"
        }
    },
    {
        "data": {
            "source": "ACCTIS 100",
            "target": "ACCTIS 300"
        }
    },
    {
        "data": {
            "source": "ACCTIS 300",
            "target": "ACCTIS 100"
        }
    },
    {
        "data": {
            "source": "ACCTIS 300",
            "target": "ECON/FINANCE 300"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON 102"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON 301"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON/REALEST/URBRPL 420"
        }
    },
    {
        "data": {
            "source": "ECON 102",
            "target": "ECON 111"
        }
    },
    {
        "data": {
            "source": "ECON 102",
            "target": "ECON 205"
        }
    },
    {
        "data": {
            "source": "ECON 102",
            "target": "ECON 310"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON 101"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON 102"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON 311"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON/FINANCE 300"
        }
    },
    {
        "data": {
            "source": "ECON 205",
            "target": "ECON 301"
        }
    },
    {
        "data": {
            "source": "ECON 301",
            "target": "AAE/REALEST/URBRPL 520"
        }
    },
    {
        "data": {
            "source": "ECON 301",
            "target": "ECON 311"
        }
    },
    {
        "data": {
            "source": "ECON 301",
            "target": "REALEST 706"
        }
    },
    {
        "data": {
            "source": "ECON 310",
            "target": "ECON/FINANCE 300"
        }
    },
    {
        "data": {
            "source": "ECON 311",
            "target": "ECON 301"
        }
    },
    {
        "data": {
            "source": "ECON 311",
            "target": "REALEST/URBRPL 720"
        }
    },
    {
        "data": {
            "source": "ECON/FINANCE 300",
            "target": "REALEST 410"
        }
    },
    {
        "data": {
            "source": "ECON/FINANCE 300",
            "target": "REALEST 540"
        }
    },
    {
        "data": {
            "source": "ECON/REALEST/URBRPL 420",
            "target": "REALEST 425"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 113"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 113",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "MATH 217"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "ECON 310"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 217",
            "target": "ECON 205"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "ECON 111"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "REALEST 410",
            "target": "REALEST 411"
        }
    },
    {
        "data": {
            "source": "REALEST 410",
            "target": "REALEST 415"
        }
    },
    {
        "data": {
            "source": "REALEST 410",
            "target": "REALEST 425"
        }
    },
    {
        "data": {
            "source": "REALEST 410",
            "target": "REALEST 540"
        }
    },
    {
        "data": {
            "source": "REALEST 410",
            "target": "REALEST 611"
        }
    },
    {
        "data": {
            "source": "REALEST 410",
            "target": "REALEST 640"
        }
    },
    {
        "data": {
            "source": "REALEST 410",
            "target": "REALEST 661"
        }
    },
    {
        "data": {
            "source": "REALEST 410",
            "target": "REALEST 841"
        }
    },
    {
        "data": {
            "source": "REALEST 411",
            "target": "REALEST 412"
        }
    },
    {
        "data": {
            "source": "REALEST 411",
            "target": "REALEST 415"
        }
    },
    {
        "data": {
            "source": "REALEST 411",
            "target": "REALEST 661"
        }
    },
    {
        "data": {
            "source": "REALEST 415",
            "target": "REALEST 530"
        }
    },
    {
        "data": {
            "source": "REALEST 415",
            "target": "REALEST 550"
        }
    },
    {
        "data": {
            "source": "REALEST 415",
            "target": "REALEST 611"
        }
    },
    {
        "data": {
            "source": "REALEST 425",
            "target": "REALEST 530"
        }
    },
    {
        "data": {
            "source": "REALEST 540",
            "target": "REALEST 841"
        }
    },
    {
        "data": {
            "source": "REALEST 550",
            "target": "REALEST 851"
        }
    },
    {
        "data": {
            "source": "REALEST 710",
            "target": "REALEST 750"
        }
    },
    {
        "data": {
            "source": "REALEST 710",
            "target": "REALEST 770"
        }
    },
    {
        "data": {
            "source": "REALEST 715",
            "target": "REALEST 750"
        }
    },
    {
        "data": {
            "source": "REALEST 841",
            "target": "REALEST 842"
        }
    },
    {
        "data": {
            "source": "REALEST 851",
            "target": "REALEST 852"
        }
    }
]