[
    {
        "data": {
            "description": "Explores themes significant to the impact of religion on women and women on religion, historically and today, across a diverse range of contexts.",
            "id": "GEN&WS/RELIGST 305",
            "title": "WOMEN, GENDER AND RELIGION"
        }
    },
    {
        "data": {
            "description": "Independent research undertaken by students in the honors program.",
            "id": "RELIGST 682",
            "parent": "RELIGST",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Individual tutorial on topics in religious studies.",
            "id": "RELIGST 999",
            "parent": "RELIGST",
            "title": "INDEPENDENT WORK"
        }
    },
    {
        "data": {
            "description": "Topics in historical or contemporary religious culture and society pertaining to persistently marginalized racial or ethnic groups in the United States.",
            "id": "RELIGST 403",
            "parent": "RELIGST",
            "title": "TOPICS IN RELIGIOUS STUDIES-US ETHNIC STUDIES"
        }
    },
    {
        "data": {
            "description": "Explores the range of relationships between DNA and American Jewish life. It begins with the \"prehistory\" of the relationship between Jewishness and genetic science, from Biblical genealogies to early twentieth century racial science. It then turns to America in the second half of the twentieth century, when the discovery of the double helix and the atrocities of Auschwitz reinvigorated and reshaped American Jewish relationships to DNA.",
            "id": "JEWISH/RELIGST 340",
            "title": "THE AMERICAN JEWISH LIFE OF DNA"
        }
    },
    {
        "data": {
            "source": "POLISCI 120",
            "target": "POLISCI 182"
        }
    },
    {
        "data": {
            "description": "Explore African Muslim communities and Black Muslim communities in the US as an under-examined archive of Islamic authenticity and authority. Involves close readings of ethnographies, fiction, films, and other forms of cultural expression and examination of the practice of Islam and representation of Muslims in Africa and Muslims of African ancestry in the US. Through both primary and secondary sources, explore themes of not just authenticity and authority but also related issues of representation, positionality, difference, otherness, essentialism, and normativity. Ultimately, form a deeper understanding of the diversity and complexity of Islam and Muslims of African ancestry.",
            "id": "AFRICAN/RELIGST 414",
            "title": "ISLAM IN AFRICA AND THE DIASPORA"
        }
    },
    {
        "data": {
            "source": "POLISCI 182",
            "target": "POLISCI 120"
        }
    },
    {
        "data": {
            "description": "Explore the diverse lived experiences of religion in Africa, examine the role of religion in shaping individual and communal identities, and understand the complex ways in which religion is practiced, experienced, and expressed in various African contexts.",
            "id": "AFRICAN/RELIGST 408",
            "title": "EVERYDAY RELIGION IN AFRICA"
        }
    },
    {
        "data": {
            "description": "A historical survey of Hindu scriptures, rituals, philosophies, and ethics from the ancient to the contemporary world. Concepts such as karma, yoga, and reincarnation will be put in the broader contexts of Hindu theism, worship, and law. Not open to students who completed RELIG ST 355 prior to Fall 2019.",
            "id": "ASIAN/RELIGST 306",
            "title": "HINDUISM"
        }
    },
    {
        "data": {
            "description": "Introduction to Comparative Politics, one of the four sub-fields in Political Science, which involves the comparative analysis of political institutions, processes, and outcomes at the national level. Examines how to usefully compare politics in a variety of countries and makes comparisons explicit and systematic in order to determine how governments work, how power is organized and contested at the national level, and how regular people can participate and pursue their interests in different political settings. Includes key concepts, theories, methods, issues, and language.",
            "id": "POLISCI 120",
            "parent": "POLISCI",
            "title": "INTRODUCTION TO COMPARATIVE POLITICS"
        }
    },
    {
        "data": {
            "description": "Examines theories and practices related to the role of religion in public schooling and its accompanying tensions: political and philosophical, practical and personal.",
            "id": "CURRIC/EDPOL/RELIGST 516",
            "title": "RELIGION AND PUBLIC EDUCATION"
        }
    },
    {
        "data": {
            "id": "ANTHRO",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Covers the major issues in international relations since the end of World War II including: the causes of war; civil wars and ethnic conflict; economic development; international trade; exchange rates and international monetary relations; international capital flows and financial crises; foreign direct investment; globalization and the environment; the UN, the IMF, World Bank, WTO, and other international organizations; and international law and human rights. The focus is on states' relations with each other and the factors determining the nature and outcomes of these international interactions. The course seeks to develop analytical tools for thinking about important questions in world politics regardless of the countries or issues involved, to examine international affairs in a systematic way. Students who have taken POLI SCI 103 prior to Fall 2017 may not enroll in this course.",
            "id": "POLISCI 140",
            "parent": "POLISCI",
            "title": "INTRODUCTION TO INTERNATIONAL RELATIONS"
        }
    },
    {
        "data": {
            "description": "As the saying goes, money can't buy happiness -- but in modern America, we certainly try. This course will provide an overview of the study of happiness and well-being, examine how consumers engage in consumption in pursuit of happiness, as well as explore the emergence of the experience economy, and the intersection of money and well-being. Students will read academic and popular pieces on positive psychology, prosocial spending and explore the psychology of persuasion in the promises associated with this industry. In addition to integrating visual media, students will have the opportunity to experience first-hand whether the advice works in their own lives.",
            "id": "CNSRSCI/RELIGST 173",
            "title": "CONSUMING HAPPINESS"
        }
    },
    {
        "data": {
            "description": "Introduction to cultural anthropology. Comparative cross-cultural consideration of social organization, economics, politics, language, religion, ecology, gender, and cultural change. Includes a primary focus on U.S. ethnic and racial minorities.",
            "id": "ANTHRO 104",
            "parent": "ANTHRO",
            "title": "CULTURAL ANTHROPOLOGY AND HUMAN DIVERSITY"
        }
    },
    {
        "data": {
            "description": "A comparative, thematic exploration of major Christian theological ideas and their relationships to practices across varieties of Christianity and contexts.",
            "id": "RELIGST 302",
            "parent": "RELIGST",
            "title": "CHRISTIANITY: INTERPRETATION AND PRACTICE"
        }
    },
    {
        "data": {
            "description": "Study of John Milton's poems and selected prose.",
            "id": "ENGL/RELIGST 434",
            "title": "MILTON"
        }
    },
    {
        "data": {
            "description": "Focuses on literature about Francis of Assisi, from medieval accounts to contemporary literature, and related artistic portrayals of St. Francis as a religious symbol and model for economic, political and environmental justice.",
            "id": "ITALIAN/MEDIEVAL/RELIGST 440",
            "title": "POVERTY, ECOLOGY AND THE ARTS: ST. FRANCIS OF ASSISI"
        }
    },
    {
        "data": {
            "description": "Introduces some of the most important deities of South Asia through visual representation, mythical narratives and rituals of worship. Topics include the development of iconographic forms and concepts, masculine and feminine aspects of the divine, the belief in human embodiments of divinities, the phenomenon of possession, modes of domestic and public worship and the symbolism of the temple structure.",
            "id": "ASIAN/RELIGST 405",
            "title": "GODS AND GODDESSES OF SOUTH ASIA"
        }
    },
    {
        "data": {
            "description": "A survey of major trends in Western intellectual history and religious thought in the modern era, a period that saw a new range of competing ideas about the divine, the human condition, justice and the social order, and the quest for meaning. Explores shifts in Christian and Jewish thought as well as secular alternatives to religious outlooks. Topics include the impact of the Reformation, Scientific Revolution, and Enlightenment; radical critiques of religion; existentialism; theological responses to World Wars and the Holocaust; and civil rights and social justice. Sources include films, novels, autobiographies, essays, theological works, and political manifestos.",
            "id": "HISTORY/RELIGST 209",
            "title": "WESTERN INTELLECTUAL AND RELIGIOUS HISTORY SINCE 1500"
        }
    },
    {
        "data": {
            "description": "A survey of Christianity from being a small, persecuted sect in the Roman Empire to becoming the dominant religion of western Europe, penetrating into the lives of Europeans, fissuring into multiple churches, and spreading across the globe. Attention is given to doctrine, ritual, worship, architecture, images, and music.",
            "id": "HISTORY/RELIGST 212",
            "title": "THE HISTORY OF WESTERN CHRISTIANITY TO 1750"
        }
    },
    {
        "data": {
            "description": "Development of society and culture in the Middle East and North Africa from the emergence of Islam (7th century) to early modern times.",
            "id": "HISTORY/RELIGST 205",
            "title": "THE MAKING OF THE ISLAMIC WORLD: THE MIDDLE EAST, 500-1500"
        }
    },
    {
        "data": {
            "description": "Analysis of religious experience and activity, and examination of principal religious ideas in light of modern psychology, philosophy, science, and anthropology.",
            "id": "PHILOS/RELIGST 501",
            "title": "PHILOSOPHY OF RELIGION"
        }
    },
    {
        "data": {
            "description": "Foundational and thematic approaches in the academic study of religion applied across global religious systems.",
            "id": "RELIGST 101",
            "parent": "RELIGST",
            "title": "RELIGION IN GLOBAL PERSPECTIVE"
        }
    },
    {
        "data": {
            "source": "RELIGST 101",
            "target": "POLISCI/RELIGST 433"
        }
    },
    {
        "data": {
            "description": "Introductory survey of Hinduism, Buddhism, Islam, Sikhism, etc., and an examination of the cultural, historical, ritual, and philosophical foundations of South Asian religion. Not open to students with credit for LCA 274 prior to Fall 2019.",
            "id": "ASIAN/RELIGST 274",
            "title": "RELIGION IN SOUTH ASIA"
        }
    },
    {
        "data": {
            "description": "Jewish literature from 350 BCE to 150 CE. The Greek and Hebrew sources include stories, religious poetry, wisdom books and apocalyptic texts. Readings (in translation) from the Apocrypha, Pseudepigrapha, and the Dead Sea Scrolls in their historical, cultural and literary setting.",
            "id": "CLASSICS/JEWISH/RELIGST 346",
            "title": "JEWISH LITERATURE OF THE GRECO-ROMAN PERIOD"
        }
    },
    {
        "data": {
            "description": "Explores literary forms through which religions originating in western culture convey ideas. Focuses on Jewish, Christian, Muslim and related religious texts.",
            "id": "ILS/RELIGST 234",
            "title": "GENRES OF WESTERN RELIGIOUS WRITING"
        }
    },
    {
        "data": {
            "description": "How does the study of religion affect the ways we interpret the past? Can we ever recover and understand the beliefs and values held by people who lived in different countries and previous centuries? Draws on the disciplines of religious studies, history and literature to evaluate the different frameworks that scholars have used in their investigations of women's spiritual writing during the turbulent English civil wars (1642-1660). Unable to fight with swords or speak out in church because they were denied ordination, women raised their pens to express their partisanship in the conflict. Positioning themselves as faithful spouses and devout Christians, these women endorsed religious injunctions about feminine modesty and spirituality at the same time as they secretly worked as messengers and spies. Involves some discussion of violence concerning the ways in which this period of conflict and religious turmoil paradoxically accorded some women a powerful literary voice.",
            "id": "RELIGST 320",
            "parent": "RELIGST",
            "title": "PROPHETS AND POETS: WOMEN, WRITING AND RELIGION IN A TIME OF WAR, 1642-1660"
        }
    },
    {
        "data": {
            "description": "An introduction to the Qur'an, the sacred scripture of the Islamic religious tradition, focused on Muslim approaches to reading the text, its themes and history, and its use as a source of law, theology, aesthetics, politics, and practices of piety.",
            "id": "ASIAN/RELIGST 206",
            "title": "THE QUR'AN: RELIGIOUS SCRIPTURE & LITERATURE"
        }
    },
    {
        "data": {
            "description": "A comparative study of the foundation and development of five great cities in the history of Islam: Cairo, Istanbul, Delhi, Mecca, and Isfahan. Architectural projects, ornamental idioms, and changes to the urban plan are studied from aesthetic and cultural perspectives. Integrates historical and religious studies to highlight the shifting nature of Islamic culture, from the tenth century CE to the present.",
            "id": "ARTHIST/RELIGST 373",
            "title": "GREAT CITIES OF ISLAM"
        }
    },
    {
        "data": {
            "description": "Independent research undertaken by students in the honors program.",
            "id": "RELIGST 681",
            "parent": "RELIGST",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "source": "CLASSICS/JEWISH/LITTRANS/RELIGST 227",
            "target": "CLASSICS/HEBR-BIB/JEWISH/LITTRANS/RELIGST 332"
        }
    },
    {
        "data": {
            "description": "By conventional reckoning, Paul was a major contributor to the development of Christianity. Analyzes both Paul's and other contemporary writings to assess the extent to which he contributed to the development of the early church.",
            "id": "RELIGST 361",
            "parent": "RELIGST",
            "title": "EARLY CHRISTIAN LITERATURE: PAULINE CHRISTIANITY"
        }
    },
    {
        "data": {
            "description": "Explores evidence of belief in the supernatural in the modern world as it appears in the context of folk religion, folk medicine, legends, folk drama, ritual and custom, and media accounts and presentations. Surveys scholarly approaches to the topic. Course not available to students with credits for Folklore 415 before Fall 2023.",
            "id": "FOLKLORE/RELIGST 326",
            "title": "THE SUPERNATURAL IN THE MODERN WORLD"
        }
    },
    {
        "data": {
            "description": "Takes up the question: What is the \"Sabbath\"? What does it mean \"to rest\"? Offers a broad, comparative introduction to the history of the Sabbath, from the Bible to the present day. Readings encompass a range of textual sources from the Jewish and Christian traditions. Topics include the major theological, ritual, and cultural practices that have developed around the Sabbath. Discuss contemporary political iterations of the Sabbath in modern, secular contexts.",
            "id": "JEWISH/RELIGST 322",
            "title": "THE SABBATH"
        }
    },
    {
        "data": {
            "description": "Explore the intersections of religiosity and queerness, including the role of religion in the lives of LGBTQ+ individuals and communities, the role of queerness and LGBTQ inclusion in various religious traditions, and what queerness can add to the study of religion (and vice versa).",
            "id": "GEN&WS/RELIGST 202",
            "title": "QUEERING RELIGION"
        }
    },
    {
        "data": {
            "description": "By studying the distinctively Tibetan forms of Buddhism, we also examine more general issues, such as the relationship between theory and practice, ancient meditation and mind training, the politics of \"world making\", and the connection between identity and experience. Not open to students with credit for LCA 421 prior to Fall 2019.",
            "id": "ASIAN/RELIGST 307",
            "title": "A SURVEY OF TIBETAN BUDDHISM"
        }
    },
    {
        "data": {
            "description": "An introduction to the study of religion through the lens of sacred places and journeys, including pilgrimage.",
            "id": "FOLKLORE/RELIGST 104",
            "title": "SACRED PLACES AND JOURNEYS"
        }
    },
    {
        "data": {
            "description": "An introduction to the study of religion through the lens of health and health through the lens of religion employing approaches from the humanities and social sciences in conversation with health-related disciplines. It asks questions such as, How do religious peoples understand and live in sickness and health? How do people connect physical well-being to spiritual well-being? Medicine to meaning-making? How does looking at religion in sickness and health provide insight into its roles in a variety of cultures and contexts, globally and locally? How do health and religion connect particularly in situations of social marginalization and immigration? How does religion impact understandings of health and sickness beyond the borders of specific religious communities?",
            "id": "RELIGST 102",
            "parent": "RELIGST",
            "title": "EXPLORING RELIGION IN SICKNESS AND HEALTH"
        }
    },
    {
        "data": {
            "description": "The basic thought, practices and history of Buddhism, including selflessness and relativity, practices of meditation, merit- making and compassion from both local and translocal perspectives. Includes a discussion of Buddhism as a contemporary, North American religion. Not open to students with credit for E ASIAN or LCA 308 prior to Fall 2019.",
            "id": "ASIAN/HISTORY/RELIGST 308",
            "title": "INTRODUCTION TO BUDDHISM"
        }
    },
    {
        "data": {
            "description": "Explores how different cultures in Asia conceive of and relate to the monstrous, ghostly, and divine, both in the past and in the contemporary world. These themes are approached from a range of different disciplinary perspectives, including religious studies, literature, anthropology, and history.",
            "id": "ASIAN/RELIGST 236",
            "title": "ASIA ENCHANTED: GHOSTS, GODS, AND MONSTERS"
        }
    },
    {
        "data": {
            "description": "Mythology, literature, ritual, traditions, medieval folklore, and religion from Nordic areas and Scandinavia.",
            "id": "FOLKLORE/MEDIEVAL/RELIGST/SCANDST 342",
            "title": "NORDIC MYTHOLOGY"
        }
    },
    {
        "data": {
            "description": "The emergence and development of Islam; schism; theology; asceticism; speculative and popular mysticism; literatures in diverse Islamic languages. Not open to students with credit for LCA 370 prior to Fall 2019.",
            "id": "AFRICAN/ASIAN/RELIGST 370",
            "title": "ISLAM: RELIGION AND CULTURE"
        }
    },
    {
        "data": {
            "description": "Explores the relationships and interactions between religion and politics from a comparative perspective. Discuss the appropriate relationship between religion and state. Investigate the implications of the various ways in which the religion-state relationship have been involved in political conflict. Building on this, turn to several of the current issues in religion and politics asking: Why is religion apparently more important than ever despite an increasingly secular world? What is religious nationalism? What is fundamentalism? How can we explain the similarities and differences between religious fundamentalist movements across the globe? How should democratic states cope with the emergence of fundamentalist movements? In order to begin answering these questions,  integrate the theoretical frameworks we develop with explorations of the historical and local context of relevant case-studies from around the world.",
            "id": "POLISCI/RELIGST 433",
            "title": "RELIGION AND POLITICS"
        }
    },
    {
        "data": {
            "description": "Topics in religious studies in the humanities at an introductory level.",
            "id": "RELIGST 200",
            "parent": "RELIGST",
            "title": "INTRODUCTORY TOPICS IN RELIGIOUS STUDIES (HUMANITIES)"
        }
    },
    {
        "data": {
            "description": "Examines contemplative practices in the two major Indian religions, Buddhism and Hinduism. Covers practices described in ancient texts but also provides an overview of selected modern practices.",
            "id": "ASIAN/RELIGST 473",
            "title": "MEDITATION IN INDIAN BUDDHISM AND HINDUISM"
        }
    },
    {
        "data": {
            "description": "An introductory examination of \"what religion is\" via investigation of how religious traditions imagine, interrogate, and regulate sexuality using several approaches in the discipline of religious studies. Focuses, although not exclusively, on the religions of the Ancient Mediterranean (Greeks, Romans, Rabbinic Jews, and early Christians) and also considers the (re)construction of ideas and practices over time and contexts.",
            "id": "RELIGST 103",
            "parent": "RELIGST",
            "title": "EXPLORING RELIGION AND SEXUALITY"
        }
    },
    {
        "data": {
            "description": "An introduction to the study of the Bible as literature and of biblical reception in the medium of film, from early Hollywood to the present day. Explores the way in which the Bible (including both Hebrew and Greek Testaments), one of the foundational literary corpora of American society, has been interpreted, reinterpreted, and misinterpreted through the medium of film over the past century. We will begin each segment of the course by reading portions of the biblical text that have experienced significant interpretation, in order to understand the literary text that has been received in film.  How beholden are filmmakers to the interpretations of communities that view these texts as authoritative, and where are they free to depart from their sources? Is it possible to \"translate\" biblical narratives into film without losing something in the translation? These questions will focus our study on ways the literature has been interpreted in this new medium.",
            "id": "CLASSICS/JEWISH/RELIGST 323",
            "title": "THE BIBLE AND FILM: LITERATURE AND MEDIA"
        }
    },
    {
        "data": {
            "description": "Advanced topics in theories focused on the mechanisms of contemplative practices such as mindfulness, focused attention and compassion practices, with special emphasis on the interaction of traditional theories from contemplative traditions such as Buddhism and more recent theoretical accounts in psychology and cognitive science.",
            "id": "ASIAN/RELIGST 650",
            "title": "PROSEMINAR IN BUDDHIST THOUGHT"
        }
    },
    {
        "data": {
            "description": "An examination of the Crusades from both Christian and Islamic perspectives; the historical, social, and religious context and significance of the Crusades for both Christians and Muslims.",
            "id": "HISTORY/MEDIEVAL/RELIGST 309",
            "title": "THE CRUSADES: CHRISTIANITY AND ISLAM"
        }
    },
    {
        "data": {
            "description": "What are sources on which members of religious communities draw in order to understand and address environmental change? Explores how religious persons and communities confront global environmental questions and challenges today, with case studies drawn from culturally and religiously plural societies such as India and Indonesia. Introducing diverse varieties of Christianity, Islam, and Hindu and Buddhist systems, gives overview of some approaches in the environmental humanities related to philosophy, history, sociology and anthropology, and ethics.",
            "id": "ENVIRST/RELIGST 270",
            "title": "THE ENVIRONMENT: RELIGION & ETHICS"
        }
    },
    {
        "data": {
            "source": "ANTHRO 104",
            "target": "ANTHRO/RELIGST 343"
        }
    },
    {
        "data": {
            "description": "Rhetorical character of religious controversy and sectarian persuasion in Western religion.",
            "id": "COMARTS/RELIGST 374",
            "title": "THE RHETORIC OF RELIGION"
        }
    },
    {
        "data": {
            "description": "An introduction to the thought, literature, and history of the prophets of ancient Israel (in English).",
            "id": "CLASSICS/HEBR-BIB/JEWISH/LITTRANS/RELIGST 332",
            "title": "PROPHETS OF THE BIBLE"
        }
    },
    {
        "data": {
            "description": "European intellectual history in the 17th and 18th centuries, from the Wars of Religion to the French Revolution. Examines the rise of Enlightenment thought in relation to political and religious conflict, revolutions in science and philosophy, and the emergence of the public sphere. Special attention is paid to the Enlightenment's relationship to religion and to contemporary critiques made of Enlightenment thinking, including those of the early Romantic movement.",
            "id": "HISTORY/RELIGST 411",
            "title": "THE ENLIGHTENMENT AND ITS CRITICS"
        }
    },
    {
        "data": {
            "description": "Introduces religious studies through the lens of popular culture. In recent decades, many have predicted the demise of religion and the \"death of God.\" Indeed, many seem to embrace science and rationality over faith and the supernatural, yet religion, religious language, religious themes permeate popular culture. This raises many questions: What is popular culture? What role is religion playing in it? How can we better understand popular culture using religious studies theory? Explores these questions through theme parks in the U.S. and Japan, Sports, Music, and tattoos.",
            "id": "RELIGST 105",
            "parent": "RELIGST",
            "title": "RELIGION AND POPULAR CULTURE-LOCAL AND GLOBAL"
        }
    },
    {
        "data": {
            "description": "Advanced directed study projects as arranged with a faculty member.",
            "id": "RELIGST 699",
            "parent": "RELIGST",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Rabbinic literature frames the fundamental attitudes for how Judaism relates to food. Examine the history of food in rabbinic Judaism. In addition, theories from the field of food studies will be applied to rabbinic texts.",
            "id": "JEWISH/RELIGST 278",
            "title": "FOOD IN RABBINIC JUDAISM"
        }
    },
    {
        "data": {
            "description": "The relationship between myth and tale, history, culture. Myth research; methodological approaches; world mythologies; myth and modern times.",
            "id": "FOLKLORE/RELIGST 359",
            "title": "MYTH"
        }
    },
    {
        "data": {
            "description": "Explores the colorful, contested relationship of religion and American (U.S.) culture. Surveys a variety of themes from Native American-European encounters to the present. Significant court cases focus on the tension between a quest for American consensus and an abiding religious and cultural pluralism.",
            "id": "RELIGST 300",
            "parent": "RELIGST",
            "title": "AMERICA AND RELIGIONS"
        }
    },
    {
        "data": {
            "description": "A survey of major philosophers and philosophical currents within Judaism from antiquity through the seventeenth century.",
            "id": "JEWISH/PHILOS/RELIGST 435",
            "title": "JEWISH PHILOSOPHY FROM ANTIQUITY TO THE SEVENTEENTH CENTURY"
        }
    },
    {
        "data": {
            "description": "An exploration of the literary and historical aspects of the text of 1-2 Samuel + 1 Kings 1-2; the history and archaeology of Jerusalem during the tenth century B.C.E.; and the varieties of ways in which the figure of King David has been received in subsequent religious and secular literature, visual art, music, television, and cinema.",
            "id": "CLASSICS/JEWISH/RELIGST 335",
            "title": "KING DAVID IN HISTORY AND TRADITION"
        }
    },
    {
        "data": {
            "description": "Topics in religious studies in the social sciences.",
            "id": "RELIGST 401",
            "parent": "RELIGST",
            "title": "TOPICS IN RELIGIOUS STUDIES - SOCIAL STUDIES"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "POLISCI 140",
            "target": "POLISCI/RELIGST 433"
        }
    },
    {
        "data": {
            "description": "An introduction to new religious movements in the U.S. frequently referred to as \"sects,\" \"cults,\" and \"fringe religions.\"",
            "id": "RELIGST 311",
            "parent": "RELIGST",
            "title": "SECTS AND CULTS"
        }
    },
    {
        "data": {
            "description": "Anthropological approaches. Illustrated by critical considerations of outstanding contributions. Selected religious systems; areal and topical comparative studies; religion as an ethnographic problem.",
            "id": "ANTHRO/RELIGST 343",
            "title": "ANTHROPOLOGY OF RELIGION"
        }
    },
    {
        "data": {
            "description": "General introduction to Judaism covering the biblical, classical rabbinic, medieval, and modern periods.",
            "id": "JEWISH/RELIGST 211",
            "title": "INTRODUCTION TO JUDAISM"
        }
    },
    {
        "data": {
            "description": "Survey of the fundamental trends in Buddhist thought through the works of major philosophers. Themes include the concept of \"selflessness\" and concomitant theories of essencelessness, perception, language and rationality. Not open to students with credit for E ASIAN or LCA 466 prior to Fall 2019.",
            "id": "ASIAN/RELIGST 466",
            "title": "BUDDHIST THOUGHT"
        }
    },
    {
        "data": {
            "description": "Explores why and how religious studies matters as a helpful interpretative field across a variety of topics of interdisciplinary interest and societal concern.",
            "id": "RELIGST 420",
            "parent": "RELIGST",
            "title": "RELIGIOUS STUDIES COLLOQUIUM"
        }
    },
    {
        "data": {
            "source": "POLISCI 120",
            "target": "POLISCI/RELIGST 433"
        }
    },
    {
        "data": {
            "description": "Theory and analysis of religion as a human phenomenon.",
            "id": "RELIGST 600",
            "parent": "RELIGST",
            "title": "RELIGION IN CRITICAL PERSPECTIVE"
        }
    },
    {
        "data": {
            "description": "Integrated capstone course combining discussion of research methods, conduct of senior thesis research, and presentation and discussion of research results.",
            "id": "RELIGST 601",
            "parent": "RELIGST",
            "title": "SENIOR CAPSTONE RESEARCH AND COLLOQUIUM"
        }
    },
    {
        "data": {
            "id": "RELIGST",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Topics may include religion in specific societies or regions; religion in the arts; contemporary themes in religion.",
            "id": "RELIGST 400",
            "parent": "RELIGST",
            "title": "TOPICS IN RELIGIOUS STUDIES - HUMANITIES"
        }
    },
    {
        "data": {
            "description": "An introduction to the study of religious language and the role of religion in everyday language. Through discourse analytical and linguistic ethnographic tools, explore ritual speech and magic, prayer, song, sermons, conversation, social media, etc., across several religious traditions.",
            "id": "RELIGST 201",
            "parent": "RELIGST",
            "title": "RELIGION IN/AND EVERYDAY LANGUAGE"
        }
    },
    {
        "data": {
            "description": "Survey of shamanism as a religious tradition and sociocultural force in Siberian, Asian, and Native American societies. Exploration of shamanic rituals, roles, cosmology. Cultural and political uses of shamanism in traditional and modern contexts.",
            "id": "FOLKLORE/RELIGST 352",
            "title": "SHAMANISM"
        }
    },
    {
        "data": {
            "description": "Introduction to the text, development, history, and social context of the Hebrew Bible/Old Testament. Covers the Torah (Pentateuch), Neviim (Former and Latter Prophets), and Ketuvim (Writings), and provides a brief introduction to early Jewish literature (Pseudepigrapha/Apocrypha). Discusses various methods of analysis and theories of composition. Addresses major theological claims made of the text by Jewish and Christian communities. Explores contextualized interpretations in the ancient and modern day.",
            "id": "CLASSICS/JEWISH/LITTRANS/RELIGST 227",
            "title": "INTRODUCTION TO BIBLICAL LITERATURE (IN ENGLISH)"
        }
    },
    {
        "data": {
            "description": "Survey of Muslim religious understandings of science, technology, nature and environment. Gain a global perspective through case studies, covering sources such as the Qur'an, theology and law, and traditions of esoteric piety (mysticism), and historical and contemporary issues like medical ethics, virtual realities, and environmental change, challenge and crisis.",
            "id": "ENVIRST/HISTSCI/RELIGST 356",
            "title": "ISLAM, SCIENCE & TECHNOLOGY, AND THE ENVIRONMENT"
        }
    },
    {
        "data": {
            "description": "Life and literature during the Old English period (c450-c1100). Primary emphasis on the vernacular and Latin writings of the Anglo-Saxons themselves. Extensive historical and archaeological background; attention to the development and character of monasticism, to the production of manuscripts, etc. All reading in translation.",
            "id": "ENGL/HISTORY/RELIGST 360",
            "title": "THE ANGLO-SAXONS"
        }
    },
    {
        "data": {
            "description": "Explores how ancient Indian traditions have been reframed for the modern age. Topics include the Ramayama in popular media, negotiations over sacred spaces, and popular Tantra. We will also examine recent controversies, such as the one surrounding the ancient Jain practice of fasting until death (sallekhana) in the modern age.",
            "id": "ASIAN/RELIGST 430",
            "title": "INDIAN TRADITIONS IN THE MODERN AGE"
        }
    },
    {
        "data": {
            "id": "POLISCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Based upon the assumption children are important participants in religious communities; that they co-create their religious traditions. Through studies of children's lives in various religious communities in America (mostly), explore how including children's perspectives shifts general claims about religious groups and their practices.",
            "id": "RELIGST 410",
            "parent": "RELIGST",
            "title": "CHILDREN AND RELIGION IN AMERICA"
        }
    },
    {
        "data": {
            "description": "Explores the development of Jewish law from antiquity to modernity, with a focus on legal questions related to business practices and ethics. Consider issues ranging from ethical practices in agriculture to how to run a modern multi billion-dollar kosher industry; from the ethics of Jews celebrating Thanksgiving to regulations governing the preparation, consumption, and sale of coffee.",
            "id": "JEWISH/LEGALST/RELIGST 203",
            "title": "JEWISH LAW, BUSINESS, AND ETHICS"
        }
    },
    {
        "data": {
            "description": "Looking at the cultural institutions of politics, medicine, and religion in multiple cultures and historical times, students will explore ideas about what constitutes a perfect body, how and why different parts of the body are privileged over others, and how and why the notion of bodily perfectibility differs for men and women, children and adults, and humans and gods. Readings encourage such questions as: Is the perfect body attainable and, if so, how? And, who benefits from bodily perfection (or the rhetoric of the bodily perfection)? We will ask these questions with comparative intent: we want both to learn about cultures other than our own and, in the process of understanding the other, we will ask how this new knowledge might empower us to be more observant and critical of the role(s) and treatment of the body in our own society historically and today.",
            "id": "ASIAN/RELIGST 505",
            "title": "THE PERFECTIBLE BODY IN RELIGIONS, MEDICINES, AND POLITICS"
        }
    },
    {
        "data": {
            "description": "Explores the historical connections between capitalism and religion. Considers if and how religious ideas and practices facilitated the rise of capitalism; asks whether religious institutions have supported the reproduction of social inequalities, unjust labor practices, and exploitative economies; and studies the role played by religious actors in the critique of capitalism. Pays attention to the historical specificity of the capitalist system, its conditions of emergence in the Christian West, and the effects of its globalization on non-Christian traditions. Covers topics including classical social theories of religion and capitalism; contemporary examples of religious practice and capital accumulation; and the relationship between religious movements and social-economic justice.",
            "id": "GERMAN/RELIGST/SOC 273",
            "title": "GOD & MONEY"
        }
    },
    {
        "data": {
            "description": "Ancient religions in their political, social and cultural contexts; topics include ritual, literary and artistic representations, religious persecutions, and/or modern approaches to the study of ancient religions. Chronological and geographical focus will vary between Greece, Rome, Judaea and Egypt.",
            "id": "CLASSICS/HISTORY/RELIGST 517",
            "title": "RELIGIONS OF THE ANCIENT MEDITERRANEAN"
        }
    },
    {
        "data": {
            "description": "Explores the history of Yoga techniques from the ancient to the modern period. Not open to students with credit for RELIG ST 623 prior to Spring 2019.",
            "id": "ASIAN/RELIGST 460",
            "title": "THE HISTORY OF YOGA"
        }
    },
    {
        "data": {
            "description": "Independent research for graduate students.",
            "id": "RELIGST 799",
            "parent": "RELIGST",
            "title": "INDEPENDENT RESEARCH"
        }
    },
    {
        "data": {
            "description": "Topics may include religion in specific contexts, religion and other disciplines or specific themes in Religious Studies.",
            "id": "RELIGST 500",
            "parent": "RELIGST",
            "title": "ADVANCED TOPICS IN RELIGIOUS STUDIES"
        }
    },
    {
        "data": {
            "description": "Have you ever wondered about human nature? What is our place in this world? Through readings, videos, and original images, explore and discuss Dante's answers from one of the greatest world literary classics, his Divine Comedy. From Hell, through Purgatory to Paradise, we will travel together with Dante in a universal tale of the journey of the human soul. Along the way, learn about Dante, his life and his works, development of literary history, historical and socio-political context of medieval Europe, the Mediterranean and the Middle East. Make connections that cross today's geographic and cultural lines in an exploration of literary topics, the history of ideas, and shared history, pondering universal concepts and patterns in the development of civilization that can still be observed today.",
            "id": "LITTRANS/MEDIEVAL/RELIGST 253",
            "title": "OF DEMONS AND ANGELS. DANTE'S DIVINE COMEDY"
        }
    },
    {
        "data": {
            "description": "Survey of key themes in Western intellectual history and religious thought from ancient Greece through the Renaissance, focusing on relationships among classical, Jewish, and Christian traditions.",
            "id": "HISTORY/RELIGST 208",
            "title": "WESTERN INTELLECTUAL AND RELIGIOUS HISTORY TO 1500"
        }
    },
    {
        "data": {
            "description": "An exploration of the faith and life of one of America's most familiar yet widely misunderstood religious groups, the Old Order Amish.",
            "id": "RELIGST 406",
            "parent": "RELIGST",
            "title": "THE AMISH"
        }
    },
    {
        "data": {
            "description": "Explores health issues and practices in religious communities and their interaction with public health concerns and programs in U.S. and international contexts.",
            "id": "RELIGST 475",
            "parent": "RELIGST",
            "title": "RELIGION, GLOBAL AND PUBLIC HEALTH"
        }
    },
    {
        "data": {
            "description": "A study of spaces, objects, and images within the context of religious belief and practice in Japan between 1300 and 1600, when great Zen monasteries grew up alongside older Buddhist/Shinto religious \"megaplexes,\" and new salvationist sects spread throughout Japan.",
            "id": "ARTHIST/RELIGST 478",
            "title": "ART AND RELIGIOUS PRACTICE IN MEDIEVAL JAPAN"
        }
    },
    {
        "data": {
            "description": "Introduction to the literature of the Classical Rabbinic or Talmudic period of Judaism (2nd to 7th centuries CE). Historical and intellectual background; the interrelation of liturgy, legal and non-legal literature.",
            "id": "JEWISH/LITTRANS/RELIGST 328",
            "title": "CLASSICAL RABBINIC LITERATURE IN TRANSLATION"
        }
    },
    {
        "data": {
            "description": "Introduction to the study of religion, science, and medicine. Focus on how religion, science, and medicine have shaped practices of knowledge production and meaning making with respect to human life, by considering theories of human history and racial progress; how logics of contagion structure human relationships and communal boundaries; the variety of ways of understanding and caring for bodies; and the place of humans within broader ecologies.",
            "id": "HISTSCI/MEDHIST/RELIGST 331",
            "title": "SCIENCE, MEDICINE AND RELIGION"
        }
    },
    {
        "data": {
            "description": "Study primary and secondary sources to explore how South Asian societies have understood the ideas of health and well-being throughout history. We will consider a number of cases that illustrate uniquely South Asian conceptions of illness and physical dysfunction and the ways in which people in South Asia have attempted (and continue to attempt today) to heal bodies. Students will learn about the traditional healing systems of South Asia, including Ayurveda, Siddha, and Unani, the basic components of each systems' ideas about disease pathology and treatment that have been used for centuries to heal illness, maintain good health, and, in some instances, aspire to a state of super-health that transcends the limitations of bodily existence altogether.",
            "id": "ASIAN/RELIGST 218",
            "title": "HEALTH AND HEALING IN SOUTH ASIA"
        }
    },
    {
        "data": {
            "description": "Introduction to Comparative Politics, one of the four sub-fields in Political Science, which involves the comparative analysis of political institutions, processes, and outcomes at the national level. Examines how to usefully compare politics in a variety of countries and makes comparisons explicit and systematic in order to determine how governments work, how power is organized and contested at the national level, and how people can participate and pursue their interests in different political settings. Includes key concepts, theories, methods, and country case studies.",
            "id": "POLISCI 182",
            "parent": "POLISCI",
            "title": "INTRODUCTION TO COMPARATIVE POLITICS (HONORS)"
        }
    },
    {
        "data": {
            "description": "Explores the historical relationship between Muslims and Jews in a variety of contexts from the seventh century to the present. Surveys literary and cultural exchanges against the background of shifting political and social conditions across the Middle East, Europe, and the United States. Considers also the parallel legacies of anti-Semitism, Orientalism, and Islamophobia. Major themes include comparative religion, secularization, migration, and colonialism, as well as the politics of history and cultural memory. Introduces readings in English translation of medieval and modern texts originally written across languages, and especially in Hebrew and Arabic.",
            "id": "AFRICAN/JEWISH/MEDIEVAL/RELIGST 462",
            "title": "MUSLIMS AND JEWS"
        }
    },
    {
        "data": {
            "description": "An exploration of Christianity's charter documents in the light of what modern scholarship has discovered about the New Testament's sociohistorical context, composition, theologies, and presentations of Jesus.",
            "id": "RELIGST 333",
            "parent": "RELIGST",
            "title": "EARLY CHRISTIAN LITERATURE: MATTHEW-REVELATION"
        }
    },
    {
        "data": {
            "description": "Between the late Middle Ages and the era of democratic revolutions Western Christianity saw a series of sweeping changes that altered its global profile and helped form the modern world - examines some of these shifts and their impact. Questions explored include: Why did the Reformations of the 16th century occur and with what effects on people's lives and on early modern societies? What was the relationship between European colonization, the Atlantic slave trade, new theories of race, and the spread of Christianity to the \"New World\"? How was the Christian religion resisted, received, and reshaped by Native Americans and people of African descent? What sparked movements of reform and renewal - including new Catholic religious orders and the Protestant Evangelical Awakening - and with what consequences for modern Christianity? How did the nature of Christian belief and identity change under the impact of religious conflict, political revolution, and new intellectual movements?",
            "id": "HISTORY/RELIGST 409",
            "title": "CHRISTIANITY IN THE ATLANTIC WORLD, 1500-1800"
        }
    }
]