[
    {
        "data": {
            "description": "Clinical elective for fourth year medical students.",
            "id": "RHABMED 923",
            "parent": "RHABMED",
            "title": "PHYSICAL MEDICINE AND REHABILITATION-MARSHFIELD"
        }
    },
    {
        "data": {
            "description": "Independent study projects as arranged with faculty or instructional staff.",
            "id": "RHABMED 699",
            "parent": "RHABMED",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Individually arranged fourth year clinical clerkships. (Student must have Fourth Year Committee approval to count for fourth year credit.)",
            "id": "RHABMED 919",
            "parent": "RHABMED",
            "title": "INDIVIDUALIZED FOURTH YEAR CLINICAL CLERKSHIP"
        }
    },
    {
        "data": {
            "description": "Inpatient hospital setting and outpatient clinical setting. Direct supervision by attending physicians and residents. Inpatient activities include rounding on rehabilitation medicine service patients, observing patient therapy sessions, discussing patient cases. Outpatient activities includes seeing clinic patients, participating in procedures like joint injections and fluoroscopic-guided spinal injections, performing electromyography (EMG), discussing patient cases. Evaluate and manage a full spectrum of patients with neurologic and musculoskeletal issues. Exposure to multiple disciplines involved in the rehabilitation process. Inpatient diagnoses commonly encountered include stroke, brain injury, spinal cord injury, orthopedic injuries, debility, amputations. Outpatient diagnoses commonly encountered include developmental disabilities, spine disorders, chronic pain, arthritis, myofascial pain and fibromyalgia, spasticity, and chronic conditions from prior neurologic injuries.",
            "id": "RHABMED 920",
            "parent": "RHABMED",
            "title": "REHABILITATION MEDICINE CLINICAL ELECTIVE"
        }
    },
    {
        "data": {
            "id": "RHABMED",
            "type": "compound"
        }
    }
]