[
    {
        "data": {
            "description": "Covers the graphs, properties and geometric significance of trigonometric functions of a real variable. Other topics include trigonometric equations and identities, application, trigonometric form of complex numbers, DeMoivre's theorem, and polar and parametric equations. The course also has a significant number of applications, especially related to other disciplines.",
            "id": "MATH 113",
            "parent": "MATH",
            "title": "TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "The assessment, control, financing and management of risks deriving from pressures on and damages to the environment, workers and local/foreign communities. Risks include liability and directors and officers law suits, boycotts, regulations and competitors' actions.",
            "id": "RMI 650",
            "parent": "RMI",
            "title": "SUSTAINABILITY, ENVIRONMENTAL AND SOCIAL RISK MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Applied learning in risk management and insurance.",
            "id": "RMI 875",
            "parent": "RMI",
            "title": "SEMINAR-RISK MANAGEMENT AND INSURANCE"
        }
    },
    {
        "data": {
            "description": "Comprehensive overview of insurer financial statement analysis and captive insurance. Examine the construction of insurer financial statements, including premiums, expenses, and losses. Financial statement analysis focusing on the statutory statement with differences from GAAP highlighted. Assess captive insurance, covering its structures, feasibility studies, and financial performance measurement.",
            "id": "RMI 636",
            "parent": "RMI",
            "title": "INSURER FINANCIAL STATEMENT ANALYSIS AND CAPTIVE INSURANCE"
        }
    },
    {
        "data": {
            "description": "Consideration of the structure, use, benefits, and limitations of corporate insurance products. Fundamental to the material is the economic underpinning of the insurance contract structure. The major commercial property and liability insurance products will be analyzed in detail with the purpose of illustrating these economic principles and applying them to specific organizational situations.",
            "id": "RMI 645",
            "parent": "RMI",
            "title": "COMMERCIAL INSURANCE"
        }
    },
    {
        "data": {
            "description": "Contemporary theory of consumption, production, pricing and resource allocation.",
            "id": "ECON 301",
            "parent": "ECON",
            "title": "INTERMEDIATE MICROECONOMIC THEORY"
        }
    },
    {
        "data": {
            "description": "Continuation ofMATH 171. Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Completion ofMATH 217implies completion ofMATH 221and114.",
            "id": "MATH 217",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY II"
        }
    },
    {
        "data": {
            "description": "Covers risks related to health and aging, rationales for social insurance programs to protect against these risks, and costs and benefits of these programs.  Broad topics include health insurance, disability insurance, and Social Security and pension policy.",
            "id": "ECON/RMI 530",
            "title": "INSURING LIFE'S RISKS: HEALTH, AGING, AND POLICY"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Defines cyber risk and studies prominent case examples to become familiar with the many challenges it poses. Includes an in-depth look at the current state of data privacy law both in the US and globally.   Establishes a framework and some basic methods to quantify cyber risk. Explores current cyber risk management options in the market including the implementation of internal risk controls as well as options in the burgeoning market for cyber insurance.",
            "id": "RMI 670",
            "parent": "RMI",
            "title": "CYBER RISK & REGULATIONS"
        }
    },
    {
        "data": {
            "description": "Develop insight into the principles of risk management, including institutions engaged in identifying, assessing, preventing, mitigating, and transferring risk. Specific focus is given to how the digitization of data, technology, and analytics are creating a new risk landscape, and how conventional risk management approaches can adapt to meet these emerging business needs.",
            "id": "RMI 705",
            "parent": "RMI",
            "title": "RISK MANAGEMENT AND TECHNOLOGIES IN A DIGITAL AGE"
        }
    },
    {
        "data": {
            "description": "Doctoral seminar in actuarial science, risk management and insurance with emphasis on developing an appreciation of existing literature and appropriate skills to conduct own scholarly work in the field.",
            "id": "RMI 920",
            "parent": "RMI",
            "title": "SEMINAR IN ACTUARIAL SCIENCE, RISK MANAGEMENT & INSURANCE I"
        }
    },
    {
        "data": {
            "description": "Doctoral seminar in actuarial science, risk management and insurance, with emphasis on developing an appreciation of existing literature and appropriate skills to conduct own scholarly work in the field.",
            "id": "RMI 930",
            "parent": "RMI",
            "title": "SEMINAR IN ACTUARIAL SCIENCE, RISK MANAGEMENT & INSURANCE II"
        }
    },
    {
        "data": {
            "description": "Economic problems of individuals, firms and industries with emphasis on value, price, and distribution of income.",
            "id": "ECON 101",
            "parent": "ECON",
            "title": "PRINCIPLES OF MICROECONOMICS"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "Examination of data collection and analysis methods for risk management decisions. Analysis of qualitative and quantitative data to support transfer, retention, and loss control decisions, including loss trending, and evaluation of regulatory controls.",
            "id": "RMI 820",
            "parent": "RMI",
            "title": "ADVANCED TOPICS IN RISK MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Examines how captive insurance works, the different structures of captives, and advantages and disadvantages of their use in various settings. In addition, the captive feasibility process, as well as techniques for measuring financial performance, will be covered.",
            "id": "RMI 635",
            "parent": "RMI",
            "title": "CAPTIVE INSURANCE"
        }
    },
    {
        "data": {
            "description": "Exploration of advanced subject areas possibly to be introduced into the business curriculum.",
            "id": "RMI 765",
            "parent": "RMI",
            "title": "CONTEMPORARY TOPICS"
        }
    },
    {
        "data": {
            "description": "Exploration of statistical inference and data analytics tools. Review of relevant foundations of statistics, machine learning and probability theory. Emphasis on applying the resulting concepts to canonical business examples, using both Excel and R.",
            "id": "GENBUS 704",
            "parent": "GENBUS",
            "title": "DATA TO DECISIONS"
        }
    },
    {
        "data": {
            "description": "Exploration of subject areas possibly to be introduced into the business curriculum.",
            "id": "RMI 365",
            "parent": "RMI",
            "title": "CONTEMPORARY TOPICS"
        }
    },
    {
        "data": {
            "description": "Focuses on reinsurance, a key component to the successful implementation of the insurance mechanism. Provides exposure to the types and uses of reinsurance, its specific regulatory requirements, how it affects and is affected by primary insurance, and general market mechanisms.",
            "id": "RMI 637",
            "parent": "RMI",
            "title": "REINSURANCE"
        }
    },
    {
        "data": {
            "description": "Functional analysis of the operations of insurance organizations; legal organization, marketing systems, management and control, underwriting, rating, financial analysis, rate making and regulation.",
            "id": "RMI 640",
            "parent": "RMI",
            "title": "MANAGEMENT OF INSURANCE ENTERPRISE"
        }
    },
    {
        "data": {
            "description": "Individual work suited to the needs of Ph.D. students may be arranged.",
            "id": "RMI 999",
            "parent": "RMI",
            "title": "READING AND RESEARCH-RISK MANAGEMENT AND INSURANCE PHD"
        }
    },
    {
        "data": {
            "description": "Individual work suited to the needs of graduate students may be arranged.",
            "id": "RMI 799",
            "parent": "RMI",
            "title": "READING AND RESEARCH-RISK MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Individual work suited to the needs of undergraduate students may be arranged with a faculty member.",
            "id": "RMI 399",
            "parent": "RMI",
            "title": "READING AND RESEARCH-RISK MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Individual work to complete dissertation requirement of Ph.D. program.",
            "id": "RMI 990",
            "parent": "RMI",
            "title": "RISK & INSURANCE INDEPENDENT RESEARCH PHD THESIS"
        }
    },
    {
        "data": {
            "description": "Integrated treatment of macroeconomics and microeconomics (seeECON 101andECON 102). Accelerated approach to economics training, especially for Economics: Math Emphasis majors.",
            "id": "ECON 111",
            "parent": "ECON",
            "title": "PRINCIPLES OF ECONOMICS-ACCELERATED TREATMENT"
        }
    },
    {
        "data": {
            "description": "Introduction to analysis of economic data. The techniques of descriptive statistics and statistical inference (hypothesis testing and estimation) as directed toward application in economic research.",
            "id": "ECON 310",
            "parent": "ECON",
            "title": "STATISTICS: MEASUREMENT IN ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Introduction to financial management of firms and investment decision making; both theory and practice are emphasized. Topics covered include the financial environment and securities markets, financial statements and analysis, working capital management and capital budgeting, cost of capital, dividend policy, asset valuation, investments, decision making under uncertainty and selected topics such as mergers, options, futures.",
            "id": "FINANCE 700",
            "parent": "FINANCE",
            "title": "INTRODUCTION TO FINANCIAL MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Learning to effectively navigate uncertainty is a key issue for all areas of business and especially for those engaged in explicit risk-management activities.  The skills for success in these environments include knowing how to formulate the right questions to ask, how to identify the information that is valuable for answering those questions, understanding how to process incoming information to distinguish signal from noise, and how to use that information to put structure to uncertain environments so that one can take good calculated risks.  This collective set of skills are at the heart of \"decision analysis\", which is a structured rational approach to making decisions under uncertainty.",
            "id": "RMI 660",
            "parent": "RMI",
            "title": "RISK ANALYTICS AND BEHAVIORAL SCIENCE"
        }
    },
    {
        "data": {
            "description": "Legal implications for business managers of selected areas of the law including negligence, contract, intellectual property, officer/director liability, financing the business enterprise, and employment and trade regulation; introduction to the legal process, including alternative dispute resolution systems.",
            "id": "GENBUS/RMI 701",
            "title": "MANAGING LEGAL RISKS"
        }
    },
    {
        "data": {
            "description": "Macroeconomic measurement and models of aggregate demand and supply; fiscal and monetary policy for unemployment, inflation, and growth.",
            "id": "ECON 102",
            "parent": "ECON",
            "title": "PRINCIPLES OF MACROECONOMICS"
        }
    },
    {
        "data": {
            "description": "Nature of risk, principal techniques of risk management, including insurance markets, and the bases for decision-making in managing risk effectively.",
            "id": "RMI 300",
            "parent": "RMI",
            "title": "PRINCIPLES OF RISK MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Nature of risk, principal techniques of risk management, including insurance markets, and the bases for decision-making in managing risk effectively.",
            "id": "RMI 700",
            "parent": "RMI",
            "title": "PRINCIPLES OF RISK MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Nongovernmental schemes for treating the risks of superannuation of members of a group; property, liability, legal expense, life and health coverages available to groups; organizational characteristics, benefit structure and pricing of risk transfer schemes for groups; characteristics and funding of various types of pension plans; effects of ERISA.",
            "id": "RMI 620",
            "parent": "RMI",
            "title": "EMPLOYEE BENEFITS MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Study of advanced risk management tools and markets for financing loss costs. Topics include: insurance, self-insurance, retrospective premium plans, risk retention and purchasing groups, reinsurance, insurance subsidiaries (captives), and other policyholder-owned facilities.",
            "id": "RMI 655",
            "parent": "RMI",
            "title": "RISK FINANCING TECHNIQUES"
        }
    },
    {
        "data": {
            "description": "The objective of this course is to refine the quantitative skills necessary to succeed in intermediate- and advanced-level economics courses. The principle focus will be on applying the skills acquired in your math courses to the questions, models, and optimization problems that are common in economics. Topics include specific economic applications of algebra, financial mathematics, and calculus.",
            "id": "ECON 205",
            "parent": "ECON",
            "title": "QUANTITATIVE TOOLS FOR ECONOMICS"
        }
    },
    {
        "data": {
            "description": "The purpose of risk management is to minimize the adverse consequences of variability. Topics include the general philosophy of risk management, environmental factors affecting risk, options to manage risk, and decision processes to select among those options.",
            "id": "RMI 710",
            "parent": "RMI",
            "title": "RISK MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Part of a 2-semester sequence withMATH 217; these two courses together are equivalent toMATH 114and221.",
            "id": "MATH 171",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY I"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ECON",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "FINANCE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "GENBUS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "RMI",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON 102"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON 301"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "RMI 300"
        }
    },
    {
        "data": {
            "source": "ECON 102",
            "target": "ECON 205"
        }
    },
    {
        "data": {
            "source": "ECON 102",
            "target": "ECON 310"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON 101"
        }
    },
    {
        "data": {
            "source": "ECON 205",
            "target": "ECON 301"
        }
    },
    {
        "data": {
            "source": "ECON 301",
            "target": "ECON/RMI 530"
        }
    },
    {
        "data": {
            "source": "ECON 310",
            "target": "ECON/RMI 530"
        }
    },
    {
        "data": {
            "source": "FINANCE 700",
            "target": "RMI 655"
        }
    },
    {
        "data": {
            "source": "GENBUS 704",
            "target": "RMI 655"
        }
    },
    {
        "data": {
            "source": "GENBUS 704",
            "target": "RMI 660"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 113"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 113",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "MATH 217"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "ECON 310"
        }
    },
    {
        "data": {
            "source": "MATH 217",
            "target": "ECON 205"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "ECON 111"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "RMI 300",
            "target": "RMI 620"
        }
    },
    {
        "data": {
            "source": "RMI 300",
            "target": "RMI 645"
        }
    },
    {
        "data": {
            "source": "RMI 300",
            "target": "RMI 655"
        }
    },
    {
        "data": {
            "source": "RMI 300",
            "target": "RMI 660"
        }
    },
    {
        "data": {
            "source": "RMI 300",
            "target": "RMI 700"
        }
    },
    {
        "data": {
            "source": "RMI 300",
            "target": "RMI 705"
        }
    },
    {
        "data": {
            "source": "RMI 700",
            "target": "RMI 635"
        }
    },
    {
        "data": {
            "source": "RMI 700",
            "target": "RMI 636"
        }
    },
    {
        "data": {
            "source": "RMI 700",
            "target": "RMI 637"
        }
    },
    {
        "data": {
            "source": "RMI 700",
            "target": "RMI 640"
        }
    },
    {
        "data": {
            "source": "RMI 700",
            "target": "RMI 705"
        }
    }
]