[
    {
        "data": {
            "description": "Practicum experience in state or community agencies or in public school programs serving individuals with physical, cognitive, emotional, learning, social or behavioral problems.",
            "id": "RP&SE 630",
            "parent": "RP&SE",
            "title": "INTERNSHIP IN REHABILITATION OR SPECIAL EDUCATION"
        }
    },
    {
        "data": {
            "description": "Registration for Ph.D. students who have successfully defended the dissertation and are in the process of completing the required predoctoral internship.",
            "id": "COUNPSY/EDPSYCH/PSYCH/RP&SE 995",
            "title": "PREDOCTORAL INTERNSHIP"
        }
    },
    {
        "data": {
            "description": "Designed to provide an entry-level overview of disability under federal legislation and regulation, substance use and abuse among persons with disabilities as either a primary or secondary disability, the physical, psychological, and socio-cultural effects of drugs, and the impact substance abuse or dependence has on the capacity of individuals with disabilities to live independently, work, and otherwise engage in a full range of life activities.",
            "id": "RP&SE 121",
            "parent": "RP&SE",
            "title": "DISABILITY AND SUBSTANCE ABUSE"
        }
    },
    {
        "data": {
            "description": "Addresses professionalism, research and problem solving, assessment, and collaborative skills relevant to the secondary special education student teaching placement.",
            "id": "RP&SE 468",
            "parent": "RP&SE",
            "title": "SECONDARY STUDENT TEACHING SEMINAR"
        }
    },
    {
        "data": {
            "description": "Introduction to the modern disability experience, with an emphasis on disability justice and advocacy.  Examines the societal implications and individual experiences of disability, centering the voices of individuals with disabilities themselves, and discusses strategies that can be used to work toward their full participation and inclusion in society.",
            "id": "RP&SE 210",
            "parent": "RP&SE",
            "title": "THE DISABILITY EXPERIENCE"
        }
    },
    {
        "data": {
            "description": "Provides an overview of teaching in early childhood and K-12 special education and introduces the content of and highlights the underlying themes (e.g., inclusion, collaboration) embedded in teacher preparation courses required for licensing in early childhood special education and K-12 special education.",
            "id": "RP&SE 320",
            "parent": "RP&SE",
            "title": "INTRODUCTION TO TEACHING IN SPECIAL EDUCATION"
        }
    },
    {
        "data": {
            "description": "",
            "id": "RP&SE 690",
            "parent": "RP&SE",
            "title": "RESEARCH OR THESIS"
        }
    },
    {
        "data": {
            "description": "Full-time supervised experience in clinical rehabilitation counseling.",
            "id": "RP&SE 910",
            "parent": "RP&SE",
            "title": "CLINICAL REHABILITATION COUNSELING - INTERNSHIP"
        }
    },
    {
        "data": {
            "description": "An introduction to the Early Childhood Special Education profession including historical, philosophical, social and psychological foundations, awareness of values, ethical and legal issues, staff relations, and the importance of becoming an advocate for children and families. Analyze trends in early education, including diversity, early intervention, early childhood special education, family centered practices, legislation, public policy, and developmentally appropriate practice.",
            "id": "RP&SE 435",
            "parent": "RP&SE",
            "title": "OVERVIEW OF EARLY CHILDHOOD SPECIAL EDUCATION"
        }
    },
    {
        "data": {
            "source": "RP&SE 880",
            "target": "RP&SE 900"
        }
    },
    {
        "data": {
            "id": "ELPA",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Examines a variety of topics related to rehabilitation psychology and special education.",
            "id": "RP&SE 660",
            "parent": "RP&SE",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "Seminar taken in conjunction withRP & SE 990to facilitate conceptualization, methodology, presentation, writing, and defense of the dissertation proposal and research.",
            "id": "RP&SE 988",
            "parent": "RP&SE",
            "title": "REHABILITATION COUNSELOR EDUCATION - DISSERTATION RESEARCH SEMINAR"
        }
    },
    {
        "data": {
            "description": "Review of research and scholarly literature on theory, models, and methods of assessment; and research priorities, approaches, and methods to improving assessment practices in clinical rehabilitation counseling.",
            "id": "RP&SE 870",
            "parent": "RP&SE",
            "title": "REHABILITATION COUNSELOR EDUCATION - ASSESSMENT THEORY & RESEARCH"
        }
    },
    {
        "data": {
            "description": "Cultural-Historical Activity Theory (CHAT) is a generative, praxis-based theory of learning. CHAT has been used to analyze and transform human-context interactions. Provides a comprehensive review of the foundations, applications, and future directions of CHAT. Reviews the theoretical and empirical CHAT studies in the fields of education, psychology, health, arts, and learning sciences with an interdisciplinary and multi-methodological perspective.",
            "id": "RP&SE 855",
            "parent": "RP&SE",
            "title": "CULTURAL-HISTORICAL ACTIVITY THEORY"
        }
    },
    {
        "data": {
            "description": "Full time student teaching in an approved placement with a qualified cooperating teacher serving students with disabilities in any of grades PK-Grade 9, supervised by a qualified university supervisor. Placement schedule follows the host school district calendar.",
            "id": "RP&SE 477",
            "parent": "RP&SE",
            "title": "SPECIAL EDUCATION STUDENT TEACHING: ELEMENTARY (PK - GRADE 9)"
        }
    },
    {
        "data": {
            "description": "Provides information and professional development on careers in academia. Designed for students to take multiple times to correspond to their developmental needs and professional development.",
            "id": "RP&SE 873",
            "parent": "RP&SE",
            "title": "PROFESSIONAL DEVELOPMENT FOR FUTURE SPECIAL EDUCATION RESEARCHERS AND FACULTY IN HIGHER EDUCATION"
        }
    },
    {
        "data": {
            "description": "Supervised practicum teaching in an approved placement with a qualified cooperating teacher serving students with disabilities birth through grade 9.",
            "id": "RP&SE 475",
            "parent": "RP&SE",
            "title": "SPECIAL EDUCATION PRACTICUM: EARLY CHILDHOOD AND ELEMENTARY"
        }
    },
    {
        "data": {
            "description": "Review of research and scholarly literature on theory, models and methods of counseling and related interventions, research priorities, approaches, and methods to improve counseling practices in clinical rehabilitation counseling.",
            "id": "RP&SE 984",
            "parent": "RP&SE",
            "title": "REHABILITATION COUNSELOR EDUCATION - COUNSELING THEORY & RESEARCH"
        }
    },
    {
        "data": {
            "source": "RP&SE 316",
            "target": "RP&SE 520"
        }
    },
    {
        "data": {
            "description": "Designed to expand the knowledge base of future educators, clinicians, and society members to better understand and serve the diverse needs and interests of individuals with disabilities. Introduces the concept of disability as well as the field of special education. The history, etiology, and characteristics of specific categories of disability are examined, as are educational and other federally mandated programs designed to address the needs of both children and adults with disabilities. Topics germane to the study of disability and the field of special education are explored.",
            "id": "RP&SE 300",
            "parent": "RP&SE",
            "title": "INDIVIDUALS WITH DISABILITIES"
        }
    },
    {
        "data": {
            "description": "Introduction to assessment terms and tools used to assist in the identification and diagnosis of students with disabilities; provide the skills necessary to collect and use assessment data to promote the successful outcomes in core academic instruction for students with disabilities.",
            "id": "RP&SE 464",
            "parent": "RP&SE",
            "title": "DIAGNOSIS, ASSESSMENT, AND INSTRUCTIONAL PLANNING IN SPECIAL EDUCATION"
        }
    },
    {
        "data": {
            "description": "Medical and psychosocial information regarding chronic illnesses and disabilities in clinical rehabilitation counseling practice.",
            "id": "RP&SE 750",
            "parent": "RP&SE",
            "title": "CLINICAL REHABILITATION COUNSELING - MEDICAL & PSYCHOSOCIAL ASPECTS"
        }
    },
    {
        "data": {
            "description": "Examines influences on the provision of high quality educational services to students who are confined, committed or selectively placed in alternative settings. For the purpose of this course, alternative settings will be defined as juvenile correctional facilities, day treatment and residential schools, and other non-traditional special schools for students with emotional and behavioral needs. Theoretical and historical perspectives on the role of educators and academic instruction in alternative settings will also be explored.",
            "id": "RP&SE 777",
            "parent": "RP&SE",
            "title": "EDUCATING STUDENTS IN ALTERNATIVE SETTINGS"
        }
    },
    {
        "data": {
            "description": "Introduction to positive psychology, or the science of human strengths, mental health, and well-being. Covers theory and current research on positive psychology including concepts of optimism, flow, gratitude, and purpose in life. Positive psychology concepts are discussed within the context of health promotion, with an emphasis on minimizing the impact of illness and disability. Learn to apply positive psychology concepts in personal and professional contexts to cultivate fulfilling, healthy, and meaningful lives.",
            "id": "RP&SE 310",
            "parent": "RP&SE",
            "title": "POSITIVE PSYCHOLOGY AND WELL BEING"
        }
    },
    {
        "data": {
            "description": "Basic counseling skills and techniques in clinical rehabilitation counseling practice.",
            "id": "RP&SE 810",
            "parent": "RP&SE",
            "title": "CLINICAL REHABILITATION COUNSELING - COUNSELING TECHNIQUES"
        }
    },
    {
        "data": {
            "description": "Examines historical and organizational context of special education administration at the federal, state and local levels. Includes policy implementation, constituency management, coordination, communication, and current issues.",
            "id": "ELPA/RP&SE 835",
            "title": "LEADERSHIP FOR INCLUSIVE SCHOOLING"
        }
    },
    {
        "data": {
            "description": "",
            "id": "RP&SE 699",
            "parent": "RP&SE",
            "title": "INDEPENDENT READING"
        }
    },
    {
        "data": {
            "description": "Supervised experience in counseling and direct service, supervision, teaching, research, and advocacy and leadership.",
            "id": "RP&SE 945",
            "parent": "RP&SE",
            "title": "INTERNSHIP IN REHABILITATION COUNSELOR EDUCATION I"
        }
    },
    {
        "data": {
            "source": "ELPA 735",
            "target": "ELPA/RP&SE 835"
        }
    },
    {
        "data": {
            "description": "Explores the interaction between the criminal justice system and disability. Explores common experiences of persons with disability such as limited access to community services, poverty, and homelessness and the connection of these experiences to mass incarceration. Explores federal disability rights laws and the implementation of these laws in education, legal, and incarceration settings. Introduction to criminal justice reform to address the experiences of persons with disabilities in this system.",
            "id": "LEGALST/RP&SE 135",
            "title": "DISABILITY AND THE CRIMINAL JUSTICE SYSTEM"
        }
    },
    {
        "data": {
            "description": "Field work in therapeutic intervention, organization and administration, and clinical needs assessment within various special education service delivery settings. Opportunity to relate relevant theoretical backgrounds to clinical organization and field problems.",
            "id": "RP&SE 921",
            "parent": "RP&SE",
            "title": "INTERNSHIP: ADVANCED PROFESSIONAL PRACTICES"
        }
    },
    {
        "data": {
            "description": "Provides a broad understanding of professional counselor roles and functions. Also provides a broad understanding of the ethical and legal standards for professional counselors. Gain familiarity with the ACA Code of Ethics, as well as with credentialing standards and organizations relevant to the practice of mental health counseling.",
            "id": "COUNPSY/RP&SE 730",
            "title": "PROFESSIONAL COUNSELING ORIENTATION"
        }
    },
    {
        "data": {
            "description": "Supervised participation in conducting, evaluation, and reporting university level research.",
            "id": "RP&SE 941",
            "parent": "RP&SE",
            "title": "INTERNSHIP: RESEARCH"
        }
    },
    {
        "data": {
            "description": "Approved placement with a qualified cooperating teacher serving students with disabilities in any of grades 6-12, supervised by a qualified university supervisor. Includes observation and supervised practice in the field of special education and discussion focusing on reflection and application of special education theories to practical settings.",
            "id": "RP&SE 445",
            "parent": "RP&SE",
            "title": "SPECIAL EDUCATION PRACTICUM: EARLY ADOLESCENCE THROUGH ADOLESCENCE"
        }
    },
    {
        "data": {
            "description": "Examines the psychological factors that influence participation in sport and exercise. Theories and interventions used to understand and enhance performance will be examined. Additionally, mental health, substance use and transition out of sport will be reviewed.",
            "id": "RP&SE 335",
            "parent": "RP&SE",
            "title": "INTRODUCTION TO SPORT PSYCHOLOGY"
        }
    },
    {
        "data": {
            "description": "Analysis of historical and contemporary trends and issues pertaining to persons with significant disabilities (i.e., significant intellectual disability, multiple disabilities, and autism spectrum disorder) across the lifespan. Topics include: an overview of the field of significant disabilities, historical trends, and current directions in curriculum design for students with significant disabilities, and valued outcomes for persons with significant disabilities.",
            "id": "RP&SE 715",
            "parent": "RP&SE",
            "title": "EQUITY AND FULL PARTICIPATION FOR INDIVIDUALS WITH SIGNIFICANT DISABILITIES"
        }
    },
    {
        "data": {
            "source": "RP&SE 871",
            "target": "RP&SE 872"
        }
    },
    {
        "data": {
            "description": "Provides the knowledge and skills to implement federal and state mandates as well as professional organization recommendations for special education and related services programs. Explores collaboration in schools, community systems and families, family functioning, historical perspectives of family life and school involvement, effective relationships between home, school, community, communication among professionals and with families, school-based programs as well as multicultural considerations including those related to race, ethnicity, gender, language, and culture, among others. Gain knowledge of family-centered practices  and family systems theory to develop and maintain reciprocal partnerships with families. Apply family capacity-building practices to support families to make informed decisions and advocate for their young children.",
            "id": "RP&SE 510",
            "parent": "RP&SE",
            "title": "PARTNERING WITH FAMILIES AND OTHER PROFESSIONALS IN EARLY CHILDHOOD SPECIAL EDUCATION"
        }
    },
    {
        "data": {
            "description": "History, ethical and professional issues and problems, and current status of the psychological specialty of counseling psychology.",
            "id": "COUNPSY/RP&SE 925",
            "title": "SEMINAR IN COUNSELING PSYCHOLOGY"
        }
    },
    {
        "data": {
            "description": "Concurrent seminar for clinical practice students inRP & SE 880,890, and900or910.",
            "id": "RP&SE 860",
            "parent": "RP&SE",
            "title": "REHABILITATION COUNSELING PSYCHOLOGY-CLINICAL PRACTICE SEMINAR"
        }
    },
    {
        "data": {
            "description": "History, development, principles, and theories and models of clinical rehabilitation counseling and psychosocial theory and research relevant to disability.",
            "id": "RP&SE 732",
            "parent": "RP&SE",
            "title": "CLINICAL REHABILITATION COUNSELING - FOUNDATIONS"
        }
    },
    {
        "data": {
            "description": "Career development and related interventions in clinical rehabilitation counseling practice.",
            "id": "RP&SE 725",
            "parent": "RP&SE",
            "title": "CLINICAL REHABILITATION COUNSELING - CAREER DEVELOPMENT & INTERVENTIONS"
        }
    },
    {
        "data": {
            "description": "Seminar in the psychology of individual differences, providing broad and general coverage of theory and research related to individual and cultural differences.",
            "id": "COUNPSY/EDPSYCH/RP&SE 736",
            "title": "SEMINAR IN PSYCHOLOGY OF INDIVIDUAL DIFFERENCES"
        }
    },
    {
        "data": {
            "description": "Legal requirements and issues relative to special education and pupil services programs; special education, juvenile justice, programs for English language learners, programs for children who are homeless; examination of applicable federal and state statutes and case law.",
            "id": "EDPOL/EDPSYCH/ELPA/RP&SE 842",
            "title": "LEGAL FOUNDATIONS OF SPECIAL EDUCATION AND PUPIL SERVICES"
        }
    },
    {
        "data": {
            "description": "Examine the lived experience of Australians with disabilities, comparing the treatment of and services provided to disabled US Americans and Australians with respect to the standards outlined in the United Nations' Convention on the Rights of Persons with Disabilities (CRPD) and localized policies abroad, and considering the US and Australia's multicultural landscape and shared colonial background. Understand issues surrounding disability access, inclusion, and rights globally to become effective advocates for positive change. Must have sophomore standing and a valid passport.",
            "id": "RP&SE 311",
            "parent": "RP&SE",
            "title": "INTERNATIONAL PERSPECTIVES ON DISABILITY IN AUSTRALIA"
        }
    },
    {
        "data": {
            "description": "Introduction to a variety of approaches for teaching mathematics to students in inclusive schools",
            "id": "CURRIC/RP&SE 365",
            "title": "TEACHING MATHEMATICS IN INCLUSIVE SETTINGS"
        }
    },
    {
        "data": {
            "description": "Coordinating and effective utilization of school-based special services in the context of student diversity with attention to values, theory, and research underlying curriculum, instruction and policy, in terms of social class, gender, sexual orientation, disability, and race.",
            "id": "ELPA 735",
            "parent": "ELPA",
            "title": "LEADERSHIP FOR EQUITY AND DIVERSITY"
        }
    },
    {
        "data": {
            "source": "COUNPSY/CURRIC/EDPOL/EDPSYCH/ELPA/RP&SE 719",
            "target": "COUNPSY/CURRIC/EDPOL/EDPSYCH/ELPA/RP&SE 788"
        }
    },
    {
        "data": {
            "description": "Children with exceptional learning and behavior characteristics (contrasting views and practices); a humanistic behavioral approach; development and evaluation of behavior change programs, classification and foundations of exceptional learning and behavior characteristics, and facilitating behavior change in different settings.",
            "id": "RP&SE 330",
            "parent": "RP&SE",
            "title": "BEHAVIOR ANALYSIS: APPLICATIONS TO PERSONS WITH DISABILITIES"
        }
    },
    {
        "data": {
            "description": "Provides knowledge and understanding of concepts of self-management of chronic Illness and disability using both theoretical and empirically-based approaches. Includes discussion of collaboration among healthcare providers in helping individuals manage symptoms of their chronic health conditions, condition-specific education about the typical symptoms and advice about the decisions and actions that the individual with the chronic health condition can take when those symptoms occur, and coping skills that can be facilitated to address the emotional reactions and stress related to chronic health conditions.",
            "id": "RP&SE 325",
            "parent": "RP&SE",
            "title": "SELF MANAGEMENT OF CHRONIC ILLNESS AND DISABILITY"
        }
    },
    {
        "data": {
            "description": "Examines the interaction between disability and media in modern society. Explore representations of disability in various forms of mass media, including television and film, social media, advertising, and others. Analyze how these representations affect disabled people directly, including the development of their identities, as well as how they influence disability attitudes and stigma throughout society. Discuss overt and casual ableism within media, as well as how the disability community uses media for activism. Discuss issues of access for disabled people (e.g., assistive technology, captions, audio descriptions), as well as the future of disability representations within media.",
            "id": "COMARTS/JOURN/RP&SE 312",
            "title": "DISABILITY AND THE MEDIA"
        }
    },
    {
        "data": {
            "id": "RP&SE",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Focus on data analysis and translation of finds and implications. Gain theoretical and practical knowledge and skills regarding coding and analysis techniques, use of qualitative analytic tools, strategies for sharing findings with audiences beyond research team.",
            "id": "COUNPSY/CURRIC/EDPOL/EDPSYCH/ELPA/RP&SE 789",
            "title": "QUALITATIVE RESEARCH METHODS IN EDUCATION: FIELD METHODS II"
        }
    },
    {
        "data": {
            "description": "Seminar in the history of psychology, providing broad and general coverage of the development of psychology as a scientific discipline. Includes coverage of philosophy of science and systems of psychological inquiry, with applications to current research in psychology.",
            "id": "COUNPSY/EDPSYCH/RP&SE 737",
            "title": "SEMINAR IN HISTORY AND SYSTEMS OF PSYCHOLOGY"
        }
    },
    {
        "data": {
            "description": "",
            "id": "RP&SE 999",
            "parent": "RP&SE",
            "title": "INDEPENDENT READING"
        }
    },
    {
        "data": {
            "source": "RP&SE 890",
            "target": "RP&SE 900"
        }
    },
    {
        "data": {
            "description": "Practicum teaching in an approved placement with a qualified cooperating teacher serving students with disabilities in any of grades 4-12, supervised by a qualified university supervisor. Placement schedule determined by course instructor.",
            "id": "RP&SE 476",
            "parent": "RP&SE",
            "title": "SPECIAL EDUCATION PRACTICUM: SECONDARY (GRADES 4-12)"
        }
    },
    {
        "data": {
            "description": "Psychometric theory and statistics and testing and assessment procedures in clinical rehabilitation and mental health counseling practice.",
            "id": "RP&SE 720",
            "parent": "RP&SE",
            "title": "CLINICAL REHABILITATION & MENTAL HEALTH COUNSELING - ASSESSMENT"
        }
    },
    {
        "data": {
            "description": "Designed to engage in an exploration and discussion of issues and trends in special education as relates to the diversity of populations, based on race/ethnicity, socioeconomic backgrounds, disability label, gender, language dominance, etc., receiving special education.",
            "id": "RP&SE 710",
            "parent": "RP&SE",
            "title": "MULTICULTURAL ISSUES IN SPECIAL EDUCATION"
        }
    },
    {
        "data": {
            "description": "Research and program evaluation methods and understanding of published research in clinical rehabilitation counseling, mental health counseling, and special education settings.",
            "id": "RP&SE 700",
            "parent": "RP&SE",
            "title": "RESEARCH METHODS IN REHABILITATION, MENTAL HEALTH, & SPECIAL EDUCATION"
        }
    },
    {
        "data": {
            "description": "Provides an overview of disabilities with an emphasis on biological, psycho-social, and vocational aspects.",
            "id": "RP&SE 505",
            "parent": "RP&SE",
            "title": "BIOLOGICAL, PSYCHOSOCIAL, AND VOCATIONAL ASPECTS OF DISABILITIES"
        }
    },
    {
        "data": {
            "description": "Provides an overview of the context and unique considerations for providing special education services to culturally and linguistically diverse learners and their families.  Upon completion, describe the diversity of students who receive special education services, including trends over time, and identify deficit orientations toward diversity, culture and disability that limit youths' opportunities to learn.",
            "id": "RP&SE 466",
            "parent": "RP&SE",
            "title": "DIVERSITY IN SPECIAL EDUCATION"
        }
    },
    {
        "data": {
            "description": "Focus on theories and practices to promote positive, proactive, and culturally responsive management of K-12 inclusive classrooms. Topics covered include multi-tiered systems of support, functional behavior assessment, and behavioral intervention plan.",
            "id": "RP&SE 473",
            "parent": "RP&SE",
            "title": "CLASSROOM MANAGEMENT FOR INCLUSIVE CLASSROOMS"
        }
    },
    {
        "data": {
            "description": "Diagnostic assessment and planning of treatment, interventions and services in clinical rehabilitation counseling, including both clinical and career and work-related assessments and interventions, in addition to advocacy.",
            "id": "RP&SE 830",
            "parent": "RP&SE",
            "title": "CLINICAL REHABILITATION COUNSELING - DIAGNOSIS & TREATMENT PLANNING"
        }
    },
    {
        "data": {
            "description": "Addresses a range of issues to help teachers more thoughtfully and equitably serve their students of color and develop a critical and historical understanding of the racism, marginalization, and exclusion that is endemic to the U.S. public school system. Provides an overview of foundational constructs that  are essential for pre-service teachers preparing to teach and serve diverse students and families. Explore how race, racism, and racialization in education intersect with class, gender, dis/ability, religion, sexuality, etc. to shape inequitable schooling conditions and experiences for students of color. Analyze the effects at the individual, interactional, institutional, and societal levels Consider how power always-already enables particular policies and practices that reproduce educational inequities and hence sustain white privilege and dominance.",
            "id": "CURRIC/RP&SE 406",
            "title": "RACE, INTERSECTIONALITY, AND EQUITY IN EDUCATION"
        }
    },
    {
        "data": {
            "description": "Introduction to research in the field of special education and provides an opportunity to acquire knowledge related to research methodology, gain competencies in critically consuming research, and spark interests in conducting action research.",
            "id": "RP&SE 780",
            "parent": "RP&SE",
            "title": "INTRODUCTION TO RESEARCH IN SPECIAL EDUCATION"
        }
    },
    {
        "data": {
            "description": "Comparison of historical and current practices in special education; legal, philosophical, and programmatic changes leading to inclusive models of education; emphasis on concepts of collaboration, cooperative learning structures, and curricular and instructional adaptations to accommodate learners with disabilities in general education classrooms.",
            "id": "CURRIC/RP&SE 506",
            "title": "STRATEGIES FOR INCLUSIVE SCHOOLING"
        }
    },
    {
        "data": {
            "description": "Full time student teaching in an approved placement with a qualified cooperating teacher serving students with disabilities in any of grades 4-12, supervised by a qualified university supervisor. Placement schedule follows the host school district calendar.",
            "id": "RP&SE 478",
            "parent": "RP&SE",
            "title": "SPECIAL EDUCATION STUDENT TEACHING: SECONDARY (GRADES 4-12)"
        }
    },
    {
        "data": {
            "description": "Advanced statistical methods, design, instrumentation, and procedures in research and program evaluation in disability and rehabilitation settings.",
            "id": "RP&SE 985",
            "parent": "RP&SE",
            "title": "ADVANCED METHODOLOGIES IN DISABILITY & REHABILITATION RESEARCH"
        }
    },
    {
        "data": {
            "description": "Leadership theory and practice, history, basic philosophy, and professional issues in clinical rehabilitation counseling and rehabilitation counselor education.",
            "id": "RP&SE 983",
            "parent": "RP&SE",
            "title": "REHABILITATION COUNSELOR EDUCATION - LEADERSHIP & PROFESSIONAL ISSUES"
        }
    },
    {
        "data": {
            "description": "Theories of counseling and related interventions in clinical rehabilitation counseling practice.",
            "id": "RP&SE 820",
            "parent": "RP&SE",
            "title": "CLINICAL REHABILITATION COUNSELING - COUNSELING THEORIES"
        }
    },
    {
        "data": {
            "description": "Provides an introduction to the concepts and processes of case management, including case planning, service coordination, referral to and utilization of other disciplines, and client advocacy; and integrating community resources and services for rehabilitation planning with persons with disabilities. Emphases on the basic principles of supporting persons with disabilities within clinical and service systems. Fosters knowledge and understanding of how theories and research translate into appropriate case management practices and explores the case management roles and processes involved in integrated, interdisciplinary, and community service settings.",
            "id": "RP&SE 520",
            "parent": "RP&SE",
            "title": "CASE MANAGEMENT AND COMMUNITY RESOURCES"
        }
    },
    {
        "data": {
            "description": "Overview of the experiences, symptoms, and unique diagnoses of individuals with severe mental health illness along with common co-occurring diagnoses. Introduction to the guiding principles that rehabilitation services and human services use to support these populations.",
            "id": "RP&SE 390",
            "parent": "RP&SE",
            "title": "COMMUNITY PSYCHIATRIC REHABILITATION"
        }
    },
    {
        "data": {
            "description": "Provides introductory and interdisciplinary life-span perspectives on disability, relevant for both education and non-education majors. Introduces theoretical, cultural, and political models of disability and explores the lived experiences of persons with disabilities (or people who are perceived to have disabilities) in society.",
            "id": "RP&SE 100",
            "parent": "RP&SE",
            "title": "DISABILITY AND SOCIETY"
        }
    },
    {
        "data": {
            "source": "RP&SE 630",
            "target": "RP&SE 501"
        }
    },
    {
        "data": {
            "source": "RP&SE 125",
            "target": "RP&SE 535"
        }
    },
    {
        "data": {
            "description": "Supervised experience in clinical rehabilitation counseling practice (beginning).",
            "id": "RP&SE 880",
            "parent": "RP&SE",
            "title": "CLINICAL REHABILITATION COUNSELING - SUPERVISED PRACTICUM I"
        }
    },
    {
        "data": {
            "description": "Addresses the theory and practice of mixed methods inquiry, particularly within disability-related fields of study. Introduces to mixed methods design, data collection, and analysis approaches. Discuss how mixed methods inquiry builds on experimental and quasi-experimental quantitative research, qualitative research, and general social science frameworks for research inquiry. Additional topics include the history of mixed methods research, various philosophical traditions and paradigms applied when mixing methods, purposes for mixed methods research, and contemporary issues in mixed methods inquiry.",
            "id": "RP&SE 875",
            "parent": "RP&SE",
            "title": "MIXED METHODS INQUIRY IN DISABILITY, EDUCATION AND RELATED RESEARCH"
        }
    },
    {
        "data": {
            "description": "Supervised experience in clinical rehabilitation counseling practice (advanced).",
            "id": "RP&SE 900",
            "parent": "RP&SE",
            "title": "CLINICAL REHABILITATION COUNSELING - SUPERVISED PRACTICUM III"
        }
    },
    {
        "data": {
            "description": "Supervised experience in rehabilitation research and scholarship.",
            "id": "RP&SE 940",
            "parent": "RP&SE",
            "title": "REHABILITATION COUNSELOR EDUCATION - SUPERVISED RESEARCH"
        }
    },
    {
        "data": {
            "description": "Explore the use of technology to provide evaluation, consultation, and services to the community. Study the creation and use of telecounseling and other remote strategies to provide services that are accessible to individuals unable to receive care in a traditional office setting. Introduce technology for remote service provision and a foundational knowledge to effectively integrate this service modality as this practice evolves.",
            "id": "RP&SE 355",
            "parent": "RP&SE",
            "title": "REMOTE SERVICE PROVISION STRATEGIES FOR HEALTH AND REHABILITATION PROVIDERS"
        }
    },
    {
        "data": {
            "description": "Addresses professionalism, research and problem solving, assessment, and collaborative skills relevant to the elementary special education student teaching placement.",
            "id": "RP&SE 467",
            "parent": "RP&SE",
            "title": "ELEMENTARY STUDENT TEACHING SEMINAR"
        }
    },
    {
        "data": {
            "description": "Prepares special educators to develop curriculum for students with disabilities aligned with general education content. Identifying appropriate Individualized Education Plan goals, supplementary aids and services, and service coordination in inclusive school contexts will be emphasized. Activities will cover three main topics, which will be woven through our activities, class readings, and assignments throughout the semester. These topics are: (a) planning supports for inclusion and access throughout the school day; (b) developing meaningful grade- and standards-aligned Individualized Education Plans; and (c) teaching and adapting general curriculum content.",
            "id": "RP&SE 515",
            "parent": "RP&SE",
            "title": "ACCESS TO THE GENERAL CURRICULUM FOR STUDENTS WITH DISABILITIES"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Supervised experience with concurrent instruction in teaching methods with graduate students in clinical rehabilitation counseling and undergraduates in rehabilitation psychology.",
            "id": "RP&SE 930",
            "parent": "RP&SE",
            "title": "REHABILITATION COUNSELOR EDUCATION - TEACHING"
        }
    },
    {
        "data": {
            "description": "Covers instructional approaches and practices that support developmentally appropriate, effective, and inclusive early childhood education and evidenced-based intervention for preschool and early elementary-age children (i.e., 3-8 years old). Focuses on strategies for supporting access to the general education curriculum, participation, and achievement of young children with developmental delays and disabilities. Learn \"what\" to teach, the selection of developmentally- and individually-appropriate child goals and objectives, and \"how\" to teach, the practical components of developing and delivering effective, evidenced based instruction and intervention. Emphasis is placed on adapting general early childhood education curriculum and practices in order to support children's individualized goals within inclusive classrooms. Addresses planning and implementing instruction in alignment with state and federal mandates.",
            "id": "RP&SE 460",
            "parent": "RP&SE",
            "title": "EARLY CHILDHOOD SPECIAL EDUCATION METHODS: INCLUSIVE STRATEGIES FOR PRESCHOOL AND EARLY ELEMENTARY"
        }
    },
    {
        "data": {
            "description": "Overview of the roles and functions of rehabilitation professionals who provide services and expert testimony in matters of litigation, such as worker's compensation, personal injury, product liability, medical/professional malpractice, catastrophic injury, and others. Ethical standards, practices, and common situations found in the litigation process.",
            "id": "RP&SE 535",
            "parent": "RP&SE",
            "title": "INTRODUCTION TO FORENSIC REHABILITATION"
        }
    },
    {
        "data": {
            "description": "Addresses professionalism, research and problem solving, assessment, and collaborative skills relevant to the elementary and special education student teaching placement.",
            "id": "RP&SE 457",
            "parent": "RP&SE",
            "title": "ELEMENTARY STUDENT TEACHING SEMINAR - ELEMENTARY/SPECIAL EDUCATION DUAL MAJOR"
        }
    },
    {
        "data": {
            "source": "RP&SE 125",
            "target": "RP&SE 505"
        }
    },
    {
        "data": {
            "description": "Explore instructional approaches and practices that support developmentally appropriate, effective, and inclusive early childhood education and evidenced-based intervention for infants and toddlers (i.e., birth-3 years old). Learn strategies to support access to the general education curriculum, participation, and achievement of young children with developmental delays and disabilities. Examines \"what\" to teach, the selection of developmentally- and individually-appropriate child goals and objectives, and \"how\" to teach, the practical components of developing and delivering effective, evidenced based instruction and intervention. Emphasis on adapting general early childhood education curriculum and practices in order to support children's individualized goals within inclusive classrooms. Addresses planning and implementing instruction in alignment with state and federal mandates.",
            "id": "RP&SE 455",
            "parent": "RP&SE",
            "title": "EARLY CHILDHOOD SPECIAL EDUCATION METHODS: INCLUSIVE STRATEGIES FOR INFANTS AND TODDLERS"
        }
    },
    {
        "data": {
            "description": "Advanced assessment practices and interpretation of findings in clinical rehabilitation counseling, including the assessment of intelligence, neuropsychological functioning, and personality.",
            "id": "RP&SE 980",
            "parent": "RP&SE",
            "title": "CLINICAL REHABILITATION COUNSELING - ADVANCED ASSESSMENT PRACTICE"
        }
    },
    {
        "data": {
            "description": "Equips the knowledge and skills necessary to be thoughtful critically consumers and producers of education and special education research. Designed to: (a) provide an overview of the variety of research methods and approaches typically used in special education and the utility of these methods and approaches in addressing educational problems and issues; (b) critically appraise published peer-reviewed research in special education; (c) develop the skills necessary to summarize, synthesize and expand upon research already conducted on topics of personal and professional relevance; and (d) communicate research ideas, findings, and implications for practice and future research to a variety of audiences in an effective and professional manner.",
            "id": "RP&SE 872",
            "parent": "RP&SE",
            "title": "SEMINAR IN SPECIAL EDUCATION RESEARCH"
        }
    },
    {
        "data": {
            "description": "Supervised experience with concurrent instruction in the individual and group supervision of practicum students in Clinical Rehabilitation Counseling.",
            "id": "RP&SE 920",
            "parent": "RP&SE",
            "title": "REHABILITATION COUNSELOR EDUCATION - COUNSELING SUPERVISION"
        }
    },
    {
        "data": {
            "description": "Intensive examination of theoretical conceptions in contemporary social psychology, including learning-theoretic, reinforcement, incentive, cognitive, and psychodynamic approaches, and research in selected topic areas reflecting these approaches, such as aggression, attitude formation and change, conformity, limitation and modeling, interpersonal attraction, perception of others, prosocial behavior, and social influence.",
            "id": "COUNPSY/PSYCH/RP&SE 729",
            "title": "ADVANCED SOCIAL PSYCHOLOGY"
        }
    },
    {
        "data": {
            "description": "Explores current issues, topics, and trends in special education.",
            "id": "RP&SE 405",
            "parent": "RP&SE",
            "title": "CURRENT TOPICS IN SPECIAL EDUCATION"
        }
    },
    {
        "data": {
            "source": "COUNPSY/CURRIC/EDPOL/EDPSYCH/ELPA/RP&SE 788",
            "target": "COUNPSY/CURRIC/EDPOL/EDPSYCH/ELPA/RP&SE 789"
        }
    },
    {
        "data": {
            "description": "Key issues and trends in special education today are examined in detail. These issues and trends are discussed within the context of ecological models of human development. Gain knowledge about child and adolescent development within the contexts of families, peer groups, schools, and communities. Apply this knowledge to teaching and practice linking these to current concepts and issues in the field. Examines the role of education and educators in providing effective supports and services to promote student learning and well-being, considering the \"whole child\". Gain awareness, knowledge and skills to be critical thinkers, effective educators, and leaders in the field of education including special education. Although much of what is covered will have clear implications for intervention and practice, this is not a methods or techniques course with a \"how to\" focus.",
            "id": "RP&SE 605",
            "parent": "RP&SE",
            "title": "DEVELOPMENT, LEARNING AND EDUCATION FOUNDATIONS IN SPECIAL EDUCATION"
        }
    },
    {
        "data": {
            "source": "RP&SE 300",
            "target": "RP&SE 330"
        }
    },
    {
        "data": {
            "description": "Provides information and methods necessary to provide individualized programming in transition and vocational education for students with disabilities, grades six through twelve.",
            "id": "RP&SE 472",
            "parent": "RP&SE",
            "title": "METHODS IN TRANSITION AND VOCATIONAL EDUCATION"
        }
    },
    {
        "data": {
            "description": "",
            "id": "RP&SE 990",
            "parent": "RP&SE",
            "title": "RESEARCH OR THESIS"
        }
    },
    {
        "data": {
            "description": "Supervised experience in counseling and direct service, supervision, teaching, research, and advocacy and leadership.",
            "id": "RP&SE 955",
            "parent": "RP&SE",
            "title": "INTERNSHIP IN REHABILITATION COUNSELOR EDUCATION II"
        }
    },
    {
        "data": {
            "description": "Provides an overview of the evidence-based practices and common practices for the treatment of addiction disorders. Emphasis is placed on training of the interventions used in the treatment of substance abuse and dependence.",
            "id": "RP&SE 721",
            "parent": "RP&SE",
            "title": "ADDICTIONS COUNSELING"
        }
    },
    {
        "data": {
            "description": "Provides an overview of qualitative inquiry, examining assumptions, standards, and methods for generating and communicating interpretations. Methodological and theoretical works illustrate case study, ethnography, narrative, and action research. Does not include a field method component.",
            "id": "COUNPSY/CURRIC/EDPOL/EDPSYCH/ELPA/RP&SE 719",
            "title": "INTRODUCTION TO QUALITATIVE RESEARCH"
        }
    },
    {
        "data": {
            "description": "Addresses theories and research related to health psychology, health behavior and quality of life. Focus on understanding models of healthy lifestyle interventions, assessment/intervention strategies for health promotion, factors affecting health behavior, public health initiatives. Attention is given to application of practical tools for promoting health and preventing secondary conditions for individuals with disabilities and chronic illness.",
            "id": "RP&SE 316",
            "parent": "RP&SE",
            "title": "HEALTH PROMOTION FOR INDIVIDUALS WITH DISABILITY AND CHRONIC ILLNESS"
        }
    },
    {
        "data": {
            "description": "History, philosophy, principles, legislation, and development of vocational rehabilitation; organizational structure and objectives of the principal community agencies.",
            "id": "RP&SE 500",
            "parent": "RP&SE",
            "title": "REHABILITATION-COUNSELING PSYCHOLOGY: FOUNDATIONS"
        }
    },
    {
        "data": {
            "description": "Review of theory and research on psychosocial aspects of chronic illness and disability; and research priorities, approaches, and methods to improving understanding of psychosocial factors in clinical rehabilitation counseling.",
            "id": "RP&SE 903",
            "parent": "RP&SE",
            "title": "REHABILITATION COUNSELOR EDUCATION - PSYCHOSOCIAL THEORY & RESEARCH"
        }
    },
    {
        "data": {
            "source": "RP&SE 945",
            "target": "RP&SE 955"
        }
    },
    {
        "data": {
            "description": "Supervised experience in clinical rehabilitation counseling practice (intermediate).",
            "id": "RP&SE 890",
            "parent": "RP&SE",
            "title": "CLINICAL REHABILITATION COUNSELING - SUPERVISED PRACTICUM II"
        }
    },
    {
        "data": {
            "description": "Supervised experience with concurrent instruction in teaching methods and development of teaching philosophy with graduate students in special education.",
            "id": "RP&SE 942",
            "parent": "RP&SE",
            "title": "INTERNSHIP IN POSTSECONDARY TEACHING"
        }
    },
    {
        "data": {
            "description": "Introductory field methods experience in qualitative research. Learn to define good research questions, determine which methods of data collection and analysis are useful for addressing those questions, engage in these methods, reflect on their utility in education research.",
            "id": "COUNPSY/CURRIC/EDPOL/EDPSYCH/ELPA/RP&SE 788",
            "title": "QUALITATIVE RESEARCH METHODS IN EDUCATION: FIELD METHODS I"
        }
    },
    {
        "data": {
            "description": "Designed to prepare future special educators to plan and provide language and reading instruction to a broad range of students with disabilities.",
            "id": "RP&SE 465",
            "parent": "RP&SE",
            "title": "LANGUAGE AND READING INSTRUCTION FOR STUDENTS WITH DISABILITIES"
        }
    },
    {
        "data": {
            "description": "Designed for learning about special education, particularly related to careers in this field. Provides information on the history and evolution of special education and special educators' roles.",
            "id": "RP&SE 200",
            "parent": "RP&SE",
            "title": "ISSUES IN SPECIAL EDUCATION"
        }
    },
    {
        "data": {
            "description": "Engage participants in a critical exploration of Special Education issues and trends as located in social, cultural, philosophical, and historical contexts.",
            "id": "RP&SE 871",
            "parent": "RP&SE",
            "title": "FOUNDATIONS OF SPECIAL EDUCATION"
        }
    },
    {
        "data": {
            "description": "Legal and ethical issues for counselors, with an emphasis on the American Counseling Association (ACA) and Commission on Rehabilitation Counselor Certification (CRCC) ethics codes and Wisconsin statutes relevant to counseling practice and research.",
            "id": "RP&SE 735",
            "parent": "RP&SE",
            "title": "LEGAL & ETHICAL BASES OF COUNSELING"
        }
    },
    {
        "data": {
            "description": "Theory and technique in group counseling in clinical rehabilitation counseling practice.",
            "id": "RP&SE 840",
            "parent": "RP&SE",
            "title": "CLINICAL REHABILITATION COUNSELING - GROUP COUNSELING"
        }
    },
    {
        "data": {
            "description": "Introduction to rehabilitation and human service programs for people with disabilities and other special needs. Emphasis on communication relevant to professional service, particularly writing.",
            "id": "RP&SE 501",
            "parent": "RP&SE",
            "title": "REHABILITATION-COUNSELING PSYCHOLOGY: APPLICATIONS"
        }
    },
    {
        "data": {
            "description": "An exploration of various health and rehabilitation professions within the United States health care system, including educational requirements, professional expectations, and practice sites. Consideration is given to career planning in health and rehabilitation professions with review of current employment opportunities and workforce trends.",
            "id": "RP&SE 125",
            "parent": "RP&SE",
            "title": "HEALTH AND REHABILITATION PROFESSIONS"
        }
    }
]