[
    {
        "data": {
            "description": "Apply principles of community engagement in the field of health services research. Read and interpret relevant articles, and discuss implications of these readings. Learn existing models and practical approaches for successfully partnering with community stakeholders to address health and medication-related needs through research.",
            "id": "S&APHM 703",
            "parent": "S&APHM",
            "title": "COMMUNITY ENGAGEMENT IN HEALTH SERVICES RESEARCH"
        }
    },
    {
        "data": {
            "description": "Introduces concepts and principles related to managing pharmacy operations and systems for patient care, and managing financial aspects of pharmacies.",
            "id": "S&APHM 514",
            "parent": "S&APHM",
            "title": "MANAGING PHARMACY SYSTEMS FOR PATIENT CARE"
        }
    },
    {
        "data": {
            "id": "S&APHM",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Prepare to enter professional careers requiring knowledge of grant-writing.  Mechanics of proposal writing and social aspects of \"grantsmanship,\" skill development in identifying sources of grant funding, practice research to support applications, and tailor proposals to specific audience interests.  Utilizing an iterative and peer supported process, draft parts of an R36 dissertation grant.",
            "id": "S&APHM 701",
            "parent": "S&APHM",
            "title": "GRANT WRITING FOR HEALTH SERVICES RESEARCH"
        }
    },
    {
        "data": {
            "source": "S&APHM 411",
            "target": "S&APHM 414"
        }
    },
    {
        "data": {
            "description": "Intermediate principles of pharmacist communication with patients and other care givers; weekly communications laboratory provides opportunity to refine skills in listening, interviewing, counseling, and use of various educational and behavioral strategies to improve drug use.",
            "id": "S&APHM 652",
            "parent": "S&APHM",
            "title": "PHARMACIST COMMUNICATION: EDUCATIONAL AND BEHAVIORAL INTERVENTIONS"
        }
    },
    {
        "data": {
            "description": "Introduction to psychosocial and behavioral aspects of pharmacy practice and patient care, including professional, ethical decision-making; the pharmacist's role in patient care and public health; patient perspectives and factors related to health and medication use; and patient-pharmacist interaction and communication.",
            "id": "S&APHM 414",
            "parent": "S&APHM",
            "title": "SOCIAL AND BEHAVIORAL ASPECTS OF PHARMACY PRACTICE"
        }
    },
    {
        "data": {
            "description": "Development of skills in the methods, techniques, and problems encountered in conducting evaluations of pharmaceutical services, programs, and policies.",
            "id": "S&APHM 711",
            "parent": "S&APHM",
            "title": "RESEARCH METHODS FOR PHARMACEUTICAL OUTCOMES AND POLICY RESEARCH"
        }
    },
    {
        "data": {
            "description": "Directed study projects as arranged with a faculty member.",
            "id": "S&APHM 699",
            "parent": "S&APHM",
            "title": "ADVANCED INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Pharmaceutical field, from antiquity to modern medical care; professional; structuring in principal countries of the West.",
            "id": "HISTSCI/S&APHM 401",
            "title": "HISTORY OF PHARMACY"
        }
    },
    {
        "data": {
            "source": "S&APHM 514",
            "target": "S&APHM 611"
        }
    },
    {
        "data": {
            "description": "Introduction to health care systems. Factors affecting health and the value placed on health, the delivery of health care in different settings, the roles of various health workers, and the sociological and economic aspects of health care.",
            "id": "NURSING/S&APHM/SOCWORK 105",
            "title": "HEALTH CARE SYSTEMS: INTERDISCIPLINARY APPROACH"
        }
    },
    {
        "data": {
            "description": "Exposes students to research related to SAS topics, discuss strategies for writing research theses and articles, discuss various methodological approaches to answering research questions, and improve oral and written communication skills. Seminars may involve presenting completed and/or planned research, leading discussions among seminar participants about research topics, and discussing written assignments.",
            "id": "S&APHM 911",
            "parent": "S&APHM",
            "title": "RESEARCH SEMINAR IN SOCIAL & ADMINISTRATIVE PHARMACY"
        }
    },
    {
        "data": {
            "description": "Directed study projects for graduate students as arranged with a faculty member.",
            "id": "S&APHM 999",
            "parent": "S&APHM",
            "title": "ADVANCED INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Independent research and writing for graduate students under the supervision of a faculty member.",
            "id": "S&APHM 990",
            "parent": "S&APHM",
            "title": "RESEARCH"
        }
    },
    {
        "data": {
            "description": "Critical review and application of social behavioral theories, methodologies, and research to current problems in pharmacy, pharmacist communication and interaction with consumers and other providers, use of prescription and nonprescription drugs, and self-care.",
            "id": "S&APHM 715",
            "parent": "S&APHM",
            "title": "SOCIAL BEHAVIORAL THEORIES IN PHARMACY, DRUG USE, AND HEALTH BEHAVIOR"
        }
    },
    {
        "data": {
            "description": "Orientation to the US health care system and pharmacy's integral role within it. Address roles and responsibilities of different individuals and organizations involved in the provision of health care, issues of insurance coverage, reimbursement, and payment for health care services. Apply principles of personnel management in pharmacy practice.",
            "id": "S&APHM 411",
            "parent": "S&APHM",
            "title": "PHARMACY IN THE HEALTH CARE SYSTEM"
        }
    },
    {
        "data": {
            "description": "Federal and Wisconsin laws related to drug manufacture, drug distribution, drug use, and pharmacy practice.",
            "id": "S&APHM 611",
            "parent": "S&APHM",
            "title": "PHARMACY LAW AND REGULATION"
        }
    },
    {
        "data": {
            "description": "Apply Dissemination and Implementation (DI) as well as sustainability concepts and principals to support organizational change efforts in different healthcare settings or learn how to conduct Sustainability research in their professional careers. Identify DI frameworks, appropriate implementation strategies, study designs and outcomes to address the implementation of an evidence-based practice or a specific organizational change.",
            "id": "S&APHM 704",
            "parent": "S&APHM",
            "title": "DISSEMINATION, IMPLEMENTATION AND SUSTAINMENT OF CHANGE IN HEALTH SERVICES RESEARCH"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "S&APHM 411",
            "target": "S&APHM 652"
        }
    },
    {
        "data": {
            "description": "Specialized subject matter of current interest to undergraduate and professional students.",
            "id": "S&APHM 490",
            "parent": "S&APHM",
            "title": "SELECTED TOPICS IN SOCIAL AND ADMINISTRATIVE PHARMACY"
        }
    },
    {
        "data": {
            "description": "Various components necessary to become an accomplished administrator of a pharmacy department in a hospital or organized health care setting.",
            "id": "S&APHM 716",
            "parent": "S&APHM",
            "title": "ADVANCED HOSPITAL PHARMACY ADMINISTRATION"
        }
    },
    {
        "data": {
            "description": "Increase awareness, understanding, and knowledge about how mixed methods research fits into the broader world of health services research. Exposure to research and lay literature in health services research in pharmacy and related fields. Improve ability to write technically, read and interpret mixed methods research articles, and discuss implications of research findings.",
            "id": "S&APHM 702",
            "parent": "S&APHM",
            "title": "MIXED METHODS FOR HEALTH SCIENCES: PURPOSE, DESIGN AND APPROACH"
        }
    }
]