[
    {
        "data": {
            "description": "An introduction to Danish philosopher Søren Kierkegaard and existentialism in Scandinavian literature. An overview into Kierkegaard's work in translation and his influence on a number of Scandinavian writers from the 19th century to the 21st.",
            "id": "SCANDST 426",
            "parent": "SCANDST",
            "title": "KIERKEGAARD AND SCANDINAVIAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Blixen's tales and biographical fiction; themes of gender, power, dreams, and love.",
            "id": "SCANDST 434",
            "parent": "SCANDST",
            "title": "THE ART OF ISAK DINESEN/KAREN BLIXEN"
        }
    },
    {
        "data": {
            "description": "Eddic and skaldic poetry; homilies and saints' lives, kings' sagas, sagas of the Icelanders; mythical-heroic sagas and romances; rimur.",
            "id": "MEDIEVAL/SCANDST 409",
            "title": "SURVEY OF OLD NORSE-ICELANDIC LITERATURE"
        }
    },
    {
        "data": {
            "description": "Examines the European context of literary decadence (Baudelaire, Huysmans, Wilde) and how it inspired some of Scandinavia's most important writers (Strindberg, Hamsun, Jacobsen).",
            "id": "SCANDST 450",
            "parent": "SCANDST",
            "title": "SCANDINAVIAN DECADENCE IN ITS EUROPEAN CONTEXT"
        }
    },
    {
        "data": {
            "description": "Forms and themes of Scandinavian children's literature from the nineteenth century to the present. Exploration of the dominant concerns of authors, adult and non-adult audiences. Film adaptations and Scandinavian-American materials included.",
            "id": "SCANDST 419",
            "parent": "SCANDST",
            "title": "SCANDINAVIAN CHILDREN'S LITERATURE"
        }
    },
    {
        "data": {
            "description": "In-depth study of topic of faculty's choice.",
            "id": "SCANDST 901",
            "parent": "SCANDST",
            "title": "SEMINAR IN SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "Interdisciplinary study of Sami (Lapp) people of Scandinavia past and present. Indigenous modes of expression and worldview, contemporary cultural and political activism. Extensive discussion of connections to Native American and Inuit experiences; rise of U.S. and other indigenous peoples' movements.",
            "id": "FOLKLORE/SCANDST 443",
            "title": "SAMI CULTURE, YESTERDAY AND TODAY"
        }
    },
    {
        "data": {
            "description": "Through a selection of short texts, novels, and plays, we'll be learning from some of the best: Nobel Laureates (Knut Hamsun, Pär Lagerkvist), medical doctors (P.C. Jersild), and other provocateurs (August Strindberg, Isak Dinesen, Ingmar Berman, Peter Hoeg, and the rest).",
            "id": "SCANDST 374",
            "parent": "SCANDST",
            "title": "MASTERPIECES OF SCANDINAVIAN LITERATURE: THE TWENTIETH CENTURY"
        }
    },
    {
        "data": {
            "description": "A history of writing in Iceland 1150-1550 on the basis of manuscripts as principal sources of evidence for Old Norse-Icelandic.",
            "id": "SCANDST 511",
            "parent": "SCANDST",
            "title": "PALEOGRAPHY AND PHILOLOGY - OLD NORSE"
        }
    },
    {
        "data": {
            "description": "Advanced directed study projects as arranged with a faculty member.",
            "id": "SCANDST 698",
            "parent": "SCANDST",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Advanced directed study projects as arranged with a faculty member.",
            "id": "SCANDST 699",
            "parent": "SCANDST",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Advanced level mentored reading and research for students with dissertator status.",
            "id": "SCANDST 990",
            "parent": "SCANDST",
            "title": "RESEARCH AND THESIS"
        }
    },
    {
        "data": {
            "description": "Advanced level mentored reading and research for students with dissertator status.",
            "id": "SCANDST 999",
            "parent": "SCANDST",
            "title": "INDEPENDENT READING"
        }
    },
    {
        "data": {
            "description": "An examination of selected topics in Scandinavian literature.",
            "id": "SCANDST 436",
            "parent": "SCANDST",
            "title": "TOPICS IN SCANDINAVIAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "An extensive, wide-ranging introduction to the cultures of and community in the Scandinavian and Nordic Countries. Through a diverse series of guest lectures and discussions, explore the culture, arts, geography, history, religion, languages, music, literature, politics etc. of the Scandinavian countries.",
            "id": "SCANDST 276",
            "parent": "SCANDST",
            "title": "CULTURE & COMMUNITY IN SCANDINAVIA"
        }
    },
    {
        "data": {
            "description": "Analyze English translations of key works by Nordic filmmakers as well as theories, histories, and the changing meaning of film authorship in the Nordic region.",
            "id": "SCANDST 439",
            "parent": "SCANDST",
            "title": "NORDIC FILMMAKERS"
        }
    },
    {
        "data": {
            "description": "Astrid Lindgren's Pippi Longstocking is an icon of childhood in the Nordic countries and beyond. Pippi has come to symbolize the Nordic \"autonomous\" child par excellence. Takes up a diverse selection of books and films that represent both the common ideas of the Nordic Child, as well as various elaborations of and exceptions to the idealized norm. Examines a number of the prevalent forms and themes in Nordic children's culture, such as nature, play, school, sexuality, death, loss, and storytelling.",
            "id": "LITTRANS/SCANDST 320",
            "title": "THE NORDIC CHILD"
        }
    },
    {
        "data": {
            "description": "Concentrated study of topics within Scandinavian literature.",
            "id": "SCANDST 411",
            "parent": "SCANDST",
            "title": "AREAS IN SCANDINAVIAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Designed with a linguistic purpose: to obtain a reading knowledge of Old Norse-Icelandic through the study of Old Icelandic grammar and selections of Old Norse-Icelandic texts.",
            "id": "MEDIEVAL/SCANDST 407",
            "title": "INTRODUCTORY OLD NORSE"
        }
    },
    {
        "data": {
            "description": "Designed with a linguistic purpose: to obtain a reading knowledge of Old Norse-Icelandic through the study of Old Icelandic grammar and selections of Old Norse-Icelandic texts.",
            "id": "MEDIEVAL/SCANDST 408",
            "title": "INTERMEDIATE OLD NORSE"
        }
    },
    {
        "data": {
            "description": "Directed study projects as arranged with a faculty member.",
            "id": "SCANDST 299",
            "parent": "SCANDST",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "During the late Middle Ages, Scandinavian literature reached its first high point: The Old Norse sagas and poems. Study Scandinavian literature from the sagas to the prose and drama of the golden age of the late 19th century.",
            "id": "SCANDST 373",
            "parent": "SCANDST",
            "title": "MASTERPIECES OF SCANDINAVIAN LITERATURE: FROM THE MIDDLE AGES TO 1900"
        }
    },
    {
        "data": {
            "description": "Examination of shared traditions and historical connections between the North and Northwest of Europe. Readings of medieval and pre-modern Scandinavian, Scottish, Welsh and Irish sagas, histories, talkes. Discussion of the role of folklore in modern Celtic and Scandinavian societies.",
            "id": "FOLKLORE/MEDIEVAL/SCANDST 446",
            "title": "CELTIC-SCANDINAVIAN CULTURAL INTERRELATIONS"
        }
    },
    {
        "data": {
            "description": "Examines the verbal, musical, customary, and material folklore of Scandinavian Americans, with emphasis on the upper Midwest.",
            "id": "FOLKLORE/SCANDST 440",
            "title": "SCANDINAVIAN AMERICAN FOLKLORE"
        }
    },
    {
        "data": {
            "description": "Exploring the oral nature and performance traditions of folklore, ethnography, tales and ballads, literature and culture from Nordic areas and Scandinavia.",
            "id": "FOLKLORE/LITTRANS/MEDIEVAL/SCANDST 345",
            "title": "THE NORDIC STORYTELLER"
        }
    },
    {
        "data": {
            "description": "Faculty-guided in depth study of a topic.",
            "id": "SCANDST 799",
            "parent": "SCANDST",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "For beginning learners of Danish; emphasis on proficiency through speaking, listening, reading, and writing, and on communication in cultural context.",
            "id": "SCANDST 121",
            "parent": "SCANDST",
            "title": "FIRST SEMESTER DANISH"
        }
    },
    {
        "data": {
            "description": "For beginning learners of Danish; emphasis on proficiency through speaking, listening, reading, and writing, and on communication in cultural context.",
            "id": "SCANDST 122",
            "parent": "SCANDST",
            "title": "SECOND SEMESTER DANISH"
        }
    },
    {
        "data": {
            "description": "For beginning learners of Finnish; emphasis on proficiency through speaking, listening, reading, and writing, and on communication in cultural context.",
            "id": "SCANDST 131",
            "parent": "SCANDST",
            "title": "FIRST SEMESTER FINNISH"
        }
    },
    {
        "data": {
            "description": "For beginning learners of Finnish; emphasis on proficiency through speaking, listening, reading, and writing, and on communication in cultural context.",
            "id": "SCANDST 132",
            "parent": "SCANDST",
            "title": "SECOND SEMESTER FINNISH"
        }
    },
    {
        "data": {
            "description": "For beginning learners of Norwegian; emphasis on proficiency through speaking, listening, reading, and writing, and on communication in cultural context.",
            "id": "SCANDST 101",
            "parent": "SCANDST",
            "title": "FIRST SEMESTER NORWEGIAN"
        }
    },
    {
        "data": {
            "description": "For beginning learners of Norwegian; emphasis on proficiency through speaking, listening, reading, and writing, and on communication in cultural context.",
            "id": "SCANDST 102",
            "parent": "SCANDST",
            "title": "SECOND SEMESTER NORWEGIAN"
        }
    },
    {
        "data": {
            "description": "For beginning learners of Swedish; emphasis on proficiency through speaking, listening, reading, and writing, and on communication in cultural context.",
            "id": "SCANDST 111",
            "parent": "SCANDST",
            "title": "FIRST SEMESTER SWEDISH"
        }
    },
    {
        "data": {
            "description": "For beginning learners of Swedish; emphasis on proficiency through speaking, listening, reading, and writing, and on communication in cultural context.",
            "id": "SCANDST 112",
            "parent": "SCANDST",
            "title": "SECOND SEMESTER SWEDISH"
        }
    },
    {
        "data": {
            "description": "Hands-on introduction to a topic in Scandinavian language study.",
            "id": "SCANDST 510",
            "parent": "SCANDST",
            "title": "TOPICS IN SCANDINAVIAN LINGUISTICS"
        }
    },
    {
        "data": {
            "description": "How have the wartime issues of occupation, resistance, collaboration, neutrality, and the Holocaust been addressed in Nordic culture? During the Second World War, Norway and Denmark were invaded and occupied by Nazi Germany, while Sweden remained neutral and Finland fought against the Soviet Union. Resistance movements developed in the occupied countries, but some Norwegians and Danes collaborated with the occupying power and were tried for treason after the war. Become familiar with the basic history of the period by reading texts of various sorts (essays, novels, diaries, poetry, memoir) that were written during the war years and since. Through analyzing films and works of fiction, in addition to historical writing, learn how the Second World War and the Holocaust have been represented and remembered in the Nordic countries.",
            "id": "SCANDST 348",
            "parent": "SCANDST",
            "title": "THE SECOND WORLD WAR IN NORDIC CULTURE"
        }
    },
    {
        "data": {
            "description": "Ideas and dramatic practice in the plays of August Strindberg.",
            "id": "SCANDST 423",
            "parent": "SCANDST",
            "title": "THE DRAMA OF AUGUST STRINDBERG"
        }
    },
    {
        "data": {
            "description": "In-depth discussion of selected texts, historical and literary background material, application and discussion of pertinent literary criticism.",
            "id": "SCANDST 475",
            "parent": "SCANDST",
            "title": "THE WRITINGS OF HANS CHRISTIAN ANDERSEN FOR SCANDINAVIAN MAJORS"
        }
    },
    {
        "data": {
            "description": "Intensive study of dramatic production and the part played by Ibsen as the founder of modern drama.",
            "id": "SCANDST 422",
            "parent": "SCANDST",
            "title": "THE DRAMA OF HENRIK IBSEN"
        }
    },
    {
        "data": {
            "description": "Intensive work in spoken and written Danish, Norwegian, and Swedish, based on contemporary readings.",
            "id": "SCANDST 401",
            "parent": "SCANDST",
            "title": "CONTEMPORARY SCANDINAVIAN LANGUAGES"
        }
    },
    {
        "data": {
            "description": "Introduction to languages of Northern Europe not covered by other department courses (e.g., Sami, Estonian). Practice in language, accompanied by introduction to grammar, culture, and literature. Other language-related topics offered occasionally; check timetable for details.",
            "id": "SCANDST 404",
            "parent": "SCANDST",
            "title": "LANGUAGES OF NORTHERN EUROPE"
        }
    },
    {
        "data": {
            "description": "Investigate the genre of autobiography in historical, cultural, and literary contexts, with a highlight of Nordic authors. Analyze autobiographical writing in the context of race, ethnicity, gender, and sexuality, while problematizing concepts such as \"fiction,\" \"truth\" and \"self.\"",
            "id": "SCANDST 355",
            "parent": "SCANDST",
            "title": "AUTOBIOGRAPHY"
        }
    },
    {
        "data": {
            "description": "Investigates the relations between theories of memory, both individual and collective, and modern literary representations of remembering. Survey seminal conceptions of memory in the interdisciplinary field of memory studies, investigating topics such as nostalgia, trauma, personal and cultural identity, war and Holocaust, sites of memory, and autobiographical narrative. Through the avenues opened up by these theoretical frameworks, consider the narrative forms as well as the ethical and political dimensions of remembering in major novels by Marcel Proust, W. G. Sebald, and Karl Ove Knausgard.",
            "id": "LITTRANS/SCANDST 428",
            "title": "MEMORY AND LITERATURE FROM PROUST TO KNAUSGARD"
        }
    },
    {
        "data": {
            "description": "Kalevala - the national epic of Finaland - and the oral literature of Finland.",
            "id": "MEDIEVAL/SCANDST 444",
            "title": "KALEVALA AND FINNISH FOLK-LORE"
        }
    },
    {
        "data": {
            "description": "Mentored individual research and study for students completing a thesis in an Honors program.",
            "id": "SCANDST 681",
            "parent": "SCANDST",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Mentored individual research and study for students completing a thesis in an Honors program.",
            "id": "SCANDST 682",
            "parent": "SCANDST",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Mythology, literature, ritual, traditions, medieval folklore, and religion from Nordic areas and Scandinavia.",
            "id": "FOLKLORE/MEDIEVAL/RELIGST/SCANDST 342",
            "title": "NORDIC MYTHOLOGY"
        }
    },
    {
        "data": {
            "description": "Nineteenth century Scandinavian immigration.",
            "id": "SCANDST 296",
            "parent": "SCANDST",
            "title": "THE SCANDINAVIAN HERITAGE IN AMERICA"
        }
    },
    {
        "data": {
            "description": "Nineteenth century Scandinavian immigration.",
            "id": "SCANDST 496",
            "parent": "SCANDST",
            "title": "THE SCANDINAVIAN HERITAGE IN AMERICA"
        }
    },
    {
        "data": {
            "description": "Penetrating study of an important Scandinavian literary or linguistic topic.",
            "id": "SCANDST 710",
            "parent": "SCANDST",
            "title": "TOPICS IN DEPTH"
        }
    },
    {
        "data": {
            "description": "Political, social, economic, and cultural development: political realignments and rise of nationalism, industrialization and rise of liberalism and socialism, democratization, independence struggles and social conflict, evolution of welfare states, World War II and its aftermath.",
            "id": "HISTORY/SCANDST 432",
            "title": "HISTORY OF SCANDINAVIA SINCE 1815"
        }
    },
    {
        "data": {
            "description": "Political, social, economic, and cultural developments of Scandinavia through the \"Viking Age\" to the break-up of Sweden-Finland and Denmark-Norway; emphasis on the interplay between social and political forces and institutions and the area's relationship with the rest of Europe.",
            "id": "HISTORY/SCANDST 431",
            "title": "HISTORY OF SCANDINAVIA TO 1815"
        }
    },
    {
        "data": {
            "description": "Prose, poetry, and drama read in Danish. Taught extensively in Danish.",
            "id": "SCANDST 271",
            "parent": "SCANDST",
            "title": "READINGS IN DANISH LITERATURE"
        }
    },
    {
        "data": {
            "description": "Prose, poetry, and drama read in Norwegian. Taught extensively in Norwegian.",
            "id": "SCANDST 251",
            "parent": "SCANDST",
            "title": "READINGS IN NORWEGIAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Prose, poetry, and drama read in Swedish. Taught extensively in Swedish.",
            "id": "SCANDST 261",
            "parent": "SCANDST",
            "title": "READINGS IN SWEDISH LITERATURE"
        }
    },
    {
        "data": {
            "description": "Provides an introductory survey of Scandinavia and Northern Europe. Approaches the source material by focusing on concepts such as environment and sustainability, nation, migration, diversity, family, childhood, happiness, and melancholy. Learn about modern and contemporary Northern European cultures through literature, film, television, music, and other media from Norway, Denmark, Sweden, Iceland, Finland, Sápmi, or the Baltic countries.",
            "id": "SCANDST 250",
            "parent": "SCANDST",
            "title": "INTRODUCTION TO SCANDINAVIA"
        }
    },
    {
        "data": {
            "description": "Rapid reading of suitable Norwegian texts by modern writers.",
            "id": "SCANDST 202",
            "parent": "SCANDST",
            "title": "SECOND YEAR NORWEGIAN"
        }
    },
    {
        "data": {
            "description": "Read and discuss works by Scandinavian writers of the nineteenth and twentieth century reflecting sexual politics and the roles of women in literature. Course taught in English.",
            "id": "GEN&WS/LITTRANS/SCANDST 438",
            "title": "SEXUAL POLITICS IN SCANDINAVIA"
        }
    },
    {
        "data": {
            "description": "Reading of selections from Danish writers, grammar review and conversation.",
            "id": "SCANDST 221",
            "parent": "SCANDST",
            "title": "SECOND YEAR DANISH"
        }
    },
    {
        "data": {
            "description": "Reading of selections from Danish writers, grammar review and conversation.",
            "id": "SCANDST 222",
            "parent": "SCANDST",
            "title": "SECOND YEAR DANISH"
        }
    },
    {
        "data": {
            "description": "Reading of selections from Norwegian writers, grammar review and conversation.",
            "id": "SCANDST 201",
            "parent": "SCANDST",
            "title": "SECOND YEAR NORWEGIAN"
        }
    },
    {
        "data": {
            "description": "Reading of selections from Swedish writers, grammar review and conversation.",
            "id": "SCANDST 211",
            "parent": "SCANDST",
            "title": "SECOND YEAR SWEDISH"
        }
    },
    {
        "data": {
            "description": "Reading of selections from Swedish writers, grammar review and conversation.",
            "id": "SCANDST 212",
            "parent": "SCANDST",
            "title": "SECOND YEAR SWEDISH"
        }
    },
    {
        "data": {
            "description": "Readings in such authors as Hans Christian Andersen, Steen Steensen Blicher, C.J.L. Almquist, Alexis Kivi, Bjornstjerne Bjornson, Jonas Lie, Alexander Kielland, Jens Peter Jacobsen, Henrik Pontoppidan, August Strindberg, Selma Lagerlof, and Johs V. Jensen.",
            "id": "SCANDST 424",
            "parent": "SCANDST",
            "title": "NINETEENTH-CENTURY SCANDINAVIAN FICTION"
        }
    },
    {
        "data": {
            "description": "Research resources and methodology; scholarly research and literary criticism.",
            "id": "SCANDST 630",
            "parent": "SCANDST",
            "title": "FUNDAMENTALS OF BIBLIOGRAPHY AND RESEARCH"
        }
    },
    {
        "data": {
            "description": "Scandinavia as a linguistic area. The main historical developments and structural features of the Scandinavian languages.",
            "id": "SCANDST 410",
            "parent": "SCANDST",
            "title": "INTRODUCTION TO SCANDINAVIAN LINGUISTICS"
        }
    },
    {
        "data": {
            "description": "Scandinavian culture in all its aspects ranging from past history up to contemporary trends in politics and ideologies.",
            "id": "SCANDST 476",
            "parent": "SCANDST",
            "title": "SCANDINAVIAN LIFE AND CIVILIZATION II"
        }
    },
    {
        "data": {
            "description": "Social, economic, and ideological changes, institutions, and movements and their relationships with the political processes and structures in the Nordic states.",
            "id": "HISTORY/SCANDST 577",
            "title": "CONTEMPORARY SCANDINAVIA: POLITICS AND HISTORY"
        }
    },
    {
        "data": {
            "description": "Special topics in Scandinavian culture, literature, and linguistics.",
            "id": "SCANDST 520",
            "parent": "SCANDST",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "Study of Scandinavian languages from the early Scandinavian period to the present day.",
            "id": "SCANDST 415",
            "parent": "SCANDST",
            "title": "HISTORY OF THE SCANDINAVIAN LANGUAGES II: STANDARD LANGUAGES"
        }
    },
    {
        "data": {
            "description": "Study of topics in Nordic and Nordic-American history, culture, and/or folklore.",
            "id": "SCANDST 421",
            "parent": "SCANDST",
            "title": "ADVANCED TOPICS IN NORDIC STUDIES"
        }
    },
    {
        "data": {
            "description": "Survey representative literary texts from Scandinavia spanning eras including Romanticism, Realism, and Naturalism; includes historical context.",
            "id": "SCANDST 635",
            "parent": "SCANDST",
            "title": "SURVEY OF SCANDINAVIAN LITERATURE: 1800-1890"
        }
    },
    {
        "data": {
            "description": "Survey representative literary texts from Scandinavia spanning through Reformation, Renaissance, Baroque, Rococo and Pre-Romanticism, including historical context.",
            "id": "SCANDST 634",
            "parent": "SCANDST",
            "title": "SURVEY OF SCANDINAVIAN LITERATURE: 1500-1800"
        }
    },
    {
        "data": {
            "description": "The Icelandic sagas viewed in their social, cultural, and literary contexts. An introduction to one of the greatest bodies of vernacular literature of the early Middle Ages.",
            "id": "FOLKLORE/MEDIEVAL/SCANDST 235",
            "title": "THE WORLD OF SAGAS"
        }
    },
    {
        "data": {
            "description": "The prose narratives of medieval Iceland. Gain an understanding of saga literature as a genre and of the cultural history of Iceland in the Viking Era and the Middle Ages, based on the interplay between pagan codes of honor and Christian ethics. In addition, gain an understanding of the methodological problems involved in studying sagas as historical documents.",
            "id": "LITTRANS/SCANDST 435",
            "title": "THE SAGAS OF ICELANDERS IN ENGLISH TRANSLATION"
        }
    },
    {
        "data": {
            "description": "Twentieth-century literary traditions and experiments, with attention to major movements, genres, and authors.",
            "id": "SCANDST 427",
            "parent": "SCANDST",
            "title": "CONTEMPORARY SCANDINAVIAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Within a historical framework, a thorough introduction to the culture, literature, and religion of the Vikings.",
            "id": "MEDIEVAL/SCANDST 430",
            "title": "THE VIKINGS"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "SCANDST",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "MEDIEVAL/SCANDST 407",
            "target": "MEDIEVAL/SCANDST 408"
        }
    },
    {
        "data": {
            "source": "MEDIEVAL/SCANDST 407",
            "target": "MEDIEVAL/SCANDST 409"
        }
    },
    {
        "data": {
            "source": "MEDIEVAL/SCANDST 407",
            "target": "SCANDST 511"
        }
    },
    {
        "data": {
            "source": "SCANDST 101",
            "target": "SCANDST 102"
        }
    },
    {
        "data": {
            "source": "SCANDST 102",
            "target": "SCANDST 201"
        }
    },
    {
        "data": {
            "source": "SCANDST 111",
            "target": "SCANDST 112"
        }
    },
    {
        "data": {
            "source": "SCANDST 112",
            "target": "SCANDST 211"
        }
    },
    {
        "data": {
            "source": "SCANDST 121",
            "target": "SCANDST 122"
        }
    },
    {
        "data": {
            "source": "SCANDST 122",
            "target": "SCANDST 221"
        }
    },
    {
        "data": {
            "source": "SCANDST 131",
            "target": "SCANDST 132"
        }
    },
    {
        "data": {
            "source": "SCANDST 201",
            "target": "SCANDST 202"
        }
    },
    {
        "data": {
            "source": "SCANDST 202",
            "target": "SCANDST 251"
        }
    },
    {
        "data": {
            "source": "SCANDST 202",
            "target": "SCANDST 373"
        }
    },
    {
        "data": {
            "source": "SCANDST 202",
            "target": "SCANDST 374"
        }
    },
    {
        "data": {
            "source": "SCANDST 202",
            "target": "SCANDST 419"
        }
    },
    {
        "data": {
            "source": "SCANDST 202",
            "target": "SCANDST 422"
        }
    },
    {
        "data": {
            "source": "SCANDST 202",
            "target": "SCANDST 427"
        }
    },
    {
        "data": {
            "source": "SCANDST 202",
            "target": "SCANDST 434"
        }
    },
    {
        "data": {
            "source": "SCANDST 202",
            "target": "SCANDST 475"
        }
    },
    {
        "data": {
            "source": "SCANDST 202",
            "target": "SCANDST 635"
        }
    },
    {
        "data": {
            "source": "SCANDST 211",
            "target": "SCANDST 212"
        }
    },
    {
        "data": {
            "source": "SCANDST 212",
            "target": "SCANDST 261"
        }
    },
    {
        "data": {
            "source": "SCANDST 212",
            "target": "SCANDST 419"
        }
    },
    {
        "data": {
            "source": "SCANDST 212",
            "target": "SCANDST 423"
        }
    },
    {
        "data": {
            "source": "SCANDST 212",
            "target": "SCANDST 424"
        }
    },
    {
        "data": {
            "source": "SCANDST 212",
            "target": "SCANDST 434"
        }
    },
    {
        "data": {
            "source": "SCANDST 212",
            "target": "SCANDST 450"
        }
    },
    {
        "data": {
            "source": "SCANDST 212",
            "target": "SCANDST 476"
        }
    },
    {
        "data": {
            "source": "SCANDST 212",
            "target": "SCANDST 496"
        }
    },
    {
        "data": {
            "source": "SCANDST 221",
            "target": "SCANDST 222"
        }
    },
    {
        "data": {
            "source": "SCANDST 222",
            "target": "SCANDST 271"
        }
    },
    {
        "data": {
            "source": "SCANDST 222",
            "target": "SCANDST 419"
        }
    },
    {
        "data": {
            "source": "SCANDST 222",
            "target": "SCANDST 422"
        }
    },
    {
        "data": {
            "source": "SCANDST 222",
            "target": "SCANDST 423"
        }
    },
    {
        "data": {
            "source": "SCANDST 222",
            "target": "SCANDST 424"
        }
    },
    {
        "data": {
            "source": "SCANDST 222",
            "target": "SCANDST 427"
        }
    },
    {
        "data": {
            "source": "SCANDST 222",
            "target": "SCANDST 450"
        }
    },
    {
        "data": {
            "source": "SCANDST 222",
            "target": "SCANDST 475"
        }
    },
    {
        "data": {
            "source": "SCANDST 222",
            "target": "SCANDST 476"
        }
    },
    {
        "data": {
            "source": "SCANDST 222",
            "target": "SCANDST 496"
        }
    },
    {
        "data": {
            "source": "SCANDST 222",
            "target": "SCANDST 635"
        }
    },
    {
        "data": {
            "source": "SCANDST 251",
            "target": "SCANDST 401"
        }
    },
    {
        "data": {
            "source": "SCANDST 251",
            "target": "SCANDST 411"
        }
    },
    {
        "data": {
            "source": "SCANDST 271",
            "target": "SCANDST 401"
        }
    },
    {
        "data": {
            "source": "SCANDST 271",
            "target": "SCANDST 411"
        }
    }
]