[
    {
        "data": {
            "description": "A sociological examination of race, class, gender and sexuality - four central axes of social stratification, identity and experience that have real consequences in people's lives, the opportunities they have, and the challenges they face. Topics include sociological perspectives on how identities and differences are socially constructed and reproduced, and how these categories manifest themselves in inequities in institutions such as schools, workplaces, housing, and the law.",
            "id": "SOC 300",
            "parent": "SOC",
            "title": "SOCIOLOGY OF RACE, CLASS, GENDER, AND SEXUALITY"
        }
    },
    {
        "data": {
            "description": "An exploration of social continuity and change of contemporary South Korea. Covers different institutions of a society - political, economic, and societal/cultural spheres. Incorporates material from anthropology, sociology, political science, economics, and law. Focus on South Korea after the division of the 'two Koreas'.",
            "id": "ASIAN/SOC 336",
            "title": "SOCIAL CHANGE IN CONTEMPORARY SOUTH KOREA"
        }
    },
    {
        "data": {
            "description": "As an introduction to Southeast Asia, covers the ethnic, cultural, religious, and political histories of the region from the classical states period to the present, with an emphasis on colonialism, nationalism, decolonization, and the emergence of modern political and social systems into the 21st century, including an exposure to region's contemporary literature. Not open to students who completed LCA 244 prior to Fall 2019.",
            "id": "ASIAN/GEOG/HISTORY/POLISCI/SOC 244",
            "title": "INTRODUCTION TO SOUTHEAST ASIA:  VIETNAM TO THE PHILIPPINES"
        }
    },
    {
        "data": {
            "description": "Covers technology, the social forces shaping its development, and social impacts of its adoption. Examine one's assumptions about technology and its relationship to society.",
            "id": "C&ESOC/SOC 245",
            "title": "TECHNOLOGY AND SOCIETY"
        }
    },
    {
        "data": {
            "description": "Examines the legal and social development and implications of laws governing sexual behavior, human reproduction, media, privacy, and topics related to sexuality, sex and gender. Includes historical analyses of laws connected to present day regulations of sexuality, demonstrating the origins of many of the world's most frequently debated civil rights issues. Chief focus on the United States legal system, with some content including examinations of institutions around the world. Investigates taken-for-granted knowledge and assumptions about sexuality and look at legal, cultural and social constructions of sex in society. Covers intersectional social implications, including race, (dis)ability, class, etc. Topics include: obscenity, pornography, sex work, sexual surrogacy, birth control, abortion, sex education, sexual violence, sex offenders, sexual citizenship rights, trans and intersex legal topics.",
            "id": "GEN&WS/LEGALST/SOC 406",
            "title": "LAW, SEXUALITY, & SOCIETY"
        }
    },
    {
        "data": {
            "description": "Intensive and critical examination of the major theoretical traditions involved in sociology's development since the 19th century.",
            "id": "SOC 773",
            "parent": "SOC",
            "title": "INTERMEDIATE CLASSICAL THEORY"
        }
    },
    {
        "data": {
            "description": "Issues related to health and health care delivery in our society. Topics include social, cultural and ethical influences on consumer definitions of health and use of medical care, and on the health care system's responses.",
            "id": "C&ESOC/SOC 532",
            "title": "HEALTH CARE ISSUES FOR INDIVIDUALS, FAMILIES AND SOCIETY"
        }
    },
    {
        "data": {
            "description": "Mentored research for the Master's thesis or doctoral dissertation.",
            "id": "SOC 990",
            "parent": "SOC",
            "title": "THESIS"
        }
    },
    {
        "data": {
            "description": "Persecution as an object of sociological investigation with special focus on the perpetrators' motivations, the machinery of persecution policies, the behaviors of state agents, and the attitudes and strategies displayed by the potential victims.",
            "id": "SOC 678",
            "parent": "SOC",
            "title": "SOCIOLOGY OF PERSECUTION"
        }
    },
    {
        "data": {
            "description": "",
            "id": "FRENCH/GERMAN/HISTORY/POLISCI/SOC 804",
            "title": "INTERDISCIPLINARY WESTERN EUROPEAN AREA STUDIES SEMINAR"
        }
    },
    {
        "data": {
            "description": "A multidisciplinary introduction to lesbian, gay, bisexual, transgender, and queer+ (LGBTQ+) studies, including theories of identity formation, different societal interaction with LGBTQ+ communities, LGBTQ+ cultures in history, and contemporary legal and political issues. Course materials explore the intersections between LGBTQ+ identities and other socially marginalized identities, including (but not limited to) those based on race, ethnicity, religion and disability.",
            "id": "GEN&WS/SOC 200",
            "title": "INTRODUCTION TO LESBIAN, GAY, BISEXUAL, TRANSGENDER AND QUEER+ STUDIES"
        }
    },
    {
        "data": {
            "description": "A sociological examination of the status and roles of women and men in society, including the experiences of marriage, parenthood, employment and occupational attainment, socialization into sex roles and cultural reinforcement of these. Attention will be given to both existing patterns and change in those patterns.",
            "id": "SOC 138",
            "parent": "SOC",
            "title": "THE SOCIOLOGY OF GENDER"
        }
    },
    {
        "data": {
            "description": "A study of immigration, crime, and border enforcement, engaging both historical and present-day debates, focusing on Latino immigration and the U.S.-Mexico border.",
            "id": "CHICLA/LEGALST/SOC 443",
            "title": "IMMIGRATION, CRIME, AND ENFORCEMENT"
        }
    },
    {
        "data": {
            "description": "Advanced study of current research in social change, e.g., democratization in the Global South, labor movements, urban protests, social media campaigns.",
            "id": "C&ESOC/SOC 913",
            "title": "SEMINAR-SOCIAL CHANGE"
        }
    },
    {
        "data": {
            "description": "Advanced study of current research in social stratification, e.g., historical and comparative studies of inequality; mathematical and econometric modeling of mobility and achievement processes; demographic approaches to power and inequality.",
            "id": "C&ESOC/SOC 923",
            "title": "SEMINAR-SOCIAL STRATIFICATION"
        }
    },
    {
        "data": {
            "description": "Advanced study of selected topics related to population and society, including health and inequality across the life course, environmental and spatial demography, biodemography.",
            "id": "C&ESOC/SOC 971",
            "title": "SEMINAR-TOPICS IN DEMOGRAPHY AND ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Advanced topics in sociology. Topics vary.",
            "id": "C&ESOC/SOC 875",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "Advanced topics in the analysis of gender relations in society.",
            "id": "C&ESOC/GEN&WS/SOC 904",
            "title": "SOCIOLOGICAL PERSPECTIVES ON GENDER"
        }
    },
    {
        "data": {
            "description": "African society and culture, polity and economy in multidisciplinary perspectives from prehistory and ancient kingdoms through the colonial period to contemporary developments, including modern nationalism, economic development and changing social structure.",
            "id": "AFRICAN/AFROAMER/ANTHRO/GEOG/HISTORY/POLISCI/SOC 277",
            "title": "AFRICA: AN INTRODUCTORY SURVEY"
        }
    },
    {
        "data": {
            "description": "Age as a basis of societal differentiation in modern and premodern societies; social psychological, demographic, sociobiological, socioeconomic, and sociohistorical views of age-graded events and behaviors; examination of the life course and aging as sociological variables.",
            "id": "SOC 575",
            "parent": "SOC",
            "title": "SOCIOLOGICAL PERSPECTIVES ON THE LIFE COURSE AND AGING"
        }
    },
    {
        "data": {
            "description": "Alternative research designs and processes, measurement, and analytical techniques in social psychology; experience in developing and utilizing research plans and techniques.",
            "id": "C&ESOC/SOC 960",
            "title": "SEMINAR-CURRENT METHODOLOGICAL ISSUES IN SOCIAL PSYCHOLOGY"
        }
    },
    {
        "data": {
            "description": "Alternatives in course organization, instructional methods, and grading techniques with emphasis on teaching basic undergraduate courses.",
            "id": "SOC 910",
            "parent": "SOC",
            "title": "TEACHING SOCIOLOGY"
        }
    },
    {
        "data": {
            "description": "American political, economic and social development from the Civil War to the present.",
            "id": "HISTORY 102",
            "parent": "HISTORY",
            "title": "AMERICAN HISTORY, CIVIL WAR ERA TO THE PRESENT"
        }
    },
    {
        "data": {
            "description": "An examination of contemporary East Asia (mainly South Korea, Japan, Taiwan, and China) by using concepts and frameworks from history, anthropology, sociology, political science, economics, and law. An emphasis will be on the intersection of multiple structures of inequality such as gender, race/ethnicity, citizenship, class, and sexuality.",
            "id": "ASIAN/SOC 334",
            "title": "GENDER, WORK, AND FAMILY IN EAST ASIA"
        }
    },
    {
        "data": {
            "description": "An examination of ethnicity, race, and justice, with a specific emphasis on US Latinos, the largest minority group in the United States.",
            "id": "CHICLA/LEGALST/SOC 440",
            "title": "ETHNICITY, RACE, AND JUSTICE"
        }
    },
    {
        "data": {
            "description": "An intensive, practice-oriented exploration of one qualitative research method such as participant-observation, interviewing, narrative analysis, oral history or ethnography. Treatment of the method includes: logics of inquiry, analysis of data obtained through the method, and uses of the method.",
            "id": "EDPOL/SOC 955",
            "title": "SEMINAR-QUALITATIVE METHODOLOGY"
        }
    },
    {
        "data": {
            "description": "An introduction to applied econometrics - the statistical methods economists use to evaluate empirical relationships and test economic theory. Emphasis on application of econometrics to real world data using modern statistical software and developing skills needed to understand empirical work in economics.",
            "id": "ECON 400",
            "parent": "ECON",
            "title": "INTRODUCTION TO APPLIED ECONOMETRICS"
        }
    },
    {
        "data": {
            "description": "An introduction to current issues in sociology and its subfields.",
            "id": "SOC 700",
            "parent": "SOC",
            "title": "INTRODUCTORY PROSEMINAR FOR GRADUATE STUDENTS"
        }
    },
    {
        "data": {
            "description": "An introduction to linear algebra and differential equations with emphasis on the relationship between the theory of linear algebra and analytical and numerical techniques for solving differential equations. Linear algebra topics include linear systems, matrices and their algebra, vector spaces and linear transformations, eigenvalues and eigenvectors. Topics from differential equations include first order ODE, homogeneous and nonhomogeneous linear systems, and numerical methods.",
            "id": "MATH 320",
            "parent": "MATH",
            "title": "LINEAR ALGEBRA AND DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "description": "An introduction to the paradigms, methods and substance of sociology.",
            "id": "SOC 181",
            "parent": "SOC",
            "title": "HONORS INTRODUCTORY SEMINAR-THE SOCIOLOGICAL ENTERPRISE"
        }
    },
    {
        "data": {
            "description": "An introduction to the sociological study of racial orders in comparative and historical perspective. As W.E.B. Du Bois famously wrote, \"The problem of the twentieth century is the problem of the color line,\" but as he also insisted, the social meaning of race is shaped by specific historical and economic contexts. Half of the content focuses on the American experience, especially over the last 50 years, exploring historical and contemporary meanings of race in America, and how racial dynamics have changed (and not changed) across time. The other half continues to explore the American experience, but now using a comparative historical approach, discussing patterns of racial inequality and social change in South Africa and Brazil, both to understand how these issues have played out in those contexts, and to gain new insights into our experiences in the United States.",
            "id": "SOC 550",
            "parent": "SOC",
            "title": "COMPARATIVE RACIAL INEQUALITY"
        }
    },
    {
        "data": {
            "description": "Analysis and presentation of survey results through contingency table analysis. Techniques for assessing the quality of data produced by survey methods. Practical application of material to a specific research problem through research reports and other exercises involving data analysis.",
            "id": "SOC 752",
            "parent": "SOC",
            "title": "MEASUREMENT AND QUESTIONNAIRES FOR SURVEY RESEARCH"
        }
    },
    {
        "data": {
            "description": "Analysis of everyday, local practices for assembling coherent and stable social environments. The focus on everyday practices derives from both ethnomethodological and conversation analytic literatures and investigations. Instruction will involve both didactic or illustrative presentations and hands-on work with interactional data from a variety of social settings, whether informal telephone calls, or more formal work or organizational settings.",
            "id": "SOC 735",
            "parent": "SOC",
            "title": "ETHNOMETHODOLOGY & CONVERSATION ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Analysis of recent research and theory, based on reviews of literature and presentations of research in progress.",
            "id": "C&ESOC/SOC 987",
            "title": "RESEARCH: RACE AND ETHNIC STUDIES"
        }
    },
    {
        "data": {
            "description": "Application of scientific methods to the analysis of social phenomena; methodological orientations in sociology; types of research procedure: nature of sociological variables.",
            "id": "C&ESOC/SOC 750",
            "title": "RESEARCH METHODS IN SOCIOLOGY"
        }
    },
    {
        "data": {
            "description": "Application of sociological theory and analysis to environmental issues. Examines the ways in which environmental stewardship and conflict are embedded within broader cultural, social, and political contexts.",
            "id": "C&ESOC/SOC 541",
            "title": "ENVIRONMENTAL STEWARDSHIP AND SOCIAL JUSTICE"
        }
    },
    {
        "data": {
            "description": "Applied linear regression modeling for social scientists. Bivariate and multiple regression, dummy variables, interactions, nonlinear relationships, indirect effects and omitted variable bias, outliers, heteroskedasticity, and mulitcollinearity; associated diagnostics and corrections. Use of Stata and/or SAS for dataset creation and analysis.",
            "id": "C&ESOC/SOC 361",
            "title": "STATISTICS FOR SOCIOLOGISTS II"
        }
    },
    {
        "data": {
            "description": "Basic principles and definitions of sociology. Readings and discussion of the perspectives of sociology, the individual and society, groups and social process, stratification, organizations and power, demography, and social change.",
            "id": "C&ESOC/SOC 211",
            "title": "THE SOCIOLOGICAL ENTERPRISE"
        }
    },
    {
        "data": {
            "description": "Behavior, including its development, motivation, frustrations, emotion, intelligence, learning, forgetting, personality, language, thinking, and social behavior.",
            "id": "PSYCH 202",
            "parent": "PSYCH",
            "title": "INTRODUCTION TO PSYCHOLOGY"
        }
    },
    {
        "data": {
            "description": "Biological, psychological and sociological aspects of sexual relationships and behavior. Presents theoretical and empirical materials on sexuality throughout the life-course, including childhood, adolescence, adulthood, and later life. Attention is given to gender, religion, education and the law as they relate to sexual expression in society.",
            "id": "PSYCH/SOC 160",
            "title": "HUMAN SEXUALITY: SOCIAL AND PSYCHOLOGICAL ISSUES"
        }
    },
    {
        "data": {
            "description": "Causes and consequences of urbanization, stressing social and economic aspects of major population movements, with particular attention to the United States.",
            "id": "HISTORY/SOC/URBRPL 979",
            "title": "SEMINAR IN URBAN HISTORY"
        }
    },
    {
        "data": {
            "description": "Classical and contemporary theories of the nature of social inequality; recent patterns and trends in inequality in the US; analysis of inequalities based on class, race, gender; the relationship of inequality to globalization, immigration, and politics.",
            "id": "SOC 633",
            "parent": "SOC",
            "title": "SOCIAL STRATIFICATION"
        }
    },
    {
        "data": {
            "description": "Classical theory; Marx, Durkheim, Weber, and other important classical theorists and schools of thought.",
            "id": "C&ESOC/SOC 475",
            "title": "CLASSICAL SOCIOLOGICAL THEORY"
        }
    },
    {
        "data": {
            "description": "Comparative strategies and historical methods through methodological readings, exercises, and evaluations of exemplary analyses in which investigators of organizational structures, institutional relationships, political conflicts, and cultural patterns bring theory and historical-comparative evidence to bear on one another.",
            "id": "SOC 753",
            "parent": "SOC",
            "title": "COMPARATIVE AND HISTORICAL METHODS IN SOCIOLOGY"
        }
    },
    {
        "data": {
            "description": "Concepts of childhood and delinquency. Measurement of delinquent behavior. Application of competing theories to relationships within the family, school, and peer group. Evaluation of programs for treatment, prevention, and control. The rise of the juvenile system.",
            "id": "SOC 446",
            "parent": "SOC",
            "title": "JUVENILE DELINQUENCY"
        }
    },
    {
        "data": {
            "description": "Contemporary theoretical positions and debates about feminisms in the humanities and social sciences.",
            "id": "GEN&WS 441",
            "parent": "GEN&WS",
            "title": "CONTEMPORARY FEMINIST THEORIES"
        }
    },
    {
        "data": {
            "description": "Coordination of current theories and methods of relevance for sociological research.",
            "id": "SOC 915",
            "parent": "SOC",
            "title": "SEMINAR-SOCIOLOGICAL THEORY"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Critical analysis of recent theoretical and methodological issues through presentations of research in progress.",
            "id": "C&ESOC/SOC 985",
            "title": "RESEARCH: COMMUNITY AND ENVIRONMENTAL SOCIOLOGY"
        }
    },
    {
        "data": {
            "description": "Critical analysis of recent theoretical developments in social psychology and of research designed by participants.",
            "id": "SOC 991",
            "parent": "SOC",
            "title": "RESEARCH : SOCIAL PSYCHOLOGY TRAINEES"
        }
    },
    {
        "data": {
            "description": "Critical examination of theories and research in political sociology. Topics include: power and interests, state-formation, social movements, class and political behavior, revolutions, ideology, and states and social policy.",
            "id": "C&ESOC/SOC 724",
            "title": "INTERMEDIATE POLITICAL SOCIOLOGY"
        }
    },
    {
        "data": {
            "description": "Critical review of most recent research in sociology.",
            "id": "SOC 901",
            "parent": "SOC",
            "title": "SEMINAR: TOPICS IN CURRENT SOCIOLOGY"
        }
    },
    {
        "data": {
            "description": "Current literature, emphasis on recent journal articles.",
            "id": "C&ESOC/SOC 965",
            "title": "SEMINAR-RECENT DEVELOPMENTS IN SOCIAL PSYCHOLOGY"
        }
    },
    {
        "data": {
            "description": "Day-to-day functioning of the elements of the criminal justice system in the U.S. Nature of crime in the U.S., ideas about causes and solutions. Emphasis on the sociology of the components of criminal justice system--organization and roles of police, lawyers, court and correctional personnel.",
            "id": "LEGALST/SOC 131",
            "title": "CRIMINAL JUSTICE IN AMERICA"
        }
    },
    {
        "data": {
            "description": "Descriptive statistics, probability concepts and distributions, random variables. Hypothesis tests and confidence intervals for one- and two-sample problems. Linear regression, model checking, and inference. Analysis of variance and basic ideas in experimental design. Utilizes the R programming language.",
            "id": "STAT 324",
            "parent": "STAT",
            "title": "INTRODUCTORY APPLIED STATISTICS FOR ENGINEERS"
        }
    },
    {
        "data": {
            "description": "Design, implementation and interpretation of epidemiologic studies; emphasis on methodologic problems in the measurement of disease frequency, natural history and risk factors.",
            "id": "POPHLTH/SOC 797",
            "title": "INTRODUCTION TO EPIDEMIOLOGY"
        }
    },
    {
        "data": {
            "description": "Developing skills in critical reading, logical thinking, use of evidence, and use of library resources. Emphasis on writing in the conventions of specific fields.",
            "id": "SOC 236",
            "parent": "SOC",
            "title": "BASCOM COURSE"
        }
    },
    {
        "data": {
            "description": "Directed study projects as arranged with a faculty member.",
            "id": "SOC 698",
            "parent": "SOC",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Directed study projects as arranged with a faculty member.",
            "id": "SOC 699",
            "parent": "SOC",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Economic problems of individuals, firms and industries with emphasis on value, price, and distribution of income.",
            "id": "ECON 101",
            "parent": "ECON",
            "title": "PRINCIPLES OF MICROECONOMICS"
        }
    },
    {
        "data": {
            "description": "Emergence of various forms of collective behavior from social interactions, collective action problem, game theory, prospect theory, social networks, network effects, information cascade, increasing returns, social influence, epidemics, social movements, mass media.",
            "id": "SOC 543",
            "parent": "SOC",
            "title": "COLLECTIVE BEHAVIOR"
        }
    },
    {
        "data": {
            "description": "Engage in ongoing reflection and dialogue on the Wisconsin Idea and how it informs the mission of the University of Wisconsin. Consider the Wisconsin Idea as it has developed since its beginnings, with a focus on what it means today and what it can mean in the future.",
            "id": "C&ESOC/HISTORY/POLISCI/SOC 259",
            "title": "FORWARD? THE WISCONSIN IDEA, PAST AND PRESENT"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "Examination of issues and theories in gender and science. Topics include historical and contemporary studies of technoscientific and medical constructions of sex/gender differences; feminist studies of science, technology, and medicine; proposals of new epistemologies.",
            "id": "GEN&WS/SOC 611",
            "title": "GENDER, SCIENCE AND TECHNOLOGY"
        }
    },
    {
        "data": {
            "description": "Examine current issues in population and development using conceptual tools of sociology and demography. Critique the motivations of agents and institutions involved in creating population policies and will evaluate the empirical evidence linking population processes and international development in its varied forms. Focus on the impact of international population priorities on the current relationship between population and development, with particular attention to gender, poverty, and health.",
            "id": "C&ESOC/SOC 972",
            "title": "SEMINAR IN POPULATION AND DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Examines both physiological and social processes relating to gender and health across the lifespan among cisgender, transgender, and non-binary individuals. Examples of topics include hormonal processes, reproductive anatomy  physiology, sexuality, sexual pleasure, chronic illness, depression, and sexual violence. A primary course objective is for students to connect information about their bodies and personal health to larger social and political contexts. In particular, considers how health and health disparities are shaped by multiple kind of social inequalities, particularly inequalities based on gender.",
            "id": "GEN&WS 103",
            "parent": "GEN&WS",
            "title": "GENDER, WOMEN, BODIES, AND HEALTH"
        }
    },
    {
        "data": {
            "description": "Examines family life from a sociological perspective, drawing on insights from demography, economics, history and anthropology. Considers theories and empirical evidence about families as social institutions; patterns of family change; and families and inequality.",
            "id": "SOC 640",
            "parent": "SOC",
            "title": "SOCIOLOGY OF THE FAMILY"
        }
    },
    {
        "data": {
            "description": "Examines theories of community change and different models of community organizing.",
            "id": "C&ESOC/SOC 573",
            "title": "COMMUNITY ORGANIZATION AND CHANGE"
        }
    },
    {
        "data": {
            "description": "Examines topics such as theories of environment and society, the treadmill of production, environmental movements, political ecology, environmental justice, consumption, ecological modernization, sustainability, environmental risk, and the sociology of environmental science.",
            "id": "C&ESOC/SOC 948",
            "title": "SEMINAR: ENVIRONMENTAL SOCIOLOGY"
        }
    },
    {
        "data": {
            "description": "Explanation of US performance in realizing the values of freedom, fairness, and democracy. Topics include markets, capitalism, democracy, capitalist democracy; class, race, and gender inequalities; militarism and US international role; and US electoral politics, media, and social mobilization.",
            "id": "SOC 125",
            "parent": "SOC",
            "title": "AMERICAN SOCIETY: HOW IT REALLY WORKS"
        }
    },
    {
        "data": {
            "description": "Explores a broad range of contemporary theories concerned with bodies and power.  Intersections with gender, race, class, dis / ability, sexuality and nation.",
            "id": "GEN&WS 445",
            "parent": "GEN&WS",
            "title": "THE BODY IN THEORY"
        }
    },
    {
        "data": {
            "description": "Explores mathematical models of social process employing dynamical systems, Markov chains, and simulation analysis. Examples will address a wide range of sociological topics including cultural evolution, demography, social influence, social-network formation, religion, residential segregation, and social movements.",
            "id": "SOC 376",
            "parent": "SOC",
            "title": "MATHEMATICAL MODELS OF SOCIAL SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Explores mathematical models of social structure, focusing especially on social network analysis and related methods. Makes extensive use of matrix algebra and mathematical software.",
            "id": "SOC 375",
            "parent": "SOC",
            "title": "INTRODUCTION TO MATHEMATICAL SOCIOLOGY"
        }
    },
    {
        "data": {
            "description": "Explores the frontiers of research in economic sociology, drawing on recently published major work and on ongoing research.",
            "id": "SOC 919",
            "parent": "SOC",
            "title": "SEMINAR: TOPICS IN ECONOMIC SOCIOLOGY"
        }
    },
    {
        "data": {
            "description": "Explores the historical connections between capitalism and religion. Considers if and how religious ideas and practices facilitated the rise of capitalism; asks whether religious institutions have supported the reproduction of social inequalities, unjust labor practices, and exploitative economies; and studies the role played by religious actors in the critique of capitalism. Pays attention to the historical specificity of the capitalist system, its conditions of emergence in the Christian West, and the effects of its globalization on non-Christian traditions. Covers topics including classical social theories of religion and capitalism; contemporary examples of religious practice and capital accumulation; and the relationship between religious movements and social-economic justice.",
            "id": "GERMAN/RELIGST/SOC 273",
            "title": "GOD & MONEY"
        }
    },
    {
        "data": {
            "description": "Factors and conditions that underlie disagreement about fundamental values which inform views and conceptualizations of deviance; their relation to personal and social maladjustment; deviant behavior across different social contexts.",
            "id": "SOC 421",
            "parent": "SOC",
            "title": "PROCESSES OF DEVIANT BEHAVIOR"
        }
    },
    {
        "data": {
            "description": "Field placements and seminar sessions to develop sociological understanding of criminal justice processes. Placement in criminal justice agencies and lectures and discussions applying concepts and theories to field experience.",
            "id": "LEGALST/SOC 694",
            "title": "CRIMINAL JUSTICE FIELD OBSERVATION"
        }
    },
    {
        "data": {
            "description": "First order differential equations, introduction to multivariable calculus and constrained optimization, infinite sequences and series, methods of approximation, and a brief introduction to probability. Models and applications from business and the social sciences.",
            "id": "MATH 213",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 2"
        }
    },
    {
        "data": {
            "description": "Focus on the systematic observation and analysis of face-to-face interaction. Sociological approaches to naturally occurring interaction--i.e., human talk and behavior that has been observed, audiorecorded, or videorecorded--will be explored. The approaches include ethnomethodology, conversational analysis, and Goffmanian sociology.",
            "id": "SOC 535",
            "parent": "SOC",
            "title": "TALK AND SOCIAL INTERACTION"
        }
    },
    {
        "data": {
            "description": "Focuses on the intersection between gender, crime and justice from a cross-cultural perspective. The gendered nature of the criminal justice system, female experiences of crime, prosecution and incarceration as well as the extent to which women are victims, offenders, and participants in the criminal justice system will be explored. Special emphasis will be placed on the theoretical implications of offending behavior and the intersection of gender with sexuality, race, ethnicity and class. The goal of this course is to provide a foundation for critically assessing the often controversial issues surrounding race, gender, crime, and criminal justice in society.",
            "id": "GEN&WS/LEGALST/SOC 425",
            "title": "CRIME, GENDER AND JUSTICE"
        }
    },
    {
        "data": {
            "description": "Gain skills for designing and facilitating effective dialogue on topics pertaining to race, ethnicity, and other categories of social difference as a facilitator and/or apprentice forSOC 205. Completion ofSOC 205required.",
            "id": "SOC 206",
            "parent": "SOC",
            "title": "LEADERSHIP IN INTERCULTURAL DIALOGUES"
        }
    },
    {
        "data": {
            "description": "Generalized linear models with selected applications to social science data. Topics: Review of multiple regression; properties of estimators; general linear restrictions; instrumental variables; two-stage least squares; panel data; fixed and random effects; logit, probit, and related models.",
            "id": "SOC 362",
            "parent": "SOC",
            "title": "STATISTICS FOR SOCIOLOGISTS III"
        }
    },
    {
        "data": {
            "description": "Global, interdisciplinary, social science-oriented analysis of gender, race, class and sexuality in relationship to social institutions and movements for social change. Focus on gender and women in institutions such as education, the economy, the family, law, media, medicine, and politics.",
            "id": "GEN&WS 102",
            "parent": "GEN&WS",
            "title": "GENDER, WOMEN, AND SOCIETY IN GLOBAL PERSPECTIVE"
        }
    },
    {
        "data": {
            "description": "Historical development, formation of social welfare policies, and the role of the social work professional.",
            "id": "SOCWORK 205",
            "parent": "SOCWORK",
            "title": "INTRODUCTION TO THE FIELD OF SOCIAL WORK"
        }
    },
    {
        "data": {
            "description": "How do Jews fit into the modern world? While the \"Jewish Question\" initially referred to debates about Jewish emancipation (the struggle for equal citizenship and social integration that started with the French Revolution), it later served to describe modern Jewish political and social thought about the identity, place, and role of the Jews in the modern world. Beginning in the late 19th century, as cultural assimilation, economic impoverishment in eastern Europe, and rising antisemitism sowed doubts about the viability of emancipation and traditionalism alike, Jewish thinkers proposed new answers to the Jewish question. Learn about some of the major answers they debated, including revolutionary universalistic utopias (socialism and Communism), various forms of Jewish nationalism, hyphenated identities, cultural pluralism, and cosmopolitanism. Work to contextualize these ideas historically while also considering whether and how they remain relevant to the present.",
            "id": "ILS/JEWISH/SOC 423",
            "title": "MODERN JEWISH THOUGHT"
        }
    },
    {
        "data": {
            "description": "Independent reading and research.",
            "id": "SOC 999",
            "parent": "SOC",
            "title": "READING AND RESEARCH IN SOCIOLOGY"
        }
    },
    {
        "data": {
            "description": "Integrated treatment of macroeconomics and microeconomics (seeECON 101andECON 102). Accelerated approach to economics training, especially for Economics: Math Emphasis majors.",
            "id": "ECON 111",
            "parent": "ECON",
            "title": "PRINCIPLES OF ECONOMICS-ACCELERATED TREATMENT"
        }
    },
    {
        "data": {
            "description": "Intensive study of selected topics in sociology.",
            "id": "SOC 496",
            "parent": "SOC",
            "title": "TOPICS IN SOCIOLOGY"
        }
    },
    {
        "data": {
            "description": "Interdisciplinary inquiry in Latin American society and culture.",
            "id": "AAE/ANTHRO/C&ESOC/GEOG/HISTORY/LACIS/POLISCI/PORTUG/SOC/SPANISH 982",
            "title": "INTERDEPARTMENTAL SEMINAR IN THE LATIN-AMERICAN AREA"
        }
    },
    {
        "data": {
            "description": "Interdisciplinary training workshop on current research in population science from scholars at research and teaching institutions around the world.",
            "id": "C&ESOC/SOC 997",
            "title": "RESEARCH: DEMOGRAPHY AND ECOLOGY TRAINEES"
        }
    },
    {
        "data": {
            "description": "Intermediate to advanced tools used by demographers for studying the behavior of human populations: multiple decrement processes, stable population model, demographic relations in non-stable populations, model age patterns of vital events, indirect estimation methods.",
            "id": "SOC 756",
            "parent": "SOC",
            "title": "DEMOGRAPHIC TECHNIQUES II"
        }
    },
    {
        "data": {
            "description": "Introduces qualitative, or ethnographic, research methods, emphasizing those suitable for educational and other organizational settings. Considers strengths and limitations of qualitative approaches in relation to varied research problems. Explores methodological procedures from entry into the field through writing.",
            "id": "C&ESOC/EDPOL/SOC 755",
            "title": "METHODS OF QUALITATIVE RESEARCH"
        }
    },
    {
        "data": {
            "description": "Introduces students to social and demographic analysis and explanations of the historical and present day causes and consequences of migration of the largest immigrant group to the United States in the 20th century.",
            "id": "CHICLA/SOC 470",
            "title": "SOCIODEMOGRAPHIC ANALYSIS OF MEXICAN MIGRATION"
        }
    },
    {
        "data": {
            "description": "Introduces the concerns and principles of sociology  through examination of human interaction with the natural environment. Places environmental issues such as resource depletion, population growth, food production, environmental regulation, and sustainability in national and global perspectives.",
            "id": "C&ESOC/F&WECOL/SOC 248",
            "title": "ENVIRONMENT, NATURAL RESOURCES, AND SOCIETY"
        }
    },
    {
        "data": {
            "description": "Introduction to analysis of economic data. The techniques of descriptive statistics and statistical inference (hypothesis testing and estimation) as directed toward application in economic research.",
            "id": "ECON 310",
            "parent": "ECON",
            "title": "STATISTICS: MEASUREMENT IN ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Introduction to demographic concepts, methods, data, and trends for application in business, government, planning and other applied areas. Emphasis on U.S. census data and their uses.",
            "id": "C&ESOC/SOC 676",
            "title": "APPLIED DEMOGRAPHY: PLANNING AND POLICY"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Introduction to modern statistical practice in the life sciences, using the R programming language. Topics include: exploratory data analysis, probability and random variables; one-sample testing and confidence intervals, role of assumptions, sample size determination, two-sample inference; basic ideas in experimental design, analysis of variance, linear regression, goodness-of fit; biological applications.",
            "id": "STAT 371",
            "parent": "STAT",
            "title": "INTRODUCTORY APPLIED STATISTICS FOR THE LIFE SCIENCES"
        }
    },
    {
        "data": {
            "description": "Introduction to principles and basic techniques in surveys for social research. Specific topics include the basic concepts of sampling and survey measurement. Learn how survey researchers apply the methods presented and practice applying the concepts and methods learned. The techniques used in this class are relevant for many kinds of data collection and standardized measurement. Provides a substantial experience with practical research skills that are relevant in many academic and private sector contexts.",
            "id": "SOC 351",
            "parent": "SOC",
            "title": "INTRODUCTION TO SURVEY METHODS FOR SOCIAL RESEARCH"
        }
    },
    {
        "data": {
            "description": "Introduction to qualitative research methods most commonly used by practitioners in business, marketing and communications, healthcare, education, government, social service organizations, and think tanks. Produce high-quality data using open-ended survey questions, interviews, focus groups, observations and media/content analysis. Techniques for analyzing and presenting qualitative data, including text-based and visual reports.",
            "id": "SOC 631",
            "parent": "SOC",
            "title": "APPLIED QUALITATIVE METHODS FOR SOCIAL SCIENCE"
        }
    },
    {
        "data": {
            "description": "Introduction to sociology concepts and methods.",
            "id": "SOC 196",
            "parent": "SOC",
            "title": "ELEMENTARY SPECIAL TOPICS IN SOCIOLOGY"
        }
    },
    {
        "data": {
            "description": "Introduction to sociology of agriculture in advanced industrial-capitalist societies, including theoretical, historical, and empirical issues of agriculture in the United States.",
            "id": "C&ESOC/SOC 650",
            "title": "SOCIOLOGY OF AGRICULTURE"
        }
    },
    {
        "data": {
            "description": "Introduction to the cultural worlds of Chicana/os and Latina/os in the U.S. Examines how diverse peoples came to understand themselves as members of a racial, ethnic, and cultural community by exploring the production of music, art, theater, film, television, and literature.",
            "id": "CHICLA 210",
            "parent": "CHICLA",
            "title": "CHICANA/O AND LATINA/O CULTURAL STUDIES"
        }
    },
    {
        "data": {
            "description": "Introduction to the field of American sociology, its subfields and specialized areas of research, theoretical traditions and research methods.",
            "id": "C&ESOC/SOC 210",
            "title": "SURVEY OF SOCIOLOGY"
        }
    },
    {
        "data": {
            "description": "Introduction to the interdisciplinary study of Chicanas/os in the United States. Become acquainted with recent scholarly literature, paradigms, theories, and debates within Chicana/o studies pertaining to the historical, economic, cultural, and sociopolitical dimensions of the Chicana/o experience in the United States.",
            "id": "CHICLA 201",
            "parent": "CHICLA",
            "title": "INTRODUCTION TO CHICANA/O AND LATINA/O STUDIES"
        }
    },
    {
        "data": {
            "description": "Issues involved in decision-making regarding technological risks and risk management in areas such as nuclear power, hazardous waste disposal, and pollution control. Risk perception and cognitive biases; risk analysis and decision analysis; political issues in risk management; regulatory mechanisms; and risk communication. Selected case studies.",
            "id": "C&ESOC/ISYE/NE/SOC 708",
            "title": "SOCIETAL RISK MANAGEMENT OF TECHNOLOGICAL HAZARDS"
        }
    },
    {
        "data": {
            "description": "Latin American culture and society from an interdisciplinary perspective; historical developments from pre-Columbian times to the present; political movements; economic problems; social change; ecology in tropical Latin America; legal systems; literature and the arts; cultural contrasts involving the US and Latin America; land reform; labor movements; capitalism, socialism, imperialism; mass media.",
            "id": "AFROAMER/ANTHRO/C&ESOC/GEOG/HISTORY/LACIS/POLISCI/SOC/SPANISH 260",
            "title": "LATIN AMERICA: AN INTRODUCTION"
        }
    },
    {
        "data": {
            "description": "Macroeconomic measurement and models of aggregate demand and supply; fiscal and monetary policy for unemployment, inflation, and growth.",
            "id": "ECON 102",
            "parent": "ECON",
            "title": "PRINCIPLES OF MACROECONOMICS"
        }
    },
    {
        "data": {
            "description": "Major social psychological theories and research that focus on the individual in social context. Topics include: perspectives on socialization, the self, social perception and attribution, attitudes, language and nonverbal communication, and attraction and relationships.",
            "id": "C&ESOC/SOC 730",
            "title": "INTERMEDIATE SOCIAL PSYCHOLOGY: THE INDIVIDUAL AND SOCIETY"
        }
    },
    {
        "data": {
            "description": "Major social pychological theories and research that focus on interpersonal relations and group processes. Topics include: social interaction (influence, self-presentation, altruism, agression), groups (cohesion, conformity, leadership, problem-solving, decision making), intergroup relations (conflict, stereotypes), n-person games (dilemmas, coalition formation).",
            "id": "C&ESOC/SOC 731",
            "title": "INTERMEDIATE SOCIAL PSYCHOLOGY: GROUP AND COLLECTIVE PROCESSES"
        }
    },
    {
        "data": {
            "description": "Mentored individual research and study for students completing Honors in the Major.",
            "id": "SOC 681",
            "parent": "SOC",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Mentored individual research and study for students completing Honors in the Major.",
            "id": "SOC 682",
            "parent": "SOC",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Mentored individual research and study for students completing a senior thesis.",
            "id": "SOC 691",
            "parent": "SOC",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Mentored individual research and study for students completing a senior thesis.",
            "id": "SOC 692",
            "parent": "SOC",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Methods of measurement for enumeration and registration data; construction of life tables; measures of fertility, nuptiality and migration; examination of census variables.",
            "id": "SOC 674",
            "parent": "SOC",
            "title": "DEMOGRAPHIC TECHNIQUES I"
        }
    },
    {
        "data": {
            "description": "Norm and norm emergence, Preference formation, Ideology, Bounded Rationality, Rational Choice, Prospect Theory, Framing processes, Models of Collective Behaviors, Symbolic Interactionism, Communicative Action, Game Theory, Processes of Social Influence.",
            "id": "SOC 476",
            "parent": "SOC",
            "title": "CONTEMPORARY SOCIOLOGICAL THEORY"
        }
    },
    {
        "data": {
            "description": "Origins and consequences of inter-regime and inter-temporal variation in the institutions of capitalism. The evolution and current trajectory of contemporary capitalism across North America, Europe, and East Asia. Theoretical debates on the dynamics, contradictions and variations of capitalist systems.",
            "id": "SOC 918",
            "parent": "SOC",
            "title": "SEMINAR IN COMPARATIVE SOCIOLOGY OF CONTEMPORARY CAPITALISM"
        }
    },
    {
        "data": {
            "description": "Origins, nature, scope and dynamics of the social problems of older adults and their families in the U.S. and to acquaint students with programs and services available to older adults.",
            "id": "SOC/SOCWORK 422",
            "title": "SOCIAL ISSUES IN AGING"
        }
    },
    {
        "data": {
            "description": "Overview of our current food system and how new technologies and globalization are reshaping it, focusing especially on the implications for workers throughout the food chain. Learn about the ways that social movements are working to reshape commodity chains by promoting local production, fair trade, and labor justice.",
            "id": "C&ESOC/SOC 341",
            "title": "LABOR IN GLOBAL FOOD SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Political institutional arrangements which have emerged since 1890 and how they have influenced social and economic policies implemented since the Second World War. Why the working class has been politically weak in America; policy consequences of this weakness.",
            "id": "HISTORY/SOC 670",
            "title": "CAPITALISM, SOCIALISM, AND DEMOCRACY IN AMERICA SINCE 1890"
        }
    },
    {
        "data": {
            "description": "Practical experience in techniques of social research through assignment to a research project for the semester. Focuses on the art and practice of research and the writing of research reports.",
            "id": "C&ESOC/SOC 693",
            "title": "PRACTICUM IN ANALYSIS AND RESEARCH"
        }
    },
    {
        "data": {
            "description": "Practical experience in techniques of social research through work on a research project for the semester.",
            "id": "SOC 320",
            "parent": "SOC",
            "title": "RESEARCH PRACTICUM IN SOCIOLOGY"
        }
    },
    {
        "data": {
            "description": "Presentation and discussion of on-going research in the area of comparative political economy and economic sociology.",
            "id": "SOC 983",
            "parent": "SOC",
            "title": "RESEARCH: ECONOMIC SOCIOLOGY AND COMPARATIVE POLITICAL ECONOMY"
        }
    },
    {
        "data": {
            "description": "Presentation of sociological data; descriptive statistics; probability theory and statistical inference; estimation and tests of hypotheses; regression and correlation and the analysis of contingency tables.",
            "id": "C&ESOC/SOC 360",
            "title": "STATISTICS FOR SOCIOLOGISTS I"
        }
    },
    {
        "data": {
            "description": "Presentations of research in progress concerning social and economic change in developing countries.",
            "id": "C&ESOC/SOC 993",
            "title": "RESEARCH: SOCIOLOGY OF ECONOMIC CHANGE TRAINEES"
        }
    },
    {
        "data": {
            "description": "Program of study devised by a student in collaboration with a faculty member. Open only to Freshmen and sophomores.",
            "id": "SOC 199",
            "parent": "SOC",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Program of study devised by a student in collaboration with a faculty member. Open only to freshmen and sophomores.",
            "id": "SOC 198",
            "parent": "SOC",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Promotes diversity by bringing students of different backgrounds together for discussion, projects, and gatherings. Gain intergroup and critical thinking skills to promote diversity and equity in classroom and professional settings. Introduces sociological analysis of race, ethnicity, and other intersecting categories.",
            "id": "SOC 205",
            "parent": "SOC",
            "title": "INTERCULTURAL DIALOGUES"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Provides a sociology area equivalency for additional methods and statistics courses taken in study abroad programs that do not equate exactly to existing sociology courses. Enrollment in a UW-Madison resident study abroad program",
            "id": "SOC 461",
            "parent": "SOC",
            "title": "STUDY ABROAD IN ADDITIONAL METHODS AND STATISTICS"
        }
    },
    {
        "data": {
            "description": "Provides a sociology area equivalency for additional theory courses taken in study abroad programs that do not equate exactly to existing sociology courses. Enrollment in a UW-Madison resident study abroad program",
            "id": "SOC 462",
            "parent": "SOC",
            "title": "STUDY ABROAD IN ADDITIONAL THEORY"
        }
    },
    {
        "data": {
            "description": "Provides a sociology area equivalency for courses taken in study abroad programs that do not equate to existing sociology courses. Enrollment in a UW-Madison resident study abroad program",
            "id": "SOC 497",
            "parent": "SOC",
            "title": "STUDY ABROAD IN SOCIOLOGY"
        }
    },
    {
        "data": {
            "description": "Provides a sociology area equivalency for demography and ecology courses taken in study abroad programs that do not equate exactly to existing sociology courses. Enrollment in a UW-Madison resident study abroad program",
            "id": "SOC 460",
            "parent": "SOC",
            "title": "STUDY ABROAD IN DEMOGRAPHY AND ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Provides a sociology area equivalency for deviant behavior courses taken in study abroad programs that do not equate to existing sociology courses. Enrollment in a UW-Madison resident study abroad program",
            "id": "SOC 463",
            "parent": "SOC",
            "title": "STUDY ABROAD IN DEVIANT BEHAVIOR"
        }
    },
    {
        "data": {
            "description": "Provides a sociology area equivalency for social organization courses taken in study abroad programs that do not equate exactly to existing sociology courses.  Enrollment in a UW-Madison resident study abroad program",
            "id": "SOC 465",
            "parent": "SOC",
            "title": "STUDY ABROAD IN SOCIAL ORGANIZATION"
        }
    },
    {
        "data": {
            "description": "Provides a sociology area equivalency for social psychology courses taken in study abroad programs that do not equate exactly to existing sociology courses. Enrollment in a UW-Madison resident study abroad program",
            "id": "SOC 464",
            "parent": "SOC",
            "title": "STUDY ABROAD IN SOCIAL PSYCHOLOGY"
        }
    },
    {
        "data": {
            "description": "Provides an interdisciplinary introduction to biological, psychological, and sociological aspects of human sexuality.",
            "id": "PSYCH/SOC 453",
            "title": "HUMAN SEXUALITY"
        }
    },
    {
        "data": {
            "description": "Relevance of the concept of community to American society. Review of several basic theories of community and analysis of the nature of community in the broader political and economic context.",
            "id": "C&ESOC/SOC/URBRPL 645",
            "title": "MODERN AMERICAN COMMUNITIES"
        }
    },
    {
        "data": {
            "description": "Review of ecological theory and research; critical assessment of the ecological complex (population, organization, environment, and technology); problems of measurement.",
            "id": "C&ESOC/SOC 977",
            "title": "SEMINAR-HUMAN ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Review of problems and prospects of so-called \"developing societies.\" Includes theory of economic/social development, political economic organizations of \"developing\" societies, history of colonialism/imperialism, attempts to industrialize and results of those attempts.",
            "id": "C&ESOC/SOC 630",
            "title": "SOCIOLOGY OF DEVELOPING SOCIETIES/THIRD WORLD"
        }
    },
    {
        "data": {
            "description": "Role of social structure, authorities and movement participants, and leadership in the origins, mobilization, participation, strategy and tacts, and potential for success of social movements.",
            "id": "SOC 626",
            "parent": "SOC",
            "title": "SOCIAL MOVEMENTS"
        }
    },
    {
        "data": {
            "description": "Scientific methods in the study of society; procedures for testing sociological theory: problem definition, hypothesis construction, collection and evaluation of data. Practical experience conducting small research projects.",
            "id": "C&ESOC/SOC 357",
            "title": "METHODS OF SOCIOLOGICAL INQUIRY"
        }
    },
    {
        "data": {
            "description": "Selected topics in Marxist theory and research.",
            "id": "C&ESOC/SOC 929",
            "title": "SEMINAR: CLASS ANALYSIS AND HISTORICAL CHANGE"
        }
    },
    {
        "data": {
            "description": "Selected topics in critical sociology taught in intensive units.",
            "id": "SOC 994",
            "parent": "SOC",
            "title": "COLLOQUIUM IN CRITICAL SOCIOLOGY"
        }
    },
    {
        "data": {
            "description": "Selected topics in measurement and model construction in social research.",
            "id": "SOC 952",
            "parent": "SOC",
            "title": "SEMINAR-MATHEMATICAL AND STATISTICAL APPLICATIONS IN SOCIOLOGY"
        }
    },
    {
        "data": {
            "description": "Selected topics in political sociology, e.g., social movements, citizenship, civic engagement, weakening of postwar \"social democratic consensus\" under financialized globalization pressures.",
            "id": "SOC/URBRPL 924",
            "title": "SEMINAR-POLITICAL SOCIOLOGY"
        }
    },
    {
        "data": {
            "description": "Selected topics.",
            "id": "EDPOL/SOC 908",
            "title": "SEMINAR-SOCIOLOGY OF EDUCATION"
        }
    },
    {
        "data": {
            "description": "Social and cultural dimensions of food production and consumption. Uses historical and cross-cultural analytical frameworks. Treats a wide variety of topics including indigenous, racial, and ethnic foodways, industrialized food systems, sustainable agriculture, movements for food justice.",
            "id": "C&ESOC/SOC 222",
            "title": "FOOD, CULTURE, AND SOCIETY"
        }
    },
    {
        "data": {
            "description": "Social and economic determinants and consequences of contemporary and historical population trends in both developed and developing societies. Fertility, mortality, migration, population distribution, age structure, population growth.",
            "id": "ECON/SOC 663",
            "title": "POPULATION AND SOCIETY"
        }
    },
    {
        "data": {
            "description": "Social and economic factors relating to stability, growth, and change in the non-Western areas of the contemporary world.",
            "id": "ANTHRO/C&ESOC/ECON/SOC 925",
            "title": "SEMINAR: SOCIO-ECONOMIC CHANGE IN UNDERDEVELOPED AREAS"
        }
    },
    {
        "data": {
            "description": "Social network analysis is a social scientific approach examining individuals as embedded in networks of social relations. Covers the fundamentals of network thinking, network tools, and the analysis and presentation of social network data. Direct practice with network data using software R.",
            "id": "C&ESOC/SOC 618",
            "title": "SOCIAL NETWORK ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Social, cultural and personality factors influencing community development, with reference to developing countries as well as contemporary rural communities; consideration of theoretical and operational issues.",
            "id": "C&ESOC/SOC/URBRPL 617",
            "title": "COMMUNITY DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Social, cultural, and structural factors in shaping definitions of health and illness, distribution of disparate health outcomes, and the organization of health professions and healthcare.",
            "id": "C&ESOC/SOC 343",
            "title": "SOCIOLOGY OF HEALTH AND MEDICINE"
        }
    },
    {
        "data": {
            "description": "Social, economic, and political problems affected by birth and death rates, population size and distribution, voluntary and forced migration. World ecology, limits to growth, economic development, international conflict, environmental quality, metropolitan expansion, segregation by age, race, and wealth. Policies affecting reproduction, nuptiality, morbidity, mortality, migration.",
            "id": "SOC 170",
            "parent": "SOC",
            "title": "POPULATION PROBLEMS"
        }
    },
    {
        "data": {
            "description": "Sociological analysis of historical and recent ethnic/racial conflict and movements in the U.S., including the relations between European Americans, African Americans, Mexican Americans, Native Americans, and Asian Americans, with additional material on other groups and relations.",
            "id": "ASIANAM/SOC 220",
            "title": "ETHNIC MOVEMENTS IN THE UNITED STATES"
        }
    },
    {
        "data": {
            "description": "Sociological analysis of relationships among economic growth, environmental sustainability and social justice in the developing world. Considers frameworks for understanding poverty, hunger, educational and technological inequality, and the impact of globalization on prospects for socially and ecologically sustainable development.",
            "id": "C&ESOC/ENVIRST/SOC 540",
            "title": "SOCIOLOGY OF INTERNATIONAL DEVELOPMENT, ENVIRONMENT, AND SUSTAINABILITY"
        }
    },
    {
        "data": {
            "description": "Sociological approaches to community, rural, and public health.  Examines epidemiological evidence for and policy solutions to health issues that impact vulnerable populations in diverse geographic and social settings. Topics include mental health, environmental and occupational health, preventive care, substance abuse.",
            "id": "C&ESOC/SOC 533",
            "title": "PUBLIC HEALTH IN RURAL & URBAN COMMUNITIES"
        }
    },
    {
        "data": {
            "description": "Sociological examination of the linkages between the social and biophysical dimensions of the environment. Key topics include community organizing, local food systems, energy transitions, environmental justice, resource dependence, and sustainable development.",
            "id": "C&ESOC/SOC 140",
            "title": "INTRODUCTION TO COMMUNITY AND ENVIRONMENTAL SOCIOLOGY"
        }
    },
    {
        "data": {
            "description": "Sociological perspectives on the organization of the firm, financial markets, and work, intermediate associations (unions, ethnic economies), the state, and the international economy. Contrast between neoclassical, traditional institutionalist, post-fordist, and neo-fordist perspectives on the nature and evolution of these institutions.",
            "id": "C&ESOC/SOC 652",
            "title": "SOCIOLOGY OF ECONOMIC INSTITUTIONS"
        }
    },
    {
        "data": {
            "description": "Sociological perspectives on the structures and processes of large-scale formal organizations in Western society; a wide ranging examination of contemporary organizational theory and research, with illustrations from business, governmental, military, political and educational organizations.",
            "id": "SOC 632",
            "parent": "SOC",
            "title": "SOCIOLOGY OF ORGANIZATIONS"
        }
    },
    {
        "data": {
            "description": "Sociology of the family. Demographic, social-psychological, economic, and historical aspects. Union formation and dissolution. Childbearing and childrearing. Social stratification and the family. Intergenerational support. Social consequences of family behaviors.",
            "id": "SOC 120",
            "parent": "SOC",
            "title": "MARRIAGE AND FAMILY"
        }
    },
    {
        "data": {
            "description": "Sport as a social institution; social characteristics and problems of sport at the youth, school, college, and professional levels.",
            "id": "SOC 647",
            "parent": "SOC",
            "title": "SOCIOLOGY OF SPORT"
        }
    },
    {
        "data": {
            "description": "Statistical methods used in applied economic research. Topics include: survey methods and data sources; multiple regression and analysis of variance; econometric estimation; forecasting and policy applications.",
            "id": "ECON 410",
            "parent": "ECON",
            "title": "INTRODUCTORY ECONOMETRICS"
        }
    },
    {
        "data": {
            "description": "Teaches how qualitative research can be used to advance sociological theory. Topics include inductive and deductive research designs in qualitative research, conducting and analyzing interviews, content analysis, conducting observations, focus groups and data management in qualitative research.",
            "id": "SOC 754",
            "parent": "SOC",
            "title": "QUALITATIVE RESEARCH METHODS IN SOCIOLOGY"
        }
    },
    {
        "data": {
            "description": "Techniques of integration, improper integrals, first order ordinary differential equations, sequences and series, Taylor series, vector geometry in two and three dimensions.",
            "id": "MATH 222",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 2"
        }
    },
    {
        "data": {
            "description": "The allocation of economic and social rewards in the United States; emphasis on persistently poor regions and communities; analysis of selected minority groups and their poverty statuses; poverty programs and their consequences for structural and cultural changes.",
            "id": "AMERIND/C&ESOC/SOC 578",
            "title": "POVERTY AND PLACE"
        }
    },
    {
        "data": {
            "description": "The nature of inter-group relations; emphasis on various forms of racism, discrimination, and white privilege; historical background and characteristics of American Indians, African Americans, Hispanic Americans, Asian Americans and other racial and ethnic minorities; a consideration of economic, housing, political, legal, educational, familial, and health challenges faced by minority groups in US society.",
            "id": "SOC 134",
            "parent": "SOC",
            "title": "SOCIOLOGY OF RACE & ETHNICITY IN THE UNITED STATES"
        }
    },
    {
        "data": {
            "description": "The study spoken English as a site for social organization. Theoretical foundations and methodological practices for conversation analysis will be explored using videotaped data from English. Content includes current critical trends in analyzing interaction as well as cross-cultural and cross-linguistic perspectives.",
            "id": "ENGL/SOC 710",
            "title": "INTERACTION ANALYSIS: TALK AS SOCIAL ORGANIZATION"
        }
    },
    {
        "data": {
            "description": "The systematic study of the individual in a social context, including social interaction, motivation, attitudes, conformity, communication, leadership, personal relationships, and behavior in small groups.",
            "id": "SOC 444",
            "parent": "SOC",
            "title": "SOCIAL PSYCHOLOGY: A SOCIOLOGICAL PERSPECTIVE"
        }
    },
    {
        "data": {
            "description": "Theoretical and practical issues involved in the design of surveys and their components. Apply knowledge of survey research techniques to a specific and complete research project.",
            "id": "SOC 751",
            "parent": "SOC",
            "title": "SURVEY METHODS FOR SOCIAL RESEARCH"
        }
    },
    {
        "data": {
            "description": "Theoretical and technical problems in research concerning organizational and socio-psychological aspects of changes in large scale social systems.",
            "id": "C&ESOC/SOC 940",
            "title": "SEMINAR-SOCIOLOGY OF ECONOMIC CHANGE"
        }
    },
    {
        "data": {
            "description": "Theoretical explanations of criminal behavior. Measurement of crime and evaluation of criminological research. Current issues in criminology and crime-related public policy.",
            "id": "SOC 441",
            "parent": "SOC",
            "title": "CRIMINOLOGY"
        }
    },
    {
        "data": {
            "description": "Theoretical, methodological, and current research problems.",
            "id": "C&ESOC/SOC 922",
            "title": "SEMINAR-RACE AND ETHNIC RELATIONS"
        }
    },
    {
        "data": {
            "description": "Theory and research in alternate semesters in rural aspects of population, stratification, social change, and groups and institutions.",
            "id": "C&ESOC/SOC 945",
            "title": "SEMINAR-RURAL SOCIOLOGY"
        }
    },
    {
        "data": {
            "description": "Theory and research on the social origins, processes and effects of law; examination of law-related behavior, legal institutions, law and social structure, and law and social change; linkage to contemporary theoretical and political debates.",
            "id": "LAW/LEGALST/SOC 641",
            "title": "SOCIOLOGY OF LAW"
        }
    },
    {
        "data": {
            "description": "Theory of democracy, political culture, comparative studies of voting behavior, political decisions, collective violence, regime breakdowns, social movements, mobilization processes, frame analysis.",
            "id": "SOC 624",
            "parent": "SOC",
            "title": "POLITICAL SOCIOLOGY"
        }
    },
    {
        "data": {
            "description": "Understanding the structure of different types of social scientific data, techniques for data evaluation, cleaning, documentation and visual display, merging data from multiple sources, restructuring data for analysis.",
            "id": "C&ESOC/SOC 365",
            "title": "DATA MANAGEMENT FOR SOCIAL SCIENCE RESEARCH"
        }
    },
    {
        "data": {
            "description": "Utilizes a sociological lens to examine American schools and schooling, with a particular focus on social inequality in the U.S. and how class, race, and gender intersect in the experiences of students. Examine how schools and schooling relate to broader social structures, institutions, and practices with a focus on inequality in public education.",
            "id": "EDPOL/SOC 648",
            "title": "SOCIOLOGY OF EDUCATION"
        }
    },
    {
        "data": {
            "description": "Vector spaces and linear transformations, differential calculus of scalar and vector fields, determinants, eigenvalues and eigenvectors, multiple integrals, line integrals, and surface integrals. Freshmen students are invited to enroll by the Department of Mathematics.",
            "id": "MATH 375",
            "parent": "MATH",
            "title": "TOPICS IN MULTI-VARIABLE CALCULUS AND LINEAR ALGEBRA"
        }
    },
    {
        "data": {
            "description": "With primary emphasis on the U.S., the course covers social, economic and biological dimensions of food systems. Using classroom and community experience, the course combines academic approaches with practitioner knowledge. A community project is required.",
            "id": "AAE/C&ESOC/SOC 340",
            "title": "ISSUES IN FOOD SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Workshop featuring presentations and discussion of current debates within the sociology of gender.",
            "id": "SOC 984",
            "parent": "SOC",
            "title": "RESEARCH: SOCIOLOGY OF GENDER TRAINEES"
        }
    },
    {
        "data": {
            "description": "Workshop on current topics in political, cultural, and comparative historical sociology (e.g., social movements, citizenship, collective identities, political behaviors, attitudes).",
            "id": "SOC 992",
            "parent": "SOC",
            "title": "RESEARCH: SOCIAL ORGANIZATION TRAINEES POLITICS, CULTURE, AND SOCIETY"
        }
    },
    {
        "data": {
            "description": "Workshop on social science research methods and professional development, e.g. ethics, communication, data management, novel research methods.",
            "id": "C&ESOC/SOC 995",
            "title": "RESEARCH: METHODOLOGY TRAINEES"
        }
    },
    {
        "data": {
            "id": "CHICLA",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ECON",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "GEN&WS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "HISTORY",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "PSYCH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "SOC",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "SOCWORK",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "STAT",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "C&ESOC/F&WECOL/SOC 248",
            "target": "C&ESOC/SOC 541"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 140",
            "target": "AAE/C&ESOC/SOC 340"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 140",
            "target": "AMERIND/C&ESOC/SOC 578"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 140",
            "target": "C&ESOC/ENVIRST/SOC 540"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 140",
            "target": "C&ESOC/SOC 533"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 140",
            "target": "C&ESOC/SOC 541"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 140",
            "target": "C&ESOC/SOC 573"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 140",
            "target": "C&ESOC/SOC 676"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 140",
            "target": "C&ESOC/SOC/URBRPL 617"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 140",
            "target": "C&ESOC/SOC/URBRPL 645"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 140",
            "target": "SOC 678"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 210",
            "target": "C&ESOC/SOC 211"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 210",
            "target": "C&ESOC/SOC 357"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 210",
            "target": "C&ESOC/SOC 475"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 210",
            "target": "C&ESOC/SOC 650"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 210",
            "target": "C&ESOC/SOC/URBRPL 645"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 210",
            "target": "HISTORY/SOC 670"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 210",
            "target": "SOC 181"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 210",
            "target": "SOC 441"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 210",
            "target": "SOC 446"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 210",
            "target": "SOC 496"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 210",
            "target": "SOC 535"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 210",
            "target": "SOC 633"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 210",
            "target": "SOC 647"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 210",
            "target": "SOC 678"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 210",
            "target": "SOC/SOCWORK 422"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 211",
            "target": "C&ESOC/SOC 210"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 211",
            "target": "C&ESOC/SOC 357"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 211",
            "target": "C&ESOC/SOC 475"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 211",
            "target": "C&ESOC/SOC 573"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 211",
            "target": "C&ESOC/SOC 676"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 211",
            "target": "C&ESOC/SOC/URBRPL 617"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 211",
            "target": "HISTORY/SOC 670"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 211",
            "target": "SOC 181"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 211",
            "target": "SOC 421"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 211",
            "target": "SOC 543"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 211",
            "target": "SOC 678"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 357",
            "target": "C&ESOC/SOC 693"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 357",
            "target": "SOC 320"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 357",
            "target": "SOC 351"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 357",
            "target": "SOC 575"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 357",
            "target": "SOC 674"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 360",
            "target": "C&ESOC/SOC 361"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 360",
            "target": "C&ESOC/SOC 365"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 360",
            "target": "C&ESOC/SOC 618"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 360",
            "target": "SOC 351"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 360",
            "target": "SOC 375"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 360",
            "target": "SOC 674"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 361",
            "target": "C&ESOC/SOC 693"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 361",
            "target": "SOC 362"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 475",
            "target": "GEN&WS/SOC 611"
        }
    },
    {
        "data": {
            "source": "CHICLA 201",
            "target": "CHICLA/LEGALST/SOC 440"
        }
    },
    {
        "data": {
            "source": "CHICLA 201",
            "target": "CHICLA/LEGALST/SOC 443"
        }
    },
    {
        "data": {
            "source": "CHICLA 201",
            "target": "CHICLA/SOC 470"
        }
    },
    {
        "data": {
            "source": "CHICLA 210",
            "target": "CHICLA/SOC 470"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON 310"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON/SOC 663"
        }
    },
    {
        "data": {
            "source": "ECON 102",
            "target": "ECON 111"
        }
    },
    {
        "data": {
            "source": "ECON 102",
            "target": "ECON 310"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON 101"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON 102"
        }
    },
    {
        "data": {
            "source": "ECON 310",
            "target": "C&ESOC/SOC 361"
        }
    },
    {
        "data": {
            "source": "ECON 310",
            "target": "C&ESOC/SOC 618"
        }
    },
    {
        "data": {
            "source": "ECON 310",
            "target": "ECON 400"
        }
    },
    {
        "data": {
            "source": "ECON 310",
            "target": "ECON 410"
        }
    },
    {
        "data": {
            "source": "ECON 310",
            "target": "SOC 351"
        }
    },
    {
        "data": {
            "source": "ECON 400",
            "target": "ECON 410"
        }
    },
    {
        "data": {
            "source": "ECON 410",
            "target": "ECON 400"
        }
    },
    {
        "data": {
            "source": "ECON 410",
            "target": "SOC 362"
        }
    },
    {
        "data": {
            "source": "GEN&WS 102",
            "target": "GEN&WS/LEGALST/SOC 406"
        }
    },
    {
        "data": {
            "source": "GEN&WS 102",
            "target": "GEN&WS/LEGALST/SOC 425"
        }
    },
    {
        "data": {
            "source": "GEN&WS 103",
            "target": "GEN&WS/LEGALST/SOC 425"
        }
    },
    {
        "data": {
            "source": "GEN&WS 441",
            "target": "GEN&WS/SOC 611"
        }
    },
    {
        "data": {
            "source": "GEN&WS 445",
            "target": "GEN&WS/SOC 611"
        }
    },
    {
        "data": {
            "source": "HISTORY 102",
            "target": "HISTORY/SOC 670"
        }
    },
    {
        "data": {
            "source": "LEGALST/SOC 131",
            "target": "LEGALST/SOC 694"
        }
    },
    {
        "data": {
            "source": "LEGALST/SOC 131",
            "target": "SOC 421"
        }
    },
    {
        "data": {
            "source": "LEGALST/SOC 131",
            "target": "SOC 441"
        }
    },
    {
        "data": {
            "source": "LEGALST/SOC 131",
            "target": "SOC 446"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 213"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "source": "MATH 213",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 222"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 320"
        }
    },
    {
        "data": {
            "source": "MATH 320",
            "target": "SOC 376"
        }
    },
    {
        "data": {
            "source": "MATH 375",
            "target": "SOC 376"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "PSYCH 202",
            "target": "PSYCH/SOC 453"
        }
    },
    {
        "data": {
            "source": "PSYCH/SOC 160",
            "target": "PSYCH/SOC 453"
        }
    },
    {
        "data": {
            "source": "PSYCH/SOC 453",
            "target": "PSYCH/SOC 160"
        }
    },
    {
        "data": {
            "source": "SOC 170",
            "target": "ECON/SOC 663"
        }
    },
    {
        "data": {
            "source": "SOC 181",
            "target": "HISTORY/SOC 670"
        }
    },
    {
        "data": {
            "source": "SOC 181",
            "target": "SOC 496"
        }
    },
    {
        "data": {
            "source": "SOC 181",
            "target": "SOC 535"
        }
    },
    {
        "data": {
            "source": "SOC 181",
            "target": "SOC 543"
        }
    },
    {
        "data": {
            "source": "SOC 181",
            "target": "SOC 647"
        }
    },
    {
        "data": {
            "source": "SOC 181",
            "target": "SOC 678"
        }
    },
    {
        "data": {
            "source": "SOC 181",
            "target": "SOC/SOCWORK 422"
        }
    },
    {
        "data": {
            "source": "SOC 375",
            "target": "SOC 376"
        }
    },
    {
        "data": {
            "source": "SOCWORK 205",
            "target": "SOC/SOCWORK 422"
        }
    },
    {
        "data": {
            "source": "STAT 324",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "source": "STAT 371",
            "target": "C&ESOC/SOC 618"
        }
    },
    {
        "data": {
            "source": "STAT 371",
            "target": "STAT 324"
        }
    }
]