[
    {
        "data": {
            "description": "Definition, incidence, etiology, and prevention of developmental disabilities. Examines the life-cycle needs of this population, as well as social-welfare issues, social services available, and the social worker's role.",
            "id": "SOCWORK 644",
            "parent": "SOCWORK",
            "title": "ISSUES IN DEVELOPMENTAL DISABILITIES"
        }
    },
    {
        "data": {
            "description": "Research and thesis for MSW students who who wish to submit a master's thesis or conduct independent research.",
            "id": "SOCWORK 890",
            "parent": "SOCWORK",
            "title": "THESIS-RESEARCH"
        }
    },
    {
        "data": {
            "description": "The relationship of parent and child; the rights of unmarried mothers and fathers and their children; parental rights to custody vis a vis third parties; parents' rights to make decisions affecting children; neglect; termination of parental rights; the foster care system and adoption.",
            "id": "LAW/SOCWORK 823",
            "title": "FAMILY LAW: PARENT AND CHILD"
        }
    },
    {
        "data": {
            "description": "A comprehensive introduction to practice of program evaluation research in social welfare and human development. Developments in descriptive, experimental, quasi-experimental, theory-driven, and naturalistic evaluations detailed. Topics include assessment, evaluation design, monitoring, outcome evaluation, selection bias, program theory, meta-analysis and utilization.",
            "id": "EDPSYCH/SOCWORK 945",
            "title": "EVALUATION RESEARCH"
        }
    },
    {
        "data": {
            "description": "A multi-level exploration of out-of-home care and permanency in the child welfare field.  Includes local, state and national perspectives, as well as research, policy and practice issues in foster care, kinship care, adoption and other permanency options.",
            "id": "SOCWORK 656",
            "parent": "SOCWORK",
            "title": "CHILD WELFARE PRACTICE IN FOSTER AND KINSHIP CARE, PERMANENCY, AND ADOPTION"
        }
    },
    {
        "data": {
            "description": "Addresses major mental health concerns across the lifespan, using the Diagnostic and Statistical Manual of Mental Disorders (DSM) as the organizing framework for reviewing major mental disorders and critiquing the current \"medical model\" approach to mental health in the United States. Approaches mental health issues from a generalist perspective, including the role of the social environment, culture, and stigma in mental health services, access, and policy.",
            "id": "SOCWORK 612",
            "parent": "SOCWORK",
            "title": "PSYCHOPATHOLOGY IN GENERALIST SOCIAL WORK PRACTICE"
        }
    },
    {
        "data": {
            "description": "Addresses multi-level interventions with children, youth, and families across multiple service systems, with an emphasis on practice innovations.",
            "id": "SOCWORK 741",
            "parent": "SOCWORK",
            "title": "INTERVENTIONS WITH CHILDREN, YOUTH, AND FAMILIES"
        }
    },
    {
        "data": {
            "description": "Addressing psychosocial, cultural, existential, ethical, and team-based aspects of care with individuals and families across the life course who are impacted by serious illness.",
            "id": "SOCWORK 648",
            "parent": "SOCWORK",
            "title": "SOCIAL WORK PRACTICE IN PALLIATIVE CARE"
        }
    },
    {
        "data": {
            "description": "Advanced practice and coursework in educational settings to conceptualize social work skills in schools and to integrate knowledge of social work theory and practice.",
            "id": "SOCWORK 817",
            "parent": "SOCWORK",
            "title": "SOCIAL WORK PRACTICE IN SCHOOLS II"
        }
    },
    {
        "data": {
            "description": "Advanced practice knowledge and skills essential for social workers practicing in health, aging, and disability care settings.",
            "id": "SOCWORK 874",
            "parent": "SOCWORK",
            "title": "HEALTH, AGING, AND DISABILITY PRACTICE FOR THE 21ST CENTURY"
        }
    },
    {
        "data": {
            "description": "Affirming social work practice with lesbian, gay, bisexual, transgender, nonbinary, queer, intersex, asexual, Two-Spirit, and other LGBTQIA2S+ individuals and communities.",
            "id": "SOCWORK 639",
            "parent": "SOCWORK",
            "title": "SOCIAL WORK PRACTICE WITH LGBTQIA2S+ INDIVIDUALS AND COMMUNITIES"
        }
    },
    {
        "data": {
            "description": "An approved advanced generalist field seminar and placement linked to areas of focus. Seminar and placement require a minimum of 20 hours per week.",
            "id": "SOCWORK 800",
            "parent": "SOCWORK",
            "title": "FIELD PRACTICE AND INTEGRATIVE SEMINAR III"
        }
    },
    {
        "data": {
            "description": "An approved advanced practice social work field seminar and placement.",
            "id": "SOCWORK 801",
            "parent": "SOCWORK",
            "title": "FIELD PRACTICE AND INTEGRATIVE SEMINAR IV"
        }
    },
    {
        "data": {
            "description": "An approved generalist field seminar and social work agency placement. Seminar and placement require a minimum of 16 hours per week. The second course of the two-semester generalist field sequence.",
            "id": "SOCWORK 401",
            "parent": "SOCWORK",
            "title": "FIELD PRACTICE AND INTEGRATIVE SEMINAR II"
        }
    },
    {
        "data": {
            "description": "An approved generalist field seminar and social work community agency placement. Seminar and placement require a minimum of 16 hours/week. The first course of the two-semester generalist field sequence.",
            "id": "SOCWORK 400",
            "parent": "SOCWORK",
            "title": "FIELD PRACTICE AND INTEGRATIVE SEMINAR I"
        }
    },
    {
        "data": {
            "description": "An introduction to the paradigms, methods and substance of sociology.",
            "id": "SOC 181",
            "parent": "SOC",
            "title": "HONORS INTRODUCTORY SEMINAR-THE SOCIOLOGICAL ENTERPRISE"
        }
    },
    {
        "data": {
            "description": "An opportunity to meet with prevention professionals and scholars from across campus and the community to explore current and emerging issues of prevention research and professional practice.  Students must completeHDFS/​ED PSYCH/​NURSING/​SOC WORK  880before taking this course.",
            "id": "EDPSYCH/HDFS/NURSING/SOCWORK 881",
            "title": "CAPSTONE SEMINAR IN PREVENTION SCIENCE"
        }
    },
    {
        "data": {
            "description": "An overview of risk and protective factors, theories, services, research, and activism related to interpersonal violence. Models of prevention and intervention will be discussed. Skills related to social work practice with individuals and communities affected by interpersonal violence will be practiced.",
            "id": "SOCWORK 623",
            "parent": "SOCWORK",
            "title": "INTERPERSONAL VIOLENCE"
        }
    },
    {
        "data": {
            "description": "An overview of statistical methods covering the topics required for social work professional degrees, such as distributions, standard error, regression, correlation assumptions and limitations, and basic ideas of experimental design.",
            "id": "SOCWORK 705",
            "parent": "SOCWORK",
            "title": "BASIC STATISTICS FOR SOCIAL WORK"
        }
    },
    {
        "data": {
            "description": "Analysis of policy issues as applied to such fields as poverty, discrimination, crime, physical and mental health on both national and state levels.",
            "id": "SOCWORK 709",
            "parent": "SOCWORK",
            "title": "SOCIAL POLICY"
        }
    },
    {
        "data": {
            "description": "Anti-oppressive approaches to analyzing the dynamics of sex trading (including sex trafficking and sex work) as well as implications for practice and policy. Integrates diverse and conflicting perspectives of survivors, practitioners, and researchers to deconstruct sex trafficking risk, prevention, identification, and intervention strategies.",
            "id": "SOCWORK 627",
            "parent": "SOCWORK",
            "title": "SEX TRAFFICKING AND SEX TRADING"
        }
    },
    {
        "data": {
            "description": "Application of research methods seminars. Practical experience and application of research knowledge and skills. Applied data analysis, proposal and grant Writing, and research methods in communities of color are examples of topics addressed.",
            "id": "SOCWORK 952",
            "parent": "SOCWORK",
            "title": "PHD PROSEMINAR"
        }
    },
    {
        "data": {
            "description": "Applied theory seminars.  Provide a model of the application of social theory to social problems. Adult Mental Health; Microeconomic Theory Applied to Social Problems; and Child Welfare are examples of topics offered.",
            "id": "SOCWORK 951",
            "parent": "SOCWORK",
            "title": "PHD PROSEMINAR"
        }
    },
    {
        "data": {
            "description": "Basic principles and definitions of sociology. Readings and discussion of the perspectives of sociology, the individual and society, groups and social process, stratification, organizations and power, demography, and social change.",
            "id": "C&ESOC/SOC 211",
            "title": "THE SOCIOLOGICAL ENTERPRISE"
        }
    },
    {
        "data": {
            "description": "Considers legislation, policies, and institutional structures that affect children, youth, and families across multiple service systems.",
            "id": "SOCWORK 920",
            "parent": "SOCWORK",
            "title": "CHILD, YOUTH, AND FAMILY POLICIES AND SERVICES"
        }
    },
    {
        "data": {
            "description": "Course for students in the Part-Time MSW Program to maintain UW-Madison status when they have partial exemptions and no other courses available.",
            "id": "SOCWORK 700",
            "parent": "SOCWORK",
            "title": "PART-TIME MSW PROGRAM EXEMPTION TERM"
        }
    },
    {
        "data": {
            "description": "Develops advanced practice knowledge and skills for social workers practicing in health and health care settings.",
            "id": "SOCWORK 873",
            "parent": "SOCWORK",
            "title": "SOCIAL WORK PRACTICE IN HEALTH CARE"
        }
    },
    {
        "data": {
            "description": "Develops generalist social work knowledge and skills for working with and on behalf of individuals, families, and groups. Focus on development of basic social work direct practice skills.",
            "id": "SOCWORK 441",
            "parent": "SOCWORK",
            "title": "GENERALIST PRACTICE WITH INDIVIDUALS, FAMILIES AND GROUPS"
        }
    },
    {
        "data": {
            "description": "Dissertation preparation.",
            "id": "SOCWORK 990",
            "parent": "SOCWORK",
            "title": "THESIS-RESEARCH"
        }
    },
    {
        "data": {
            "description": "Evidence-based cognitive and behavioral interventions used by social workers in the treatment of mental health challenges.",
            "id": "SOCWORK 870",
            "parent": "SOCWORK",
            "title": "COGNITIVE AND BEHAVIORAL MENTAL HEALTH TREATMENTS FOR ADULTS"
        }
    },
    {
        "data": {
            "description": "Examination of physical, emotional and sexual abuse of children, child neglect, and exploitation.",
            "id": "SOCWORK 646",
            "parent": "SOCWORK",
            "title": "CHILD ABUSE AND NEGLECT"
        }
    },
    {
        "data": {
            "description": "Examine ideas and values related to making a difference, think critically about the meaning and methods of changing the world, and integrate thoughtful evidence with your values and beliefs about doing good in the world. With a focus on the profession of social work and other helping professions, consider a variety of social problems, and investigate and critique various approaches to creating change to improve social problems.",
            "id": "SOCWORK 100",
            "parent": "SOCWORK",
            "title": "SO YOU WANT TO CHANGE THE WORLD?"
        }
    },
    {
        "data": {
            "description": "Exploration and application of theory to the formation and development of small groups deliberately used by social workers to effect specified change in interpersonal relationships.",
            "id": "SOCWORK 454",
            "parent": "SOCWORK",
            "title": "SMALL GROUPS IN SOCIAL WORK  PRACTICE"
        }
    },
    {
        "data": {
            "description": "Exploration of the small group as the interventive unit; major models and techniques; principles guiding the selection of the small group approach to intervention based on research knowledge of problems, processes, and outcomes.",
            "id": "SOCWORK 624",
            "parent": "SOCWORK",
            "title": "SOCIAL WORK WITH THE SMALL GROUP"
        }
    },
    {
        "data": {
            "description": "Explore evidence-based services through a holistic perspective that looks at a person in their environment, using a person-centered approach.  Assessment, treatment, and generalization of change strategies; problem solving; resource development; intervention planning; current trends in mental health and other practice issues are explored.",
            "id": "SOCWORK 742",
            "parent": "SOCWORK",
            "title": "ASSESSING AND TREATING CHILDREN AND ADOLESCENTS"
        }
    },
    {
        "data": {
            "description": "Explore multiple approaches social workers use to foster social justice across organizations, communities, and societal levels. Practice advanced skills for addressing complex macro level practice issues.",
            "id": "SOCWORK 840",
            "parent": "SOCWORK",
            "title": "ADVANCED MACRO PRACTICE"
        }
    },
    {
        "data": {
            "description": "Explores the nature and centrality of the experience of loss and subsequent grief, preparing individuals with strategies to intervene with individuals, families, and communities in response to a diversity of losses throughout the lifespan.",
            "id": "SOCWORK 825",
            "parent": "SOCWORK",
            "title": "GRIEF, DEATH, LOSS, AND LIFE"
        }
    },
    {
        "data": {
            "description": "Exposes students to the theory and practice of planned change in communities and organizations and helps them incorporate a generalist model into practice at these levels of intervention.",
            "id": "SOCWORK 442",
            "parent": "SOCWORK",
            "title": "GENERALIST PRACTICE WITH COMMUNITIES AND ORGANIZATIONS"
        }
    },
    {
        "data": {
            "description": "First of two semesters of undergraduate research for students in the honors program leading to completion of thesis.",
            "id": "SOCWORK 681",
            "parent": "SOCWORK",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "First of two semesters of undergraduate research leading to completion of thesis.",
            "id": "SOCWORK 691",
            "parent": "SOCWORK",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Focused work on a topic or problem of graduate student interest under supervision of social work instructors.",
            "id": "SOCWORK 999",
            "parent": "SOCWORK",
            "title": "INDEPENDENT READING"
        }
    },
    {
        "data": {
            "description": "Focuses on a biopsychosocial understanding of mental health from a social work and social environment perspective, giving special attention to the person-in-environment and current classification systems available to the practitioner.",
            "id": "SOCWORK 712",
            "parent": "SOCWORK",
            "title": "PSYCHOPATHOLOGY FOR SOCIAL WORK PRACTICE IN MENTAL HEALTH"
        }
    },
    {
        "data": {
            "description": "Focuses on the core practice theories, conceptual frameworks, and intervention skills necessary for social work practice in mental health.",
            "id": "SOCWORK 835",
            "parent": "SOCWORK",
            "title": "ADVANCED SOC WORK PRACTICE IN MENTAL HEALTH"
        }
    },
    {
        "data": {
            "description": "Foundational knowledge for generalist social work practice in a multicultural society. Examines the experiences of diverse populations with interpersonal and institutional oppression, and implications are drawn for social policy.",
            "id": "SOCWORK 640",
            "parent": "SOCWORK",
            "title": "DIVERSITY, OPPRESSION AND SOCIAL JUSTICE IN SOCIAL WORK"
        }
    },
    {
        "data": {
            "description": "Foundational knowledge of contemporary psychedelic healing and integration practices.",
            "id": "SOCWORK 838",
            "parent": "SOCWORK",
            "title": "PRINCIPLES OF PSYCHEDELIC HEALING"
        }
    },
    {
        "data": {
            "description": "Foundational preparation for social work practice in a multicultural society. Examines the experiences of diverse populations with interpersonal and institutional oppression and implications are drawn for social policy.",
            "id": "SOCWORK 710",
            "parent": "SOCWORK",
            "title": "DIVERSITY, OPPRESSION AND SOCIAL JUSTICE IN SOCIAL WORK"
        }
    },
    {
        "data": {
            "description": "Furthers the socialization of students to the Ph.D. program. Provides opportunities for faculty to discuss research interests and doctoral education.",
            "id": "SOCWORK 946",
            "parent": "SOCWORK",
            "title": "FACULTY RESEARCH SEMINAR"
        }
    },
    {
        "data": {
            "description": "Gain foundational knowledge and skills in interprofessional collaborative practice and HIV care. Explore the roles of medicine, nursing, pharmacy, and social work in the HIV care continuum. Discuss quality team-based care as a member of an interprofessional student team.",
            "id": "MEDICINE/NURSING/PHMPRAC/SOCWORK 467",
            "title": "INTERPROFESSIONAL COLLABORATIVE PRACTICE IN HIV CARE"
        }
    },
    {
        "data": {
            "description": "Historical development, formation of social welfare policies, and the role of the social work professional.",
            "id": "SOCWORK 205",
            "parent": "SOCWORK",
            "title": "INTRODUCTION TO THE FIELD OF SOCIAL WORK"
        }
    },
    {
        "data": {
            "description": "Implications of knowledge from the social and behavioral sciences and public welfare policy on child welfare problems and services.",
            "id": "SOCWORK 921",
            "parent": "SOCWORK",
            "title": "CHILD WELFARE"
        }
    },
    {
        "data": {
            "description": "Independent study for MSW graduate students.",
            "id": "SOCWORK 799",
            "parent": "SOCWORK",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Independent study for undergraduates under the direction of a Social Work instructor. Only juniors and seniors will be given permission to enroll.",
            "id": "SOCWORK 699",
            "parent": "SOCWORK",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Intensive study of selected topics in the field of social work.",
            "id": "SOCWORK 579",
            "parent": "SOCWORK",
            "title": "SPECIAL TOPICS IN SOCIAL WORK"
        }
    },
    {
        "data": {
            "description": "Interdisciplinary team care of children with special health care needs across the trajectory of illness presented within the context of family, culture, social determinants of health, community, and healthcare policy.   Students introduced to interdisciplinary, collaborative, family-centered team care.",
            "id": "NURSING/PHMPRAC/SOCWORK 746",
            "title": "INTERDISCIPLINARY CARE OF CHILDREN WITH SPECIAL HEALTH CARE NEEDS"
        }
    },
    {
        "data": {
            "description": "Introduction to health care systems. Factors affecting health and the value placed on health, the delivery of health care in different settings, the roles of various health workers, and the sociological and economic aspects of health care.",
            "id": "NURSING/S&APHM/SOCWORK 105",
            "title": "HEALTH CARE SYSTEMS: INTERDISCIPLINARY APPROACH"
        }
    },
    {
        "data": {
            "description": "Introduction to the complex issues surrounding homelessness in America including epidemiology, demographics, history and public beliefs and attitudes. It explores structural conditions and personal attributes posited as causes of contemporary homelessness. Varying social policies and service needs of homeless persons are discussed.",
            "id": "SOCWORK 578",
            "parent": "SOCWORK",
            "title": "HOMELESSNESS: A SERVICE LEARNING COURSE"
        }
    },
    {
        "data": {
            "description": "Introduction to the field of American sociology, its subfields and specialized areas of research, theoretical traditions and research methods.",
            "id": "C&ESOC/SOC 210",
            "title": "SURVEY OF SOCIOLOGY"
        }
    },
    {
        "data": {
            "description": "Learn patterns, principles and methods of supervision and consultation.",
            "id": "SOCWORK 842",
            "parent": "SOCWORK",
            "title": "SUPERVISION AND LEADERSHIP IN SOCIAL WORK AND HUMAN SERVICES ORGANIZATIONS"
        }
    },
    {
        "data": {
            "description": "Learn to work with individuals impacted by substance misuse. The history, current understanding, assessment, and treatment of problematic substance use will be described.",
            "id": "SOCWORK 929",
            "parent": "SOCWORK",
            "title": "SOCIAL WORK AND SUBSTANCE MISUSE"
        }
    },
    {
        "data": {
            "description": "Marriage and less formal spousal relationships, husband-wife relationships in on-going marriage; divorce and its economic and custody consequences; post-divorce relationships.",
            "id": "LAW/SOCWORK 822",
            "title": "FAMILY LAW: MARRIAGE AND DIVORCE"
        }
    },
    {
        "data": {
            "description": "Meaning of crisis to client systems and social work practitioners; principles guiding rational decision to intervene at the point of \"critical incident\".",
            "id": "SOCWORK 854",
            "parent": "SOCWORK",
            "title": "CRISIS INTERVENTION"
        }
    },
    {
        "data": {
            "description": "Nature and dimensions of poverty in the U.S. Individual and social consequences of poverty. Historic and contemporary approaches. Poverty and social welfare policy and programs.",
            "id": "SOCWORK 420",
            "parent": "SOCWORK",
            "title": "POVERTY AND SOCIAL WELFARE"
        }
    },
    {
        "data": {
            "description": "Nature, purpose, function, and organizational content of the profession. Historical development; a consideration of the development of the social welfare institutions, formation of social welfare policies and their impact on practice, and the role of the social work professional.",
            "id": "SOCWORK 708",
            "parent": "SOCWORK",
            "title": "THE FIELD OF SOCIAL WORK"
        }
    },
    {
        "data": {
            "description": "Origins, nature, scope and dynamics of the social problems of older adults and their families in the U.S. and to acquaint students with programs and services available to older adults.",
            "id": "SOC/SOCWORK 422",
            "title": "SOCIAL ISSUES IN AGING"
        }
    },
    {
        "data": {
            "description": "Physiological, psychological, and social changes throughout the life cycle. Major crisis and developmental tasks at each point in terms of their implications for social work practice.",
            "id": "SOCWORK 457",
            "parent": "SOCWORK",
            "title": "HUMAN BEHAVIOR AND THE ENVIRONMENT"
        }
    },
    {
        "data": {
            "description": "Practice and coursework in educational settings to conceptualize social work skills in schools and to integrate knowledge of social work theory and practice.",
            "id": "SOCWORK 815",
            "parent": "SOCWORK",
            "title": "SOCIAL WORK PRACTICE IN SCHOOLS I"
        }
    },
    {
        "data": {
            "description": "Practicum and supervision in school settings.",
            "id": "SOCWORK 816",
            "parent": "SOCWORK",
            "title": "SOCIAL WORK PRACTICUM IN SCHOOLS I"
        }
    },
    {
        "data": {
            "description": "Practicum and supervision in school settings.",
            "id": "SOCWORK 818",
            "parent": "SOCWORK",
            "title": "SOCIAL WORK PRACTICUM IN SCHOOLS II"
        }
    },
    {
        "data": {
            "description": "Preparation for leadership roles in mental health programs, agencies, and organizations. Examine mental health policies and services that influence care and treatment of persons with mental illness and shape mental health care systems, programs and services",
            "id": "SOCWORK 836",
            "parent": "SOCWORK",
            "title": "MENTAL HEALTH POLICIES AND SERVICES"
        }
    },
    {
        "data": {
            "description": "Prepares front line social workers to address mental health needs of older adults and their family members. Examines common mental health conditions, assessment, planning, evidence-based individual, family and group interventions, resources, cultural competence, ethical issues, and contexts for practice.",
            "id": "SOCWORK 821",
            "parent": "SOCWORK",
            "title": "SOCIAL WORK PRACTICE IN AGING AND MENTAL HEALTH"
        }
    },
    {
        "data": {
            "description": "Presentation of social, historical, legal, political, and ethical considerations surrounding the use and abuse of alcohol and psychotropic drugs in the U.S.",
            "id": "SOCWORK 453",
            "parent": "SOCWORK",
            "title": "SUBSTANCE USE DISORDERS"
        }
    },
    {
        "data": {
            "description": "Program of study devised by a student in collaboration with a faculty member.",
            "id": "SOCWORK 299",
            "parent": "SOCWORK",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Provides a forum to discuss experiences, success strategies and research interests; receive feedback on research and later, on colloquia they prepare for job searches.",
            "id": "SOCWORK 947",
            "parent": "SOCWORK",
            "title": "STUDENT RESEARCH SEMINAR"
        }
    },
    {
        "data": {
            "description": "Provides an awareness of problems and concepts of the policy process in the U.S. Explores the political, economic, and institutional frameworks which structure public social welfare choices.",
            "id": "SOCWORK 206",
            "parent": "SOCWORK",
            "title": "INTRODUCTION TO SOCIAL POLICY"
        }
    },
    {
        "data": {
            "description": "Provides knowledge about the contemporary organization of health care, as well as policies and services for older adults and people with disabilities.",
            "id": "SOCWORK 875",
            "parent": "SOCWORK",
            "title": "HEALTH, AGING, AND DISABILITY POLICY AND SERVICES"
        }
    },
    {
        "data": {
            "description": "Qualitative research methods seminars for research in the social and behavioral sciences.",
            "id": "SOCWORK 949",
            "parent": "SOCWORK",
            "title": "PROSEMINAR"
        }
    },
    {
        "data": {
            "description": "Quantitative research methods seminars for research in the social and behavioral sciences.",
            "id": "SOCWORK 948",
            "parent": "SOCWORK",
            "title": "PROSEMINAR"
        }
    },
    {
        "data": {
            "description": "Research methods and statistics used in analyzing planning problems: conceptualization, design, and implementation of planning research; statistical methods for analyzing data including review of inferential statistics, analysis of variance, correlation, and multiple regression; use of computer; review of sources of planning data.",
            "id": "SOCWORK/URBRPL 721",
            "title": "METHODS OF PLANNING ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Review of family theory and its relevance for social work practice; an analysis of family subsystems in the U.S.; current research on the American family.",
            "id": "SOCWORK 924",
            "parent": "SOCWORK",
            "title": "FAMILY PROBLEMS AND SOCIAL WORK"
        }
    },
    {
        "data": {
            "description": "Second of two semesters of undergraduate research for students in the honors program including completion of a thesis.",
            "id": "SOCWORK 682",
            "parent": "SOCWORK",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Second of two semesters of undergraduate research including completion of a thesis.",
            "id": "SOCWORK 692",
            "parent": "SOCWORK",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Social policy seminars. Contemporary social welfare policy concerns are addressed utilizing a policy analytics framework. Poverty and Income Support Policy; Family Theory Policy; Child Development and Policy; and Social Determinants of Health and Policy are examples of topics offered.",
            "id": "SOCWORK 950",
            "parent": "SOCWORK",
            "title": "PHD PROSEMINAR"
        }
    },
    {
        "data": {
            "description": "Social research and problems of project design and programming. Distinctive characteristics of investigations directed to planning, administrative, and scientific objectives.",
            "id": "SOCWORK 650",
            "parent": "SOCWORK",
            "title": "METHODS OF SOCIAL WORK RESEARCH"
        }
    },
    {
        "data": {
            "description": "Supportive, supplementary, and substitute child welfare services employed in dealing with the problems of dependent, neglected, delinquent children. Scope, method, problems, trends of the services; child welfare in other countries; sociology of the child welfare worker.",
            "id": "SOCWORK 462",
            "parent": "SOCWORK",
            "title": "CHILD WELFARE"
        }
    },
    {
        "data": {
            "description": "The focus on Social Work political advocacy strategies in public policy and government settings. To best prepare social workers seeking to impact public policy and social change and improve the social and economic status of individuals, families, communities and systems, examine the knowledge and political skills, strategies, techniques and actions which influence elected officials and policy makers and the policies, practices, programs, services and resources they establish for people in need through local, state and federal units of government.",
            "id": "SOCWORK 852",
            "parent": "SOCWORK",
            "title": "INFLUENCING POLITICAL SYSTEMS FOR SOCIAL CHANGE"
        }
    },
    {
        "data": {
            "description": "The literature on human behavior and the environment is reviewed from a bio-psychosocial perspective. Special attention is given to understanding individual and family behavior and development as a function of reciprocal interactions with groups, communities, organizations, and society.",
            "id": "SOCWORK 711",
            "parent": "SOCWORK",
            "title": "HUMAN BEHAVIOR AND THE ENVIRONMENT"
        }
    },
    {
        "data": {
            "description": "The role of social workers and social services in American Indian and tribal communities, particularly compliance with the Indian Child Welfare Act. Historical context includes land removal and loss, the boarding school and adoption eras, and social determinants of health including the impacts of historical and intergenerational trauma.",
            "id": "AMERIND/SOCWORK 636",
            "title": "SOCIAL WORK IN AMERICAN INDIAN COMMUNITIES: THE INDIAN CHILD WELFARE ACT"
        }
    },
    {
        "data": {
            "description": "Theoretical, empirical and practical foundation for prevention science as it relates to the prevention of human social problems. Research and evaluation methods, program design strategies, best practices and policy as they relate to the field of prevention are also examined.",
            "id": "EDPSYCH/HDFS/NURSING/SOCWORK 880",
            "title": "PREVENTION SCIENCE"
        }
    },
    {
        "data": {
            "description": "Topics vary and focus on advanced practice.",
            "id": "SOCWORK 861",
            "parent": "SOCWORK",
            "title": "RECENT DEVELOPMENTS IN SOCIAL WORK"
        }
    },
    {
        "data": {
            "description": "Topics vary and focus on social problems/social issues.",
            "id": "SOCWORK 863",
            "parent": "SOCWORK",
            "title": "RECENT DEVELOPMENTS IN SOCIAL WORK"
        }
    },
    {
        "data": {
            "description": "Topics will vary and designed to meet MSW Program requisites.",
            "id": "SOCWORK 673",
            "parent": "SOCWORK",
            "title": "TOPICS IN CONTEMPORARY SOCIAL WELFARE"
        }
    },
    {
        "data": {
            "description": "Topics will vary, reflecting current issues and trends in social justice, social welfare, and social work.",
            "id": "SOCWORK 375",
            "parent": "SOCWORK",
            "title": "CONTEMPORARY ISSUES IN SOCIAL WELFARE"
        }
    },
    {
        "data": {
            "description": "Topics will vary, reflecting current issues and trends in social justice, social welfare, and social work.",
            "id": "SOCWORK 675",
            "parent": "SOCWORK",
            "title": "TOPICS IN CONTEMPORARY SOCIAL WELFARE"
        }
    },
    {
        "data": {
            "description": "Topics will vary, reflecting emerging issues and trends in social work for social welfare, generalist and advanced practice students.",
            "id": "SOCWORK 674",
            "parent": "SOCWORK",
            "title": "TOPICS IN CONTEMPORARY SOCIAL WELFARE"
        }
    },
    {
        "data": {
            "description": "Topics will vary, reflecting issues and trends in social policy and social work.",
            "id": "SOCWORK 662",
            "parent": "SOCWORK",
            "title": "TOPICS IN CONTEMPORARY SOCIAL WELFARE"
        }
    },
    {
        "data": {
            "description": "Topics will vary, reflecting issues and trends in social work for non-social workers.",
            "id": "SOCWORK 672",
            "parent": "SOCWORK",
            "title": "TOPICS IN CONTEMPORARY SOCIAL WELFARE"
        }
    },
    {
        "data": {
            "description": "Topics will vary, reflecting new issues and trends in fields of practice such as child welfare, health, or mental health.",
            "id": "SOCWORK 664",
            "parent": "SOCWORK",
            "title": "TOPICS IN CONTEMPORARY SOCIAL WELFARE"
        }
    },
    {
        "data": {
            "description": "Topics will vary, reflecting new issues and trends in social justice, social welfare, or social work.",
            "id": "SOCWORK 275",
            "parent": "SOCWORK",
            "title": "CONTEMPORARY ISSUES IN SOCIAL WELFARE"
        }
    },
    {
        "data": {
            "description": "Topics will vary, reflecting social issues/social problems relevant to social welfare and social work.",
            "id": "SOCWORK 663",
            "parent": "SOCWORK",
            "title": "TOPICS IN CONTEMPORARY SOCIAL WELFARE"
        }
    },
    {
        "data": {
            "description": "Topics will vary, reflecting trends in policy and practice for social welfare, generalist, and advanced students.",
            "id": "SOCWORK 679",
            "parent": "SOCWORK",
            "title": "TOPICS IN CONTEMPORARY SOCIAL WELFARE"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "SOC",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "SOCWORK",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 210",
            "target": "C&ESOC/SOC 211"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 210",
            "target": "SOC 181"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 210",
            "target": "SOC/SOCWORK 422"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 211",
            "target": "C&ESOC/SOC 210"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 211",
            "target": "SOC 181"
        }
    },
    {
        "data": {
            "source": "SOC 181",
            "target": "SOC/SOCWORK 422"
        }
    },
    {
        "data": {
            "source": "SOCWORK 205",
            "target": "SOC/SOCWORK 422"
        }
    },
    {
        "data": {
            "source": "SOCWORK 205",
            "target": "SOCWORK 454"
        }
    },
    {
        "data": {
            "source": "SOCWORK 205",
            "target": "SOCWORK 639"
        }
    },
    {
        "data": {
            "source": "SOCWORK 205",
            "target": "SOCWORK 644"
        }
    },
    {
        "data": {
            "source": "SOCWORK 206",
            "target": "SOCWORK 420"
        }
    },
    {
        "data": {
            "source": "SOCWORK 400",
            "target": "SOCWORK 401"
        }
    },
    {
        "data": {
            "source": "SOCWORK 441",
            "target": "SOCWORK 874"
        }
    },
    {
        "data": {
            "source": "SOCWORK 442",
            "target": "SOCWORK 840"
        }
    },
    {
        "data": {
            "source": "SOCWORK 442",
            "target": "SOCWORK 874"
        }
    },
    {
        "data": {
            "source": "SOCWORK 612",
            "target": "SOCWORK 712"
        }
    },
    {
        "data": {
            "source": "SOCWORK 612",
            "target": "SOCWORK 870"
        }
    },
    {
        "data": {
            "source": "SOCWORK 708",
            "target": "SOCWORK 639"
        }
    },
    {
        "data": {
            "source": "SOCWORK 708",
            "target": "SOCWORK 644"
        }
    },
    {
        "data": {
            "source": "SOCWORK 709",
            "target": "SOCWORK 836"
        }
    },
    {
        "data": {
            "source": "SOCWORK 800",
            "target": "SOCWORK 801"
        }
    },
    {
        "data": {
            "source": "SOCWORK 801",
            "target": "SOCWORK 817"
        }
    },
    {
        "data": {
            "source": "SOCWORK 815",
            "target": "SOCWORK 816"
        }
    },
    {
        "data": {
            "source": "SOCWORK 816",
            "target": "SOCWORK 818"
        }
    },
    {
        "data": {
            "source": "SOCWORK 817",
            "target": "SOCWORK 818"
        }
    }
]