[
    {
        "data": {
            "description": "A preparation and introductory math course for students enrolled in the Summer Collegiate Experience program. Includes material from precalculus and calculus and related topics depending on students' results on the math placement exam.",
            "id": "MATH 118",
            "parent": "MATH",
            "title": "SUMMER COLLEGIATE EXPERIENCE MATHEMATICS COURSE"
        }
    },
    {
        "data": {
            "description": "Covers the graphs, properties and geometric significance of trigonometric functions of a real variable. Other topics include trigonometric equations and identities, application, trigonometric form of complex numbers, DeMoivre's theorem, and polar and parametric equations. The course also has a significant number of applications, especially related to other disciplines.",
            "id": "MATH 113",
            "parent": "MATH",
            "title": "TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "Environmental pollution on global, regional, and local scales is one of humanity's most pressing issues, and will remain so for the foreseeable future. Examine the sources and properties of anthropogenic soil pollution including emerging contaminants such as PFAS, nanomaterials, and microplastics. Understand the contaminant mobility in the environment and in turn, how these contaminants affect human and ecosystem health. Apply epidemiological, toxicological, and risk assessment methods to assess soil contamination impacts on local populations. Through case studies from around the world explore issues of soil contamination and interventions to mitigate health impacts.",
            "id": "SOILSCI 430",
            "parent": "SOILSCI",
            "title": "SOIL POLLUTION AND HUMAN HEALTH"
        }
    },
    {
        "data": {
            "description": "Introduction to how the Earth system works and what makes Earth livable. Gain appreciation for how the atmosphere, oceans, life, and earth's surface interact to shape our local, regional and global landscapes.",
            "id": "ENVIRST/GEOG 120",
            "title": "INTRODUCTION TO THE EARTH SYSTEM"
        }
    },
    {
        "data": {
            "description": "Water is central to the functioning of planet Earth. As humans increase their impact on Earth's systems and cohabitants, our understanding of the multiple roles of water becomes critical to finding sustainable strategies for human and ecosystem health. Explores the science of Earth's hydrosphere, with constant attention to human uses and impacts.",
            "id": "ATMOCN/SOILSCI 132",
            "title": "EARTH'S WATER: NATURAL SCIENCE AND HUMAN USE"
        }
    },
    {
        "data": {
            "description": "A capstone applying independent and team problem solving, critical thinking and oral and written communication skills to issues in soil and environmental sciences.",
            "id": "SOILSCI 499",
            "parent": "SOILSCI",
            "title": "SOIL MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "A overview of the soils of the world and the grand environmental challenges that face humanity. Soils of the USA and Wisconsin included.",
            "id": "SOILSCI 131",
            "parent": "SOILSCI",
            "title": "EARTH'S SOIL: NATURAL SCIENCE AND HUMAN USE"
        }
    },
    {
        "data": {
            "description": "A quantitative treatment of macroscopic phenomena including thermodynamics, chemical equilibria, solution behavior, electrochemistry, and chemical kinetics.",
            "id": "CHEM 116",
            "parent": "CHEM",
            "title": "CHEMICAL PRINCIPLES II"
        }
    },
    {
        "data": {
            "description": "Accelerated coverage of topics in general chemistry, including introduction to laboratory techniques. Topics include atomic and molecular structure, chemical equilibrium, acid-base chemistry, thermodynamics, kinetics, and electrochemistry.",
            "id": "CHEM 109",
            "parent": "CHEM",
            "title": "ADVANCED GENERAL CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "An in-depth look at plant growth, development, respiration, photosynthesis, mineral nutrition, and water relations. Experimental approaches will be used to demonstrate principles described.",
            "id": "BOTANY 500",
            "parent": "BOTANY",
            "title": "PLANT PHYSIOLOGY"
        }
    },
    {
        "data": {
            "description": "An internship under guidance of a Soil Science faculty or instructional academic staff member and internship site supervisor. Students are responsible for arranging the work and credits with the Soil Science faculty or instructional academic staff member and the internship site supervisor.",
            "id": "SOILSCI 399",
            "parent": "SOILSCI",
            "title": "COORDINATIVE INTERNSHIP/COOPERATIVE EDUCATION"
        }
    },
    {
        "data": {
            "description": "An introduction to natural environmental systems, emphasizing the interconnections between the systems of the solid earth (minerals, rocks, soils), the hydrosphere (water in all its forms), the biosphere, and the atmosphere. Emphasizes connections between basic concepts and specific environmental issues through hands-on case studies, lab projects, and field trips to collect samples and observations for lab projects.",
            "id": "ENVIRST/GEOG 127",
            "title": "PHYSICAL SYSTEMS OF THE ENVIRONMENT"
        }
    },
    {
        "data": {
            "description": "Basic biology of microorganisms, including structure, function, physiology, genetics, ecology, diversity, and evolution.",
            "id": "MICROBIO 303",
            "parent": "MICROBIO",
            "title": "BIOLOGY OF MICROORGANISMS"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for engineering students. Electricity, magnetism, light, and sound.",
            "id": "PHYSICS 202",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for engineering students. Mechanics: kinematics, statics, dynamics; energy and momentum.",
            "id": "PHYSICS 201",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Calculus-based introduction to physics intended for students majoring in biological sciences. Mechanics: kinematics, statics, dynamics; energy and momentum. Heat and sound.",
            "id": "PHYSICS 207",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Characterization of a soil in the field. Monitoring water flow, heat exchange, solute transport and greenhouse gas emission using soil physical models and state-of-the-art soil sensing technologies.",
            "id": "SOILSCI 327",
            "parent": "SOILSCI",
            "title": "ENVIRONMENTAL MONITORING AND SOIL CHARACTERIZATION FOR EARTH'S CRITICAL ZONE"
        }
    },
    {
        "data": {
            "description": "Conforms to the guidelines covered under the Occupational Safety and Health Administration (OSHA) standard 29 CFR part 1910.120 for providing Hazardous Wasted Operations and Emergency Response (HAZWOPER) 40-hour certification, required for workers involved in clean-up operations, voluntary clean-up operations, emergency response operations, and the storage, disposal, or treatment of hazardous substances or uncontrolled hazardous waste sites. Beyond satisfying OSHA standards, provides safety training for personnel conducting field sampling operations in proximity of heavy equipment (e.g. excavators, drilling rigs, dump trucks) through guest lectures and videos. Additionally, case studies relating to field safety operations will be examined.",
            "id": "SOILSCI 330",
            "parent": "SOILSCI",
            "title": "HAZARDOUS WASTE OPERATIONS AND EMERGENCY RESPONSE (HAZWOPER) AND FIELD SAFETY TRAINING"
        }
    },
    {
        "data": {
            "description": "Continuation of 681.",
            "id": "SOILSCI 682",
            "parent": "SOILSCI",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Continuation ofPHYSICS 103. Principles of electricity and magnetism, light, optics, and modern physics, with applications to a number of different fields. Not recommended for students in the physical sciences and engineering.",
            "id": "PHYSICS 104",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Continuation ofPHYSICS 207: calculus-based introduction to physics intended for students majoring in biological sciences. Electricity, magnetism, light, and modern physics.",
            "id": "PHYSICS 208",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Core organic chemistry concepts of structure, reactivity, and synthesis with regards to the functional groups commonly found in commercial and biological substances. Covers a selection of topics fromCHEM 343and345.",
            "id": "CHEM 341",
            "parent": "CHEM",
            "title": "ELEMENTARY ORGANIC CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Covers how to develop a publishable systematic review for dissertations and professional work. Understand the distinguishing features of systematic review typologies and apply this understanding to selecting and conducting systematic reviews applicable to a variety of research questions in agricultural sciences.",
            "id": "SOILSCI 710",
            "parent": "SOILSCI",
            "title": "SYSTEMATIC REVIEWS IN AGRICULTURE AND THE ENVIRONMENT"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Current topics in molecular and environmental toxicology and problems related to biologically active substances in the environment. Topics vary each semester. Lectures are by resident and visiting professors and other researchers.",
            "id": "ENTOM/F&WECOL/PLPATH/SOILSCI 606",
            "title": "COLLOQUIUM IN ENVIRONMENTAL TOXICOLOGY"
        }
    },
    {
        "data": {
            "description": "Data science techniques are increasingly important in soil and environmental science, improving the efficiency and repeatability of data analysis and enhancing fundamental understanding of soil and environmental issues. Various R packages will be introduced and used to analyze and process soil and environmental data collected using a variety of in situ, ground-based, and remote sensing platforms. R software will be applied to detailed case studies covering soil and environmental data processing, manipulation, and modeling.",
            "id": "SOILSCI 585",
            "parent": "SOILSCI",
            "title": "USING R FOR SOIL AND ENVIRONMENTAL SCIENCES"
        }
    },
    {
        "data": {
            "description": "Design, implementation and use of automated procedures for storage, analysis and display of spatial information. Covers data bases, information manipulation and display techniques, software systems and management issues. Case studies.",
            "id": "CIVENGR/ENVIRST/GEOG 377",
            "title": "AN INTRODUCTION TO GEOGRAPHIC INFORMATION SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Discuss how Planet Earth is an interconnected system dominated by the ever-present exchange of materials and energy that control the fitness and fate of all living organisms. Designed to introduce the interdisciplinary field of Environmental Science by providing a broad overview of the basic concepts used to make sense of the environment. Explore how natural systems work, the services they provide, important environmental challenges facing these systems, and how people are working to address them. Includes professionals in the field as guest speakers to discuss a future in Environmental Sciences.",
            "id": "SOILSCI 250",
            "parent": "SOILSCI",
            "title": "INTRODUCTION TO ENVIRONMENTAL SCIENCE"
        }
    },
    {
        "data": {
            "description": "Essential and beneficial elements, solutions and soil as nutrient sources, rhizosphere chemistry, nutritional physiology, ion uptake and translocation, functions of elements, nutrient interactions, genetics of plant nutrition.",
            "id": "BOTANY/HORT/SOILSCI 626",
            "title": "MINERAL NUTRITION OF PLANTS"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "Examines issues related to global agriculture and healthy sustainable development. Using a regional approach and focusing on crops and livestock case studies, students will learn the interdependence between US agriculture and agriculture in emerging economies. Some topics covered include population and food, immigration, the environment; crop and livestock agriculture; global trade; sustainability; and the role of women in agriculture and the role of dairy products in a healthy diet.",
            "id": "ANSCI/DYSCI/FOODSCI/SOILSCI 473",
            "title": "INTERNATIONAL FIELD STUDY IN ANIMAL AGRICULTURE AND SUSTAINABLE DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Examines issues related to global agriculture and healthy sustainable development. Using a regional approach and focusing on crops and livestock case studies, students will learn the interdependence between US agriculture and agriculture in emerging economies. Some topics covered include population and food, immigration, the environment; crop and livestock agriculture; global trade; sustainability; food security, the role of women in agriculture, and the role of dairy products in a healthy diet.",
            "id": "ANSCI/DYSCI/FOODSCI/SOILSCI 472",
            "title": "ANIMAL AGRICULTURE AND GLOBAL SUSTAINABLE DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Explores a detailed atomic and molecular view of matter and its interactions, with a specific focus on quantum theory, molecular structure, and chemical bonding. Application required for enrollment.",
            "id": "CHEM 115",
            "parent": "CHEM",
            "title": "CHEMICAL PRINCIPLES I"
        }
    },
    {
        "data": {
            "description": "Explores long and short-term cycles of carbon, nitrogen, phosphorus, sulfur, and metals as well as water and energy cycles between water, the atmosphere, terrestrial vegetation, and soils. Emphasizes the linkage between terrestrial vegetation and soils across global biomes for managed and unmanaged ecosystems. Investigates biogeochemical processes through their biochemical constituents, conceptual models and exploration of isotopic and chemical data. Provides a practical understanding of the interactions between components and fluxes of terrestrial ecosystems and how data is developed and employed.",
            "id": "F&WECOL/SOILSCI 451",
            "title": "ENVIRONMENTAL BIOGEOCHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Functions, requirements and uptake of essential plant nutrients; chemical and microbial processes affecting nutrient availability; diagnosis of plant and soil nutrient status; fertilizers and efficient fertilizer use in different tillage systems.",
            "id": "AGRONOMY/HORT/SOILSCI 326",
            "title": "PLANT NUTRITION MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "General biological principles. Topics include: evolution, ecology, animal behavior, cell structure and function, genetics and molecular genetics and the physiology of a variety of organ systems emphasizing function in humans.",
            "id": "BIOLOGY/ZOOLOGY 101",
            "title": "ANIMAL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Hands-on laboratory on soil analysis and interpretation of soil properties for different uses, such as food production, waste management, water quality, stormwater control, and environmental sustainability.",
            "id": "SOILSCI 302",
            "parent": "SOILSCI",
            "title": "MEET YOUR SOIL: SOIL ANALYSIS AND INTERPRETATION LABORATORY"
        }
    },
    {
        "data": {
            "description": "Independent research and writing to complete dissertation requirements.",
            "id": "SOILSCI 990",
            "parent": "SOILSCI",
            "title": "RESEARCH"
        }
    },
    {
        "data": {
            "description": "Individual study for majors completing theses for Soil Science Honors degrees as arranged with a faculty member. Requires consent of supervising instructor. Enrolled in CALS Honors Program.",
            "id": "SOILSCI 681",
            "parent": "SOILSCI",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Individual study for majors completing theses for Soil Science degrees as arranged with a faculty member. Requires consent of supervising instructor.",
            "id": "SOILSCI 699",
            "parent": "SOILSCI",
            "title": "SPECIAL PROBLEMS"
        }
    },
    {
        "data": {
            "description": "Instructional orientation to teaching at the higher education level in the agricultural and life sciences, direct teaching experience under faculty supervision, experience in testing and evaluation of students, and the analysis of teaching performance.",
            "id": "SOILSCI 799",
            "parent": "SOILSCI",
            "title": "PRACTICUM IN SOIL SCIENCE TEACHING"
        }
    },
    {
        "data": {
            "description": "Interaction of soils with environmental contaminants and the role of soils in pollution control.",
            "id": "ENVIRST/SOILSCI 324",
            "title": "SOILS AND ENVIRONMENTAL QUALITY"
        }
    },
    {
        "data": {
            "description": "Introduce standard operating procedures and guidance for intrusive and non-intrusive sampling techniques for assessing soil, sediment, surface water, and ground water. Prepare boring logs and install groundwater monitoring well.  Properly prepare samples for preservation and shipment. Prepare and maintain defensible field documentation. Use quality control sampling, data verification and validation, and data quality assessment. Decontaminate drilling and field sampling equipment and manage investigative-derived waste.",
            "id": "SOILSCI 630",
            "parent": "SOILSCI",
            "title": "FIELD METHODS FOR ENVIRONMENTAL CHARACTERIZATION, ANALYSIS, AND MONITORING"
        }
    },
    {
        "data": {
            "description": "Introduces reproducible data management, modeling, analysis, and statistical inference through a practical, hands-on case studies approach. Topics include the use of an integrated statistical computing environment, data wrangling, the R programming language, data graphics and visualization, random variables and concepts of probability including the binomial and normal distributions, data modeling, statistical inference in one- and two- sample settings for proportions and means, simple linear regression, and report generation using R Markdown with applications to a wide variety of data to address open-ended questions.",
            "id": "STAT 240",
            "parent": "STAT",
            "title": "DATA SCIENCE MODELING I"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Introduction to physics at the non-calculus level. Principles of mechanics, heat, and waves, with applications to a number of different fields. Not recommended for students in the physical sciences and engineering.",
            "id": "PHYSICS 103",
            "parent": "PHYSICS",
            "title": "GENERAL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Introduction to the Earth as viewed from above, focusing on use of aerial photography and satellite imagery to study the environment. Includes physical processes of electromagnetic radiation, data types and sensing capabilities, methods for interpretation, analysis and mapping, and applications.",
            "id": "ENVIRST/F&WECOL/GEOG/GEOSCI/GLE/LANDARC 371",
            "title": "INTRODUCTION TO ENVIRONMENTAL REMOTE SENSING"
        }
    },
    {
        "data": {
            "description": "Introduction to the basic principles and concepts of the biology of plants. an integrative approach stressing evolutionary sequences and the relationship between structure and function at succeeding levels of organization: molecule, cell, organism, population, community. Correlated lectures, laboratories, and discussions.",
            "id": "BIOLOGY/BOTANY 130",
            "title": "GENERAL BOTANY"
        }
    },
    {
        "data": {
            "description": "Lectures and discussions about environmental issues. Historical and contemporary environmental impacts of humans on the biosphere. Global futures: population, technology, societal values, resources and prospects for sustainable management.",
            "id": "ENVIRST/SOILSCI 101",
            "title": "FORUM ON THE ENVIRONMENT"
        }
    },
    {
        "data": {
            "description": "Microbial interactions in soils, water, extreme environments and biofilms. Modern methods for studying microbial ecology. role of microbes in nutrient cycles and biogeochemistry. Use of microbes for mitigating manmade environmental problems of industrial, agricultural, and domestic origin.",
            "id": "MICROBIO/SOILSCI 425",
            "title": "ENVIRONMENTAL MICROBIOLOGY"
        }
    },
    {
        "data": {
            "description": "Modern GIS desktop and web-based workflows, analyses, and visualizations related to natural resource and environmental planning issues and communication. Guest lectures from agency and industry professionals.",
            "id": "ENVIRST/LANDARC/SOILSCI 695",
            "title": "APPLICATIONS OF GEOGRAPHIC INFORMATION SYSTEMS IN NATURAL RESOURCES"
        }
    },
    {
        "data": {
            "description": "Nature, activities and role of organisms inhabiting soil. Effects of soil biota on ecosystem function, response to cultural practices, and impacts on environmental quality, including bioremediation of contaminated soils.",
            "id": "PLPATH/SOILSCI 323",
            "title": "SOIL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Nature, sources, distribution, and fate of contaminants in air, water, soil, and food and potential for harmful exposure.",
            "id": "CIVENGR/M&ENVTOX/SOILSCI 631",
            "title": "TOXICANTS IN THE ENVIRONMENT: SOURCES, DISTRIBUTION, FATE, & EFFECTS"
        }
    },
    {
        "data": {
            "description": "Nutrient requirements of turfgrasses; nature of turfgrass response to fertilization; soil and tissue testing methodology and interpretation; irrigation scheduling; irrigation water quality; use of irrigation and fertilizer to minimize environmental impact; writing effective nutrient management plans.",
            "id": "HORT/SOILSCI 332",
            "title": "TURFGRASS NUTRIENT AND WATER MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "On-site treatment and dispersal of waste water from homes, commercial sources and small communities. Sources, pretreatment units, nutrient removal units, constructed wetlands, surface and soil dispersal systems, recycle and reuse systems, regulations, alternative collection systems.",
            "id": "BSE/CIVENGR/SOILSCI 372",
            "title": "ON-SITE WASTE WATER TREATMENT AND DISPERSAL"
        }
    },
    {
        "data": {
            "description": "Overview of methods for collecting and analyzing information about environmental impacts on agricultural and natural resources, including monitoring the physical environment and relating impacts to people and society.",
            "id": "ENVIRST/SOILSCI 575",
            "title": "ASSESSMENT OF ENVIRONMENTAL IMPACT"
        }
    },
    {
        "data": {
            "description": "Physical chemical and biological properties of soils as they affect soil-plant-water relations, soil classification and suitability for agricultural and other uses.",
            "id": "SOILSCI 301",
            "parent": "SOILSCI",
            "title": "GENERAL SOIL SCIENCE"
        }
    },
    {
        "data": {
            "description": "Physical properties of soils. Water retention and transmission in soils. Transport of heat, gas, and solutes. Physical environment of soil organisms and soil-plant-water relations.",
            "id": "SOILSCI 622",
            "parent": "SOILSCI",
            "title": "SOIL PHYSICS"
        }
    },
    {
        "data": {
            "description": "Plant science applied to the growth, production, management, distribution and utilization of field crops.",
            "id": "AGRONOMY 100",
            "parent": "AGRONOMY",
            "title": "PRINCIPLES AND PRACTICES IN CROP PRODUCTION"
        }
    },
    {
        "data": {
            "description": "Plant-environment interactions with particular reference to energy exchanges and water relations. Models are used to provide a quantitative synthesis of information from plant physiology, soil physics, and micrometeorology with some consideration of plant-pest interactions.",
            "id": "AGRONOMY/ATMOCN/SOILSCI 532",
            "title": "ENVIRONMENTAL BIOPHYSICS"
        }
    },
    {
        "data": {
            "description": "Principles and application of chemical equilibrium, coordination chemistry, oxidation-reduction and electrochemistry, kinetics, nuclear chemistry, introduction to organic chemistry, and chemistry laboratory skills.",
            "id": "CHEM 104",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Principles of molecular structure and bonding applied to predict and explain the reactivity of alkanes, alkenes, alkynes, alkyl halides, alcohols, and thiols. Emphasis placed on rationalizing the stereochemical and regiochemical outcome of chemical processes.",
            "id": "CHEM 343",
            "parent": "CHEM",
            "title": "ORGANIC CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Principles of molecular structure and bonding applied to predict and explain the reactivity of aromatic systems, benzylic and allylic systems, aryl and vinyl halides, and carbonyl-containing compounds (e.g., ketones, carboxylic acids, esters, acid chlorides, amides). Emphasis placed on rationalizing the stereochemical and regiochemical outcome of chemical processes as well as arguing reaction outcomes from spectroscopic evidence.",
            "id": "CHEM 345",
            "parent": "CHEM",
            "title": "ORGANIC CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Provides an area equivalency for courses taken on Madison Study Abroad Programs that do not equate to existing UW courses. Current enrollment in a UW-Madison study abroad program",
            "id": "SOILSCI 400",
            "parent": "SOILSCI",
            "title": "STUDY ABROAD IN SOIL SCIENCE"
        }
    },
    {
        "data": {
            "description": "Research work under direct guidance of a Soil Science faculty or instructional academic staff member. Students are responsible for arranging the work and credits with the supervising instructor. Intended for students in the CALS Honors Program.",
            "id": "SOILSCI 289",
            "parent": "SOILSCI",
            "title": "HONORS INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Research work under direct guidance of a faculty or instructional academic staff member. Students are responsible for arranging the work and credits with the supervising instructor.",
            "id": "SOILSCI 299",
            "parent": "SOILSCI",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Selected topics in inorganic and organic chemistry. Emphasis is on relevance to biological, environmental and social issues.",
            "id": "CHEM 108",
            "parent": "CHEM",
            "title": "CHEMISTRY IN OUR WORLD"
        }
    },
    {
        "data": {
            "description": "Soil development as related to landscape throughout the Quaternary; focusing on the relationship of soils to climate and vegetation, landscape evolution, and time; principles of soil stratigraphy; case histories of soil geomorphic studies; field trips. Students should have completed one course in geomorphology to feel comfortable with the course content.",
            "id": "GEOG/SOILSCI 525",
            "title": "SOIL GEOMORPHOLOGY"
        }
    },
    {
        "data": {
            "description": "Soil represents the largest terrestrial pool of carbon, and our management of soil will play a key role in the future of our planet. Course topics include overviews of basic soil science and climate change science; how climate affects soil formation, soil carbon and soil organic matter; soil carbon dynamics in urban areas, the tropics, and the arctic; how humans influence soil carbon stocks around the globe.",
            "id": "SOILSCI 211",
            "parent": "SOILSCI",
            "title": "SOILS AND CLIMATE CHANGE"
        }
    },
    {
        "data": {
            "description": "Soils are fundamental to ecosystem science. A systems approach is used to investigate how soils look and function. Topics investigated include soil structure, biology, water, fertility, and taxonomy as well as the human impact on the soil environment.",
            "id": "ENVIRST/GEOG/SOILSCI 230",
            "title": "SOIL: ECOSYSTEM AND RESOURCE"
        }
    },
    {
        "data": {
            "description": "Sources, reactions, transport, effects, and fates of chemical species in soils and associated water and air environments. Emphasis on the chemical behavior of elements and compounds and the phenomena affecting natural and anthropogenic materials in soils.",
            "id": "SOILSCI 621",
            "parent": "SOILSCI",
            "title": "SOIL AND ENVIRONMENTAL CHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Special topics on contemporary issues relevant to soil science.",
            "id": "SOILSCI 375",
            "parent": "SOILSCI",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "Special topics on contemporary issues relevant to soil science.",
            "id": "SOILSCI 875",
            "parent": "SOILSCI",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "Stoichiometry and the mole concept, the behavior of gases, liquids and solids, thermochemistry, electronic structure of atoms and chemical bonding, descriptive chemistry of selected elements and compounds, intermolecular forces, and chemistry laboratory skills.",
            "id": "CHEM 103",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Takes an earth systems approach to explore the role of human societies in shaping earth surface processes from local to global scales. We address how alterations to our landscapes and waterways affect biological, physical and chemical interactions among our biosphere, geosphere, hydrosphere and atmosphere. We discuss methods used to distinguish the \"human impact\" from background variability.",
            "id": "GEOG/SOILSCI 526",
            "title": "HUMAN TRANSFORMATIONS OF EARTH SURFACE PROCESSES"
        }
    },
    {
        "data": {
            "description": "The two semester sequenceMATH 112-MATH 113covers similar material asMATH 114, but in a slower pace. Not recommended for students with less than an AB inMATH 96.",
            "id": "MATH 114",
            "parent": "MATH",
            "title": "ALGEBRA AND TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "Topical oral presentations by guest speakers and graduate students on contemporary concerns and issues involving land and soils.",
            "id": "SOILSCI 728",
            "parent": "SOILSCI",
            "title": "GRADUATE SEMINAR"
        }
    },
    {
        "data": {
            "description": "Topical oral presentations by students, faculty, staff, and guest speakers on contemporary concerns and issues designed to increase knowledge and foster understanding of environmental contamination and remediation of soils and groundwater. Includes instruction and practice in public speaking, presentation visuals, resumes, and networking.",
            "id": "SOILSCI 730",
            "parent": "SOILSCI",
            "title": "COLLOQUIUM: ENVIRONMENTAL REMEDIATION AND MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Part of a 2-semester sequence withMATH 217; these two courses together are equivalent toMATH 114and221.",
            "id": "MATH 171",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY I"
        }
    },
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics and selected topics in Animal Physiology.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Topics include: selected topics in plant physiology, a survey of the five major kingdoms of organisms, speciation and evolutionary theory, and ecology at multiple levels of the biological hierarchy.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Transformations of nutrients and contaminants in soils and groundwater by microorganisms: emphasis on enzymatic mechanisms and metabolic pathways. Approaches for analyzing microbial populations and activities including molecular techniques. Applications of microbial activities for bioremediation of contaminated soils and groundwater. Students should have completed one course in either Soil Science or Microbiology to feel comfortable with the course content.",
            "id": "MICROBIO/SOILSCI 523",
            "title": "SOIL MICROBIOLOGY AND BIOCHEMISTRY"
        }
    },
    {
        "data": {
            "description": "Understand factors driving global, continental, regional, and local distribution of grasslands. Discuss how management affects provision of grassland ecosystem goods and services. Compare and contrast plant community and ecosystem dynamics in native prairie and intensively managed pastures.",
            "id": "AGRONOMY/BOTANY/SOILSCI 370",
            "title": "GRASSLAND ECOLOGY"
        }
    },
    {
        "data": {
            "id": "AGRONOMY",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "BOTANY",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MICROBIO",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "PHYSICS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "SOILSCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "STAT",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "AGRONOMY 100",
            "target": "AGRONOMY/BOTANY/SOILSCI 370"
        }
    },
    {
        "data": {
            "source": "AGRONOMY/HORT/SOILSCI 326",
            "target": "HORT/SOILSCI 332"
        }
    },
    {
        "data": {
            "source": "ANSCI/DYSCI/FOODSCI/SOILSCI 472",
            "target": "ANSCI/DYSCI/FOODSCI/SOILSCI 473"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "AGRONOMY/ATMOCN/SOILSCI 532"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "BOTANY 500"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY 130",
            "target": "MICROBIO/SOILSCI 523"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 152"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 101"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "ENTOM/F&WECOL/PLPATH/SOILSCI 606"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "target": "PLPATH/SOILSCI 323"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 151"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "MICROBIO 303"
        }
    },
    {
        "data": {
            "source": "BOTANY 500",
            "target": "BOTANY/HORT/SOILSCI 626"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "SOILSCI 301"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 108"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 109"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 341"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "CHEM 343"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "ENVIRST/SOILSCI 324"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "F&WECOL/SOILSCI 451"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "MICROBIO 303"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "MICROBIO/SOILSCI 523"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "PLPATH/SOILSCI 323"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "SOILSCI 621"
        }
    },
    {
        "data": {
            "source": "CHEM 108",
            "target": "SOILSCI 430"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "BSE/CIVENGR/SOILSCI 372"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "source": "CHEM 109",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 115",
            "target": "CHEM 116"
        }
    },
    {
        "data": {
            "source": "CHEM 116",
            "target": "CIVENGR/M&ENVTOX/SOILSCI 631"
        }
    },
    {
        "data": {
            "source": "CHEM 341",
            "target": "MICROBIO/SOILSCI 425"
        }
    },
    {
        "data": {
            "source": "CHEM 343",
            "target": "CHEM 345"
        }
    },
    {
        "data": {
            "source": "CHEM 345",
            "target": "CHEM 341"
        }
    },
    {
        "data": {
            "source": "CIVENGR/ENVIRST/GEOG 377",
            "target": "ENVIRST/LANDARC/SOILSCI 695"
        }
    },
    {
        "data": {
            "source": "ENVIRST/F&WECOL/GEOG/GEOSCI/GLE/LANDARC 371",
            "target": "SOILSCI 585"
        }
    },
    {
        "data": {
            "source": "ENVIRST/GEOG 120",
            "target": "ENVIRST/GEOG 127"
        }
    },
    {
        "data": {
            "source": "ENVIRST/GEOG 120",
            "target": "GEOG/SOILSCI 526"
        }
    },
    {
        "data": {
            "source": "ENVIRST/GEOG 127",
            "target": "ENVIRST/GEOG 120"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 113"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "SOILSCI 301"
        }
    },
    {
        "data": {
            "source": "MATH 113",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 114",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 114"
        }
    },
    {
        "data": {
            "source": "MATH 118",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "ENVIRST/F&WECOL/GEOG/GEOSCI/GLE/LANDARC 371"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "AGRONOMY/ATMOCN/SOILSCI 532"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "CHEM 109"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "CIVENGR/M&ENVTOX/SOILSCI 631"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "PHYSICS 201"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "PHYSICS 202"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "PHYSICS 207"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "SOILSCI 622"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 114"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "MICROBIO 303",
            "target": "MICROBIO/SOILSCI 425"
        }
    },
    {
        "data": {
            "source": "PHYSICS 103",
            "target": "PHYSICS 104"
        }
    },
    {
        "data": {
            "source": "PHYSICS 104",
            "target": "CIVENGR/M&ENVTOX/SOILSCI 631"
        }
    },
    {
        "data": {
            "source": "PHYSICS 104",
            "target": "SOILSCI 622"
        }
    },
    {
        "data": {
            "source": "PHYSICS 201",
            "target": "PHYSICS 103"
        }
    },
    {
        "data": {
            "source": "PHYSICS 201",
            "target": "PHYSICS 202"
        }
    },
    {
        "data": {
            "source": "PHYSICS 201",
            "target": "PHYSICS 207"
        }
    },
    {
        "data": {
            "source": "PHYSICS 202",
            "target": "PHYSICS 104"
        }
    },
    {
        "data": {
            "source": "PHYSICS 202",
            "target": "PHYSICS 208"
        }
    },
    {
        "data": {
            "source": "PHYSICS 207",
            "target": "AGRONOMY/ATMOCN/SOILSCI 532"
        }
    },
    {
        "data": {
            "source": "PHYSICS 207",
            "target": "PHYSICS 201"
        }
    },
    {
        "data": {
            "source": "PHYSICS 207",
            "target": "PHYSICS 208"
        }
    },
    {
        "data": {
            "source": "PHYSICS 208",
            "target": "PHYSICS 202"
        }
    },
    {
        "data": {
            "source": "SOILSCI 301",
            "target": "AGRONOMY/HORT/SOILSCI 326"
        }
    },
    {
        "data": {
            "source": "SOILSCI 301",
            "target": "ENVIRST/GEOG/SOILSCI 230"
        }
    },
    {
        "data": {
            "source": "SOILSCI 301",
            "target": "SOILSCI 302"
        }
    },
    {
        "data": {
            "source": "SOILSCI 301",
            "target": "SOILSCI 327"
        }
    },
    {
        "data": {
            "source": "SOILSCI 301",
            "target": "SOILSCI 622"
        }
    },
    {
        "data": {
            "source": "STAT 240",
            "target": "SOILSCI 585"
        }
    }
]