[
    {
        "data": {
            "description": "In-depth reading of Cervantes' masterpiece, including a thorough study of its historical context and its place in the history of fiction.",
            "id": "SPANISH 851",
            "parent": "SPANISH",
            "title": "SEMINAR IN GOLDEN AGE PROSE: CERVANTES DON QUIJOTE"
        }
    },
    {
        "data": {
            "description": "Rock'n'roll music emerged in the USA in the 1950s, and almost immediately became a global phenomena, intimately associated to the scheme of Western modernity, informing music and cultural expressions in many parts of world. Seeks to study this transnational process, and the culture and music that were produced in Latin America.",
            "id": "SPANISH 477",
            "parent": "SPANISH",
            "title": "LATIN AMERICAN ROCK CULTURES"
        }
    },
    {
        "data": {
            "description": "A monograph on a particular author, work or literary current of Latin America: Modernismo, the novel of protest, Latin American theater, etc.",
            "id": "SPANISH 460",
            "parent": "SPANISH",
            "title": "LITERATURA HISPANOAMERICANA"
        }
    },
    {
        "data": {
            "description": "Accelerated development of Italian oral, reading and writing skills, equivalent to the completion of bothITALIAN 203andITALIAN 204.",
            "id": "ITALIAN 205",
            "parent": "ITALIAN",
            "title": "ACCELERATED INTERMEDIATE ITALIAN"
        }
    },
    {
        "data": {
            "description": "Accelerated introduction to Spanish language practice through writing, reading, speaking and listening. Course equivalent toSPANISH 101and102.",
            "id": "SPANISH 103",
            "parent": "SPANISH",
            "title": "FIRST YEAR INTENSIVE SPANISH"
        }
    },
    {
        "data": {
            "description": "Advanced course focusing on particular theories, approaches, and/or methodologies concerned with Spanish linguistics.",
            "id": "SPANISH 630",
            "parent": "SPANISH",
            "title": "TOPICS IN HISPANIC LINGUISTICS"
        }
    },
    {
        "data": {
            "description": "Advanced descriptive, historical, or applied topics in Spanish linguistics.",
            "id": "SPANISH 446",
            "parent": "SPANISH",
            "title": "TOPICS IN SPANISH LINGUISTICS"
        }
    },
    {
        "data": {
            "description": "Advanced language practice, including intensive writing and work in pertinent areas of grammar and stylistics.",
            "id": "SPANISH 311",
            "parent": "SPANISH",
            "title": "ADVANCED LANGUAGE PRACTICE"
        }
    },
    {
        "data": {
            "description": "All basic language skills: listening comprehension, speaking, reading, and writing. Requires no previous knowledge of Spanish.",
            "id": "SPANISH 101",
            "parent": "SPANISH",
            "title": "FIRST SEMESTER SPANISH"
        }
    },
    {
        "data": {
            "description": "An advanced topics course focusing on themes, particular authors, individual works, or literary genres in medieval Spanish literature.",
            "id": "MEDIEVAL/SPANISH 718",
            "title": "TOPICS IN MEDIEVAL SPANISH LITERATURE"
        }
    },
    {
        "data": {
            "description": "An in-depth study of Hispanic theatre through the analysis of dramatic texts as well as the production of live performance. By reading and staging a final play students explore the full value of dramatic arts.",
            "id": "SPANISH 564",
            "parent": "SPANISH",
            "title": "THEORY AND PRACTICE OF HISPANIC THEATRE"
        }
    },
    {
        "data": {
            "description": "An introduction to audiovisual media in the Spanish-speaking world. Topics may include cinema, television, video and video gaming. Learn basic technical vocabulary, analytical concepts and industrial history for specific media and consider theoretical issues relating to the integration of those media in various local cultures. Special attention will be paid to the economic, technological, social and political conditions that have determined the differential development of the various screen arts in Spanish-speaking countries.",
            "id": "SPANISH 472",
            "parent": "SPANISH",
            "title": "HISPANIC SCREEN STUDIES"
        }
    },
    {
        "data": {
            "description": "An introduction to reading and analyzing literary works, with special emphasis on development of oral and written skills for the discussion of literature. Concentration on methods of analyzing basic literary forms, conventions, genres, and representative short texts in Spanish.",
            "id": "SPANISH 224",
            "parent": "SPANISH",
            "title": "INTRODUCTION TO HISPANIC LITERATURES"
        }
    },
    {
        "data": {
            "description": "Analysis of Latina and Latino popular culture to consider the varied make-up of Latinos, their specific histories, social dynamics and politics through their creative expressions, performances and cultural contestations. Covers key terms and concepts, cultural developments, and diverse interpretations while focusing in the analysis of Latinx music, performance art, film and media, sports, food, and car culture. Other topics include the production, circulation and reception of Latinx popular culture, the use of Spanish and English languages, issues of identity, migration and interculturality, the role of the cultural industry, and the context of globalization. Broadly explores the intersectionality of race, ethnicity, class, gender, sexuality, and nation regarding Latinos. Taught in Spanish.",
            "id": "CHICLA/SPANISH 364",
            "title": "SURVEY OF LATINO AND LATINA POPULAR CULTURE"
        }
    },
    {
        "data": {
            "description": "Connects the topics discussed inSPANISH 320with concrete, physical speech signals. Learn to detect vocal fold vibration, evidence of tongue position, degree of closure between two organs, and friction caused by organ configuration, among other features, through the use of specialized software. Discuss sound experimental designs. Identify a specific set of sound system challenges that speakers of English face when learning Spanish. With regard to all of these issues, discuss address perception and production data, and data coming from native speakers and second language learners. Comparisons between Spanish data and those of English and other Romance languages.",
            "id": "SPANISH 420",
            "parent": "SPANISH",
            "title": "ADVANCED SPANISH PHONETICS"
        }
    },
    {
        "data": {
            "description": "Continuation ofSPANISH 101. All basic language skills: listening comprehension, speaking, reading, and writing.",
            "id": "SPANISH 102",
            "parent": "SPANISH",
            "title": "SECOND SEMESTER SPANISH"
        }
    },
    {
        "data": {
            "description": "Covers professional oral and written Spanish communication skills to prepare for interactions with Spanish-speaking patients in a clinical setting. Conducted entirely in Spanish.",
            "id": "SPANISH 317",
            "parent": "SPANISH",
            "title": "SPANISH FOR NURSING"
        }
    },
    {
        "data": {
            "description": "Cultural evolution from medieval period through the present; illustrated lectures. Taught in Spanish.",
            "id": "SPANISH 361",
            "parent": "SPANISH",
            "title": "SPANISH CIVILIZATION"
        }
    },
    {
        "data": {
            "description": "Cultural evolution of Spanish America from pre-Hispanic days through the present. Conducted in Spanish.",
            "id": "SPANISH 363",
            "parent": "SPANISH",
            "title": "SPANISH AMERICAN CIVILIZATION"
        }
    },
    {
        "data": {
            "description": "Development of Cervantes as a craftsman and thinker; linguistic and philosophical commentaries on Don Quixote and significant major works.",
            "id": "SPANISH 435",
            "parent": "SPANISH",
            "title": "CERVANTES"
        }
    },
    {
        "data": {
            "description": "Development of accurate and nuanced capacity for expression in Italian and for understanding the spoken and written language. Also addresses Italian phonetics and phonology to develop accurate pronunciation.",
            "id": "ITALIAN 311",
            "parent": "ITALIAN",
            "title": "ADVANCED ITALIAN LANGUAGE"
        }
    },
    {
        "data": {
            "description": "Development of the short story throughout Spanish America from its origins in the 19th century to the present.",
            "id": "SPANISH 461",
            "parent": "SPANISH",
            "title": "THE SPANISH AMERICAN SHORT STORY"
        }
    },
    {
        "data": {
            "description": "Directed study projects for freshmen and sophomores as arranged with a faculty member.",
            "id": "SPANISH 299",
            "parent": "SPANISH",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Directed study projects for graduate students as arranged with a faculty member.",
            "id": "SPANISH 899",
            "parent": "SPANISH",
            "title": "INDEPENDENT READING"
        }
    },
    {
        "data": {
            "description": "Directed study projects for juniors and seniors as arranged with a faculty member.",
            "id": "SPANISH 699",
            "parent": "SPANISH",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Discussion and research of advanced topics related to Hispanic literature, linguistics, or culture.",
            "id": "SPANISH 470",
            "parent": "SPANISH",
            "title": "UNDERGRADUATE SEMINARS IN HISPANIC LITERATURE/CULTURE/LINGUISTICS"
        }
    },
    {
        "data": {
            "description": "Drawing from cultural studies, border studies and/or critical race theory, this course explores through cultural and literary texts the social and political issues regarding migration, contact zones, transculturation, and/or diaspora.",
            "id": "CHICLA/SPANISH 478",
            "title": "BORDER AND RACE STUDIES IN LATIN AMERICA"
        }
    },
    {
        "data": {
            "description": "Drawing from cultural studies, border studies, migration and race theory, explores through cultural and literary texts the social and political issues regarding migration, contact zones, transculturation, and/or diaspora. Considers the various meanings of the word \"border\" or \"frontera\". What is a border geographically speaking? What does it mean in political and legal terms? How do we conceive the border in cultural, literary, linguistic, political, judicial, and personal ways? What is like to live on the border or on the margins? It is said that the border is a contact zone, a meeting point, a way to transfer and share information, an invitation to (in)tolerance and ex/inclusion. Read texts from history, politics, cultural anthropology, literature, and theatre to grasp the vast understanding of what is life on the border. Focus on the humanities, paying close attention to how visual artists (theater, performance, documentaries) understand and confront life on the border.",
            "id": "CHICLA/SPANISH 215",
            "title": "BORDER AND MIGRATION STUDIES OF LATINX AMERICA"
        }
    },
    {
        "data": {
            "description": "Drawing mainly from early modern Spanish and Colonial texts, this course will explore encounters and relations with different forms of \"otherness\". We will move from America to Spain and across the Mediterranean world to Istanbul, from the late 15th century to the 17th. Issues of race, ethnicity, and religious affiliation will take on diverse forms throughout the course. Spain's long history of relations between Muslims, Jews and Christians will form a backdrop to interactions with Amerindians, sub-Saharan Africans, Jews, Moriscos, Gypsies, North African Muslims and Turks. One of the millions of slaves during this period was Miguel de Cervantes, author of Don Quixote. He and many other writers would reflect profoundly on questions of \"otherness\" in works that would have universal implications and continue to connect with our concerns in the 21st century. Such works will guide us through this course, as will a wide array of visual resources from that era and our own.",
            "id": "SPANISH 490",
            "parent": "SPANISH",
            "title": "RACE, RELIGION AND ETHNICITY IN THE AGE OF EMPIRE"
        }
    },
    {
        "data": {
            "description": "Examine how the experiences of marginalized groups in the U.S. are profoundly intertwined with hemispheric historical processes. Review the categories that emerged to conceptualize human difference as European colonizers dispossessed indigenous peoples of their lands and inaugurated the forced migration and enslavement of peoples from Africa. Focus on how race was transformed after the revolutions of independence, exploring key concepts such as the one drop rule, mestizaje, racial democracy, and color-blindness. Explore how race intersects with gender, class, and migration, as well as with slavery, anti-colonial struggles, and US expansionism. Examine common assumptions in comparisons of race relations -e.g., the idea of a more more \"fluid\" understanding of race in Latin American countries, versus the binary models of the U.S.",
            "id": "LACIS/SPANISH 285",
            "title": "RACE AND CULTURE IN THE AMERICAS"
        }
    },
    {
        "data": {
            "description": "Explore the enduring wisdom and resilience of the Maya civilization amidst historical challenges and contemporary dynamics. Delve into Maya philosophy, history, and current affairs, with a focus on their relationship with the environment. Analyze pivotal questions: Did the Maya civilization collapse or undergo intentional transformation? Why did the Maya army refrain from sacking the colonial capital during a major rebellion? Examine the impact of modern politics and economics on Maya culture. Uncover the role of Maya bioculture in cultural resistance and survival, and the interconnectedness of spirituality, health, and ethics with nature. Investigate the complexities of Maya perspectives on present-day issues.",
            "id": "SPANISH 455",
            "parent": "SPANISH",
            "title": "CONTEMPORARY MAYAS: A CULTURE OF NATURE"
        }
    },
    {
        "data": {
            "description": "Explores the literary culture that emerged in Latin American countries after the military dictatorships in the seventies and eighties. Engage with cultural responses to human rights abuses in order to determine what kind of memory was invoked through available cultural venues and what kind of memory market has been created as a response to neo-liberal economic project. Looks into the means by which literary and cultural responses are produced, circulated and consumed, what seems to be remembered and forgotten as well as who takes ownership of memories and how the state produced official story compares with individual as well as community generated accounts.",
            "id": "SPANISH 479",
            "parent": "SPANISH",
            "title": "LATIN AMERICAN LITERATURE AND HUMAN RIGHTS"
        }
    },
    {
        "data": {
            "description": "First semester independent study with the goal to do the preliminary research to write a senior honors thesis in Spanish.",
            "id": "SPANISH 681",
            "parent": "SPANISH",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "First semester independent study with the goal to do the preliminary research to write a senior thesis in Spanish.",
            "id": "SPANISH 691",
            "parent": "SPANISH",
            "title": "FIRST SEMESTER SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Focus on the Spanish language in the United States from a sociolinguistic perspective. Comprises three goals: 1) presentation of the main linguistic characteristics represented in the Spanish of the United States (from both speakers that brought their variety from their home country, and Spanish speakers born in the United States); 2) examination of the main aspects related to the acquisition of Spanish as a minority language and phenomena related to English-Spanish language contact; and 3) understanding the socio-cultural aspects connected with the presence and vitality of Spanish in the United States (e.g., Spanish in the public, political, and educational contexts; linguistic identity, linguistic discrimination).",
            "id": "SPANISH 430",
            "parent": "SPANISH",
            "title": "SPANISH IN THE UNITED STATES"
        }
    },
    {
        "data": {
            "description": "Focuses on the cultural evolution of Chicanos, Puerto Ricans, Cuban-Americans, and other U.S. Latinos in relation to their countries of origin. Topics vary.",
            "id": "CHICLA/SPANISH 469",
            "title": "TOPICS IN LATINX CULTURE"
        }
    },
    {
        "data": {
            "description": "Focuses on the study of medical Spanish terminology and the cultural issues related to successful interactions with Spanish-speaking patients and their families in the clinical encounter. Introduces a wide array of vocabulary particular to the medical field, as well as a cultural understanding of medicine and illness in the Spanish-speaking world. Prepares to work with Spanish-speaking patients in future careers in medicine, nursing, social work, translation/interpretation, or mental health settings. Addresses cultural issues that may affect the clinical encounter with Spanish-speaking patients and their families.",
            "id": "SPANISH 328",
            "parent": "SPANISH",
            "title": "ADVANCED MEDICAL SPANISH"
        }
    },
    {
        "data": {
            "description": "Historical Spanish phonology, morphology, and syntax, with application to theories of language variation and change.",
            "id": "MEDIEVAL/SPANISH 541",
            "title": "OLD SPANISH"
        }
    },
    {
        "data": {
            "description": "Historical survey of the literature of the Twentieth Century. Major authors and representative works in all genres beginning with the Generation of 1898 to the present. Important currents in intellectual history.",
            "id": "SPANISH 453",
            "parent": "SPANISH",
            "title": "LITERATURE OF THE TWENTIETH CENTURY"
        }
    },
    {
        "data": {
            "description": "Historical survey of the literature of the eighteenth and nineteenth centuries. Major authors and representative works in all genres covering Neo-Classicism, Romanticism, Realism, and Naturalism. Important currents in intellectual history.",
            "id": "SPANISH 451",
            "parent": "SPANISH",
            "title": "LITERATURE OF THE EIGHTEENTH AND NINETEENTH CENTURIES"
        }
    },
    {
        "data": {
            "description": "In the last three decades, soccer has been transformed from being a very popular game in certain regions of the world to what is now considered a multicultural phenomenon. Soccer has caught the attention of not only the international media but also of disciplines such as sociology, psychology and cultural studies, as well as art forms like photography and filmmaking, digital art and comics. However, more than just a form of entertainment soccer is considered a national sport in most of Latin America. How is it that a game that originated in 19th Century England was adopted by a large and varied culture as a matter of national identity and pride? Focuses on the history of soccer and on soccer as a cultural phenomenon intimately linked to nation building and to notions of progress and national self-image.",
            "id": "SPANISH 230",
            "parent": "SPANISH",
            "title": "THE BEAUTIFUL GAME: CULTURAL POLITICS OF SOCCER"
        }
    },
    {
        "data": {
            "description": "In-depth study of important cultural-historical issues concerning the Hispanic world.",
            "id": "SPANISH 468",
            "parent": "SPANISH",
            "title": "TOPICS IN HISPANIC CULTURE"
        }
    },
    {
        "data": {
            "description": "Independent research and writing for graduate students under the supervision of a faculty member.",
            "id": "SPANISH 990",
            "parent": "SPANISH",
            "title": "THESIS"
        }
    },
    {
        "data": {
            "description": "Intensive oral and written practice in major areas of Spanish professional usage. Each offering will focus on an important field in which students tend to apply their language skills (journalism, commerce, medicine, law, social services, etc.).",
            "id": "SPANISH 319",
            "parent": "SPANISH",
            "title": "TOPICS IN SPANISH LANGUAGE PRACTICE"
        }
    },
    {
        "data": {
            "description": "Intensive practice in reading, writing, and grammar.",
            "id": "SPANISH 226",
            "parent": "SPANISH",
            "title": "INTERMEDIATE LANGUAGE PRACTICE WITH EMPHASIS ON WRITING AND GRAMMAR"
        }
    },
    {
        "data": {
            "description": "Interdisciplinary inquiry in Latin American society and culture.",
            "id": "AAE/ANTHRO/C&ESOC/GEOG/HISTORY/LACIS/POLISCI/PORTUG/SOC/SPANISH 982",
            "title": "INTERDEPARTMENTAL SEMINAR IN THE LATIN-AMERICAN AREA"
        }
    },
    {
        "data": {
            "description": "Intermediate-level language review, Hispanic readings, culture, and patterns of conversation.",
            "id": "SPANISH 203",
            "parent": "SPANISH",
            "title": "THIRD SEMESTER SPANISH"
        }
    },
    {
        "data": {
            "description": "Intermediate-level language review, extensive Hispanic readings and culture, intensive written and oral activities.",
            "id": "SPANISH 204",
            "parent": "SPANISH",
            "title": "FOURTH SEMESTER SPANISH"
        }
    },
    {
        "data": {
            "description": "Introduction to Spanish teaching methodology: classroom procedures, lesson planning, drilling techniques, preparation and evaluation of testing devices, current trends in language teaching, audio-visual aids, review of key grammatical concepts, etc.",
            "id": "SPANISH 545",
            "parent": "SPANISH",
            "title": "COLLEGE TEACHING OF SPANISH"
        }
    },
    {
        "data": {
            "description": "Introduction to Spanish teaching methodology: classroom procedures, lesson planning, preparation and evaluation of testing devices, current trends in language teaching, audio visualaids, etc. Other aspects of working in academia are incorporated as well, such as research (intertwining it with teaching, abstracts, conferences, publishing, etc.) and professionalization (building a CV, the job market, cover letters, research statements, teaching philosophies, etc.), both of which are guided by the instructor and faculty visitors from the Department of Spanish  Portuguese.",
            "id": "SPANISH 770",
            "parent": "SPANISH",
            "title": "INTRODUCTION TO THE PROFESSION"
        }
    },
    {
        "data": {
            "description": "Introduction to major 13th and 14th-century Castilian works.",
            "id": "MEDIEVAL/SPANISH 503",
            "title": "SURVEY OF MEDIEVAL LITERATURE"
        }
    },
    {
        "data": {
            "description": "Introduction to structural similarities and differences apparent in major Romance languages (French, Italian, Portuguese, Spanish) and to their historical developments, with reference to basic linguistic features of each language: phonology, morphology, syntax, and lexicon.",
            "id": "FRENCH/ITALIAN/PORTUG/SPANISH 429",
            "title": "INTRODUCTION TO THE ROMANCE LANGUAGES"
        }
    },
    {
        "data": {
            "description": "Introduction to the basic concepts of linguistics as a discipline and explore real-world Spanish use (e.g., blogs and vlogs, language corpora, press, film, recorded conversations, class visitors, etc.) and how that use varies across regions, speakers, and communicative contexts. Through examination of how different Spanish speakers deploy language in contexts such as confronting social taboos, expressing humor, being polite (or impolite), persuading particular audiences, and negotiating individual and cultural identities, students will gain a foundational understanding of several areas of linguistic study, including phonetics/ phonology, morphosyntax, pragmatics, sociolinguistics, language ideologies, and language variation and change.",
            "id": "SPANISH 225",
            "parent": "SPANISH",
            "title": "LYING, SWEARING, AND BREAKING THE RULES: AN INTRODUCTION TO THE LINGUISTIC STUDY OF SPANISH"
        }
    },
    {
        "data": {
            "description": "Introduction to the issues which shape the national cultures and the cultural practices of the Hispanic world. Emphasis on diversity, emergence of new imagined communities, cultural hybridity, and social movements within a historical framework.",
            "id": "SPANISH 223",
            "parent": "SPANISH",
            "title": "INTRODUCTION TO HISPANIC CULTURES"
        }
    },
    {
        "data": {
            "description": "Introduction to the linguistic analysis of Spanish, including morphology, syntax, dialectology, history of the language, language acquisition, and sociolinguistic variation.",
            "id": "SPANISH 327",
            "parent": "SPANISH",
            "title": "INTRODUCTION TO SPANISH LINGUISTICS"
        }
    },
    {
        "data": {
            "description": "Introduction to the study of Spanish American literature; reading, discussions, literary history. Eighteenth century to present.",
            "id": "SPANISH 326",
            "parent": "SPANISH",
            "title": "SURVEY OF SPANISH AMERICAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Investigates how economy and culture work together, consuming and/or restoring their environments in divergent scenarios of the Hispanic World.",
            "id": "ENVIRST/SPANISH 445",
            "title": "CULTURE AND THE ENVIRONMENT IN THE LUSO-HISPANIC WORLD"
        }
    },
    {
        "data": {
            "description": "Latin American culture and politics through the study of selected aspects of performance and/or visual culture. Topics vary.",
            "id": "SPANISH 480",
            "parent": "SPANISH",
            "title": "TOPICS IN LATIN AMERICAN PERFORMANCE/VISUAL STUDIES"
        }
    },
    {
        "data": {
            "description": "Latin American culture and society from an interdisciplinary perspective; historical developments from pre-Columbian times to the present; political movements; economic problems; social change; ecology in tropical Latin America; legal systems; literature and the arts; cultural contrasts involving the US and Latin America; land reform; labor movements; capitalism, socialism, imperialism; mass media.",
            "id": "AFROAMER/ANTHRO/C&ESOC/GEOG/HISTORY/LACIS/POLISCI/SOC/SPANISH 260",
            "title": "LATIN AMERICA: AN INTRODUCTION"
        }
    },
    {
        "data": {
            "description": "Literary, cultural, or theoretical topics relevant to Modern Peninsular Literature.",
            "id": "SPANISH 861",
            "parent": "SPANISH",
            "title": "SEMINAR-MODERN SPANISH LITERATURE"
        }
    },
    {
        "data": {
            "description": "Multiple alterities: religious affiliations, ethnicities, race, and gender in early modern America, Spain and the Mediterranean.",
            "id": "SPANISH 701",
            "parent": "SPANISH",
            "title": "TEXTUAL CRITICISM"
        }
    },
    {
        "data": {
            "description": "Offers an introduction to the culture and history of the Mexican and Latin American origin people in the United States. Emphasis on diversity, emergence of new imagined communities, and cultural hybridity. Focusing on key issues such as U.S. imperial expansion, colonialism, nation and community formations, migration, urban spaces, and the dynamics of race, class, gender, ethnicity, and sexuality, study a range of socio-political, historical, literary, and artistic expressions that inform the whole process of culture and reveal the way Latinos and Latinas negotiate their presence, cultural difference, and creativity in the U.S.",
            "id": "CHICLA/SPANISH 222",
            "title": "INTRODUCTION TO LATINX CULTURES"
        }
    },
    {
        "data": {
            "description": "Oral practice and conversation, grammar, reading, vocabulary building, and study of Italian cultures.",
            "id": "ITALIAN 101",
            "parent": "ITALIAN",
            "title": "FIRST SEMESTER ITALIAN"
        }
    },
    {
        "data": {
            "description": "Oral practice and conversation, grammar, reading, vocabulary building, and study of Italian cultures.",
            "id": "ITALIAN 102",
            "parent": "ITALIAN",
            "title": "SECOND SEMESTER ITALIAN"
        }
    },
    {
        "data": {
            "description": "Overview of relevant academic genres through readings and extensive practice in writing, critiquing and editing. Genres include conference paper writing and delivery; grant applications; how to prepare an article for submission, how to choose a journal or a press, and the editorial process from consideration of a manuscript until final publication; to prepare a dissertation proposal, write a dissertation chapter, and an abstract for the job market. Students will work on their choice projects throughout the semester.",
            "id": "SPANISH 771",
            "parent": "SPANISH",
            "title": "WRITING FOR THE PROFESSION"
        }
    },
    {
        "data": {
            "description": "Practice and improve conversational Spanish. Form and present opinions about a variety of cultural and social issues that affect Latin America and the US by using appropriate vocabulary and language.",
            "id": "SPANISH 325",
            "parent": "SPANISH",
            "title": "ADVANCED CONVERSATION"
        }
    },
    {
        "data": {
            "description": "Practice course for improvement of pronunciation, and introduction to transcription and phonetic and phonemic analysis.",
            "id": "SPANISH 320",
            "parent": "SPANISH",
            "title": "SPANISH PHONETICS"
        }
    },
    {
        "data": {
            "description": "Provides an overview of second language acquisition theories and processes as they pertain to Spanish second language learners and characterizes the linguistic challenge that specific Spanish structures pose for English-speakers in particular.",
            "id": "SPANISH 331",
            "parent": "SPANISH",
            "title": "SPANISH APPLIED LINGUISTICS"
        }
    },
    {
        "data": {
            "description": "Readings in the work of major Spanish American poets and essayists within a historical framework.",
            "id": "SPANISH 464",
            "parent": "SPANISH",
            "title": "SPANISH AMERICAN POETRY AND ESSAY"
        }
    },
    {
        "data": {
            "description": "Readings, discussions, literary history. Eighteenth century to present.",
            "id": "SPANISH 324",
            "parent": "SPANISH",
            "title": "SURVEY OF MODERN SPANISH LITERATURE"
        }
    },
    {
        "data": {
            "description": "Second semester independent study with the goal to complete a senior honors thesis in Spanish.SPANISH 681",
            "id": "SPANISH 682",
            "parent": "SPANISH",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Second semester independent study with the goal to complete a senior thesis in Spanish.SPANISH 691",
            "id": "SPANISH 692",
            "parent": "SPANISH",
            "title": "SECOND SEMESTER SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Selected readings, discussions, and literary history of Spain and Spanish America through 1700.",
            "id": "SPANISH 322",
            "parent": "SPANISH",
            "title": "SURVEY OF EARLY HISPANIC LITERATURE"
        }
    },
    {
        "data": {
            "description": "Seminar focusing on literary, textual criticism or theoretical topics relevant to Medieval Spanish literature.",
            "id": "MEDIEVAL/SPANISH 842",
            "title": "SEMINAR-MEDIEVAL LITERATURE"
        }
    },
    {
        "data": {
            "description": "Seminar focusing on literature, literary criticism, culture or theory relevant to 20th and 21st Spanish American Lit.",
            "id": "SPANISH 802",
            "parent": "SPANISH",
            "title": "SEMINAR-SPANISH AMERICAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Seminar focusing on literature, literary criticism, or theory relevant to colonial and 19th-century Spanish American literature.",
            "id": "SPANISH 801",
            "parent": "SPANISH",
            "title": "SEMINAR-SPANISH AMERICAN LITERATURE"
        }
    },
    {
        "data": {
            "description": "Seminar focusing on theoretical, methodological, and applied approaches to a specific topic related to current Spanish (e.g,, Second Language acquisition, Applied Linguistics, Syntax, Semantics, Phonetics, Phonology, Language variation and change).",
            "id": "SPANISH 815",
            "parent": "SPANISH",
            "title": "SEMINAR IN LANGUAGE: MODERN SPANISH"
        }
    },
    {
        "data": {
            "description": "Spanish business language, culture and practice within Spanish-speaking economic markets.",
            "id": "SPANISH 359",
            "parent": "SPANISH",
            "title": "SPANISH BUSINESS AREA STUDIES"
        }
    },
    {
        "data": {
            "description": "Spanish lexicon and linguistic style for management, banking, accounting, capital investment, personnel and office systems, production of goods and services, marketing, finance, and import/export; includes translation and interpretive activities.",
            "id": "INTLBUS/SPANISH 329",
            "title": "SPANISH FOR BUSINESS"
        }
    },
    {
        "data": {
            "description": "Structure and usage of modern Spanish through an examination of linguistic phenomena found throughout the Spanish-speaking world. Analyze authentic speech and texts of varied genres (newspaper articles, literature, advertisements, blogs, etc.) both to understand the conventions of modern Spanish structure and usage, and to investigate how grammatical structure may be manipulated by Spanish speakers (including themselves) to accomplish particular communicative goals.",
            "id": "SPANISH 321",
            "parent": "SPANISH",
            "title": "THE STRUCTURE OF MODERN SPANISH"
        }
    },
    {
        "data": {
            "description": "Studies in the emergence of the modern novel with the invention of short and long novel forms as well as the development of intellectual and scientific works, including literature about other parts of the world, picaresque novels, courtly novels, pastoral novels, Moorish novels, autobiographies, travel narratives, mystic writings, humanistic dialogues, histories, geographies, and treatises on a wide array of topics.",
            "id": "SPANISH 852",
            "parent": "SPANISH",
            "title": "SEMINAR IN GOLDEN AGE PROSE"
        }
    },
    {
        "data": {
            "description": "Study the literature of Latinos and Latinas in the United States, particularly of writers of Mexican, Puerto Rican, Cuban, Dominican and Central American descent. Examines the impact of race and how individuals and communities negotiate situations of internal colonialism, migration, generational conflicts, tensions between assimilation and cultural preservation, gender roles, literary traditions, and transnational situations. Considers the linguistic, cultural and formal singularity of Latinx literature, the use of Spanish and English languages, the advent of feminist and queer writing, and the vision of the United States in their works regarding its past, its present and its future. Explores the intersectionality of race, ethnicity, class, gender, sexuality, and literary forms. Diverse theories and ways to read literary texts will be explored. Literary texts - novels, short stories, poetry and essays - will be read in English or Spanish, or a combination of both. Taught in Spanish",
            "id": "CHICLA/SPANISH 467",
            "title": "US LATINO LITERATURE"
        }
    },
    {
        "data": {
            "description": "Survey and analysis of the historical and contemporary presence of the Spanish language and its speakers in U.S. communities, pop culture, media, schools and politics. Examination through linguistic, sociolinguistic, raciolinguistic and linguistic-anthropological lenses of how Spanish is used (and misused) by speakers and non-speakers alike to uphold, reproduce or perhaps transform ethnolinguistic, racialized and other social identities, attitudes and ideologies associated with Spanish in the U.S.",
            "id": "SPANISH 228",
            "parent": "SPANISH",
            "title": "FROM BAD BUNNY TO BAD HOMBRES: THE (MIS)REPRESENTATION AND (IN)VISIBILITY OF SPANISH IN THE US"
        }
    },
    {
        "data": {
            "description": "Teaches professional oral and written Spanish communication skills for use in the setting of a pharmacy to communicate with Spanish-speaking patients. Conducted entirely in Spanish. A minimum of three semesters of undergraduate Spanish coursework recommended.",
            "id": "SPANISH 318",
            "parent": "SPANISH",
            "title": "SPANISH FOR PHARMACY"
        }
    },
    {
        "data": {
            "description": "The study of a particular author, work, topic, or literary genre of the Middle Ages and/or Early Renaissance (through15th century): Poema de mio Cid, mester de juglaria, Libro de buen amor, mester de clerecia, El conde Lucanor, La Celestina, etc.",
            "id": "MEDIEVAL/SPANISH 414",
            "title": "LITERATURA DE LA EDAD MEDIA CASTELLANA (SS. XII-XV)"
        }
    },
    {
        "data": {
            "description": "Treatment of a topic in Hispanic cultures in a course carried with a UW-Madison resident study abroad program that has no equivalent on this campus. Enrollment in a UW-Madison resident study abroad program",
            "id": "SPANISH 476",
            "parent": "SPANISH",
            "title": "STUDY ABROAD IN HISPANIC CULTURES"
        }
    },
    {
        "data": {
            "description": "Treatment of a topic in Hispanic literatures in a course carried with a UW-Madison resident study abroad program that has no equivalent on this campus. Enrollment in a UW-Madison resident study abroad program",
            "id": "SPANISH 475",
            "parent": "SPANISH",
            "title": "STUDY ABROAD IN HISPANIC LITERATURES"
        }
    },
    {
        "data": {
            "description": "Treatment of a topic in Spanish language in a course carried with a UW-Madison resident study abroad program that has no equivalent on this campus. Enrollment in a UW-Madison resident study abroad program",
            "id": "SPANISH 473",
            "parent": "SPANISH",
            "title": "STUDY ABROAD IN SPANISH LANGUAGE PRACTICE"
        }
    },
    {
        "data": {
            "description": "Treatment of a topic in Spanish linguistics in a course carried with a UW-Madison resident study abroad program that has no equivalent on this campus. Enrollment in a UW-Madison resident study abroad program",
            "id": "SPANISH 474",
            "parent": "SPANISH",
            "title": "STUDY ABROAD IN SPANISH LINGUISTICS"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ITALIAN",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "SPANISH",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "CHICLA/SPANISH 215",
            "target": "CHICLA/SPANISH 478"
        }
    },
    {
        "data": {
            "source": "CHICLA/SPANISH 222",
            "target": "CHICLA/SPANISH 469"
        }
    },
    {
        "data": {
            "source": "CHICLA/SPANISH 222",
            "target": "CHICLA/SPANISH 478"
        }
    },
    {
        "data": {
            "source": "CHICLA/SPANISH 222",
            "target": "ENVIRST/SPANISH 445"
        }
    },
    {
        "data": {
            "source": "CHICLA/SPANISH 222",
            "target": "SPANISH 326"
        }
    },
    {
        "data": {
            "source": "CHICLA/SPANISH 222",
            "target": "SPANISH 361"
        }
    },
    {
        "data": {
            "source": "CHICLA/SPANISH 222",
            "target": "SPANISH 363"
        }
    },
    {
        "data": {
            "source": "CHICLA/SPANISH 222",
            "target": "SPANISH 455"
        }
    },
    {
        "data": {
            "source": "CHICLA/SPANISH 222",
            "target": "SPANISH 461"
        }
    },
    {
        "data": {
            "source": "CHICLA/SPANISH 222",
            "target": "SPANISH 468"
        }
    },
    {
        "data": {
            "source": "CHICLA/SPANISH 222",
            "target": "SPANISH 480"
        }
    },
    {
        "data": {
            "source": "CHICLA/SPANISH 364",
            "target": "CHICLA/SPANISH 469"
        }
    },
    {
        "data": {
            "source": "CHICLA/SPANISH 364",
            "target": "SPANISH 468"
        }
    },
    {
        "data": {
            "source": "ITALIAN 101",
            "target": "ITALIAN 102"
        }
    },
    {
        "data": {
            "source": "ITALIAN 102",
            "target": "ITALIAN 205"
        }
    },
    {
        "data": {
            "source": "ITALIAN 205",
            "target": "ITALIAN 311"
        }
    },
    {
        "data": {
            "source": "ITALIAN 311",
            "target": "FRENCH/ITALIAN/PORTUG/SPANISH 429"
        }
    },
    {
        "data": {
            "source": "SPANISH 101",
            "target": "SPANISH 102"
        }
    },
    {
        "data": {
            "source": "SPANISH 102",
            "target": "SPANISH 103"
        }
    },
    {
        "data": {
            "source": "SPANISH 103",
            "target": "SPANISH 203"
        }
    },
    {
        "data": {
            "source": "SPANISH 203",
            "target": "SPANISH 204"
        }
    },
    {
        "data": {
            "source": "SPANISH 203",
            "target": "SPANISH 317"
        }
    },
    {
        "data": {
            "source": "SPANISH 223",
            "target": "CHICLA/SPANISH 364"
        }
    },
    {
        "data": {
            "source": "SPANISH 223",
            "target": "CHICLA/SPANISH 467"
        }
    },
    {
        "data": {
            "source": "SPANISH 223",
            "target": "CHICLA/SPANISH 469"
        }
    },
    {
        "data": {
            "source": "SPANISH 223",
            "target": "ENVIRST/SPANISH 445"
        }
    },
    {
        "data": {
            "source": "SPANISH 223",
            "target": "MEDIEVAL/SPANISH 414"
        }
    },
    {
        "data": {
            "source": "SPANISH 223",
            "target": "SPANISH 322"
        }
    },
    {
        "data": {
            "source": "SPANISH 223",
            "target": "SPANISH 324"
        }
    },
    {
        "data": {
            "source": "SPANISH 223",
            "target": "SPANISH 361"
        }
    },
    {
        "data": {
            "source": "SPANISH 223",
            "target": "SPANISH 363"
        }
    },
    {
        "data": {
            "source": "SPANISH 223",
            "target": "SPANISH 435"
        }
    },
    {
        "data": {
            "source": "SPANISH 223",
            "target": "SPANISH 451"
        }
    },
    {
        "data": {
            "source": "SPANISH 223",
            "target": "SPANISH 453"
        }
    },
    {
        "data": {
            "source": "SPANISH 223",
            "target": "SPANISH 455"
        }
    },
    {
        "data": {
            "source": "SPANISH 223",
            "target": "SPANISH 460"
        }
    },
    {
        "data": {
            "source": "SPANISH 223",
            "target": "SPANISH 464"
        }
    },
    {
        "data": {
            "source": "SPANISH 223",
            "target": "SPANISH 468"
        }
    },
    {
        "data": {
            "source": "SPANISH 223",
            "target": "SPANISH 470"
        }
    },
    {
        "data": {
            "source": "SPANISH 223",
            "target": "SPANISH 472"
        }
    },
    {
        "data": {
            "source": "SPANISH 223",
            "target": "SPANISH 477"
        }
    },
    {
        "data": {
            "source": "SPANISH 223",
            "target": "SPANISH 479"
        }
    },
    {
        "data": {
            "source": "SPANISH 223",
            "target": "SPANISH 480"
        }
    },
    {
        "data": {
            "source": "SPANISH 223",
            "target": "SPANISH 490"
        }
    },
    {
        "data": {
            "source": "SPANISH 223",
            "target": "SPANISH 564"
        }
    },
    {
        "data": {
            "source": "SPANISH 224",
            "target": "CHICLA/SPANISH 364"
        }
    },
    {
        "data": {
            "source": "SPANISH 224",
            "target": "CHICLA/SPANISH 467"
        }
    },
    {
        "data": {
            "source": "SPANISH 224",
            "target": "MEDIEVAL/SPANISH 414"
        }
    },
    {
        "data": {
            "source": "SPANISH 224",
            "target": "SPANISH 322"
        }
    },
    {
        "data": {
            "source": "SPANISH 224",
            "target": "SPANISH 324"
        }
    },
    {
        "data": {
            "source": "SPANISH 224",
            "target": "SPANISH 326"
        }
    },
    {
        "data": {
            "source": "SPANISH 224",
            "target": "SPANISH 435"
        }
    },
    {
        "data": {
            "source": "SPANISH 224",
            "target": "SPANISH 451"
        }
    },
    {
        "data": {
            "source": "SPANISH 224",
            "target": "SPANISH 453"
        }
    },
    {
        "data": {
            "source": "SPANISH 224",
            "target": "SPANISH 460"
        }
    },
    {
        "data": {
            "source": "SPANISH 224",
            "target": "SPANISH 461"
        }
    },
    {
        "data": {
            "source": "SPANISH 224",
            "target": "SPANISH 464"
        }
    },
    {
        "data": {
            "source": "SPANISH 224",
            "target": "SPANISH 470"
        }
    },
    {
        "data": {
            "source": "SPANISH 224",
            "target": "SPANISH 472"
        }
    },
    {
        "data": {
            "source": "SPANISH 224",
            "target": "SPANISH 477"
        }
    },
    {
        "data": {
            "source": "SPANISH 224",
            "target": "SPANISH 479"
        }
    },
    {
        "data": {
            "source": "SPANISH 224",
            "target": "SPANISH 490"
        }
    },
    {
        "data": {
            "source": "SPANISH 224",
            "target": "SPANISH 564"
        }
    },
    {
        "data": {
            "source": "SPANISH 225",
            "target": "SPANISH 320"
        }
    },
    {
        "data": {
            "source": "SPANISH 225",
            "target": "SPANISH 321"
        }
    },
    {
        "data": {
            "source": "SPANISH 225",
            "target": "SPANISH 327"
        }
    },
    {
        "data": {
            "source": "SPANISH 225",
            "target": "SPANISH 331"
        }
    },
    {
        "data": {
            "source": "SPANISH 225",
            "target": "SPANISH 430"
        }
    },
    {
        "data": {
            "source": "SPANISH 225",
            "target": "SPANISH 446"
        }
    },
    {
        "data": {
            "source": "SPANISH 226",
            "target": "CHICLA/SPANISH 222"
        }
    },
    {
        "data": {
            "source": "SPANISH 226",
            "target": "SPANISH 223"
        }
    },
    {
        "data": {
            "source": "SPANISH 226",
            "target": "SPANISH 224"
        }
    },
    {
        "data": {
            "source": "SPANISH 226",
            "target": "SPANISH 225"
        }
    },
    {
        "data": {
            "source": "SPANISH 226",
            "target": "SPANISH 311"
        }
    },
    {
        "data": {
            "source": "SPANISH 311",
            "target": "INTLBUS/SPANISH 329"
        }
    },
    {
        "data": {
            "source": "SPANISH 311",
            "target": "SPANISH 226"
        }
    },
    {
        "data": {
            "source": "SPANISH 311",
            "target": "SPANISH 319"
        }
    },
    {
        "data": {
            "source": "SPANISH 311",
            "target": "SPANISH 325"
        }
    },
    {
        "data": {
            "source": "SPANISH 311",
            "target": "SPANISH 328"
        }
    },
    {
        "data": {
            "source": "SPANISH 311",
            "target": "SPANISH 359"
        }
    },
    {
        "data": {
            "source": "SPANISH 320",
            "target": "SPANISH 420"
        }
    }
]