[
    {
        "data": {
            "description": "A rigorous introduction to probability theory at an advanced undergraduate level. Only a minimal amount of measure theory is used, in particular, the theory of Lebesgue integrals is not needed. It is aimed at math majors and Master's degree students, or students in other fields who will need probability in their future careers. Gives an introduction to the basics (Kolmogorov axioms, conditional probability and independence, random variables, expectation) and discusses some classical results with proofs (DeMoivre-Laplace limit theorems, the study of simple random walk on the one dimensional lattice, applications of generating functions).",
            "id": "MATH 531",
            "parent": "MATH",
            "title": "PROBABILITY THEORY"
        }
    },
    {
        "data": {
            "description": "Covers the graphs, properties and geometric significance of trigonometric functions of a real variable. Other topics include trigonometric equations and identities, application, trigonometric form of complex numbers, DeMoivre's theorem, and polar and parametric equations. The course also has a significant number of applications, especially related to other disciplines.",
            "id": "MATH 113",
            "parent": "MATH",
            "title": "TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "Deep learning is a field that specializes in discovering and extracting intricate structures in large, unstructured datasets for parameterizing artificial neural networks with many layers. Since deep learning has pushed the state-of-the-art in many research and application areas, it's become indispensable for modern technology. Focuses on a understanding deep, artificial neural networks by connecting it to related concepts in statistics. Beyond covering deep learning models for predictive modeling, focus on deep generative models. Besides explanations on a mathematical and conceptual level, emphasize the practical aspects of deep learning. Open-source computing provides hands-on experience for implementing deep neural nets, working on supervised learning tasks, and applying generative models for dataset synthesis.",
            "id": "STAT 453",
            "parent": "STAT",
            "title": "INTRODUCTION TO DEEP LEARNING AND GENERATIVE MODELS"
        }
    },
    {
        "data": {
            "description": "Mathematical statistical inference aims at providing an understanding of likelihood's central role to statistical inference, using the language of mathematical statistics to analyze statistical procedures, and using the computer as a tool for understanding statistics. Specific topics include: samples and populations, estimation, hypothesis testing, and theoretical properties of statistical inference.",
            "id": "MATH/STAT 310",
            "title": "INTRODUCTION TO PROBABILITY AND MATHEMATICAL STATISTICS II"
        }
    },
    {
        "data": {
            "description": "Multivariate normal distribution, estimation of mean and covariance matrix; Wishart distribution; distribution of partial and multiple correlation coefficients; Hotelling's T-squared, principal components.",
            "id": "STAT 760",
            "parent": "STAT",
            "title": "MULTIVARIATE ANALYSIS I"
        }
    },
    {
        "data": {
            "description": "Special topics in statistics at the master's level. Subject matter varies.",
            "id": "STAT 679",
            "parent": "STAT",
            "title": "SPECIAL TOPICS IN STATISTICS"
        }
    },
    {
        "data": {
            "description": "Topics covered include axioms of probability, random variables, the most important discrete and continuous probability distributions, expectation and variance, moment generating functions, conditional probability and conditional expectations, multivariate distributions, Markov's and Chebyshev's inequalities, laws of large numbers, and the central limit theorem.",
            "id": "MATH/STAT 431",
            "title": "INTRODUCTION TO THE THEORY OF PROBABILITY"
        }
    },
    {
        "data": {
            "description": "A survey of some of the tools and frameworks that are currently popular among data scientists and statisticians working in both academia and industry. Begins with an accelerated introduction to the Python programming language and brief introductions to object-oriented and functional programming. Covers some of the scientific computing platforms available in Python, including tools for numerical and scientific computing; training basic machine learning models; and data visualization. Discusses collecting data from the web both by scraping and using APIs. Concludes with a brief survey of distributed computing platforms, focusing on the MapReduce framework.",
            "id": "STAT 606",
            "parent": "STAT",
            "title": "COMPUTING IN DATA SCIENCE AND STATISTICS"
        }
    },
    {
        "data": {
            "description": "Advanced mathematical theory and methods of machine learning. Statistical learning theory, Vapnik-Chevronenkis Theory, model selection, high-dimensional models, nonparametric methods, probabilistic analysis, optimization, learning paradigms.",
            "id": "COMPSCI/ECE/STAT 861",
            "title": "THEORETICAL FOUNDATIONS OF MACHINE LEARNING"
        }
    },
    {
        "data": {
            "description": "Advanced topics in probability and stochastic processes.",
            "id": "MATH/STAT 833",
            "title": "TOPICS IN THE THEORY OF PROBABILITY"
        }
    },
    {
        "data": {
            "description": "Advanced topics in the mathematical foundations of data science",
            "id": "ECE/MATH/STAT 888",
            "title": "TOPICS IN MATHEMATICAL DATA SCIENCE"
        }
    },
    {
        "data": {
            "description": "An introduction to linear algebra and differential equations with emphasis on the relationship between the theory of linear algebra and analytical and numerical techniques for solving differential equations. Linear algebra topics include linear systems, matrices and their algebra, vector spaces and linear transformations, eigenvalues and eigenvectors. Topics from differential equations include first order ODE, homogeneous and nonhomogeneous linear systems, and numerical methods.",
            "id": "MATH 320",
            "parent": "MATH",
            "title": "LINEAR ALGEBRA AND DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "description": "An introduction to measure theoretic probability and stochastic processes.Topics include foundations, independence, zero-one laws, laws of large numbers, convergence in distribution, characteristic functions, central limit theorems, random walks, conditional expectations. Familiarity with basic measure theory (e.g.MATH 629or721) or concurrent registration inMATH 721is strongly recommended.",
            "id": "MATH/STAT 733",
            "title": "THEORY OF PROBABILITY I"
        }
    },
    {
        "data": {
            "description": "An introduction to regression with emphasis on the practical aspects. Topics include: straight-line model, role of assumptions, residual analysis, transformations, multiple regression (with some use of matrix notation), multicollinearity, subset selection, and a brief introduction to mixed models.",
            "id": "STAT 333",
            "parent": "STAT",
            "title": "APPLIED REGRESSION ANALYSIS"
        }
    },
    {
        "data": {
            "description": "An introduction to the methods used to design sample surveys and analyze the results. Topics covered include: basic tools, simple random sampling, ratio and regression estimation, stratification, systematic sampling, cluster (area) sampling, two-stage sampling, unequal probability sampling, non-sampling errors, and missing data. For illustration and clarification, examples are drawn from diverse areas of application.",
            "id": "STAT 411",
            "parent": "STAT",
            "title": "AN INTRODUCTION TO SAMPLE SURVEY THEORY AND METHODS"
        }
    },
    {
        "data": {
            "description": "An understanding of the commonly used statistical language R. Topics will include using R to manipulate data and perform exploratory data analysis.",
            "id": "STAT 303",
            "parent": "STAT",
            "title": "R FOR STATISTICS I"
        }
    },
    {
        "data": {
            "description": "Analysis of multidimensional contingency tables, Poisson regression, and logistic regression, with emphasis on practical applications. Use of computer programs for such analyses. Model selection, testing goodness of fit, estimation of parameters, measures of association and methods for detecting sources of significance.",
            "id": "STAT 421",
            "parent": "STAT",
            "title": "APPLIED CATEGORICAL DATA ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Autocorrelation; stationarity and non-stationarity; heteroscedasticity; dynamic models; auto-regressive and moving average models; identification and fitting; forecasting; seasonal adjustment; applications for financial time series, social sciences and environmental studies.",
            "id": "STAT 349",
            "parent": "STAT",
            "title": "INTRODUCTION TO TIME SERIES"
        }
    },
    {
        "data": {
            "description": "Classical statistical procedures arise where closed-form mathematical expressions are available for various inference summaries (e.g. linear regression; analysis of variance). A major emphasis of modern statistics is the development of inference principles in cases where both more complex data structures are involved and where more elaborate computations are required. Topics from numerical linear algebra, optimization, Monte Carlo (including Markov chain Monte Carlo), and graph theory are developed, especially as they relate to statistical inference (e.g., bootstrapping, permutation, Bayesian inference, EM algorithm, multivariate analysis).",
            "id": "COMPSCI/STAT 471",
            "title": "INTRODUCTION TO COMPUTATIONAL STATISTICS"
        }
    },
    {
        "data": {
            "description": "Conditioning, distribution theory, approximation to distributions, modes of convergence, limit theorems, statistical models, parameter estimation, comparision of estimators, confidence sets, theory of hypothesis tests, introduction to Bayesian inference and nonparametric estimation.",
            "id": "STAT 610",
            "parent": "STAT",
            "title": "INTRODUCTION TO STATISTICAL INFERENCE"
        }
    },
    {
        "data": {
            "description": "Consulting apprenticeship.",
            "id": "STAT 998",
            "parent": "STAT",
            "title": "STATISTICAL CONSULTING"
        }
    },
    {
        "data": {
            "description": "Continuation ofMATH 171. Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Completion ofMATH 217implies completion ofMATH 221and114.",
            "id": "MATH 217",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY II"
        }
    },
    {
        "data": {
            "description": "Course designed for the biomedical researcher. Topics include: descriptive statistics, hypothesis testing, estimation, confidence intervals, t-tests, chi-squared tests, analysis of variance, linear regression, correlation, nonparametric tests, survival analysis and odds ratio. Biomedical applications used for each topic.",
            "id": "BMI/STAT 541",
            "title": "INTRODUCTION TO BIOSTATISTICS"
        }
    },
    {
        "data": {
            "description": "Covers important aspects of professional development in statistics, including skills with internet tools, sophisticated use of statistical languages (such as R) and other emerging topics.",
            "id": "STAT 627",
            "parent": "STAT",
            "title": "PROFESSIONAL SKILLS IN DATA SCIENCE"
        }
    },
    {
        "data": {
            "description": "Covers material in first and second semester calculus but it is intended to teach math majors to write and understand proofs in mathematics in general and in calculus in particular.",
            "id": "MATH 421",
            "parent": "MATH",
            "title": "THE THEORY OF SINGLE VARIABLE CALCULUS"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Credit is awarded for students having completed an advanced statistics course in a study abroad program for which there is no direct equivalence to the statistics department course offerings. The study abroad course must be pre-approved by the statistics department. Enrollment in a UW-Madison resident study abroad program.",
            "id": "STAT 360",
            "parent": "STAT",
            "title": "TOPICS IN STATISTICS STUDY ABROAD"
        }
    },
    {
        "data": {
            "description": "Descriptive statistics, distributions, one- and two-sample normal inference, power, one-way ANOVA, simple linear regression, categorical data, non-parametric methods; underlying assumptions and diagnostic work.",
            "id": "F&WECOL/STAT 571",
            "title": "STATISTICAL METHODS FOR BIOSCIENCE I"
        }
    },
    {
        "data": {
            "description": "Descriptive statistics, probability concepts and distributions, random variables. Hypothesis tests and confidence intervals for one- and two-sample problems. Linear regression, model checking, and inference. Analysis of variance and basic ideas in experimental design. Utilizes the R programming language.",
            "id": "STAT 324",
            "parent": "STAT",
            "title": "INTRODUCTORY APPLIED STATISTICS FOR ENGINEERS"
        }
    },
    {
        "data": {
            "description": "Designed for population health researcher. Topics include descriptive statistics, elementary probability, probability distributions, one- and two-sample normal inference (point estimation, hypothesis testing, confidence intervals), power and sample size calculations, one- and two-sample binomial inference, underlying assumptions and diagnostic work.",
            "id": "BMI/POPHLTH 551",
            "title": "INTRODUCTION TO BIOSTATISTICS FOR POPULATION HEALTH"
        }
    },
    {
        "data": {
            "description": "Detecting, quantifying, and modeling spatial patterns and structure in data. Variograms and covariance functions, linear predictions with uncertainty qualification, and conditional simulations. Spectral domain models and spectral densities. Spatial point processes. Contemporary applications and Gaussian process model fitting at scale.",
            "id": "STAT 575",
            "parent": "STAT",
            "title": "STATISTICAL METHODS FOR SPATIAL DATA"
        }
    },
    {
        "data": {
            "description": "Develop statistical consulting skills to be able to communicate design and analysis to non-technical research collaborators. Provides a supportive environment to experiment with statistical consulting in practice, which will sometimes be uncomfortable and strange. Consulting problems typically do not have a \"right\" answer, and mistakes are encouraged. Take risks in sharing developing ideas in class. Connections with external organizations, such as the private sector and government agencies, will be made through possible internship experiences.",
            "id": "STAT 678",
            "parent": "STAT",
            "title": "INTRODUCTION TO STATISTICAL CONSULTING"
        }
    },
    {
        "data": {
            "description": "Directed study projects as arranged with a faculty member.",
            "id": "STAT 698",
            "parent": "STAT",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Directed study projects as arranged with a faculty member.",
            "id": "STAT 699",
            "parent": "STAT",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Distribution free statistical procedures or methods valid under nonrestrictive assumptions: basic tools; counting methods; order statistics, ranks, empirical distribution functions; distribution free tests and associated interval and point estimators; sign test; signed rank tests; rank tests; Mann Whitney Wilcoxon procedures; Kolmogorov Smirnov tests; permutation methods; kernel density estimation; kernel and spline regression estimation; computer techniques and programs; discussion and comparison with parametric methods.",
            "id": "STAT 351",
            "parent": "STAT",
            "title": "INTRODUCTORY NONPARAMETRIC STATISTICS"
        }
    },
    {
        "data": {
            "description": "Distributions, measures of central tendency, dispersion and shape, the normal distribution; experiments to compare means, standard errors, confidence intervals; effects of departure from assumption; method of least squares, regression, correlation, assumptions and limitations; basic ideas of experimental design.",
            "id": "STAT 301",
            "parent": "STAT",
            "title": "INTRODUCTION TO STATISTICAL METHODS"
        }
    },
    {
        "data": {
            "description": "Economic problems of individuals, firms and industries with emphasis on value, price, and distribution of income.",
            "id": "ECON 101",
            "parent": "ECON",
            "title": "PRINCIPLES OF MICROECONOMICS"
        }
    },
    {
        "data": {
            "description": "Elements of probability, important discrete distributions, acceptance sampling by attributes, sample characteristics, probability distributions and population characteristics, the normal distribution, acceptance sampling plans based on sample means and variances, sampling from the normal, the central limit theorem, point and interval estimation.",
            "id": "STAT 311",
            "parent": "STAT",
            "title": "INTRODUCTION TO THEORY AND METHODS OF MATHEMATICAL STATISTICS I"
        }
    },
    {
        "data": {
            "description": "Empirical process methods in statistics; semiparametric models; stochastic convergence in metric spaces; Glivenko-Cantelli and Donsker theorems; entropy calculations; bootstrapped empirical processes; functional delta method; Z-estimators; M-estimators; rates of convergence; semiparametric efficiency; semiparametric estimating equations; nonparametric maximum likelihood.",
            "id": "STAT 834",
            "parent": "STAT",
            "title": "EMPIRICAL PROCESSES AND SEMIPARAMETRIC INFERENCE"
        }
    },
    {
        "data": {
            "description": "Enables students with outside internships to earn academic credit connected to their work experience related to the Computer Sciences or Data Science programs.",
            "id": "COMPSCI/STAT 403",
            "title": "INTERNSHIP COURSE IN COMP SCI AND DATA SCIENCE"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "Estimation, efficiency, Neyman-Pearson theory of hypothesis testing, confidence regions, decision theory, analysis of variance, and distribution of quadratic forms.",
            "id": "MATH/STAT 710",
            "title": "MATHEMATICAL STATISTICS"
        }
    },
    {
        "data": {
            "description": "Gain an understanding of fundamental elements of clinical trials (such as objectives, endpoints, surrogate endpoints, and statistical decisions) and statistical design considerations (such as randomization and blinding). Designs of clinical trials for Phase I, II, and III studies including single-arm, two-arm, and drug combination trials. Introduction to adaptive designs for precision medicine and master protocol designs such as umbrella trials and basket trials.",
            "id": "BMI/STAT 643",
            "title": "CLINICAL TRIAL DESIGN, IMPLEMENTATION, AND ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Independent research and writing for graduate students under the supervision of a faculty member.",
            "id": "STAT 990",
            "parent": "STAT",
            "title": "RESEARCH"
        }
    },
    {
        "data": {
            "description": "Integrated treatment of macroeconomics and microeconomics (seeECON 101andECON 102). Accelerated approach to economics training, especially for Economics: Math Emphasis majors.",
            "id": "ECON 111",
            "parent": "ECON",
            "title": "PRINCIPLES OF ECONOMICS-ACCELERATED TREATMENT"
        }
    },
    {
        "data": {
            "description": "Intended for biomedical researchers interested in the design and analysis of clinical trials. Topics include definition of hypotheses, measures of effectiveness, sample size, randomization, data collection and monitoring, and issues in statistical analysis.",
            "id": "BMI/STAT 542",
            "title": "INTRODUCTION TO CLINICAL TRIALS I"
        }
    },
    {
        "data": {
            "description": "Introduce key statistical methods and concepts for analyzing various medical images. Analyze publicly available and student/instructor supplied imaging data using the most up-to-date methods and tools.",
            "id": "BMI/STAT 768",
            "title": "STATISTICAL METHODS FOR MEDICAL IMAGE ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Introduce new algorithms that leverage randomization to address the scale, speed, and sensitivity needs of modern data science. Develop the mathematical foundations of such randomized algorithms. Criticize these algorithms through the lens of computational resource utilization. Implement these algorithms to address linear problems in data science.",
            "id": "STAT 772",
            "parent": "STAT",
            "title": "LINEAR RANDOMIZED ALGORITHMS FOR DATA SCIENCE"
        }
    },
    {
        "data": {
            "description": "Introduces optimization problems whose constraints are expressed by linear inequalities. Develops geometric and algebraic insights into the structure of the problem, with an emphasis on formal proofs. Presents the theory behind the simplex method, the main algorithm used to solve linear optimization problems. Explores duality theory and theorems of the alternatives.",
            "id": "COMPSCI/ISYE/MATH/STAT 525",
            "title": "LINEAR OPTIMIZATION"
        }
    },
    {
        "data": {
            "description": "Introduces reproducible data management, modeling, analysis, and statistical inference through a practical, hands-on case studies approach. Topics include the use of an integrated statistical computing environment, data wrangling, the R programming language, data graphics and visualization, random variables and concepts of probability including the binomial and normal distributions, data modeling, statistical inference in one- and two- sample settings for proportions and means, simple linear regression, and report generation using R Markdown with applications to a wide variety of data to address open-ended questions.",
            "id": "STAT 240",
            "parent": "STAT",
            "title": "DATA SCIENCE MODELING I"
        }
    },
    {
        "data": {
            "description": "Introduces the theory, methods, and computational procedures needed to perform advanced Bayesian data analyses. Predictive and decision-theoretic motivations including subjective probability, risk, admissibility, and exchangeability; highlights key components of Bayesian analysis (i.e., prior, likelihood, posterior, and predictive distributions) within standard parametric models and advanced hierarchical and multilevel models; demonstrates the iterative process of model specification, implementation, criticism, and revision with applied case studies; implements computational techniques (e.g., Markov chain Monte Carlo, variational inference) in modern probabilistic programming languages.",
            "id": "ECON/GENBUS/STAT 775",
            "title": "BAYESIAN STATISTICS"
        }
    },
    {
        "data": {
            "description": "Introduction to Data Science programming using Python.  No previous programming experience required.  Emphasis on analyzing real datasets in a variety of forms and visual communication.",
            "id": "COMPSCI 220",
            "parent": "COMPSCI",
            "title": "DATA SCIENCE PROGRAMMING I"
        }
    },
    {
        "data": {
            "description": "Introduction to algorithms and applications of classification and regression trees. Recursive partitioning, pruning, and cross-validation estimation of prediction error. Class priors and misclassification costs. Univariate and linear splits. Linear and kernel discriminant analysis and nearest-neighbor classification. Unbiased variable selection and importance scoring of variables. Least-squares, quantile, Poisson, logistic, and proportional hazards regression tree models. Tree ensembles. Subgroup identification of differential treatment effects. Multiple and longitudinal response variables. Missing values and multiple missing value codes.  Comparisons with neural networks, support vector machines, and other methods. Bootstrap calibration and post-selection inference. Applications to business, social science, engineering, biology, medicine, and other fields.",
            "id": "STAT 443",
            "parent": "STAT",
            "title": "CLASSIFICATION AND REGRESSION TREES"
        }
    },
    {
        "data": {
            "description": "Introduction to analysis of economic data. The techniques of descriptive statistics and statistical inference (hypothesis testing and estimation) as directed toward application in economic research.",
            "id": "ECON 310",
            "parent": "ECON",
            "title": "STATISTICS: MEASUREMENT IN ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Introduction to calculus of functions of several variables; calculus on parameterized curves, derivatives of functions of several variables, multiple integrals, vector calculus.",
            "id": "MATH 234",
            "parent": "MATH",
            "title": "CALCULUS--FUNCTIONS OF SEVERAL VARIABLES"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Introduction to measure theoretic probability; derivation and transformation of probability distributions; generating functions and characteristic functions; conditional expectation, sufficiency, and unbiased estimation; methods of large sample theory including laws of large numbers and central limit theorems; order statistics.",
            "id": "MATH/STAT 709",
            "title": "MATHEMATICAL STATISTICS"
        }
    },
    {
        "data": {
            "description": "Introduction to modern statistical practice in the life sciences, using the R programming language. Topics include: exploratory data analysis, probability and random variables; one-sample testing and confidence intervals, role of assumptions, sample size determination, two-sample inference; basic ideas in experimental design, analysis of variance, linear regression, goodness-of fit; biological applications.",
            "id": "STAT 371",
            "parent": "STAT",
            "title": "INTRODUCTORY APPLIED STATISTICS FOR THE LIFE SCIENCES"
        }
    },
    {
        "data": {
            "description": "Introduction to statistical design and analysis of experiments. Topics include: principles of randomization, blocking and replication, randomized blocking designs, Latin square designs, full factorial and fractional factorial designs and response surface methodology. Substantial focus will be devoted to engineering applications.",
            "id": "ME/STAT 424",
            "title": "STATISTICAL EXPERIMENTAL DESIGN"
        }
    },
    {
        "data": {
            "description": "Macroeconomic measurement and models of aggregate demand and supply; fiscal and monetary policy for unemployment, inflation, and growth.",
            "id": "ECON 102",
            "parent": "ECON",
            "title": "PRINCIPLES OF MACROECONOMICS"
        }
    },
    {
        "data": {
            "description": "Mathematical foundations of machine learning theory and algorithms. Probabilistic, algebraic, and geometric models and representations of data, mathematical analysis of state-of-the-art learning algorithms and optimization methods, and applications of machine learning. Knowledge of probability [such asMATH/​STAT  431orCOMP SCI/​E C E  561] and linear algebra [such asMATH 341orM E/​COMP SCI/​E C E  532] is required.",
            "id": "COMPSCI/ECE 761",
            "title": "MATHEMATICAL FOUNDATIONS OF MACHINE LEARNING"
        }
    },
    {
        "data": {
            "description": "Mentored individual study for students writing honors thesis, as arranged with a faculty member.",
            "id": "STAT 681",
            "parent": "STAT",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Mentored individual study for students writing honors thesis, as arranged with a faculty member.",
            "id": "STAT 682",
            "parent": "STAT",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Methods for analysis of case-control, cross sectional, and cohort studies. Covers epidemiologic study design, measures of association, rates, classical contingency table methods, and logistic and Poisson regression.",
            "id": "BMI/STAT 642",
            "title": "STATISTICAL METHODS FOR EPIDEMIOLOGY"
        }
    },
    {
        "data": {
            "description": "Pattern classification, regression analysis, clustering, and dimensionality reduction. For each category, covers fundamental algorithms and selections of contemporary, current state-of-the-art algorithms. Focus on evaluation of machine learning models using statistical methods. Statistical pattern classification approaches, including maximum likelihood estimation and Bayesian decision theory, algorithmic and nonparametric approaches. Practical use of machine learning algorithms using open source libraries from the Python programming ecosystem.",
            "id": "STAT 451",
            "parent": "STAT",
            "title": "INTRODUCTION TO MACHINE LEARNING AND STATISTICAL PATTERN CLASSIFICATION"
        }
    },
    {
        "data": {
            "description": "Perform Data Science as an iterative (back and forth) process of four different types of activities (data collection, data wrangling, data analysis, communication). Traverse through the five requisite stances (scientist, coder, mathematician, methodologist, skeptic). Develop and hone a broad set of computational tools in R (but not the broadest) and a broad set of statistical/machine learning tools (but not the broadest). Focus on doing these with agility to make the coding \"transparent\" and serve the large goals of the project.",
            "id": "STAT 433",
            "parent": "STAT",
            "title": "DATA SCIENCE WITH R"
        }
    },
    {
        "data": {
            "description": "Polynomial regression, multiple regression, two-way ANOVA with and without interaction, split-plot design, subsampling, analysis of covariance, elementary sampling, introduction to bioassay.",
            "id": "F&WECOL/STAT 572",
            "title": "STATISTICAL METHODS FOR BIOSCIENCE II"
        }
    },
    {
        "data": {
            "description": "Possible topics include martingales, weak convergence of measures, introduction to Brownian motion.",
            "id": "MATH/STAT 734",
            "title": "THEORY OF PROBABILITY II"
        }
    },
    {
        "data": {
            "description": "Probability and combinatorial methods, discrete and continuous, univariate and multivariate distributions, expected values, moments, normal distribution and derived distributions, estimation.",
            "id": "MATH/STAT 309",
            "title": "INTRODUCTION TO PROBABILITY AND MATHEMATICAL STATISTICS I"
        }
    },
    {
        "data": {
            "description": "Probability, random variables and their distributions, joint and conditional distributions, moments and inequalities, generating functions, transformations of random variables, sampling and distribution theory, convergence concepts and limit theorems for sequences of random variables.",
            "id": "STAT 611",
            "parent": "STAT",
            "title": "STATISTICAL MODELS FOR DATA SCIENCE"
        }
    },
    {
        "data": {
            "description": "Problems of enumeration, distribution, and arrangement. Inclusion-exclusion principle. Generating functions and linear recurrence relations. Combinatorial identities. Graph coloring problems. Finite designs. Systems of distinct representatives and matching problems in graphs. Potential applications in the social, biological, and physical sciences. Puzzles. Problem solving.",
            "id": "COMPSCI/MATH/STAT 475",
            "title": "INTRODUCTION TO COMBINATORICS"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Provides a comprehensive survey of statistical methods in human genetics research. Covered topics include linkage analysis, genome-wide association study, rare variant association analysis, meta-analysis, genome and variant annotation, heritability estimation, multi-trait modeling techniques, multi-omic data integration, and genetic risk prediction.",
            "id": "BMI/STAT 620",
            "title": "STATISTICS IN HUMAN GENETICS"
        }
    },
    {
        "data": {
            "description": "Provides a thorough grounding in modern statistical methods. Introduces statistical techniques and methods of data analysis, including data description, linear regression models, diagnostic tools, prediction and model selection, and experimental design.",
            "id": "STAT 613",
            "parent": "STAT",
            "title": "STATISTICAL METHODS FOR DATA SCIENCE"
        }
    },
    {
        "data": {
            "description": "Provides a thorough grounding in modern statistical methods. The specific learning outcomes for the course are to understand data collection in context (how/why data were collected, key questions under study); explore data by effective graphical and numerical summaries; understand probability concepts and models as tools for studying random phenomena and for statistical inference; analyze data using appropriate, modern statistical models, methods, and software; understand the statistical concepts underlying methods; develop the ability to interpret results and critically evaluate the methods used; communicate data analysis and key findings in context.",
            "id": "STAT 601",
            "parent": "STAT",
            "title": "STATISTICAL METHODS I"
        }
    },
    {
        "data": {
            "description": "Provides a thorough grounding in modern statistical methods. The specific learning outcomes for the course are to understand data collection in context (how/why data were collected, key questions under study); explore data by effective graphical and numerical summaries; understand probability concepts and models as tools for studying random phenomena and for statistical inference; analyze data using appropriate, modern statistical models, methods, and software; understand the statistical concepts underlying methods; develop the ability to interpret results and critically evaluate the methods used; communicate data analysis and key findings in context.",
            "id": "STAT 602",
            "parent": "STAT",
            "title": "STATISTICAL METHODS II"
        }
    },
    {
        "data": {
            "description": "Provides an understanding of and experience with turning statistics concepts into practice through data science practicums inspired by realistic projects. Combine theory and methods expertise with communications skills to translate from a vaguely stated project description and complex data set into a concisely summarized analysis, including both written and graphical interpretation that can be used by decision makers in an organization.",
            "id": "STAT 628",
            "parent": "STAT",
            "title": "DATA SCIENCE PRACTICUM"
        }
    },
    {
        "data": {
            "description": "Provides an understanding of the commonly used statistical language R. Learn to combine R with high performance computing tools to do scientific computing.",
            "id": "STAT 305",
            "parent": "STAT",
            "title": "R FOR STATISTICS III"
        }
    },
    {
        "data": {
            "description": "Provides an understanding of the commonly used statistical language R. Topics will include writing conditional expressions, loops, and functions; manipulating data matrices and arrays; extracting data from text; and making high level visualizations of data.",
            "id": "STAT 304",
            "parent": "STAT",
            "title": "R FOR STATISTICS II"
        }
    },
    {
        "data": {
            "description": "Quantum computation issues, including probability, statistics, sensing, information, machine learning, and applying data science to quantum information science.",
            "id": "STAT 780",
            "parent": "STAT",
            "title": "INTRODUCTION TO QUANTUM DATA SCIENCE"
        }
    },
    {
        "data": {
            "description": "Review of probability, random variables and vectors and their distributions, moments and inequalities, generating functions, transformations of random variables, sampling and distribution theory, convergence concepts for sequences of random variables, laws of large numbers, central limit and other limit theorems.",
            "id": "STAT 609",
            "parent": "STAT",
            "title": "MATHEMATICAL STATISTICS I"
        }
    },
    {
        "data": {
            "description": "Review of statistical convergence modes, M-estimation, and basics of Hilbert space. Introduction of how to derive the nuisance tangent space, its complement, and the corresponding efficient influence function, from the geometric perspective of semiparametric models. Introduction of how to estimate nuisance functions using machine learning methods, and their implementations in R and/or Python. Introduction of a variety of semiparametric models in missing data analysis, causal inference, dimension reduction, precision medicine, semi-supervised learning, transfer learning and domain adaptation.",
            "id": "BMI/STAT 828",
            "title": "SEMIPARAMETRIC METHODS IN DATA SCIENCE"
        }
    },
    {
        "data": {
            "description": "Special topics in statistics at the graduate level. Subject matter varies.",
            "id": "STAT 992",
            "parent": "STAT",
            "title": "SEMINAR"
        }
    },
    {
        "data": {
            "description": "Special topics of interest in undergraduate students.",
            "id": "STAT 479",
            "parent": "STAT",
            "title": "SPECIAL TOPICS IN STATISTICS"
        }
    },
    {
        "data": {
            "description": "Statistical and computational methods in statistical genomics for human and experimental populations. Review methods for quality control, experimental design, clustering, network analysis, and other downstream analysis of next-generation sequencing studies along with methods for genome wide association studies.",
            "id": "BMI/STAT 877",
            "title": "STATISTICAL METHODS FOR MOLECULAR BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Statistical function estimation and classification; reproducing kernel machines, support vector machines; high dimensional model selection and estimation; Bayesian, empirical Bayesian interpretation of nonparametric learning methods; log density ANOVA and graphical models; tree ensemble methods including bagging, boosting, and random forest.",
            "id": "STAT 841",
            "parent": "STAT",
            "title": "NONPARAMETRIC STATISTICS AND MACHINE LEARNING METHODS"
        }
    },
    {
        "data": {
            "description": "Statistical issues in the design of clinical trials, basic survival analysis, data collection and sequential monitoring.",
            "id": "BMI/STAT 641",
            "title": "STATISTICAL METHODS FOR CLINICAL TRIALS"
        }
    },
    {
        "data": {
            "description": "Statistical methods used in applied economic research. Topics include: survey methods and data sources; multiple regression and analysis of variance; econometric estimation; forecasting and policy applications.",
            "id": "ECON 410",
            "parent": "ECON",
            "title": "INTRODUCTORY ECONOMETRICS"
        }
    },
    {
        "data": {
            "description": "Statistical models, methods and theory for parameter estimation, Bayesian approach to parameter estimation, methods and theory for hypothesis tests, confidence sets, two-sample testing and ANOVA, categorical data analysis, linear regression.",
            "id": "STAT 612",
            "parent": "STAT",
            "title": "STATISTICAL INFERENCE FOR DATA SCIENCE"
        }
    },
    {
        "data": {
            "description": "Statistical procedures valid under unrestrictive assumptions; sign test; confidence intervals; efficiency comparisons; signed rank procedures; Walsh sums; point estimators; two sample rank tests; zeros, ties, and other problems of discrete data; order statistics; Winsorized and truncated point estimators and connection with gross error models; permutation procedures; combinatorial problems, and computer applications.",
            "id": "STAT 809",
            "parent": "STAT",
            "title": "NON PARAMETRIC STATISTICS"
        }
    },
    {
        "data": {
            "description": "Statistical theory and methodology for modern financial data. Topics include financial stochastic models based on time series and stochastic calculus, modern statistical inference, and statistical learning for financial data as well as their applications to financial problems.",
            "id": "STAT 801",
            "parent": "STAT",
            "title": "ADVANCED FINANCIAL STATISTICS"
        }
    },
    {
        "data": {
            "description": "Stochastic models and statistical methodologies are widely employed in modern finance. The models and their inferences are very important for academic research and financial practices. Financial stochastic models and their statistical inferences with applications to volatility analysis and risk management, introduction to discrete models such as binomial trees and GARCH and stochastic volatility models as well as simple continuous models like the Black-Scholes model. The focus will be on statistical inference, data analysis and risk management regarding these models.",
            "id": "STAT 461",
            "parent": "STAT",
            "title": "FINANCIAL STATISTICS"
        }
    },
    {
        "data": {
            "description": "Stochastic modes of convergence. Asymptotic theory of normed sums of random variables with applications to asymptotic normality of estimators. Methods for deriving limit distributions of nonlinear statistics. Asymptotic relative efficiencies. Asymptotic confidence regions and tests of hypotheses. Models of non-identically distributed or dependent random variables.",
            "id": "STAT 732",
            "parent": "STAT",
            "title": "LARGE SAMPLE THEORY OF STATISTICAL INFERENCE"
        }
    },
    {
        "data": {
            "description": "Summary of matrix algebra required, theory of estimable functions, incomplete blocks, balanced incomplete block designs, partially balanced incomplete block designs.",
            "id": "MATH/STAT 803",
            "title": "EXPERIMENTAL DESIGN I"
        }
    },
    {
        "data": {
            "description": "Teaches how to explore, model, and analyze data using R. Topics include basic probability models; the central limit theorem; Monte Carlo simulation; one- and two-sample hypothesis testing; Bayesian inference; linear and logistic regression; ANOVA; the bootstrap; random forests and cross-validation. Features the analysis of real-world data sets and the communication of findings in a clear and reproducible manner within a project setting.",
            "id": "STAT 340",
            "parent": "STAT",
            "title": "DATA SCIENCE MODELING II"
        }
    },
    {
        "data": {
            "description": "Techniques for visualization within data science workflows. Topics include data preparation; exploratory data analysis; spatial, tabular, and graph structured data; dimensionality reduction; model visualization and interpretability; interactive queries and navigation.",
            "id": "STAT 436",
            "parent": "STAT",
            "title": "STATISTICAL DATA VISUALIZATION"
        }
    },
    {
        "data": {
            "description": "Techniques of integration, improper integrals, first order ordinary differential equations, sequences and series, Taylor series, vector geometry in two and three dimensions.",
            "id": "MATH 222",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 2"
        }
    },
    {
        "data": {
            "description": "The design of statistical software including special techniques for probability distributions, methods of simulation of random processes, numerical methods for linear models and multivariate analysis, and methods for nonlinear models.",
            "id": "STAT 771",
            "parent": "STAT",
            "title": "STATISTICAL COMPUTING"
        }
    },
    {
        "data": {
            "description": "The development of a variety of mathematical theories and statistical concepts (1) to understand the properties of those models and methods used for the purpose of prediction from data or decision making from data, and (2) to criticize such models, methods and their consequences. Specifically, the theories and tools that will be developed will include complexity theory, Hilbert spaces, Gaussian processes, Variational Analysis, and concentration inequalities.",
            "id": "STAT 615",
            "parent": "STAT",
            "title": "STATISTICAL LEARNING"
        }
    },
    {
        "data": {
            "description": "The development of tools necessary for collecting, managing, and analyzing large data sets. Examples of techniques and programs used include Linux, R, distributed computing, text editor(s), git/github, and other related tools. Work in teams to research, develop, write, and make presentations related to a variety of data analysis projects.",
            "id": "STAT 405",
            "parent": "STAT",
            "title": "DATA SCIENCE COMPUTING PROJECT"
        }
    },
    {
        "data": {
            "description": "The development of tools necessary for collecting, managing, and analyzing large data sets. Examples of techniques and programs utilized include Linux, R, distributed computing, powerful editor(s), git/github, and other related tools. Work in the class will be done in teams to research, develop, write, and make presentations related to a variety of data analysis projects.",
            "id": "STAT 605",
            "parent": "STAT",
            "title": "DATA SCIENCE COMPUTING PROJECT"
        }
    },
    {
        "data": {
            "description": "The real numbers, elements of set theory, metric spaces and basic topology, sequences and series, limits, continuity, differentiation, integration, sequences and series of functions, uniform convergence.",
            "id": "MATH 521",
            "parent": "MATH",
            "title": "ANALYSIS I"
        }
    },
    {
        "data": {
            "description": "The theory of linear algebra with an introduction to proofs and proof writing. Topics include vector spaces, linear dependence, span, basis, linear transformations, kernel, image, inner products and inner product spaces, geometry, eigenvalues, eigenvectors, standard matrix factorizations. Other content includes basic set theory, logical operations, quantifiers, direct and indirect arguments, and induction. Differential equations [MATH 320] not covered.",
            "id": "MATH 341",
            "parent": "MATH",
            "title": "LINEAR ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Theory and algorithms for nonlinear optimization, focusing on unconstrained optimization. Line-search and trust-region methods; quasi-Newton methods; conjugate-gradient and limited-memory methods for large-scale problems; derivative-free optimization; algorithms for least-squares problems and nonlinear equations; gradient projection algorithms for bound-constrained problems; and simple penalty methods for nonlinearly constrained optimization. Students are strongly encouraged to have knowledge of linear algebra and familiarity with basic mathematical analysis.",
            "id": "COMPSCI/ISYE/MATH/STAT 726",
            "title": "NONLINEAR OPTIMIZATION I"
        }
    },
    {
        "data": {
            "description": "Theory and application of discrete time series models illustrated with forecasting problems. Principles of iterative model building. Representation of dynamic relations by difference equations. Autoregressive integrated Moving Average models. Identification, fitting, diagnostic checking of models. Seasonal model application to forecasting in business, economics, ecology, and engineering used at each stage, which the student analyzes using computer programs which have been specially written and extensively tested.",
            "id": "STAT 701",
            "parent": "STAT",
            "title": "APPLIED TIME SERIES ANALYSIS, FORECASTING AND CONTROL I"
        }
    },
    {
        "data": {
            "description": "Theory and applications of multivariate statistical methods. Basic concepts and statistical reasoning which underlie the techniques of multivariate analysis. Ideas rather than derivations stressed although basic models discussed to give the student some feeling for their adequacy in particular situations. Acquaintance with and use of existing computer programs in the multivariate analysis area.",
            "id": "STAT 456",
            "parent": "STAT",
            "title": "APPLIED MULTIVARIATE ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Theory and applications of the general linear model; graphical methods; simultaneous inference; regression diagnostics; analysis of variance of fixed, random and mixed effects models; ANCOVA: violations of assumptions.",
            "id": "STAT 849",
            "parent": "STAT",
            "title": "THEORY AND APPLICATION OF REGRESSION AND ANALYSIS OF VARIANCE I"
        }
    },
    {
        "data": {
            "description": "Theory and applications of the general linear model; graphical methods; simultaneous inference; regression diagnostics; analysis of variance of fixed, random and mixed effects models; ANCOVA: violations of assumptions.",
            "id": "STAT 850",
            "parent": "STAT",
            "title": "THEORY AND APPLICATION OF REGRESSION AND ANALYSIS OF VARIANCE II"
        }
    },
    {
        "data": {
            "description": "Theory and methods of fundamental statistical models for the analysis of longitudinal data, including repeated measures analysis of variance, linear mixed models, generalized linear mixed models, and generalized estimating equations. Introduction of how to implement these methods in statistical softwares such as in R and/or SAS, within the context of appropriate statistical models and carry out and interpret analyses.",
            "id": "BMI/STAT 727",
            "title": "THEORY AND METHODS OF LONGITUDINAL DATA ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Theory and practice of analytic methods for censored survival data, including nonparametric and parametric methods, the proportional hazards regression model, and a review of current topics in survival analysis.",
            "id": "BMI/STAT 741",
            "title": "SURVIVAL ANALYSIS THEORY AND METHODS"
        }
    },
    {
        "data": {
            "description": "Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Part of a 2-semester sequence withMATH 217; these two courses together are equivalent toMATH 114and221.",
            "id": "MATH 171",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY I"
        }
    },
    {
        "data": {
            "description": "Topics in multi-variable calculus and introduction to differential equations.",
            "id": "MATH 376",
            "parent": "MATH",
            "title": "TOPICS IN MULTI-VARIABLE CALCULUS AND DIFFERENTIAL EQUATIONS"
        }
    },
    {
        "data": {
            "description": "Topics include discrete-time Markov chains, Poisson point processes, continuous-time Markov chains, and renewal processes. Applications to queueing, branching, and other models in science, engineering and business.",
            "id": "ISYE/MATH/OTM/STAT 632",
            "title": "INTRODUCTION TO STOCHASTIC PROCESSES"
        }
    },
    {
        "data": {
            "description": "Tree construction, including finding splits, tree-pruning and error estimation. Categorical predictor variables, missing or censored data, prior class-probabilities, and unequal misclassification costs. Selection bias. Comparison with other statistics and machine-learning methods. Extensions to piecewise linear and non-least squares regression models.",
            "id": "STAT 761",
            "parent": "STAT",
            "title": "DECISION TREES FOR MULTIVARIATE ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Unbiased estimation, maximum likelihood estimation, confidence intervals, tests of hypotheses, Neyman-Pearson lemma, likelihood ratio test, regression, analysis of variance with applications.",
            "id": "STAT 312",
            "parent": "STAT",
            "title": "INTRODUCTION TO THEORY AND METHODS OF MATHEMATICAL STATISTICS II"
        }
    },
    {
        "data": {
            "description": "Vector spaces and linear transformations, differential calculus of scalar and vector fields, determinants, eigenvalues and eigenvectors, multiple integrals, line integrals, and surface integrals. Freshmen students are invited to enroll by the Department of Mathematics.",
            "id": "MATH 375",
            "parent": "MATH",
            "title": "TOPICS IN MULTI-VARIABLE CALCULUS AND LINEAR ALGEBRA"
        }
    },
    {
        "data": {
            "id": "COMPSCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ECON",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "STAT",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "BMI/POPHLTH 551",
            "target": "BMI/STAT 541"
        }
    },
    {
        "data": {
            "source": "BMI/STAT 541",
            "target": "BMI/STAT 542"
        }
    },
    {
        "data": {
            "source": "BMI/STAT 641",
            "target": "BMI/STAT 643"
        }
    },
    {
        "data": {
            "source": "COMPSCI 220",
            "target": "STAT 405"
        }
    },
    {
        "data": {
            "source": "COMPSCI/ECE 761",
            "target": "COMPSCI/ECE/STAT 861"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON 102"
        }
    },
    {
        "data": {
            "source": "ECON 102",
            "target": "ECON 310"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON 101"
        }
    },
    {
        "data": {
            "source": "ECON 310",
            "target": "ECON 410"
        }
    },
    {
        "data": {
            "source": "ECON 310",
            "target": "STAT 333"
        }
    },
    {
        "data": {
            "source": "ECON 410",
            "target": "STAT 461"
        }
    },
    {
        "data": {
            "source": "F&WECOL/STAT 571",
            "target": "F&WECOL/STAT 572"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 113"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 113",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "MATH 217"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "ECON 310"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "STAT 324"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "source": "MATH 217",
            "target": "STAT 340"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "ECON 111"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "ECON 410"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 222"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 234"
        }
    },
    {
        "data": {
            "source": "MATH 222",
            "target": "MATH 320"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "MATH 341"
        }
    },
    {
        "data": {
            "source": "MATH 234",
            "target": "MATH 421"
        }
    },
    {
        "data": {
            "source": "MATH 320",
            "target": "STAT 453"
        }
    },
    {
        "data": {
            "source": "MATH 341",
            "target": "COMPSCI/ISYE/MATH/STAT 525"
        }
    },
    {
        "data": {
            "source": "MATH 341",
            "target": "COMPSCI/MATH/STAT 475"
        }
    },
    {
        "data": {
            "source": "MATH 341",
            "target": "STAT 433"
        }
    },
    {
        "data": {
            "source": "MATH 375",
            "target": "MATH 376"
        }
    },
    {
        "data": {
            "source": "MATH 375",
            "target": "STAT 451"
        }
    },
    {
        "data": {
            "source": "MATH 375",
            "target": "STAT 456"
        }
    },
    {
        "data": {
            "source": "MATH 375",
            "target": "STAT 575"
        }
    },
    {
        "data": {
            "source": "MATH 376",
            "target": "MATH/STAT 309"
        }
    },
    {
        "data": {
            "source": "MATH 376",
            "target": "MATH/STAT 431"
        }
    },
    {
        "data": {
            "source": "MATH 376",
            "target": "STAT 311"
        }
    },
    {
        "data": {
            "source": "MATH 421",
            "target": "MATH 521"
        }
    },
    {
        "data": {
            "source": "MATH 521",
            "target": "MATH 531"
        }
    },
    {
        "data": {
            "source": "MATH 531",
            "target": "ISYE/MATH/OTM/STAT 632"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "MATH/STAT 309",
            "target": "ISYE/MATH/OTM/STAT 632"
        }
    },
    {
        "data": {
            "source": "MATH/STAT 309",
            "target": "MATH/STAT 310"
        }
    },
    {
        "data": {
            "source": "MATH/STAT 310",
            "target": "BMI/STAT 641"
        }
    },
    {
        "data": {
            "source": "MATH/STAT 310",
            "target": "BMI/STAT 642"
        }
    },
    {
        "data": {
            "source": "MATH/STAT 310",
            "target": "COMPSCI/STAT 471"
        }
    },
    {
        "data": {
            "source": "MATH/STAT 431",
            "target": "STAT 461"
        }
    },
    {
        "data": {
            "source": "MATH/STAT 709",
            "target": "MATH/STAT 710"
        }
    },
    {
        "data": {
            "source": "MATH/STAT 710",
            "target": "STAT 760"
        }
    },
    {
        "data": {
            "source": "STAT 240",
            "target": "STAT 303"
        }
    },
    {
        "data": {
            "source": "STAT 240",
            "target": "STAT 340"
        }
    },
    {
        "data": {
            "source": "STAT 240",
            "target": "STAT 405"
        }
    },
    {
        "data": {
            "source": "STAT 240",
            "target": "STAT 436"
        }
    },
    {
        "data": {
            "source": "STAT 301",
            "target": "MATH/STAT 310"
        }
    },
    {
        "data": {
            "source": "STAT 303",
            "target": "STAT 304"
        }
    },
    {
        "data": {
            "source": "STAT 303",
            "target": "STAT 333"
        }
    },
    {
        "data": {
            "source": "STAT 304",
            "target": "STAT 305"
        }
    },
    {
        "data": {
            "source": "STAT 311",
            "target": "STAT 312"
        }
    },
    {
        "data": {
            "source": "STAT 324",
            "target": "ME/STAT 424"
        }
    },
    {
        "data": {
            "source": "STAT 324",
            "target": "STAT 301"
        }
    },
    {
        "data": {
            "source": "STAT 333",
            "target": "STAT 349"
        }
    },
    {
        "data": {
            "source": "STAT 333",
            "target": "STAT 351"
        }
    },
    {
        "data": {
            "source": "STAT 333",
            "target": "STAT 421"
        }
    },
    {
        "data": {
            "source": "STAT 333",
            "target": "STAT 443"
        }
    },
    {
        "data": {
            "source": "STAT 333",
            "target": "STAT 456"
        }
    },
    {
        "data": {
            "source": "STAT 340",
            "target": "BMI/STAT 620"
        }
    },
    {
        "data": {
            "source": "STAT 340",
            "target": "COMPSCI/STAT 471"
        }
    },
    {
        "data": {
            "source": "STAT 340",
            "target": "STAT 411"
        }
    },
    {
        "data": {
            "source": "STAT 340",
            "target": "STAT 433"
        }
    },
    {
        "data": {
            "source": "STAT 340",
            "target": "STAT 575"
        }
    },
    {
        "data": {
            "source": "STAT 601",
            "target": "STAT 602"
        }
    },
    {
        "data": {
            "source": "STAT 610",
            "target": "BMI/STAT 727"
        }
    },
    {
        "data": {
            "source": "STAT 610",
            "target": "ECON/GENBUS/STAT 775"
        }
    },
    {
        "data": {
            "source": "STAT 610",
            "target": "STAT 732"
        }
    },
    {
        "data": {
            "source": "STAT 610",
            "target": "STAT 809"
        }
    },
    {
        "data": {
            "source": "STAT 610",
            "target": "STAT 834"
        }
    },
    {
        "data": {
            "source": "STAT 610",
            "target": "STAT 841"
        }
    },
    {
        "data": {
            "source": "STAT 611",
            "target": "STAT 612"
        }
    },
    {
        "data": {
            "source": "STAT 611",
            "target": "STAT 780"
        }
    },
    {
        "data": {
            "source": "STAT 612",
            "target": "STAT 780"
        }
    },
    {
        "data": {
            "source": "STAT 701",
            "target": "STAT 801"
        }
    },
    {
        "data": {
            "source": "STAT 849",
            "target": "STAT 850"
        }
    }
]