[
    {
        "data": {
            "description": "Independent study as arranged with a faculty member. Topics, readings, assignments and  meetings will be outlined in a student-faculty \"contract.\"",
            "id": "STS 999",
            "parent": "STS",
            "title": "INDEPENDENT STUDY IN SCIENCE AND TECHNOLOGY STUDIES"
        }
    },
    {
        "data": {
            "description": "An overview of science and technology studies. Explores science and technology as central institutions in modern societies. Teaches approaches to analyzing social dimensions of recent advances in areas such as genetics, environment, Internet, surveillance, and nanotechnology..",
            "id": "STS 201",
            "parent": "STS",
            "title": "WHERE SCIENCE MEETS SOCIETY"
        }
    },
    {
        "data": {
            "id": "STS",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Key themes, issues and scholarship in the interdisciplinary fields of science and technology studies. Explores how different disciplinary perspectives contribute to and influence the questions, methods and theoretical approaches within particular fields of science studies.",
            "id": "STS 901",
            "parent": "STS",
            "title": "SCIENCE, TECHNOLOGY AND MEDICINE IN SOCIETY"
        }
    },
    {
        "data": {
            "description": "Key themes, issues and scholarship in the interdisciplinary field of science and technology studies (STS). Participating faculty and speakers will be drawn from the social sciences, humanities, and physical and life sciences.",
            "id": "STS 902",
            "parent": "STS",
            "title": "CURRENT TOPICS IN SCIENCE AND TECNOLOGY STUDIES"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Examines the influence of science in everyday life. Provides both academic context (research and theory) and a firsthand look at how science matters to people who are not themselves scientists.",
            "id": "CURRIC/STS 733",
            "title": "PUBLIC ENGAGEMENT WITH SCIENCE"
        }
    },
    {
        "data": {
            "description": "An interdisciplinary exploration of one or more high profile issues motivated debate and discussion among science and technology studies scholars.",
            "id": "STS 903",
            "parent": "STS",
            "title": "SPECIAL TOPICS IN SCIENCE AND TECHNOLOGY STUDIES"
        }
    },
    {
        "data": {
            "description": "Examination of the key ideas from the field of science and technology studies (history, philosophy, sociology of science, etc.) and how they have been taken up in both the school science curriculum as well as the science education research community.",
            "id": "CURRIC/STS 734",
            "title": "SCIENCE STUDIES AND SCIENCE EDUCATION"
        }
    },
    {
        "data": {
            "description": "Advanced directed study projects as arranged with a faculty member. Requires completion ofSTS 201.",
            "id": "STS 699",
            "parent": "STS",
            "title": "DIRECTED STUDY"
        }
    }
]