[
    {
        "data": {
            "description": "Develop clinical knowledge and skills necessary to care for patients in Pediatrics and Obstetrics and Gynecology, with emphasis on unique skills such as taking care of vulnerable populations as identified in women's and child health and working with caregivers in addition to the patient themselves. Increase knowledge of fundamental science concepts introduced in Human Family Tree during Phase 1 of the curriculum, such as embryology and teratology, genetic testing, and neurodevelopment. Clinical experiences will occur in a range of representative inpatient, outpatient and surgical settings. In structured educational sessions, compare and contrast selected topics in pediatric, obstetric, and gynecologic patient populations, highlighting the relevant physiology, pathophysiology, basic science, and public health topics.",
            "id": "MEDSC-M 810",
            "parent": "MEDSC-M",
            "title": "SPECIALIZED CARE OF OBSTETRIC, GYNECOLOGIC, AND PEDIATRIC PATIENTS (SCOPE)"
        }
    },
    {
        "data": {
            "description": "Direct supervision by Cardiothoracic fellows and attending physicians. Participate in regularly scheduled supervisor-student meetings, which involve some or all of the following: rounding on service patients, participating in scheduled operative procedures, presenting cases and teaching topics, and discussing patient cases. Complete independent activities including some or all of the following: reading about patient conditions and preparing for direct patient care as needed. Attend conferences associated with the assigned general surgery service. Complete other patient care related learning activities as assigned by instructors; these are dependent on the individual student, the patients under the student's care, and the location.",
            "id": "SURGERY 963",
            "parent": "SURGERY",
            "title": "CARDIOTHORACIC SURGERY ELECTIVE"
        }
    },
    {
        "data": {
            "description": "Direct supervision by General Surgery senior residents, fellows, and attending physicians. Participate in regularly scheduled supervisor-student meetings, which involve some or all of the following: rounding on service patients, participating in scheduled operative procedures, presenting cases and teaching topics, and discussing patient cases. Complete independent activities including some or all of the following: reading about patient conditions and preparing for direct patient care as needed. Attend conferences associated with the assigned general surgery service. Complete other patient care related learning activities as assigned by instructors; these are dependent on the individual student, the patients under the student's care, and the location.",
            "id": "SURGERY 920",
            "parent": "SURGERY",
            "title": "GENERAL SURGERY ELECTIVE"
        }
    },
    {
        "data": {
            "description": "Direct supervision by General Surgery senior residents, fellows, and attending physicians. Participate in regularly scheduled supervisor-student meetings, which involve some or all of the following: rounding on service patients, participating in scheduled operative procedures, presenting cases and teaching topics, and discussing patient cases. Complete independent activities including some or all of the following: reading about patient conditions and preparing for direct patient care as needed. Attend conferences associated with the assigned general surgery service. Complete other patient care related learning activities as assigned by instructors; these are dependent on the individual student, the patients under the student's care, and the location.",
            "id": "SURGERY 962",
            "parent": "SURGERY",
            "title": "SURGICAL CRITICAL CARE ELECTIVE"
        }
    },
    {
        "data": {
            "description": "Direct supervision by Otolaryngology senior residents, fellows, and attending physicians. Participate in regularly scheduled supervisor-student meetings, which involve some or all of the following: rounding on service patients, participating in scheduled operative procedures, presenting cases and teaching topics, and discussing patient cases. Complete independent activities including some or all of the following: reading about patient conditions and preparing for direct patient care as needed. Attend conferences associated with the assigned general surgery service. Complete other patient care related learning activities as assigned by instructors; these are dependent on the individual student, the patients under the student's care, and the location.",
            "id": "SURGERY 948",
            "parent": "SURGERY",
            "title": "OTOLARYNGOLOGY ELECTIVE"
        }
    },
    {
        "data": {
            "description": "Direct supervision by Peripheral Vascular Surgery senior residents, fellows, and attending physicians. Participate in regularly scheduled supervisor-student meetings, which involve some or all of the following: rounding on service patients, participating in scheduled operative procedures, presenting cases and teaching topics, and discussing patient cases. Complete independent activities including some or all of the following: reading about patient conditions and preparing for direct patient care as needed. Attend conferences associated with the assigned general surgery service. Complete other patient care related learning activities as assigned by instructors; these are dependent on the individual student, the patients under the student's care, and the location.",
            "id": "SURGERY 954",
            "parent": "SURGERY",
            "title": "PERIPHERAL VASCULAR ELECTIVE"
        }
    },
    {
        "data": {
            "description": "Direct supervision by Plastic Surgery senior residents and attending physicians. Participate in regularly scheduled supervisor-student meetings, which involve some or all of the following: rounding on service patients, participating in scheduled operative procedures, presenting cases and teaching topics, and discussing patient cases. Complete independent activities including some or all of the following: reading about patient conditions and preparing for direct patient care as needed. Attend conferences associated with the assigned general surgery service. Complete other patient care related learning activities as assigned by instructors; these are dependent on the individual student, the patients under the student's care, and the location.",
            "id": "SURGERY 956",
            "parent": "SURGERY",
            "title": "PLASTIC AND RECONSTRUCTIVE SURGERY ELECTIVE"
        }
    },
    {
        "data": {
            "description": "Direct supervision by Transplant fellows and attending physicians. Participate in regularly scheduled supervisor-student meetings, which involve some or all of the following: rounding on service patients, participating in scheduled operative procedures, presenting cases and teaching topics, and discussing patient cases. Complete independent activities including some or all of the following: reading about patient conditions and preparing for direct patient care as needed. Attend conferences associated with the assigned general surgery service. Complete other patient care related learning activities as assigned by instructors; these are dependent on the individual student, the patients under the student's care, and the location.",
            "id": "SURGERY 960",
            "parent": "SURGERY",
            "title": "TRANSPLANTATION ELECTIVE"
        }
    },
    {
        "data": {
            "description": "Direct supervision by Urology residents, fellows, and attending physicians. Participate in regularly scheduled supervisor-student meetings, which involve some or all of the following: rounding on service patients, participating in scheduled operative procedures, presenting cases and teaching topics, and discussing patient cases. Complete independent activities including some or all of the following: reading about patient conditions and preparing for direct patient care as needed. Attend conferences associated with the assigned Urology service. Complete other patient care related learning activities as assigned by instructors; these are dependent on the individual student, the patients under the student's care, and the location.",
            "id": "SURGERY 967",
            "parent": "SURGERY",
            "title": "UROLOGY ELECTIVE"
        }
    },
    {
        "data": {
            "description": "Direct supervision by community orthopedic senior residents, fellows, and attending physicians. Participate in regularly scheduled supervisor-student meetings, which involve some or all of the following: rounding on service patients, participating in scheduled operative procedures, presenting cases and teaching topics, and discussing patient cases. Complete independent activities including some or all of the following: reading about patient conditions and preparing for direct patient care as needed. Attend conferences associated with the assigned general surgery service. Complete other patient care related learning activities as assigned by instructors; these are dependent on the individual student, the patients under the student's care, and the location.",
            "id": "SURGERY 940",
            "parent": "SURGERY",
            "title": "ADULT ORTHOPEDICS FOR THE NON-ORTHOPEDIST ELECTIVE"
        }
    },
    {
        "data": {
            "description": "Direct supervision by orthopedic Surgery senior residents, fellows, and attending physicians. Participate in regularly scheduled supervisor-student meetings, which involve some or all of the following: rounding on service patients, participating in scheduled operative procedures, presenting cases and teaching topics, and discussing patient cases. Complete independent activities including some or all of the following: reading about patient conditions and preparing for direct patient care as needed. Present a case of interest based on involvement in and a brief literature review on the treatment or condition. Complete other patient care related learning activities as assigned by instructors; these are dependent on the individual student, the patients under the student's care, and the location.",
            "id": "SURGERY 939",
            "parent": "SURGERY",
            "title": "ADULT ORTHOPEDICS FOR THE FUTURE ORTHOPEDIST ELECTIVE"
        }
    },
    {
        "data": {
            "description": "Explore the reasons behind failure of colorectal cancer screening programs. Learn the standard of care for prevention, diagnosis, and treatment of colorectal cancer. Focus on all facets of the disease, with active engagement in dialogue to improve screening programs for colorectal cancer. Learn to identify methods to improve medical care and population health. Explore background studies to integrate emerging information on individual's biologic and genetic risk with population-level factors when deciding upon prevention and treatment options. Work with the various members of the healthcare team involved in treating colorectal cancer and educate the public on the importance of colorectal cancer screening.",
            "id": "SURGERY 975",
            "parent": "SURGERY",
            "title": "MULTIDISCIPLINARY APPROACHES TO COLON CANCER PREVENTION/TREATMENT"
        }
    },
    {
        "data": {
            "description": "Focus on assessing patients with urgent medical conditions, providing acute inpatient care, and transitioning patients to other care settings or home under the care of other professionals. Provide acute care in inpatient and outpatient urgent care settings as well as on the inpatient wards, and develop acute management plans and subsequent transition of care plans. Clinical experiences in acute care settings such as the emergency department and inpatient medicine (both general and subspecialty), psychiatry, and neurology. Builds upon fundamental science concepts introduced in Body in Balance and Mind and Motion, including Ohm's Law, acid-base balance, and volume regulation. Organ system-based approach employing varied modalities. Complete an integrated patient-centered experience by participating in the care of a patient from an urgent admission through inpatient treatment and discharge.",
            "id": "MEDSC-M 812",
            "parent": "MEDSC-M",
            "title": "ACUTE CARE"
        }
    },
    {
        "data": {
            "description": "An in-depth understanding of the key concepts of value, quality and safety is critical to the education of future physicians. The majority of adverse events experienced by hospitalized patients occur in surgery. Surgery offers the ideal setting to explore these three components critical to improving the US healthcare system. Examine factors that influence the care we provide and critically consider the value of this care. Observe efforts to improve value in surgery focusing on quality, safety and appropriate utilization of critical resources and consider areas for improvement. Follow patients in all processes of care from clinic, to the operating room, through their postoperative course, to discharge, and consider how important measures to secure safety and quality are encountered and impact care in the clinical arena. Consider price and allocation of scarce resources. Gather information for their analysis of the patient experience.",
            "id": "SURGERY 973",
            "parent": "SURGERY",
            "title": "OPTIMIZING VALUE, QUALITY AND SAFETY IN HEALTHCARE"
        }
    },
    {
        "data": {
            "description": "An overview of how concepts of sex, gender, and sexuality in society and medicine impact medical care and lived experience for patients who are LGBQ, transgender, gender-diverse and/or have variations in sex characteristics (VSC). Topics include shared decision-making, allyship, trauma-informed care, gender-affirming care, and unique health disparities in patients who are LGBQ, transgender, gender-diverse and/or those with VSC. Gain insight into patient experience of medical care through patient-centered shadowing/observer opportunities.",
            "id": "SURGERY 980",
            "parent": "SURGERY",
            "title": "SEX, GENDER, AND SEXUALITY HEALTH EQUITY"
        }
    },
    {
        "data": {
            "description": "Care for hospitalized patients on general surgery or surgical specialty services. Admit new patients, round on previously admitted patients, participate in multidisciplinary rounds, and work to transition patients to the next level of care. Evaluate and manage patient with both common inpatient conditions and medically complex patients requiring collaboration with consulting specialties. Direct supervision by house staff and attending physicians. Participate in regularly scheduled supervisor-student meetings, which involve some or all of the following: rounding on service patients, participating in scheduled operative procedures, presenting cases and teaching topics, and discussing patient cases. Complete independent activities including some or all of the following: reading about patient conditions and preparing for direct patient care as needed. Complete other patient care related learning activities as assigned by instructors.",
            "id": "SURGERY 919",
            "parent": "SURGERY",
            "title": "INDIVIDUALIZED PHASE 3 CLINICAL ELECTIVE IN SURGERY"
        }
    },
    {
        "data": {
            "description": "Care of adults and children undergoing an operation or procedure, including perioperative preparation, operative care, and post-operative cares for core clinical conditions in the specialties of anesthesia, neurosurgery, ophthalmology, general surgery, otolaryngology, urology, cardiothoracic surgery, peripheral vascular surgery, orthopedics, plastic and reconstructive surgery, and gynecology, as well as interventional radiology, procedural cardiology and gastroenterology. Basic science concepts include cerebral spinal fluid production and flow, fluids and electrolytes, consciousness, inflammation and wound healing, and cancer biology. Anatomic approach using case discussions, podcasts, curated independent reading, online nationally supported modules, and simulation skills. Longitudinal patient care experience integrating communication, evidence based medicine, health information technology, quality improvement  patient safety, professionalism, scientific inquiry, and public health.",
            "id": "MEDSC-M 813",
            "parent": "MEDSC-M",
            "title": "SURGICAL AND PROCEDURAL CARE"
        }
    },
    {
        "data": {
            "description": "Clinical elective for fourth year medical students.",
            "id": "SURGERY 944",
            "parent": "SURGERY",
            "title": "UPPER EXTREMITY ORTHOPAEDIC CLERKSHIP-MARSHFIELD CLINIC"
        }
    },
    {
        "data": {
            "description": "Develop knowledge of how people learn, adult learning principles, and how these apply to medicine. Learn and practice effective interpersonal communication techniques. Reflect on your own strategies for communicating with patients, and develop and implement a plan to improve your communication with patients. Effective communication and patient education allows physicians to act as advocates for their patients. Discuss barriers to patient education, and strategies to mitigate those barriers. Gain insight into communication and education strategies for patients with communication issues.",
            "id": "SURGERY 974",
            "parent": "SURGERY",
            "title": "PATIENT EDUCATION AS A STRATEGY FOR ADVOCACY"
        }
    },
    {
        "data": {
            "description": "Focuses on molecular, genetic, embryologic, hormonal, anatomical and physiological factors that govern fertility, cell growth, fetal development, and pregnancy as well as the congenital anomalies that can occur when those processes are aberrant. Encompasses the full life-cycle spectrum including childhood growth and development, young adulthood/puberty, issues affecting adolescents and young adults, genetic basis of human disease, reproductive health, menopause, aging, unregulated cell growth (cancer) and end of life issues. Significant content from other competency domains, or \"longitudinal threads\", such as public health, advocacy, ethics, patient care/communication and clinical skills.",
            "id": "MEDSC-M 773",
            "parent": "MEDSC-M",
            "title": "HUMAN FAMILY TREE"
        }
    },
    {
        "data": {
            "description": "Gain familiarity with Mindfulness-Based Stress Reduction interventions that have been shown to increase physician well-being and build resiliency. Cultivate non-judgmental and calm awareness of the present moment. Learn and practice formal and informal mindfulness meditation practices. Research mindfulness skills and their benefits to physicians. Understand guided mindful activities. Adapt individualized mindfulness techniques.",
            "id": "SURGERY 981",
            "parent": "SURGERY",
            "title": "MINDFULNESS TRAINING FOR RESIDENCY"
        }
    },
    {
        "data": {
            "description": "High-yield topics that a surgery intern should know to start of residency. Routine communication skills  needed in residency, including writing comprehensive orders and effectively handing off patients. Communication and teamwork skills with healthcare team members. Communication and interpersonal skills in difficult situations, including obtaining informed consent, talking with parents of patients who choose to decline recommended management options, and disclosing complications. Common pediatric skills, including IV placement, umbilical line placement, defibrillation, airway management, lumbar puncture, and suturing. Based on the national Educational Curriculum that was developed by the American College of Surgeons, American Program Director Society, and the Association for Surgical Education, which focuses on focused on essential skills for medical students and PGY-1 residents to successfully navigate the first year of surgical residency.",
            "id": "SURGERY 909",
            "parent": "SURGERY",
            "title": "SURGERY INTERNSHIP PREPARATION"
        }
    },
    {
        "data": {
            "description": "Identify the roles of physicians, interdisciplinary providers, health care systems, and communities in screening, treating, and preventing common, chronic conditions. Activities are centered on health promotion, outpatient-based chronic disease management, and community health. Clinical experiences will occur in primary care, behavioral health, and other ambulatory and community-based settings that focus on chronic disease management.",
            "id": "MEDSC-M 811",
            "parent": "MEDSC-M",
            "title": "CHRONIC AND PREVENTIVE CARE"
        }
    },
    {
        "data": {
            "description": "Independent research under the direct supervision of Surgery, Orthopedics, or Urology faculty. Projects are individualized to meet research goals within the context of faculty research needs.",
            "id": "SURGERY 910",
            "parent": "SURGERY",
            "title": "INDEPENDENT READING AND RESEARCH IN SURGERY"
        }
    },
    {
        "data": {
            "description": "Independent study projects as arranged with faculty or instructional staff.",
            "id": "SURGERY 699",
            "parent": "SURGERY",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Learn effective methods of teaching procedural skills and of small group case-based learning (CBL) facilitation. Demonstrate effective teaching strategies when instructing more junior medical students in in-person procedural skills (e.g., suturing, knot-tying, ultrasound/doppler, intubation) and facilitating virtual CBL learning. Bolster mastery in surgical and procedural education.",
            "id": "SURGERY 982",
            "parent": "SURGERY",
            "title": "SURGICAL AND PROCEDURAL CARE EDUCATION TEACHING ELECTIVE"
        }
    },
    {
        "data": {
            "description": "Organized around physiological themes, the course includes material related to the cardiovascular system, hematology, nephrology, and pulmonology to present an integrated picture of how these systems function together to maintain homeostasis. In addition, there is significant content from other competency domains such as public health, ethics, evidence-based medicine, patient care/communication and clinical skills.",
            "id": "MEDSC-M 771",
            "parent": "MEDSC-M",
            "title": "BODY IN BALANCE"
        }
    },
    {
        "data": {
            "description": "Provides an in-depth exposure to inpatient and operative management of complicated surgical patients. Work under the direct supervision of a senior resident, fellows and faculty. This rotation will provides an opportunity to function at the intern level and play an active role in inpatient management of surgical patients.",
            "id": "SURGERY 938",
            "parent": "SURGERY",
            "title": "INPATIENT ACTING INTERNSHIP-SURGERY"
        }
    },
    {
        "data": {
            "description": "The anatomy applicable to abdominal aortic aneurysm repair, how this influenced the development of endografts, and how that development is regulated. Investigate the issues involved in aneurysm screening, and experience aneurysm screening in the clinic and aneurysm repair in the operating room. Discuss what is involved in medical device regulation, and how the medical device industry interacts with physicians to develop and distribute technology. Evaluate how the cost of medical devices is distributed to patients.",
            "id": "SURGERY 912",
            "parent": "SURGERY",
            "title": "AORTIC DISEASE FROM BENCH TO BOARDROOM"
        }
    },
    {
        "data": {
            "description": "The basics of vascular biology, as it applies to abdominal aortic aneurysm disease. Gain an understanding of pathophysiology of aneurysm disease, animal models of aortic aneurysm, and knowledge on experimental approaches to develop biomarkers and therapeutic strategies. Experience medical treatment of aneurysm disease in the clinic, and how risk factors identified from basic science techniques are applied at the bedside.",
            "id": "SURGERY 911",
            "parent": "SURGERY",
            "title": "AORTIC DISEASE FROM BENCH TO BEDSIDE"
        }
    },
    {
        "data": {
            "description": "The concept of injury prevention is inherently challenging, despite the systemic global public health problem of violence and injuries. Provides a foundation to approach injury prevention and control. Incorporates curriculum from TEACH-VIP (Training, Educating, and Advancing Collaboration in Health on Violence and Injury Prevention).",
            "id": "SURGERY 977",
            "parent": "SURGERY",
            "title": "INJURY AND VIOLENCE PREVENTION"
        }
    },
    {
        "data": {
            "description": "The diagnosis and treatment of common anorectal diseases in the context of anatomical and physiological basis as it correlates to the clinical setting. The medical and surgical treatment of anorectal disorders will be discussed from the historical background to modern management algorithms. Topics will include fissures, perirectal abscess, fistula-in-ano, external and internal hemorrhoidal diseases, pruritus ani, fecal incontinence, rectal prolapse, obstructive defecation, sexually transmitted infections, and various anorectal manifestations of irritable bowel disease. Symptomatic presentation and natural progression of each of these disease processes will be discussed. Provide a sound scientific foundation with which to approach evidence-based diagnosis, triage, and treatment of patients with acute versus chronic anorectal disorders.",
            "id": "SURGERY 983",
            "parent": "SURGERY",
            "title": "COMMON ANORECTAL DISEASES"
        }
    },
    {
        "data": {
            "description": "The science of diabetes and obesity as it correlates to the clinical setting. The history of endocrinology and discovery of insulin will provide the basis for understanding hormonal mechanisms controlling fuel metabolism and how these processes become dysfunctional in different disease states. Topics will include pancreatic and extrapancreatic control of metabolism, and diseases linked with obesity, including PCOS, type 2 diabetes, and cancer. Lifestyle, medical, and surgical treatments of obesity and diabetes, including pharmacologic mechanisms of insulin and non-insulin diabetes therapeutics and bariatric surgery, will be highlighted. The public health perspective will shine light on societal factors that influence obesity and diabetes care. Provides an advanced scientific foundation with which to approach evidence-based care and treatment of individuals with obesity and/or diabetes.",
            "id": "SURGERY 976",
            "parent": "SURGERY",
            "title": "THE SCIENCE OF OBESITY AND DIABETES"
        }
    },
    {
        "data": {
            "id": "MEDSC-M",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "SURGERY",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 771",
            "target": "MEDSC-M 810"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 773",
            "target": "MEDSC-M 810"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 810",
            "target": "SURGERY 909"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 810",
            "target": "SURGERY 912"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 810",
            "target": "SURGERY 980"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 810",
            "target": "SURGERY 982"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 811",
            "target": "SURGERY 974"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 811",
            "target": "SURGERY 975"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 811",
            "target": "SURGERY 976"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 811",
            "target": "SURGERY 982"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 812",
            "target": "SURGERY 911"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 812",
            "target": "SURGERY 938"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 812",
            "target": "SURGERY 973"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 812",
            "target": "SURGERY 982"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 812",
            "target": "SURGERY 983"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "SURGERY 909"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "SURGERY 911"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "SURGERY 912"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "SURGERY 938"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "SURGERY 973"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "SURGERY 974"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "SURGERY 975"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "SURGERY 976"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "SURGERY 980"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "SURGERY 982"
        }
    },
    {
        "data": {
            "source": "MEDSC-M 813",
            "target": "SURGERY 983"
        }
    }
]