[
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics and selected topics in Animal Physiology.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Focus on anesthetic management of common veterinary species with concurrent medical disease. Covers advanced pain management principles and techniques, anesthesia for exotic animal species, and breed considerations in anesthesia. Case-based and interactive where appropriate.",
            "id": "SURGSCI 545",
            "parent": "SURGSCI",
            "title": "FUNDAMENTALS OF ANESTHESIOLOGY II"
        }
    },
    {
        "data": {
            "description": "Examination techniques, diagnostic aids and surgical procedures relevant to the gastrointestinal, integumentory, musculoskeletal, respiratory and genitourinary systems of the equine and food animal species.",
            "id": "SURGSCI 631",
            "parent": "SURGSCI",
            "title": "LARGE ANIMAL SURGERY: ORTHOPEDIC AND SOFT TISSUE"
        }
    },
    {
        "data": {
            "description": "General biological principles. Topics include: evolution, ecology, animal behavior, cell structure and function, genetics and molecular genetics and the physiology of a variety of organ systems emphasizing function in humans.",
            "id": "BIOLOGY/ZOOLOGY 101",
            "title": "ANIMAL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Offers opportunities for faculty coordinated experience in the veterinary medical profession outside School of Veterinary Medicine.",
            "id": "SURGSCI 775",
            "parent": "SURGSCI",
            "title": "EXTERNSHIP"
        }
    },
    {
        "data": {
            "description": "Topics vary.",
            "id": "SURGSCI 675",
            "parent": "SURGSCI",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "Provides an overview of the issues involved across a wide range of wildlife diseases, presented within the context of ecosystem health or \"one health\". Content will be on the biological, epidemiological, clinical, public health and, in some cases, sociopolitical ramifications of wildlife diseases. Covers a wide variety of wildlife diseases caused by bacteria, viruses, parasites, prions, and environmental contaminants. Consequences associated with environmental changes on the manifestation of wildlife diseases will also be discussed. This range of diseases will be presented in order to familiarize the many facets involved in disease management, from animal and human health issues, to ecological and environmental considerations, to the role of society in contributing to, and managing, these diseases.",
            "id": "F&WECOL/SURGSCI 548",
            "title": "DISEASES OF WILDLIFE"
        }
    },
    {
        "data": {
            "id": "SURGSCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Apply principles and techniques of veterinary anesthesiology to common companion animals.",
            "id": "SURGSCI 634",
            "parent": "SURGSCI",
            "title": "SMALL ANIMAL ANESTHESIA LABORATORY"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "F&WECOL/SURGSCI 548"
        }
    },
    {
        "data": {
            "description": "General concepts of animal biology at an introductory level emphasizing the evolutionary relationships between animals. Learn about general body plans and strategies used to accomplish the basic tasks of staying alive in major animal groups using preserved and live animals. Study the diversity within each group of animals by integrating the body plans with the lifestyle and ecology of animals. Dissections of earthworm, freshwater mussel, squid, sea star, and rat aid the study of these general principles.",
            "id": "BIOLOGY/ZOOLOGY 102",
            "title": "ANIMAL BIOLOGY LABORATORY"
        }
    },
    {
        "data": {
            "description": "Hands-on diagnosis and treatment of general surgical diseases of small animal species.",
            "id": "SURGSCI 645",
            "parent": "SURGSCI",
            "title": "SENIOR ROTATION IN SMALL ANIMAL GENERAL SURGERY"
        }
    },
    {
        "data": {
            "description": "Apply clinical veterinary medicine in a small animal oncology setting that focuses on radiotherapy. Work alongside veterinarians and veterinary technicians with expertise in veterinary oncology. Participate in case management and client communication. Expand general knowledge about cancer in dogs and cats, including diagnosis and treatment. Learn about the role of radiotherapy in the treatment of cancer. Understand the patient experience during cancer treatment, specifically related to radiation. Learn about alternative treatment options when radiotherapy is not feasible. Practice clinical skills including physical examination, venipuncture, fine needle aspiration, tissue biopsy, image interpretation, and record keeping.",
            "id": "SURGSCI 714",
            "parent": "SURGSCI",
            "title": "SMALL ANIMAL RADIATION ONCOLOGY ROTATION"
        }
    },
    {
        "data": {
            "description": "Provides experience in ocular examination, problem solving skills, and formulation of diagnostic and therapeutic plans for animals presenting with eye disease. Ocular examination as part of the complete physical examination and ocular manifestations of systemic diseases are emphasized.",
            "id": "SURGSCI 741",
            "parent": "SURGSCI",
            "title": "CLINICAL OPHTHALMOLOGY ROTATION"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 102"
        }
    },
    {
        "data": {
            "description": "Covers basic principles of sedation, pain physiology, anesthetic drugs, anesthetic monitoring, and the practical considerations in performing anesthesia on healthy veterinary species. Case-based and interactive where appropriate.",
            "id": "SURGSCI 543",
            "parent": "SURGSCI",
            "title": "FUNDAMENTALS OF ANESTHESIOLOGY I"
        }
    },
    {
        "data": {
            "description": "Provides basic instruction in the application of ophthalmic diagnostics and therapeutics to small and large domestic animals. Acquire skills and knowledge to accurately diagnose, treat, prognose or refer domestic animals with common ophthalmic disorders.",
            "id": "SURGSCI 542",
            "parent": "SURGSCI",
            "title": "VETERINARY OPHTHALMOLOGY"
        }
    },
    {
        "data": {
            "description": "Introduction to veterinary dentistry principles and practice.",
            "id": "SURGSCI 677",
            "parent": "SURGSCI",
            "title": "VETERINARY DENTISTRY ELECTIVE"
        }
    },
    {
        "data": {
            "description": "Veterinary radiology principles, physical background and diagnostic techniques will be taught and emphasized in laboratory exercises.",
            "id": "SURGSCI 638",
            "parent": "SURGSCI",
            "title": "VETERINARY DIAGNOSTIC IMAGING"
        }
    },
    {
        "data": {
            "description": "Basic principles of ecology and interrelations between individuals, populations, communities, ecosystems and their environment; transmission genetics and introduction to population genetics; origin of life, evolutionary mechanisms, ancestral relationships among species, and the diversity of life.",
            "id": "BIOCORE 381",
            "parent": "BIOCORE",
            "title": "EVOLUTION, ECOLOGY, AND GENETICS"
        }
    },
    {
        "data": {
            "description": "Projects in the laboratory and/or through library work in specific subject area under the direct guidance of a faculty member.",
            "id": "SURGSCI 699",
            "parent": "SURGSCI",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Clinical clerkship in the Veterinary Medical Teaching Hospital. Provides exercises in technical and interpretive diagnostic radiology.",
            "id": "SURGSCI 647",
            "parent": "SURGSCI",
            "title": "RADIOLOGY CLINICS"
        }
    },
    {
        "data": {
            "description": "Provides advanced, in-depth training in the areas of small, large and exotic animal anesthesia and pain management.",
            "id": "SURGSCI 743",
            "parent": "SURGSCI",
            "title": "ADVANCED ANESTHESIOLOGY/CRITICAL CARE MEDICINE"
        }
    },
    {
        "data": {
            "description": "Practice medical management of zoological species kept in small- to medium-sized zoological facilities and wildlife rehabilitation cases, in collaboration with local facilities, such as Henry Vilas Zoo, Ochsner Park Zoo, and the Dane County Humane Society's Wildlife Center. Prepare for clinical cases, provide on-site medical evaluations, and complete medical records.",
            "id": "SURGSCI 712",
            "parent": "SURGSCI",
            "title": "ZOOLOGICAL MEDICINE CLINICAL ROTATION"
        }
    },
    {
        "data": {
            "description": "Rotation through orthopedic and neurosurgical clinics and surgery.",
            "id": "SURGSCI 644",
            "parent": "SURGSCI",
            "title": "CLINICS-SMALL ANIMAL ORTHOPEDIC SURGERY"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "F&WECOL/SURGSCI 548"
        }
    },
    {
        "data": {
            "description": "Provides advanced, directed anesthetic and restraint techniques for multiple exotic animal species such as rodents, rabbits, amphibians, reptiles, primates, fish and birds. The unique pharmacology and physiology of each species will be emphasized.",
            "id": "SURGSCI 744",
            "parent": "SURGSCI",
            "title": "RESTRAINT AND ANESTHESIA OF EXOTIC ANIMALS"
        }
    },
    {
        "data": {
            "description": "Basic principles of the clinical management of exotic pet species, with an emphasis on small mammals (rabbits, rodents, etc), birds and reptiles commonly kept as companion animals.",
            "id": "SURGSCI 676",
            "parent": "SURGSCI",
            "title": "SPECIAL SPECIES HEALTH"
        }
    },
    {
        "data": {
            "description": "Clinical anesthesia and pain management techniques including pre-anesthetic evaluation, induction procedures, intraoperative anesthetic and analgesic care and recovery management of small, large and exotic animal species. Critical patient care, novel anesthetic and analgesic techniques and cardiopulmonary resuscitation.",
            "id": "SURGSCI 646",
            "parent": "SURGSCI",
            "title": "VETERINARY ANESTHESIOLOGY-CLINICAL ROTATION"
        }
    },
    {
        "data": {
            "description": "Basic skills necessary for participation in the surgical management of small animals in the Veterinary Medical Teaching Hospital.",
            "id": "SURGSCI 632",
            "parent": "SURGSCI",
            "title": "SMALL ANIMAL SURGERY LABORATORY"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "description": "Introduction to hands-on ultrasound imaging and expand on selected portions of ultrasound physics, literature and problem-based case studies.",
            "id": "SURGSCI 750",
            "parent": "SURGSCI",
            "title": "SMALL ANIMAL ULTRASOUND ELECTIVE"
        }
    },
    {
        "data": {
            "description": "The pathophysiology and diagnosis of common general, orthopedic, and neurologic surgical diseases of small animals are presented. The operative management and postoperative care of small animal surgical patients are discussed in detail.",
            "id": "SURGSCI 630",
            "parent": "SURGSCI",
            "title": "SMALL ANIMAL SURGERY"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 151"
        }
    },
    {
        "data": {
            "description": "Rotation is a partnership between the UW Vet School, Dane County Humane Society's Wildlife Center and the Wisconsin Humane Societies' (WHS) Wildlife Center in Milwaukee. Develop clinical proficiency in wildlife rehabilitation. Work closely with licensed wildlife rehabilitators at wildlife centers to learn more about native wildlife in rehabilitation settings. Participate in veterinary patient rounds, which are led by UW veterinarians at wildlife centers. Cadaver laboratories, topic presentations and radiograph and blood smear reviews will complement the patient-based learning.",
            "id": "SURGSCI 711",
            "parent": "SURGSCI",
            "title": "WILDLIFE REHABILITATION MEDICINE ROTATION"
        }
    },
    {
        "data": {
            "id": "BIOCORE",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 102",
            "target": "F&WECOL/SURGSCI 548"
        }
    },
    {
        "data": {
            "description": "Normal radiographic anatomy of the dog and cat. This will include soft tissue structures as well as the skeletal system. Clinical case material to emphasize the need for a thorough knowledge of normal radiographic anatomy.",
            "id": "SURGSCI 501",
            "parent": "SURGSCI",
            "title": "RADIOGRAPHIC ANATOMY OF THE DOG AND CAT"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 101"
        }
    },
    {
        "data": {
            "description": "Develop clinical proficiency in the basic veterinary care of common exotic pet species routinely seen in general veterinary practice. Learn how to obtain comprehensive medical histories, how to safely restrain, obtain samples and administer drugs in a variety of common exotic pet species. Develop a solid understanding on how to manage common disorders seen in small exotic mammals, pet birds and pet reptiles.",
            "id": "SURGSCI 710",
            "parent": "SURGSCI",
            "title": "SPECIAL SPECIES CLINICAL ROTATION"
        }
    },
    {
        "data": {
            "description": "Introductory material on the scientific foundations of surgery. Preparation for clinical work in veterinary surgery and medicine.",
            "id": "SURGSCI 544",
            "parent": "SURGSCI",
            "title": "SURGERY FUNDAMENTALS"
        }
    },
    {
        "data": {
            "description": "Provides didactic and surgical experience in the major, common surgical diseases of cattle and pigs.",
            "id": "SURGSCI 746",
            "parent": "SURGSCI",
            "title": "FOOD ANIMAL SURGERY"
        }
    },
    {
        "data": {
            "description": "Dentistry, oral medicine and surgery as well as comprehensive patient care through the use of progressive methods, hospital resources and interdisciplinary specialists.",
            "id": "SURGSCI 748",
            "parent": "SURGSCI",
            "title": "DENTISTRY AND ORAL SURGERY ROTATION"
        }
    },
    {
        "data": {
            "description": "Learn the admission, examination, preoperative management, surgical procedures and postoperative management of large animals presented to the Veterinary Medical Teaching Hospital. Hands-on experience in the Large Animal Surgery Service.",
            "id": "SURGSCI 642",
            "parent": "SURGSCI",
            "title": "LARGE ANIMAL SURGERY: CLINICAL ROTATION"
        }
    }
]