[
    {
        "data": {
            "description": "By attending live theatre performances, watching films of theatrical productions and participating in colloquiums with theatre professionals, explore how theatre is made through the lens of various theatre artists. Through this exploration, develop an understanding and a deeper  appreciation of performative events as well as critically think about those experiences. Explores performance and the human condition, using acquired knowledge to build empathy and appreciation for the complexities of one's own and other people's perspectives.",
            "id": "THEATRE 100",
            "parent": "THEATRE",
            "title": "EXPERIENCING THEATRE"
        }
    },
    {
        "data": {
            "description": "Development of the actor's awareness of habitual patterns of tension. Elements of movement including space, time, energy. Introduction to improvisation skills.",
            "id": "THEATRE 342",
            "parent": "THEATRE",
            "title": "FUNDAMENTALS OF MOVEMENT FOR THE STAGE"
        }
    },
    {
        "data": {
            "description": "Emphasis on student's involvement with a specific responsibility within theatrical production.",
            "id": "THEATRE 361",
            "parent": "THEATRE",
            "title": "BACKSTAGE LABORATORY II"
        }
    },
    {
        "data": {
            "description": "Mentored individual study for students completing honor theses. For further information, consult the department's Undergraduate Advisor.",
            "id": "THEATRE 681",
            "parent": "THEATRE",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Mentored individual study for students completing honor theses. For further information, consult the department's Undergraduate Advisor.",
            "id": "THEATRE 682",
            "parent": "THEATRE",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Offers the fundamental principles and the practical knowledge of design visualization for theatrical productions and entertainment events. Focuses on building students' capability of producing clear and effective visual presentations of their creative design concepts by using the most cutting edge 2D and 3D digital applications.",
            "id": "THEATRE 213",
            "parent": "THEATRE",
            "title": "DIGITAL DESIGN VISUALIZATION FOR ENTERTAINMENT"
        }
    },
    {
        "data": {
            "description": "Representative twentieth-century plays from Glaspell and O'Neill to the present considered within contemporary cultural, theatrical and academic context.",
            "id": "ENGL/THEATRE 578",
            "title": "MODERN AMERICAN DRAMA AND THEATRE"
        }
    },
    {
        "data": {
            "description": "A course carried with a UW-Madison study abroad program which has no equivalent on this campus.",
            "id": "THEATRE 595",
            "parent": "THEATRE",
            "title": "TOPICS IN THEATRE AND DRAMA: STUDY ABROAD"
        }
    },
    {
        "data": {
            "description": "A practical class: preparation and performance of a production for young audiences, with development and implementation of accompanying educational material.",
            "id": "CURRIC/THEATRE 462",
            "title": "THEATRE FOR YOUNG AUDIENCES: PRODUCTION"
        }
    },
    {
        "data": {
            "description": "A study of dramatic structure and examination of the basic elements of theatrical text. Introduction to applied methods of script analysis as an approach to researching, writing, directing, designing, performing and critiquing plays and screenplays.",
            "id": "THEATRE 367",
            "parent": "THEATRE",
            "title": "SCRIPT ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Advanced problems in costume design for the stage.",
            "id": "THEATRE 763",
            "parent": "THEATRE",
            "title": "COSTUME DESIGN III"
        }
    },
    {
        "data": {
            "description": "Advanced studies in theories and practices of drama in education.",
            "id": "CURRIC/THEATRE 562",
            "title": "DRAMA IN EDUCATION: ADVANCED STUDIES"
        }
    },
    {
        "data": {
            "description": "Advanced study of organizational behaviors, theatre infrastructures, styles  communication techniques in relation to Stage Management.",
            "id": "THEATRE 579",
            "parent": "THEATRE",
            "title": "ADVANCED CONCEPTS IN STAGE MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "An advanced study of the theatres of China and Japan in relation to aesthetics and form.",
            "id": "THEATRE 526",
            "parent": "THEATRE",
            "title": "THE THEATRES OF CHINA AND JAPAN"
        }
    },
    {
        "data": {
            "description": "An intensive study of stage rigging, scenic locomotion, set construction and structural analysis techniques.",
            "id": "THEATRE 570",
            "parent": "THEATRE",
            "title": "ADVANCED STAGECRAFT"
        }
    },
    {
        "data": {
            "description": "An introduction to costume design theory and techniques for performance. Emphasis on script analysis for costume design and visual communication skills. Projects will explore design by using analytical and problem-solving skills to interpret a text, supporting a text through design choices, and achieving mastery of drawing and costume rendering techniques using analog techniques and/or digital media.",
            "id": "THEATRE 363",
            "parent": "THEATRE",
            "title": "COSTUME DESIGN I"
        }
    },
    {
        "data": {
            "description": "An introduction to makeup design for the theater. Learn the aesthetics of makeup, color theory, and the technical aspects of applying makeup. Topics include the importance of developing a character through makeup, techniques of physically applying makeup to the actor and special effects makeup such as old age and prosthetic makeup appliances.",
            "id": "THEATRE 364",
            "parent": "THEATRE",
            "title": "MAKEUP FOR THE THEATRE"
        }
    },
    {
        "data": {
            "description": "Analysis of sensitive subject matter in U.S. workplace and school/community settings through theatre and drama. Examines race relations, cultural diversity, gender, sexual orientation and other topics in plays, films, and current events. Develops theatrical models to encourage healthy dialogue.",
            "id": "THEATRE 357",
            "parent": "THEATRE",
            "title": "INTRODUCTION TO THEATRE FOR CULTURAL AND SOCIAL AWARENESS"
        }
    },
    {
        "data": {
            "description": "Application of lighting design to the stage and natural environment. Color principles, lighting instruments, and control equipment. Production participation and labs.",
            "id": "ART/THEATRE 366",
            "title": "STAGE LIGHTING I"
        }
    },
    {
        "data": {
            "description": "Audio equipment and its use in the theatre; the integration of sound as a design element of live theatrical performance.",
            "id": "THEATRE 371",
            "parent": "THEATRE",
            "title": "SOUND FOR THEATRE"
        }
    },
    {
        "data": {
            "description": "Collaborate with instructor for personalized curriculum.",
            "id": "THEATRE 199",
            "parent": "THEATRE",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Collaborate with instructor for personalized curriculum.",
            "id": "THEATRE 298",
            "parent": "THEATRE",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Collaborate with instructor for personalized curriculum.",
            "id": "THEATRE 299",
            "parent": "THEATRE",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Collaborate with instructor for personalized curriculum.",
            "id": "THEATRE 698",
            "parent": "THEATRE",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Collaborate with instructor for personalized curriculum.",
            "id": "THEATRE 699",
            "parent": "THEATRE",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Collaborate with instructor for personalized curriculum.",
            "id": "THEATRE 799",
            "parent": "THEATRE",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Considers important current trends in performance and dramatic literature worldwide. Writing component includes both literary and performance criticism. When possible, some course materials are linked to University Theatre productions.",
            "id": "THEATRE 424",
            "parent": "THEATRE",
            "title": "CONTEMPORARY WORLD THEATRE AND DRAMATIC LITERATURE"
        }
    },
    {
        "data": {
            "description": "Detailed study of lighting design techniques and professional practices for commercial and resident theatres.",
            "id": "THEATRE 466",
            "parent": "THEATRE",
            "title": "STAGE LIGHTING DESIGN II"
        }
    },
    {
        "data": {
            "description": "Detailed study of research and practice in the physical theatre and its scenic devices.",
            "id": "THEATRE 770",
            "parent": "THEATRE",
            "title": "ADVANCED THEATRE TECHNOLOGY"
        }
    },
    {
        "data": {
            "description": "Emphasis on fulfilling one major assignment in theatre performance or production situation such as actor, stage manager, master carpenter, wardrobe master, properties master.",
            "id": "THEATRE 561",
            "parent": "THEATRE",
            "title": "BACKSTAGE LABORATORY III"
        }
    },
    {
        "data": {
            "description": "Enables theatre majors with a supervised internship to earn academic credit while engaged in a professional setting outside of the University and directly related to their field of study.",
            "id": "THEATRE 597",
            "parent": "THEATRE",
            "title": "INTERNSHIP IN THEATRE"
        }
    },
    {
        "data": {
            "description": "Examines dress in Western civilization through the cultural context of history, art and fashion and related to theatrical costume design through a comparison of theatre designs to their primary visual sources.",
            "id": "THEATRE 327",
            "parent": "THEATRE",
            "title": "HISTORY OF COSTUME FOR THE STAGE"
        }
    },
    {
        "data": {
            "description": "Examines techniques used to create costumes. Rotating topics including draping, period patternmaking, tailoring, crafts, and painting. When taken for 4 credits, a lab component required.",
            "id": "THEATRE 464",
            "parent": "THEATRE",
            "title": "COSTUME TECHNOLOGY TOPICS"
        }
    },
    {
        "data": {
            "description": "Explores the real-world practicalities of the business side of show business, and gives students the business tools and resources necessary to be successful as directors, designers, stage managers, and technicians. Addresses the unique business demands of working artists.",
            "id": "THEATRE 500",
            "parent": "THEATRE",
            "title": "THE BUSINESS OF THE BUSINESS"
        }
    },
    {
        "data": {
            "description": "Focuses on developing fundamental acting techniques (voice, characterization, physicality) and learn to apply skills in individual performance and scene study of contemporary dramatic texts.",
            "id": "THEATRE 250",
            "parent": "THEATRE",
            "title": "FUNDAMENTALS OF ACTING"
        }
    },
    {
        "data": {
            "description": "Focuses on the fundamental principles and practical operational knowledge of different theatrical business models. Topics include: planning, scheduling, marketing, fundraising, budgeting, hiring, commercial vs. not-for-profit, legal concerns, and public relations.",
            "id": "THEATRE 260",
            "parent": "THEATRE",
            "title": "PRODUCING THEATRE"
        }
    },
    {
        "data": {
            "description": "Focuses on the principles of acting for the camera including industry terms, auditioning techniques, and acting techniques for film/television, industrials, and commercials. Learn tools for script analysis, character development, and on-camera performance which will be recorded and critiqued in class.",
            "id": "THEATRE 451",
            "parent": "THEATRE",
            "title": "ACTING FOR THE CAMERA"
        }
    },
    {
        "data": {
            "description": "Foundational elements of theatrical design and developing the skills to translate text into visual and/or aural content. Involves an introduction to script analysis; visual, aural, and dramaturgical research; problem solving skills; creative exploration and visual communication. Relevant to designers, directors, actors, stage managers, technicians, and informed audience members.",
            "id": "THEATRE 130",
            "parent": "THEATRE",
            "title": "FUNDAMENTALS OF THEATRICAL DESIGN"
        }
    },
    {
        "data": {
            "description": "Graduate seminar focused on providing advanced students in design and technology opportunities to collaborate on projects within the classroom.",
            "id": "THEATRE 970",
            "parent": "THEATRE",
            "title": "COLLABORATIVE DESIGN & TECHNOLOGY STUDIO"
        }
    },
    {
        "data": {
            "description": "Guest artists offer interdisciplinary courses on topics appropriate to their specializations.",
            "id": "THEATRE 469",
            "parent": "THEATRE",
            "title": "INTERDISCIPLINARY STUDIES IN THE ARTS"
        }
    },
    {
        "data": {
            "description": "Historical survey of visual theatre, painting, and architectural styles adapted to various dramatic forms. Application of design elements and styles to contemporary theatre productions.",
            "id": "ART/THEATRE 572",
            "title": "SET DESIGN II"
        }
    },
    {
        "data": {
            "description": "Historiographical perspectives in theatre for young audiences; analysis of plays for young people, theoretical implications, assumptions, current developments.",
            "id": "CURRIC/THEATRE 426",
            "title": "HISTORY, THEORY, AND DRAMATIC CRITICISM IN THEATRE FOR YOUNG AUDIENCES"
        }
    },
    {
        "data": {
            "description": "Hone skills learned in Technical Theater Fundamentals while working side-by-side with designers and technicians building University Theatre productions.",
            "id": "THEATRE 220",
            "parent": "THEATRE",
            "title": "SCENIC STUDIO PRACTICUM"
        }
    },
    {
        "data": {
            "description": "Hone skills learned in Technical Theater Fundamentals while working side-by-side with designers and technicians building University Theatre productions.",
            "id": "THEATRE 221",
            "parent": "THEATRE",
            "title": "COSTUME STUDIO PRACTICUM"
        }
    },
    {
        "data": {
            "description": "Hone skills learned in Technical Theater Fundamentals while working side-by-side with designers and technicians building University Theatre productions.",
            "id": "THEATRE 222",
            "parent": "THEATRE",
            "title": "LIGHTING & SOUND STUDIO PRACTICUM"
        }
    },
    {
        "data": {
            "description": "Independent pursuit of a creative project designed by the student and supervised by a staff member.",
            "id": "THEATRE 999",
            "parent": "THEATRE",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "Independent research and writing under the supervision of a staff member.",
            "id": "THEATRE 990",
            "parent": "THEATRE",
            "title": "RESEARCH AND THESIS"
        }
    },
    {
        "data": {
            "description": "Intensive movement discipline using Asian martial art techniques and mask work as a preparation for performance.",
            "id": "THEATRE 351",
            "parent": "THEATRE",
            "title": "FUNDAMENTALS OF ASIAN STAGE DISCIPLINE"
        }
    },
    {
        "data": {
            "description": "Intensive scene study from the major works of selected modern playwrights, concentrating on realism.",
            "id": "THEATRE 350",
            "parent": "THEATRE",
            "title": "ACTING REALISM"
        }
    },
    {
        "data": {
            "description": "Intensive scene study from the major works of selected modern playwrights.",
            "id": "THEATRE 550",
            "parent": "THEATRE",
            "title": "ADVANCED SCENE STUDY"
        }
    },
    {
        "data": {
            "description": "Interdisciplinary and cross-cultural seminar on the historical, cultural, performative, aesthetic, and ideological construction of acting on stage.",
            "id": "THEATRE 631",
            "parent": "THEATRE",
            "title": "THEORIES OF ACTING"
        }
    },
    {
        "data": {
            "description": "Intermediate sewing techniques used to create theatrical garments.",
            "id": "THEATRE 365",
            "parent": "THEATRE",
            "title": "SEWING FOR THE THEATRE"
        }
    },
    {
        "data": {
            "description": "Introduces and explores the fundamentals and discipline of voice and speech. Provides a foundation from which the student will begin to access and engage healthful, practical, and creative vocal and speech function. Introduction to methods of expression for acting and public speaking.",
            "id": "THEATRE 140",
            "parent": "THEATRE",
            "title": "VOICE 1: EFFECTIVE COMMUNICATION"
        }
    },
    {
        "data": {
            "description": "Introduction to Javanese theatre performance in a Javanese epic tradition. Includes use of Javanese gamelan music as accompaniment for dance drama.",
            "id": "DANCE/FOLKLORE/THEATRE 421",
            "title": "JAVANESE PERFORMANCE REPERTORY"
        }
    },
    {
        "data": {
            "description": "Introduction to art, architecture, interior design, objects, and clothing history, including social and economic factors that influenced development. Through research and critical thinking, demonstrate knowledge of historical and contemporary art movements, architecture, and clothing for application in performance design.",
            "id": "THEATRE 328",
            "parent": "THEATRE",
            "title": "MATERIAL CULTURE FOR PERFORMANCE DESIGN"
        }
    },
    {
        "data": {
            "description": "Introduction to historical, social and political contexts of African-American artistic expression in theatre and performance.  Offers critical analyses of theatre, films, and/or dance forms that reflect cultural values, ideologies and performance aesthetics rooted in African-American and West African traditions.",
            "id": "THEATRE 329",
            "parent": "THEATRE",
            "title": "INTRODUCTION TO AFRICAN-AMERICAN PERFORMANCE"
        }
    },
    {
        "data": {
            "description": "Introduction to the history, literature and theory of feminist theatre and of feminist criticism of mainstream theatre in the United States from 1960 to the present.",
            "id": "GEN&WS/THEATRE 415",
            "title": "INTRODUCTION TO CONTEMPORARY FEMINIST THEATRE AND CRITICISM"
        }
    },
    {
        "data": {
            "description": "Learn how to apply acting skills to presentations and interactions in non-arts settings (business, education, etc.), such as enhancing confidence and communication in interviews presentations, elevator pitches, authentically connecting on a personal level with others, and how to avoid or better deal with stage fright.",
            "id": "THEATRE 200",
            "parent": "THEATRE",
            "title": "ACTING SKILLS FOR LIFE"
        }
    },
    {
        "data": {
            "description": "Learn how to mount a theatrical production. Through scenery, costumes, lighting, sound, and stage management explore the relationship between the technical components of the production process. Includes lectures as well as practical experience in University Theatre productions.",
            "id": "THEATRE 160",
            "parent": "THEATRE",
            "title": "TECHNICAL THEATRE FUNDAMENTALS"
        }
    },
    {
        "data": {
            "description": "Learn through practical participation in University Theatre productions; lab choices include scenery and costume construction, lighting, and sound.",
            "id": "THEATRE 161",
            "parent": "THEATRE",
            "title": "BACKSTAGE LABORATORY I"
        }
    },
    {
        "data": {
            "description": "Mentored individual study for students completing theses.",
            "id": "THEATRE 691",
            "parent": "THEATRE",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Mentored individual study for students completing theses.",
            "id": "THEATRE 692",
            "parent": "THEATRE",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Methods and development of techniques used in theatrical drafting.",
            "id": "THEATRE 370",
            "parent": "THEATRE",
            "title": "DRAFTING FOR THE THEATRE"
        }
    },
    {
        "data": {
            "description": "Methods for all involved in teaching and learning, including foreign languages. Introduction to philosophy, methodology, and practice of the use of drama and performance techniques in any educational or recreational settings. Focus on creativity and embodied and contextual learning, based on current neurological, psychological, and sociological research. A practical class which includes demonstration and practice with children.",
            "id": "CURRIC/SLAVIC/THEATRE 362",
            "title": "DRAMA FOR TEACHING AND LEARNING"
        }
    },
    {
        "data": {
            "description": "Multiple approaches to reading plays from a variety of important periods in dramatic literature with an emphasis on the life of older plays in the contemporary repertory. When possible, some course materials are linked to University Theatre production.",
            "id": "THEATRE 324",
            "parent": "THEATRE",
            "title": "TRADITIONS IN DRAMATIC LITERATURE"
        }
    },
    {
        "data": {
            "description": "Offers advanced knowledge of design visualization for theatrical productions and entertainment events. Focuses on producing clear and effective visual presentations of creative design concepts by using the most cutting edge digital applications that include 3D contents modeling, texturing, still and animated rendering, VR and interactive output packaging.",
            "id": "THEATRE 713",
            "parent": "THEATRE",
            "title": "ADVANCED DIGITAL DESIGN VISUALIZATION FOR ENTERTAINMENT"
        }
    },
    {
        "data": {
            "description": "Often considered \"the father of modern drama,\" the Norwegian playwright Henrik Ibsen (1828-1906) is a major figure of world literature whose dramatic works remain fascinating and globally influential, both as texts and through performance and adaptation. Read and discuss Ibsen in English translation, with a focus on Ibsen's historical contexts, dramatic techniques, social and political thought, and the reception and adaptation of his work in modern culture.",
            "id": "LITTRANS/THEATRE 335",
            "title": "IN TRANSLATION: THE DRAMA OF HENRIK IBSEN"
        }
    },
    {
        "data": {
            "description": "Painting scenery for the stage. Techniques for painting drops, flats, and props in a range of illusion effects.",
            "id": "THEATRE 472",
            "parent": "THEATRE",
            "title": "SCENIC PAINTING"
        }
    },
    {
        "data": {
            "description": "Participation as a backstage run crew member for one University Theatre production. Crew positions vary per production and may include wardrobe, deck, light board operator, sound board operator, backstage microphone technician, and follow spot operator. In-person attendance for all production calls is mandatory.",
            "id": "THEATRE 262",
            "parent": "THEATRE",
            "title": "BACKSTAGE PRACTICUM"
        }
    },
    {
        "data": {
            "description": "Plays and playwrights from the first World War to the present, including movements leading to the \"revolt\" of 1956 and subsequent proletarian and absurdist drama. Plays by Shaw, O'Casey, Maugham, Coward, Eliot, Osborne, Beckett, Pinter, Stoppard, Arden, Wesker, Bond, Churchill and others.",
            "id": "ENGL/THEATRE 575",
            "title": "BRITISH DRAMA, 1914 TO PRESENT"
        }
    },
    {
        "data": {
            "description": "Principles and practice of play direction; motivational analysis, composition, movement, stage business and rehearsal techniques. Student directs a final project.",
            "id": "THEATRE 368",
            "parent": "THEATRE",
            "title": "FUNDAMENTALS OF DIRECTING"
        }
    },
    {
        "data": {
            "description": "Principles of composition, scale, perspective, and color applied to the stage; production of ground plans, elevations, sketches, and models.",
            "id": "ART/THEATRE 372",
            "title": "SET DESIGN I"
        }
    },
    {
        "data": {
            "description": "Principles of stage management from auditions through closing night. Class work and supplementary production experience.",
            "id": "THEATRE 379",
            "parent": "THEATRE",
            "title": "INTRODUCTION TO STAGE MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Problems in use of line, form, color, texture, and movement in the design of costumes for the stage. Class projects include investigation into classical and contemporary drama.",
            "id": "THEATRE 563",
            "parent": "THEATRE",
            "title": "COSTUME DESIGN II"
        }
    },
    {
        "data": {
            "description": "Problems of scholarship in the dramatic, performance and staging practices of major traditions of world theatre history between 500 BCE and 1700 including the theatres of ancient Greece and Rome; medieval, Renaissance and early modern Europe; and the Muromachi and Tokugawa eras in Japan.",
            "id": "ENGL/THEATRE 731",
            "title": "ADVANCED THEATRE HISTORY 500 BC TO 1700"
        }
    },
    {
        "data": {
            "description": "Problems of scholarship in the dramatic, performance and staging practices of major traditions of world theatre history since 1700, including melodrama, naturalism, the avant-garde, and other movements that helped shaped contemporary theatre.",
            "id": "ENGL/THEATRE 732",
            "title": "ADVANCED THEATRE HISTORY 1700 TO PRESENT"
        }
    },
    {
        "data": {
            "description": "Provides a basic introduction to the craft of acting. Develops disciplines and tools of the actor as they relate to voice, movement, language skills, and engaging communication. Explores how actor training skills can be a benefit in a wide context of professional and personal endeavors.",
            "id": "THEATRE 150",
            "parent": "THEATRE",
            "title": "ACTING I: INTRODUCTION TO ACTING"
        }
    },
    {
        "data": {
            "description": "Provides in-depth knowledge of the artistic career of the influential Swedish playwright, August Strindberg (1849-1912), and a general knowledge of the literary, artistic, and intellectual history that shaped his artistic production.",
            "id": "LITTRANS/THEATRE 336",
            "title": "IN TRANSLATION: THE DRAMA OF AUGUST STRINDBERG"
        }
    },
    {
        "data": {
            "description": "Provides students the opportunity to apply their knowledge in a production setting. Enrollment is limited to designated Dramaturg, Lighting Designer, Costume Designer, Set Designer, Technical Director, Assistant Dramaturg, Assistant Designers, or Assistant Technical Director on a season production for the University Theatre.",
            "id": "THEATRE 661",
            "parent": "THEATRE",
            "title": "ADVANCED PRODUCTION PRACTICUM"
        }
    },
    {
        "data": {
            "description": "Reading important plays, attending stage productions, writing and thinking critically about theatre and drama. Emphasis on developing analytic skills in dramatic literature and theatre production.",
            "id": "ENGL/THEATRE 120",
            "title": "INTRODUCTION TO THEATRE AND DRAMATIC LITERATURE"
        }
    },
    {
        "data": {
            "description": "Selected major critical and theoretical sources, from Aristotle to the present day; the influences of theories upon playwriting and modes of theatrical production.",
            "id": "ENGL/THEATRE 576",
            "title": "SURVEY: THEORIES OF DRAMA"
        }
    },
    {
        "data": {
            "description": "Slavic playwrights and the European tradition of theatre and drama.",
            "id": "LITTRANS/THEATRE 423",
            "title": "IN TRANSLATION: SLAVIC DRAMA IN CONTEXT"
        }
    },
    {
        "data": {
            "description": "Specialized subjects of current interest in design, performance, technology, history, dramatic theory, literature criticism, and theatre/drama education.",
            "id": "THEATRE 619",
            "parent": "THEATRE",
            "title": "SPECIAL TOPICS IN THEATRE AND DRAMA"
        }
    },
    {
        "data": {
            "description": "Student actors develop career-focused skills and confidence in auditioning for theatre and on-camera projects. Includes exercises in handling \"cold\" readings, prepared monologues, interviews, and improvisational auditioning. Student will also learn to look at auditions from the casting director's point of view.",
            "id": "THEATRE 352",
            "parent": "THEATRE",
            "title": "AUDITIONING FOR STAGE AND SCREEN"
        }
    },
    {
        "data": {
            "description": "Students gain practical theatrical experience, skills, and knowledge by working on a University Theatre production. The assignments will involve responsibilities as Actor, Director, Assistant Director, Stage Manager, Assistant Stage Manager, or other approved performance related positions on a University Theatre production.",
            "id": "THEATRE 360",
            "parent": "THEATRE",
            "title": "PERFORMANCE IN PRACTICE"
        }
    },
    {
        "data": {
            "description": "Studio presentation of Shakespearean drama with emphasis on language and verse structure; techniques for enhancing performances skills.",
            "id": "THEATRE 541",
            "parent": "THEATRE",
            "title": "ACTING SHAKESPEARE"
        }
    },
    {
        "data": {
            "description": "Study and demonstration of the various acting styles from the Greek to the modern. Concentration on two specific styles in a semester.",
            "id": "THEATRE 450",
            "parent": "THEATRE",
            "title": "ACTING STYLES"
        }
    },
    {
        "data": {
            "description": "Study of drama, dramatic theory and theatrical practices in postcolonial cultures, primarily in Asia, Africa and the Caribbean. Considers status of drama/theatre in postcolonial studies and focuses on issues of form, language, intertextuality, trans-culturation, material organization and reception.",
            "id": "ENGL/THEATRE 577",
            "title": "POSTCOLONIAL THEATRE: DRAMA, THEORY AND PERFORMANCE IN THE GLOBAL SOUTH"
        }
    },
    {
        "data": {
            "description": "Study of the drama and theatre of a variety of immigrant communities in three Western locations: Britain, the United States, and Canada. Focuses on current theories of diaspora and transnationalism, the place of theatre in diasporic writing, and the literary, performative, and material dimensions of the genre.",
            "id": "ENGL/THEATRE 477",
            "title": "DIASPORA AND THEATRE"
        }
    },
    {
        "data": {
            "description": "Styles and genres of the modern American and British musical theatre for performers. Their application to audition techniques and scene/song presentations.",
            "id": "THEATRE 440",
            "parent": "THEATRE",
            "title": "MUSICAL PERFORMANCE FOR THE ACTOR"
        }
    },
    {
        "data": {
            "description": "Teaches actors the vital, non-performance skills and knowledge needed to launch professional acting careers. Knowledge of self-promoting, marketing, unions, networking, headshot/resumes, agents, casting directors, trade publications, and more will empower the actor and ease their transition into the professional world.",
            "id": "THEATRE 501",
            "parent": "THEATRE",
            "title": "THE BUSINESS OF ACTING"
        }
    },
    {
        "data": {
            "description": "Technique and practice of classical Javanese dance in its musical, historical and cultural contexts.",
            "id": "DANCE/FOLKLORE/THEATRE 321",
            "title": "JAVANESE PERFORMANCE"
        }
    },
    {
        "data": {
            "description": "Technique and practice of several basic African dance forms with study of their musical, historical and cultural contexts.",
            "id": "DANCE 118",
            "parent": "DANCE",
            "title": "AFRICAN DANCE"
        }
    },
    {
        "data": {
            "description": "Technique, practice and performance of complex African and African-based dances in relation to polyrhythmic musical and percussive accompaniment. Study of historical and cultural contexts of these forms. Development of improvisational skills in dialogue with musicians.",
            "id": "DANCE/THEATRE 218",
            "title": "AFRICAN DANCE PERFORMANCE"
        }
    },
    {
        "data": {
            "description": "Techniques and practice for increasing vocal strength, range, flexibility and the study of diction. Attention to individual problems in tone production, resonance, and articulation.",
            "id": "THEATRE 240",
            "parent": "THEATRE",
            "title": "INTERMEDIATE VOICE TRAINING"
        }
    },
    {
        "data": {
            "description": "Theatre architecture, scenery, costume, acting, directing, and modes of staging in Europe from 500 B.C.",
            "id": "THEATRE 431",
            "parent": "THEATRE",
            "title": "HISTORY OF THEATRES AND STAGING"
        }
    },
    {
        "data": {
            "description": "Theatre is the manifestation of collaborative problem solving. Collaboration is a process involving two or more individuals working toward a common goal, through interdependent behavior with individual accountability. Build collaborative and creative problem-solving skills to generate innovative solutions to complex problems and practices.",
            "id": "THEATRE 234",
            "parent": "THEATRE",
            "title": "COLLABORATIVE PROBLEM SOLVING"
        }
    },
    {
        "data": {
            "description": "Theories and techniques for the use of stage lighting equipment, special effects, and other stage electrics devices.",
            "id": "THEATRE 266",
            "parent": "THEATRE",
            "title": "FUNDAMENTALS OF STAGE LIGHTING TECHNOLOGY"
        }
    },
    {
        "data": {
            "description": "Theory and practice of theatre in elementary and secondary educational settings. Devise, script, and present programs as actor-teachers and interact with audiences.",
            "id": "CURRIC/THEATRE 525",
            "title": "THEATRE IN EDUCATION"
        }
    },
    {
        "data": {
            "description": "Theory and techniques of stagecraft for theatrical production. When taken for 4 credits, a lab component required.",
            "id": "THEATRE 270",
            "parent": "THEATRE",
            "title": "FUNDAMENTALS OF STAGECRAFT"
        }
    },
    {
        "data": {
            "description": "Topics variable.",
            "id": "THEATRE 911",
            "parent": "THEATRE",
            "title": "SEMINAR-PROBLEMS IN THEATRE AND DRAMA"
        }
    },
    {
        "data": {
            "description": "Undergraduate study in subjects of current interest in design, performance, technology, history, dramatic theory, literature criticism, or theatre/drama education.",
            "id": "THEATRE 219",
            "parent": "THEATRE",
            "title": "UNDERGRADUATE TOPICS INTHEATRE AND DRAMA"
        }
    },
    {
        "data": {
            "description": "Video game environments by their nature are designed to support storytelling. Develop the skills needed to create rich virtual worlds using theatrical storytelling techniques and three-dimensional modeling.",
            "id": "THEATRE 230",
            "parent": "THEATRE",
            "title": "ENVIRONMENT DESIGN FOR GAMES AND OTHER VIRTUAL STORYTELLING SPACES"
        }
    },
    {
        "data": {
            "description": "Work together to create a repertory company which produces performances of short hip hop theater and other collaborative performance art works for public viewing. Experimental works are researched and developed. Involves the development of collaborative and small group pieces as well as artistic training with a focus on individual and multi-voice work, theater improvisation, dance/movement.",
            "id": "DANCE/THEATRE 259",
            "title": "COLLABORATIVE ARTS PERFORMANCE LAB: DEVISING COLLABORATIVE PERFORMANCE THROUGH HIP HOP ARTS"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "DANCE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "THEATRE",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "ART/THEATRE 366",
            "target": "THEATRE 466"
        }
    },
    {
        "data": {
            "source": "ART/THEATRE 372",
            "target": "ART/THEATRE 572"
        }
    },
    {
        "data": {
            "source": "CURRIC/SLAVIC/THEATRE 362",
            "target": "CURRIC/THEATRE 426"
        }
    },
    {
        "data": {
            "source": "CURRIC/SLAVIC/THEATRE 362",
            "target": "CURRIC/THEATRE 562"
        }
    },
    {
        "data": {
            "source": "DANCE 118",
            "target": "DANCE/THEATRE 218"
        }
    },
    {
        "data": {
            "source": "ENGL/THEATRE 120",
            "target": "THEATRE 324"
        }
    },
    {
        "data": {
            "source": "ENGL/THEATRE 120",
            "target": "THEATRE 631"
        }
    },
    {
        "data": {
            "source": "THEATRE 100",
            "target": "THEATRE 234"
        }
    },
    {
        "data": {
            "source": "THEATRE 130",
            "target": "ART/THEATRE 366"
        }
    },
    {
        "data": {
            "source": "THEATRE 130",
            "target": "THEATRE 230"
        }
    },
    {
        "data": {
            "source": "THEATRE 130",
            "target": "THEATRE 328"
        }
    },
    {
        "data": {
            "source": "THEATRE 130",
            "target": "THEATRE 363"
        }
    },
    {
        "data": {
            "source": "THEATRE 140",
            "target": "THEATRE 440"
        }
    },
    {
        "data": {
            "source": "THEATRE 150",
            "target": "THEATRE 250"
        }
    },
    {
        "data": {
            "source": "THEATRE 150",
            "target": "THEATRE 352"
        }
    },
    {
        "data": {
            "source": "THEATRE 150",
            "target": "THEATRE 440"
        }
    },
    {
        "data": {
            "source": "THEATRE 160",
            "target": "THEATRE 221"
        }
    },
    {
        "data": {
            "source": "THEATRE 160",
            "target": "THEATRE 222"
        }
    },
    {
        "data": {
            "source": "THEATRE 160",
            "target": "THEATRE 266"
        }
    },
    {
        "data": {
            "source": "THEATRE 160",
            "target": "THEATRE 270"
        }
    },
    {
        "data": {
            "source": "THEATRE 160",
            "target": "THEATRE 370"
        }
    },
    {
        "data": {
            "source": "THEATRE 160",
            "target": "THEATRE 379"
        }
    },
    {
        "data": {
            "source": "THEATRE 240",
            "target": "THEATRE 541"
        }
    },
    {
        "data": {
            "source": "THEATRE 250",
            "target": "THEATRE 352"
        }
    },
    {
        "data": {
            "source": "THEATRE 250",
            "target": "THEATRE 451"
        }
    },
    {
        "data": {
            "source": "THEATRE 270",
            "target": "THEATRE 570"
        }
    },
    {
        "data": {
            "source": "THEATRE 350",
            "target": "THEATRE 541"
        }
    },
    {
        "data": {
            "source": "THEATRE 363",
            "target": "THEATRE 563"
        }
    },
    {
        "data": {
            "source": "THEATRE 367",
            "target": "THEATRE 368"
        }
    },
    {
        "data": {
            "source": "THEATRE 370",
            "target": "THEATRE 466"
        }
    },
    {
        "data": {
            "source": "THEATRE 370",
            "target": "THEATRE 570"
        }
    },
    {
        "data": {
            "source": "THEATRE 379",
            "target": "THEATRE 579"
        }
    }
]