[
    {
        "data": {
            "description": "Energy resources are an essential element of the world's business, political, technical and environmental landscape. Analytic tools provided by the discipline of economics expands our understanding of this critical issue. Energy supply markets reviewed include both fossil fuels and renewable resources. Energy demand sectors include residential, commercial, industrial and transportation. Electricity represents an intermediate energy market. The interactions among these markets participants indicate how scarce resources are allocated among competing needs in the world economy.",
            "id": "AAE/CIVENGR/ENVIRST/URBRPL 561",
            "title": "ENERGY MARKETS"
        }
    },
    {
        "data": {
            "description": "Interdisciplinary team of students and staff working with agency personnel, citizen groups, and/or private sector representatives on the analysis of a contemporary, problem-oriented water resource issue. Physical, biological, economic and social aspects of the issue analyzed. Comprehensive written report results, practicum's findings and management recommendations.",
            "id": "CIVENGR/ENVIRST/URBRPL 719",
            "title": "WATER RESOURCES MANAGEMENT SUMMER PRACTICUM"
        }
    },
    {
        "data": {
            "description": "Visual communication in planning addresses the communication of plans - specifically in the form of site plans, master plans, comprehensive plans, illustrative design codes, cartography, analyses maps, among other. Provides a planning and design graphics foundation to help realize the procedures in communication and information management within today's interdisciplinary planning process. Develop skills in graphic communication from techniques currently used in the planning, architecture, engineering, landscape architecture and urban design fields and review several digital graphic representation programs as a means of developing a planning graphics toolkit.",
            "id": "URBRPL 791",
            "parent": "URBRPL",
            "title": "VISUAL COMMUNICATION FOR PLANNERS"
        }
    },
    {
        "data": {
            "description": "We live in an increasingly urban world and anticipate that 70% of the world's population will live in urban areas by 2050. For many of us, our shared future experience will be urban and interconnected. How can we make the future of urban areas as bright as possible for everyone? The answer begins with us. Building equitable and sustainable urban futures for everyone will require the efforts of a diverse group of people from many disciplines, backgrounds, and ways of thinking. Guest presenters introduce different disciplines and perspectives through major themes related to the planning and design of urban systems and environments. Imagine and develop your plan to effect positive change in an urban area focused on relevant topics like community food systems, water conservation, multimodal and active transportation, affordable housing, and urban nature.",
            "id": "URBRPL 215",
            "parent": "URBRPL",
            "title": "WELCOME TO YOUR URBAN FUTURE"
        }
    },
    {
        "data": {
            "description": "A mathematical approach to the theory of consumption, production, pricing and resource allocation.",
            "id": "ECON 311",
            "parent": "ECON",
            "title": "INTERMEDIATE MICROECONOMIC THEORY - ADVANCED TREATMENT"
        }
    },
    {
        "data": {
            "description": "Advanced public finance problems and literature, research; subject changes each semester; may be repeated. Modules.",
            "id": "ECON/URBRPL 845",
            "title": "ADVANCED TOPICS IN PUBLIC FINANCE"
        }
    },
    {
        "data": {
            "description": "An examination of how the legal system influences community planning. Overview of the institutional framework for planning and the legal authority for tools used to create healthy and sustainable communities.",
            "id": "URBRPL 833",
            "parent": "URBRPL",
            "title": "PLANNING AND THE LEGAL SYSTEM"
        }
    },
    {
        "data": {
            "description": "An examination of the writings and activities of green parties and movements around the globe in order to assess the potential of an explicit, radical environmental politics for the United States.",
            "id": "ENVIRST/URBRPL 668",
            "title": "GREEN POLITICS: GLOBAL EXPERIENCE, AMERICAN PROSPECTS"
        }
    },
    {
        "data": {
            "description": "An intensive analysis of the process of gentrification through its historical and spatial development within moments of post-fordist urban restructuring in the United States. Highlights urban theory and methodological questions important to the study of gentrification that are relevant to the fields of urban planning, geography and sociology. Case study investigation of particular locations will provide examples to test the applicability of the various analytical frameworks presented in the class.",
            "id": "URBRPL 512",
            "parent": "URBRPL",
            "title": "GENTRIFICATION AND URBAN RESTRUCTURING"
        }
    },
    {
        "data": {
            "description": "Analysis of spatial relationships in the urban economy, including urban land, labor and housing markets; urban transport; city governance and finance; and regional models. Historical and applied focus. Interdisciplinary approach emphasizing economics, geography, and planning.",
            "id": "REALEST/URBRPL 720",
            "title": "URBAN ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Basic principles and definitions of sociology. Readings and discussion of the perspectives of sociology, the individual and society, groups and social process, stratification, organizations and power, demography, and social change.",
            "id": "C&ESOC/SOC 211",
            "title": "THE SOCIOLOGICAL ENTERPRISE"
        }
    },
    {
        "data": {
            "description": "Broad coverage of regional planning--basic concepts, history, influences of the political, economic, and social environment, techniques of analysis and substantive tasks and problems in preparing regional plans.",
            "id": "URBRPL 731",
            "parent": "URBRPL",
            "title": "INTRODUCTION TO REGIONAL PLANNING"
        }
    },
    {
        "data": {
            "description": "Causes and consequences of urbanization, stressing social and economic aspects of major population movements, with particular attention to the United States.",
            "id": "HISTORY/SOC/URBRPL 979",
            "title": "SEMINAR IN URBAN HISTORY"
        }
    },
    {
        "data": {
            "description": "Contemporary theory of consumption, production, pricing and resource allocation.",
            "id": "ECON 301",
            "parent": "ECON",
            "title": "INTERMEDIATE MICROECONOMIC THEORY"
        }
    },
    {
        "data": {
            "description": "Critical evaluation and analysis of land use policies and programs in relation to comprehensive planning and growth management issues in the U.S. The role of legislative and judicial processes and emerging public land use social values and philosophies in the development, regulation, and effectuation of innovative land use policies. Alternative land policy and growth guidance systems of select European countries.",
            "id": "ENVIRST/URBRPL 843",
            "title": "LAND USE POLICY AND PLANNING"
        }
    },
    {
        "data": {
            "description": "Design, implementation and use of automated procedures for storage, analysis and display of spatial information. Covers data bases, information manipulation and display techniques, software systems and management issues. Case studies.",
            "id": "CIVENGR/ENVIRST/GEOG 377",
            "title": "AN INTRODUCTION TO GEOGRAPHIC INFORMATION SYSTEMS"
        }
    },
    {
        "data": {
            "description": "Economic problems of individuals, firms and industries with emphasis on value, price, and distribution of income.",
            "id": "ECON 101",
            "parent": "ECON",
            "title": "PRINCIPLES OF MICROECONOMICS"
        }
    },
    {
        "data": {
            "description": "Economic theory (location and growth) applicable to community economic development; the role of private and public sector in local economic development, and techniques for economic analysis of community.",
            "id": "AAE/REALEST/URBRPL 520",
            "title": "COMMUNITY ECONOMIC ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Evolution of contemporary urban and regional planning thought. Major conceptual dilemmas in theory and practice. Emerging trends in planning, e.g., forecasting and futurism.",
            "id": "URBRPL 741",
            "parent": "URBRPL",
            "title": "INTRODUCTION TO PLANNING"
        }
    },
    {
        "data": {
            "description": "Examination of major theories of regional economic development, with special emphasis upon the evolution and amelioration of regional economic problems. Selected techniques of regional analysis, including economic base multipliers, input/output models, and shift-share analysis are used in the context of setting regional development goals.",
            "id": "ECON/PUBAFFR/URBRPL 734",
            "title": "REGIONAL ECONOMIC PROBLEM ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Examination of special issues or problems in urban and regional planning and development, such as mineral development in Wisconsin or fringe development in Madison. Topic and faculty vary.",
            "id": "URBRPL 590",
            "parent": "URBRPL",
            "title": "CONTEMPORARY TOPICS IN URBAN AND REGIONAL PLANNING"
        }
    },
    {
        "data": {
            "description": "Examines public participation for planning and policymaking in both urban and natural environments; considers different types of participation from agency consultation to negotiation; designing, conducting, and evaluating citizen participation are major features.",
            "id": "ENVIRST/URBRPL 917",
            "title": "PUBLIC PARTICIPATION FOR PLANNING AND POLICY MAKING"
        }
    },
    {
        "data": {
            "description": "Examines the political, social, and economic contexts that shape and are shaped by policy making processes. Though the focus is on the US, international comparisons will be made, and students are encouraged to think about the American context through comparative and international perspectives. Familiarizes students with dominant theories and models of policymaking process and policy change, starting with the model of the policy cycle. Focuses in on key topics and issues in policy making, specifically, agenda setting, implementation, and the relationships between policymaking and democracy. Reflects on contemporary and emerging issues and dilemmas of the politics of policy making.",
            "id": "POLISCI/PUBAFFR/URBRPL 874",
            "title": "POLICY-MAKING PROCESS"
        }
    },
    {
        "data": {
            "description": "Exploration of special issues or problems in urban planning.",
            "id": "URBRPL 375",
            "parent": "URBRPL",
            "title": "SPECIAL TOPICS"
        }
    },
    {
        "data": {
            "description": "Explores planning-related Geographic Information System (GIS) data, applications, analytical tools, and implementation issues.",
            "id": "ENVIRST/GEOG/LANDARC/URBRPL 532",
            "title": "APPLICATIONS OF GEOGRAPHIC INFORMATION SYSTEMS IN PLANNING"
        }
    },
    {
        "data": {
            "description": "Explores, and applies, qualitative methods in the field of urban geography. An introduction to debates around the analysis and interpretation of qualitative data is provided, grounded in concrete urban research. Participation in a three-day field course is required.",
            "id": "GEOG/URBRPL 503",
            "title": "RESEARCHING THE CITY: QUALITATIVE STRATEGIES"
        }
    },
    {
        "data": {
            "description": "First course in a two semester sequence: commodity, money and labor markets, their components and general equilibrium; intertemporal optimization and growth theory. It is expected that students will have completed three semesters calculus (such asMATH 234) and linear algebra (such asMATH 340).",
            "id": "ECON 712",
            "parent": "ECON",
            "title": "ECONOMIC THEORY-MACROECONOMICS SEQUENCE"
        }
    },
    {
        "data": {
            "description": "First course in a two-semester sequence: theories of firms, consumers, and markets; or partial and general equilibria in market and centralized economies; topics in welfare economics. It is expected that students will have completed three semesters calculus (such asMATH 234) and linear algebra (such asMATH 340).",
            "id": "ECON 711",
            "parent": "ECON",
            "title": "ECONOMIC THEORY-MICROECONOMICS SEQUENCE"
        }
    },
    {
        "data": {
            "description": "Focuses on national budget and tax policy and administration, and the parallel processes at the state and local levels. Included are discussions of: decision-making theories; budget and tax policy; and analysis of normative and empirical criteria and analytical techniques for assessing alternative policy proposals.",
            "id": "POLISCI/PUBAFFR/URBRPL 890",
            "title": "FEDERAL BUDGET AND TAX POLICY AND ADMINISTRATION"
        }
    },
    {
        "data": {
            "description": "Focuses on the study of the allocation of scarce resources across space. Uses economic methods to analyze urban real  estate. Topics covered include the determinants of real estate values, the location decisions  of households and firms, land use, urban growth and agglomeration, real estate pricing, cycles, development, housing market and policies, and sustainable development.",
            "id": "ECON/REALEST/URBRPL 420",
            "title": "URBAN AND REGIONAL ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Focusing on three basic components of the built environment (buildings, transportation systems, and open spaces), addresses the forces that shape land use and transportation patterns, the effects of urban form on public health, safety, and welfare, and ways that communities can make their built environments more livable and environmentally sustainable.",
            "id": "URBRPL 611",
            "parent": "URBRPL",
            "title": "URBAN DESIGN: THEORY AND PRACTICE"
        }
    },
    {
        "data": {
            "description": "Governmental processes and policies for water resources management: major substantive problems and issues; political processes of decision making; problems of governmental organization and intergovernmental arrangements.",
            "id": "ENVIRST/URBRPL 865",
            "title": "WATER RESOURCES INSTITUTIONS AND POLICIES"
        }
    },
    {
        "data": {
            "description": "Group consideration of thesis or equivalent projects during their preparation; individual reports on successive stages of work.",
            "id": "URBRPL 932",
            "parent": "URBRPL",
            "title": "SEMINAR-RESEARCH REVIEW AND CRITICISM"
        }
    },
    {
        "data": {
            "description": "Historical geography of urban development in Europe from classical times to the post-Word War II era, with emphasis on changes in built environment, public space and infrastructure, land use, and urban systems.",
            "id": "GEOG/URBRPL 506",
            "title": "HISTORICAL GEOGRAPHY OF EUROPEAN URBANIZATION"
        }
    },
    {
        "data": {
            "description": "In addition to reviewing gender-within-development theory and practice, this course examines specific gender issues including social status and roles, productive and reproductive work, access to resources, identity and citizenship, empowerment, and intersection of race, class, and ethnicity with gender.",
            "id": "GEN&WS/URBRPL 644",
            "title": "INTERNATIONAL DEVELOPMENT AND GENDER"
        }
    },
    {
        "data": {
            "description": "Independent study as arranged with a faculty member.",
            "id": "URBRPL 699",
            "parent": "URBRPL",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Independent study as arranged with a faculty member.",
            "id": "URBRPL 999",
            "parent": "URBRPL",
            "title": "INDEPENDENT WORK"
        }
    },
    {
        "data": {
            "description": "Individual mentored research and study for completing theses, as arranged with a faculty member",
            "id": "URBRPL 990",
            "parent": "URBRPL",
            "title": "RESEARCH AND THESIS"
        }
    },
    {
        "data": {
            "description": "Influence of social, economic, and political systems, technological innovations, and architectural concepts on the spatial organization and environmental form of cities and urban areas; the adaptability of urban physical structure to developmental change; planned, conceptual organization and form versus unplanned and ecological organization and form.",
            "id": "URBRPL 841",
            "parent": "URBRPL",
            "title": "URBAN FUNCTIONS, SPATIAL ORGANIZATION AND ENVIRONMENTAL FORM"
        }
    },
    {
        "data": {
            "description": "Integrated treatment of macroeconomics and microeconomics (seeECON 101andECON 102). Accelerated approach to economics training, especially for Economics: Math Emphasis majors.",
            "id": "ECON 111",
            "parent": "ECON",
            "title": "PRINCIPLES OF ECONOMICS-ACCELERATED TREATMENT"
        }
    },
    {
        "data": {
            "description": "Intensive analysis of selected planning cases highlighting important issues that planners deal with in practice. Examine case studies in the context of broader framework of planning history, decision making process models and planner role models. Explore subnational planning and regional development issues in developing countries.",
            "id": "URBRPL 781",
            "parent": "URBRPL",
            "title": "PLANNING THOUGHT AND PRACTICE"
        }
    },
    {
        "data": {
            "description": "Interdisciplinary application of energy knowledge to an analysis project for a real-world client. Integrate and apply technical, economic, political, and social factors in energy decision-making.",
            "id": "ENVIRST/PUBAFFR/URBRPL 810",
            "title": "ENERGY ANALYSIS AND POLICY CAPSTONE"
        }
    },
    {
        "data": {
            "description": "Introduction to economic ways of thinking about a wide range of problems and issues. Topics include consumption, production, prices, markets, finance, trade, pollution, growth, farms, taxes, and development.",
            "id": "AAE 101",
            "parent": "AAE",
            "title": "INTRODUCTION TO AGRICULTURAL AND APPLIED ECONOMICS"
        }
    },
    {
        "data": {
            "description": "Introduction to the field of American sociology, its subfields and specialized areas of research, theoretical traditions and research methods.",
            "id": "C&ESOC/SOC 210",
            "title": "SURVEY OF SOCIOLOGY"
        }
    },
    {
        "data": {
            "description": "Introduction to the field of planning and orientation to graduate study in urban and regional planning at UW-Madison. Explore planning as a tool for problem solving, planning and social change, the multiple roles in which planners find themselves, useful skills and perspectives, and areas of planning practice. Addresses core values, sustainability, equity and social justice, professional skills, and the role of plans in relation to policies and programs.",
            "id": "URBRPL 742",
            "parent": "URBRPL",
            "title": "PLANNING ORIENTATION SEMINAR"
        }
    },
    {
        "data": {
            "description": "Introductory overview focused on the key aspects of the real estate process: developing real estate, permitting real estate, buying and selling real estate, understanding the economics of real estate, financing real estate, valuing real estate, leasing real estate, and managing real estate.",
            "id": "AAE/ECON/REALEST/URBRPL 306",
            "title": "THE REAL ESTATE PROCESS"
        }
    },
    {
        "data": {
            "description": "Investigates urbanization as a general process, as well as the resulting contemporary physical, social, cultural and political- economic forms of cities. Emphasis will be placed on the history and current forms of spatial and social segregation of cities by race, class, ethnicity, and gender. The myriad ways that cities have addressed the tensions emerging from this history of spatial and social segregation will be highlighted. Further, emphasis will be placed on understanding the experiences of those most-affected by historical and continuing segregation.",
            "id": "GEOG/URBRPL 305",
            "title": "INTRODUCTION TO THE CITY"
        }
    },
    {
        "data": {
            "description": "Investigation of multi-modal transportation, travel behavior, and urban form. Attention to site, neighborhood, regional, and global scales. Consideration of public health, environmental, economic, and social equity outcomes.",
            "id": "URBRPL 550",
            "parent": "URBRPL",
            "title": "TRANSPORTATION AND THE BUILT ENVIRONMENT"
        }
    },
    {
        "data": {
            "description": "Issues and methodological problems encountered in the production, financial, and consumption sectors of housing program design; comparisons with European and Third World country housing and public policy programs.",
            "id": "URBRPL 844",
            "parent": "URBRPL",
            "title": "HOUSING AND PUBLIC POLICY"
        }
    },
    {
        "data": {
            "description": "Land tenure and utilization research and policy problems.",
            "id": "ENVIRST/URBRPL 923",
            "title": "SEMINAR-LAND PROBLEMS: INSTITUTIONAL DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Learn fundamental concepts of climate action planning and sustainable transportation through hands-on collaborations with the University of Wisconsin-Madison Office of Sustainability, Transportation Services, and other partners. Work with real world data to analyze policies, programs, and plans to reduce greenhouse gas emissions from travel, as well as the potential health and well-being co-benefits of sustainable transportation interventions.  Analyze further reduction of the campus and community carbon footprints through practice-oriented green fleet management, behavior-based tools to support participation in active travel, modifications to the built environment, and other interventions.",
            "id": "URBRPL 551",
            "parent": "URBRPL",
            "title": "CLIMATE ACTION PLANNING: SUSTAINABLE TRANSPORTATION"
        }
    },
    {
        "data": {
            "description": "Limitations imposed upon the use of privately owned land by the court-made law of nuisance, by private covenant, and by public action; master plan, official map, subdivision regulation, zoning, and urban redevelopment.",
            "id": "LAW/URBRPL 830",
            "title": "LAND USE CONTROLS"
        }
    },
    {
        "data": {
            "description": "Macroeconomic measurement and models of aggregate demand and supply; fiscal and monetary policy for unemployment, inflation, and growth.",
            "id": "ECON 102",
            "parent": "ECON",
            "title": "PRINCIPLES OF MACROECONOMICS"
        }
    },
    {
        "data": {
            "description": "Orientation to the UniverCity Year program and  underlying theory and applied knowledge around community engagement, the function of local governments, and working with local officials and professional staff. Gain core competencies for applied, community-based learning projects and the importance of place-based learning.  Includes multidisciplinary approaches to problem-solving, access and use of information resources, reflection and action on ethical and professional issues,  consideration of  social and systemic roots of issues faced by local municipalities, and preparing written reports.",
            "id": "URBRPL 597",
            "parent": "URBRPL",
            "title": "UNIVERCITY YEAR GUIDED EXPERIENCE"
        }
    },
    {
        "data": {
            "description": "Planning for and improving the quality of US metropolitan markets and food systems.  Topics include public markets, community food security, urban agriculture, and the public health impact of food systems.",
            "id": "URBRPL 711",
            "parent": "URBRPL",
            "title": "PLANNING FOR FOOD SYSTEMS AND MARKETPLACES"
        }
    },
    {
        "data": {
            "description": "Principles, methods, and techniques of alternative dispute resolution; characteristics and dynamics of environmental and public policy conflicts; environmental and public policy dispute resolution theory; dispute systems design; applications to planning practice.",
            "id": "URBRPL 814",
            "parent": "URBRPL",
            "title": "ENVIRONMENTAL AND ALTERNATIVE DISPUTE RESOLUTION IN PLANNING"
        }
    },
    {
        "data": {
            "description": "Problems of public policy and administration for development and use of natural resources.",
            "id": "ECON/ENVIRST/POLISCI/URBRPL 449",
            "title": "GOVERNMENT AND NATURAL RESOURCES"
        }
    },
    {
        "data": {
            "description": "Provides a practical introduction to basic concepts of research question formulation, research designs and alternative methods of inquiry, implications for internal validity of the research and generalizability of the findings, operational definitions and measurement validity, reliability, utility and precision.",
            "id": "DS/F&WECOL/URBRPL 955",
            "title": "PRACTICAL RESEARCH DESIGN AND METHODS OF EMPIRICAL INQUIRY"
        }
    },
    {
        "data": {
            "description": "Relevance of the concept of community to American society. Review of several basic theories of community and analysis of the nature of community in the broader political and economic context.",
            "id": "C&ESOC/SOC/URBRPL 645",
            "title": "MODERN AMERICAN COMMUNITIES"
        }
    },
    {
        "data": {
            "description": "Research methods and statistics used in analyzing planning problems: conceptualization, design, and implementation of planning research; statistical methods for analyzing data including review of inferential statistics, analysis of variance, correlation, and multiple regression; use of computer; review of sources of planning data.",
            "id": "SOCWORK/URBRPL 721",
            "title": "METHODS OF PLANNING ANALYSIS"
        }
    },
    {
        "data": {
            "description": "Resource policy issues frequently faced by local and state governments and the federal government. Emphasis: (1) techniques for analysis of resource issues; (2) methods of collating knowledge from natural and social science disciplines which can make meaningful contributions to resolution of resource issues; (3) identification and analysis of strategic points of decision making in the legislative and executive branches of government; and (4) the application of planning techniques for accomplishing resource goals.",
            "id": "ENVIRST/URBRPL 821",
            "title": "RESOURCES POLICY ISSUES: REGIONAL AND NATIONAL"
        }
    },
    {
        "data": {
            "description": "Role of administration in American government; problems of organization, bureaucracy and control; public policy as the output of the administrative process.",
            "id": "POLISCI/PUBAFFR/URBRPL 878",
            "title": "PUBLIC MANAGEMENT"
        }
    },
    {
        "data": {
            "description": "Second course in a two-semester sequence. Topics include: asset pricing; fiscal and monetary policy; mechanism design, estimation and calibration of business cycle models.",
            "id": "ECON 714",
            "parent": "ECON",
            "title": "ECONOMIC THEORY; MACROECONOMICS SEQUENCE"
        }
    },
    {
        "data": {
            "description": "Second course in a two-semester sequence: the theory of market, their efficiency properties, externalities, and the role of prices, and an introduction to the economics of information, including moral hazard and adverse selection.",
            "id": "ECON 713",
            "parent": "ECON",
            "title": "ECONOMIC THEORY: MICROECONOMICS SEQUENCE"
        }
    },
    {
        "data": {
            "description": "Selected problems in planning to emphasize the interdisciplinary character of planning practice and to give opportunity to apply socioeconomic analysis, physical planning, and implementation techniques.",
            "id": "URBRPL 912",
            "parent": "URBRPL",
            "title": "PLANNING WORKSHOP"
        }
    },
    {
        "data": {
            "description": "Selected topics in political sociology, e.g., social movements, citizenship, civic engagement, weakening of postwar \"social democratic consensus\" under financialized globalization pressures.",
            "id": "SOC/URBRPL 924",
            "title": "SEMINAR-POLITICAL SOCIOLOGY"
        }
    },
    {
        "data": {
            "description": "Social, cultural and personality factors influencing community development, with reference to developing countries as well as contemporary rural communities; consideration of theoretical and operational issues.",
            "id": "C&ESOC/SOC/URBRPL 617",
            "title": "COMMUNITY DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Social, economic, environmental, and fiscal trends affecting larger, older American cities, critical policy issues confronting central city decision-makers, and major programmatic responses to these issues; the role of planning in response to these trends and issues.",
            "id": "URBRPL 761",
            "parent": "URBRPL",
            "title": "CENTRAL CITY PLANNING: ISSUES AND APPROACHES"
        }
    },
    {
        "data": {
            "description": "Sociological examination of the linkages between the social and biophysical dimensions of the environment. Key topics include community organizing, local food systems, energy transitions, environmental justice, resource dependence, and sustainable development.",
            "id": "C&ESOC/SOC 140",
            "title": "INTRODUCTION TO COMMUNITY AND ENVIRONMENTAL SOCIOLOGY"
        }
    },
    {
        "data": {
            "description": "State and local financial planning with emphasis on the functional importance of expenditure; special problems in financing city and metropolitan governments; intergovernmental fiscal relations and the use of various budgetary techniques as integral parts of the planning process.",
            "id": "URBRPL 751",
            "parent": "URBRPL",
            "title": "INTRODUCTION TO FINANCIAL PLANNING"
        }
    },
    {
        "data": {
            "description": "Strategy and policy problems in energy policy, both national and international.",
            "id": "ENVIRST/PUBAFFR/URBRPL 809",
            "title": "INTRODUCTION TO ENERGY ANALYSIS AND POLICY"
        }
    },
    {
        "data": {
            "description": "Survey of site planning theory and methods; standards for municipal review of site plans and related design proposals. Topics include architecture, vehicle circulation and parking, pedestrian circulation, stormwater management, landscaping, outdoor lighting, and signage.",
            "id": "URBRPL 601",
            "parent": "URBRPL",
            "title": "SITE PLANNING"
        }
    },
    {
        "data": {
            "description": "The first of two seminars for planning the activities of the practicum.",
            "id": "CIVENGR/ENVIRST/URBRPL 717",
            "title": "WATER RESOURCES MANAGEMENT PRACTICUM PLANNING SEMINAR I"
        }
    },
    {
        "data": {
            "description": "The history, practices, processes, and prospects of marketplaces generally and farmers markets in particular. Includes the history, practices, and processes, of entrepreneurship and the tight fit between markets and entrepreneurship. Explores marketplaces and entrepreneurship in through the lens of economic development, food justice, and political regionalism.",
            "id": "URBRPL 411",
            "parent": "URBRPL",
            "title": "MARKETPLACES AND ENTREPRENEURSHIP"
        }
    },
    {
        "data": {
            "description": "The method, application, and limitations of traditional economic approaches to the study of energy problems. Topics include microeconomic foundations of energy demand and supply; optimal pricing and allocation of energy resources; energy market structure, conduct, and performance; macro linkages of energy and the economy; and the economics of regulatory and other public policy approaches to the social control of energy.",
            "id": "AAE/ECON/ENVIRST/URBRPL 671",
            "title": "ENERGY ECONOMICS"
        }
    },
    {
        "data": {
            "description": "The nature and cultural significance of contemporary methods for the systematic formulation of public policies for community, metropolitan, and state development through comprehensive planning. Historic roots, recent trends and new directions in American planning concepts, institutions and professional specializations.",
            "id": "LANDARC/URBRPL 463",
            "title": "EVOLUTION OF AMERICAN PLANNING"
        }
    },
    {
        "data": {
            "description": "The second of two seminars for planning the field work, analysis, and reporting of the practicum.",
            "id": "CIVENGR/ENVIRST/URBRPL 718",
            "title": "WATER RESOURCES MANAGEMENT PRACTICUM PLANNING SEMINAR II"
        }
    },
    {
        "data": {
            "description": "The social, economic, and political setting of urban blight and the current measures, including urban renewal and model cities programs, to cope with the condition. Attention to social change, concept of neighborhood, and cross-cultural perspectives to renewal and community development.",
            "id": "URBRPL 945",
            "parent": "URBRPL",
            "title": "SEMINAR IN LAND USE AND COMMUNITY DEVELOPMENT ISSUES"
        }
    },
    {
        "data": {
            "description": "Theory and practice of survey research; questionnaire design, sampling, data visualization, statistical analysis.",
            "id": "JOURN/POLISCI/URBRPL 373",
            "title": "INTRODUCTION TO SURVEY RESEARCH"
        }
    },
    {
        "data": {
            "description": "Various urban empirical regularities and theories which explain them.",
            "id": "GEOG/URBRPL 505",
            "title": "URBAN SPATIAL PATTERNS AND THEORIES"
        }
    },
    {
        "data": {
            "id": "AAE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ECON",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "URBRPL",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "AAE 101",
            "target": "AAE/CIVENGR/ENVIRST/URBRPL 561"
        }
    },
    {
        "data": {
            "source": "AAE 101",
            "target": "AAE/ECON/ENVIRST/URBRPL 671"
        }
    },
    {
        "data": {
            "source": "AAE 101",
            "target": "AAE/ECON/REALEST/URBRPL 306"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 140",
            "target": "C&ESOC/SOC/URBRPL 617"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 140",
            "target": "C&ESOC/SOC/URBRPL 645"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 210",
            "target": "C&ESOC/SOC 211"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 210",
            "target": "C&ESOC/SOC/URBRPL 645"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 211",
            "target": "C&ESOC/SOC 210"
        }
    },
    {
        "data": {
            "source": "C&ESOC/SOC 211",
            "target": "C&ESOC/SOC/URBRPL 617"
        }
    },
    {
        "data": {
            "source": "CIVENGR/ENVIRST/GEOG 377",
            "target": "ENVIRST/GEOG/LANDARC/URBRPL 532"
        }
    },
    {
        "data": {
            "source": "CIVENGR/ENVIRST/URBRPL 718",
            "target": "CIVENGR/ENVIRST/URBRPL 719"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "AAE/CIVENGR/ENVIRST/URBRPL 561"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "AAE/ECON/ENVIRST/URBRPL 671"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON 301"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON 311"
        }
    },
    {
        "data": {
            "source": "ECON 101",
            "target": "ECON/REALEST/URBRPL 420"
        }
    },
    {
        "data": {
            "source": "ECON 102",
            "target": "ECON 111"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "AAE/ECON/ENVIRST/URBRPL 671"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON 101"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON 102"
        }
    },
    {
        "data": {
            "source": "ECON 111",
            "target": "ECON 311"
        }
    },
    {
        "data": {
            "source": "ECON 301",
            "target": "AAE/REALEST/URBRPL 520"
        }
    },
    {
        "data": {
            "source": "ECON 301",
            "target": "ECON 311"
        }
    },
    {
        "data": {
            "source": "ECON 301",
            "target": "REALEST/URBRPL 720"
        }
    },
    {
        "data": {
            "source": "ECON 311",
            "target": "AAE/REALEST/URBRPL 520"
        }
    },
    {
        "data": {
            "source": "ECON 311",
            "target": "ECON 301"
        }
    },
    {
        "data": {
            "source": "ECON 311",
            "target": "REALEST/URBRPL 720"
        }
    },
    {
        "data": {
            "source": "ECON 711",
            "target": "ECON 713"
        }
    },
    {
        "data": {
            "source": "ECON 712",
            "target": "ECON 714"
        }
    },
    {
        "data": {
            "source": "ECON 713",
            "target": "ECON/URBRPL 845"
        }
    },
    {
        "data": {
            "source": "ECON 714",
            "target": "ECON/URBRPL 845"
        }
    },
    {
        "data": {
            "source": "URBRPL 791",
            "target": "URBRPL 912"
        }
    }
]