[
    {
        "data": {
            "description": "Covers a range of topics related to human genetics and evolution. Explores questions about what genetic differences between humans tell us about our species' evolutionary and demographic history, and conversely, how our history has shaped the genetic diversity of people living today. At a time of rapidly increasing ability to sequence huge numbers of genomes such questions play a central role in understanding how genetics impacts individuals' disease risks, how to interpret reported ancestry and family history from direct-to-consumer genotyping kits, and how genetics can (or importantly, cannot) inform descriptions of human diversity and concepts of race. Includes topics of diversity and inclusion in genomics studies, with a focus on the application and limits of results obtained from one group to our understanding of other groups.",
            "id": "ZOOLOGY 415",
            "parent": "ZOOLOGY",
            "title": "GENETICS OF HUMAN HISTORY"
        }
    },
    {
        "data": {
            "description": "Covers the graphs, properties and geometric significance of trigonometric functions of a real variable. Other topics include trigonometric equations and identities, application, trigonometric form of complex numbers, DeMoivre's theorem, and polar and parametric equations. The course also has a significant number of applications, especially related to other disciplines.",
            "id": "MATH 113",
            "parent": "MATH",
            "title": "TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "Explore how organisms make decisions and how these decisions affect their survival. These decisions are key aspects of an organism's life, e.g. foraging behavior, mating behavior, anti-predator behavior, and habitat selection. Approaches these questions with the perspective that understanding the proximal and ultimate basis of behavior requires understanding the ecological and evolutionary context of behavior.",
            "id": "ZOOLOGY 425",
            "parent": "ZOOLOGY",
            "title": "BEHAVIORAL ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Provides an advanced understanding of cell biology as it relates to the nervous system. Covers the neuronal cytoskeleton, molecular motors and their cargos, the secretory system and how it functions in neurons, formation and maintenance of pre- and post-synaptic structures, neuronal organelles and their functions. Discussion of what is known about the disruptions to cell biology of neurons that contributes to neurodevelopmental and neurodegenerative diseases such as Alzheimer's disease, Parkinson's disease, Amyotrophic Lateral Sclerosis, Charcot Marie Tooth Disease, Spinal Muscular Atrophy, and others.",
            "id": "ZOOLOGY 444",
            "parent": "ZOOLOGY",
            "title": "NEURONAL CELL BIOLOGY IN HEALTH AND DISEASE"
        }
    },
    {
        "data": {
            "description": "The evidence that the Earth's climate is changing at unprecedented rates is now overwhelming. Environmental tipping points are being crossed and many species are adapting or failing to adapt. Climate change poses a significant problem for conserving and managing wildlife and their habitats. Climate change, its ecological impacts, and the principle of climate change adaptation in natural resources conservation will be discussed.",
            "id": "F&WECOL/ZOOLOGY 660",
            "title": "CLIMATE CHANGE ECOLOGY"
        }
    },
    {
        "data": {
            "description": "A comprehensive treatment of the ecology, causes, and consequences of species extinction. Ecology and problems of individual species, habitat alteration and degradation, socio-economic pressures and conservation techniques and strategies.",
            "id": "ENVIRST/F&WECOL/ZOOLOGY 360",
            "title": "EXTINCTION OF SPECIES"
        }
    },
    {
        "data": {
            "description": "A group discussion of primary literature articles relevant to the neural basis of behavior with a purpose to understand the neural basis of behavior in animals, to learn to read papers critically and improve discussion leading skills.",
            "id": "NTP/ZOOLOGY 620",
            "title": "NEUROETHOLOGY SEMINAR"
        }
    },
    {
        "data": {
            "description": "A wide range of topics in neurobiology research from molecular neurobiology to integrative systems. Topics discussed by invited UW-Madison faculty researchers might include: ion channels and synaptic plasticity, neural development, sensory and cognitive physiology, biological basis of behavioral disorders and cognitive decline.",
            "id": "ZOOLOGY 500",
            "parent": "ZOOLOGY",
            "title": "UNDERGRADUATE NEUROBIOLOGY SEMINAR"
        }
    },
    {
        "data": {
            "description": "Advanced research in biology as part of graduate program requirements arranged with mentoring faculty.",
            "id": "ZOOLOGY 990",
            "parent": "ZOOLOGY",
            "title": "RESEARCH"
        }
    },
    {
        "data": {
            "description": "Advanced topics in zoology explored through individual research projects.",
            "id": "ZOOLOGY 799",
            "parent": "ZOOLOGY",
            "title": "INDEPENDENT STUDY"
        }
    },
    {
        "data": {
            "description": "An integrative approach to studying the interaction between the atmosphere, hydrosphere, biosphere, and geosphere as they have evolved during earth history. Overarching theme includes ocean-climate system changes, biogeochemical cycles, evolution from microbes to mammals, and critical events in life history.",
            "id": "GEOSCI 304",
            "parent": "GEOSCI",
            "title": "GEOBIOLOGY"
        }
    },
    {
        "data": {
            "description": "An interdisciplinary approach to our complex and often contradictory relationships with non-human animals, including information about the nature, needs and behavior of human and non-human animals in relation to our personal and professional interactions with them.",
            "id": "F&WECOL/ZOOLOGY 335",
            "title": "HUMAN/ANIMAL RELATIONSHIPS: BIOLOGICAL AND PHILOSOPHICAL ISSUES"
        }
    },
    {
        "data": {
            "description": "An introduction to the role that hormones play in a variety of physiological pocesses and behaviors from a molecular to a systems level. Topics include hormonal involvement in growth, development, homeostasis, reproduction, and behavior, with an emphasis on vertebrate systems.",
            "id": "ZOOLOGY 603",
            "parent": "ZOOLOGY",
            "title": "ENDOCRINOLOGY"
        }
    },
    {
        "data": {
            "description": "Analysis of neural development with emphasis on experimental approaches. Combination of lectures and discussions of primary literature. Topics include neural induction, patterning, mechanisms of axon guidance, neural crest cell migration and differentiation, cortical development, and synapse formation and elimination.",
            "id": "NEURODPT/NTP/ZOOLOGY 765",
            "title": "DEVELOPMENTAL NEUROSCIENCE"
        }
    },
    {
        "data": {
            "description": "Anatomy and taxonomy of Wisconsin fishes and projects in fish ecology.",
            "id": "ENVIRST/ZOOLOGY 511",
            "title": "ECOLOGY OF FISHES LAB"
        }
    },
    {
        "data": {
            "description": "Application of ecological principles and human dimensions to the conservation of biological diversity. Topics: biodiversity science; conservation planning; population ecology; habitat loss, species exploitation, invasive species, pollution; human attitudes and activities as they affect the biosphere; approaches to monitoring interventions.",
            "id": "BOTANY/ENVIRST/F&WECOL/ZOOLOGY 651",
            "title": "CONSERVATION BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Application of geology to problems resulting from the ever more intense use of the earth and its resources.",
            "id": "ENVIRST/GEOSCI 106",
            "title": "ENVIRONMENTAL GEOLOGY"
        }
    },
    {
        "data": {
            "description": "Basic biology of microorganisms, including structure, function, physiology, genetics, ecology, diversity, and evolution.",
            "id": "MICROBIO 303",
            "parent": "MICROBIO",
            "title": "BIOLOGY OF MICROORGANISMS"
        }
    },
    {
        "data": {
            "description": "Basic mechanisms in cellular neurophysiology: electrophysiology and chemistry of nerve signals, mechanisms in integration, simple nervous pathways and their behavioral correlates.",
            "id": "PSYCH/ZOOLOGY 523",
            "title": "NEUROBIOLOGY"
        }
    },
    {
        "data": {
            "description": "Basic principles of ecology and interrelations between individuals, populations, communities, ecosystems and their environment; transmission genetics and introduction to population genetics; origin of life, evolutionary mechanisms, ancestral relationships among species, and the diversity of life.",
            "id": "BIOCORE 381",
            "parent": "BIOCORE",
            "title": "EVOLUTION, ECOLOGY, AND GENETICS"
        }
    },
    {
        "data": {
            "description": "Basic principles of molecular ecology. Lecture topics include population genetics, molecular phylogenetics, rates and patterns of evolution, genome evolution, and molecular ecology.",
            "id": "ENTOM/GENETICS/ZOOLOGY 624",
            "title": "MOLECULAR ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Basic vertebrate anatomical systems and a consideration of variations, using functional embryological and evolutionary approaches. Lab dissection and study of representative vertebrate material.",
            "id": "ZOOLOGY 430",
            "parent": "ZOOLOGY",
            "title": "COMPARATIVE ANATOMY OF VERTEBRATES"
        }
    },
    {
        "data": {
            "description": "Behavior results from a complex interplay among hormones, the brain, and environmental factors. Behaviors and their underlying neural substrates have evolved in response to specific environmental conditions, resulting in vast species diversity in behavioral and neuroendocrine solutions to environmental problems. Designed to explore the primary literature on the neuroendocrine underpinnings of behavior spanning from feeding to sex differences in complex social behaviors. A range of taxonomic groups will be discussed, including (but not limited to) mammals, birds, and fish.",
            "id": "NEURODPT/PSYCH/ZOOLOGY 674",
            "title": "BEHAVIORAL NEUROENDOCRINOLOGY SEMINAR"
        }
    },
    {
        "data": {
            "description": "Behavior, including its development, motivation, frustrations, emotion, intelligence, learning, forgetting, personality, language, thinking, and social behavior.",
            "id": "PSYCH 202",
            "parent": "PSYCH",
            "title": "INTRODUCTION TO PSYCHOLOGY"
        }
    },
    {
        "data": {
            "description": "Biological basis of human and animal behaviors, including perception, action, cognition, social interaction and disease. Weekly themes from \"Cracking the Neural Code\" to \"Love and War\". Learn, develop and use neural mechanisms to explain and (attempt to) predict what they and others think and do in all facets of life.",
            "id": "PSYCH 454",
            "parent": "PSYCH",
            "title": "BEHAVIORAL NEUROSCIENCE"
        }
    },
    {
        "data": {
            "description": "Biological, physical, and chemical characteristics and their interrelationships in Wisconsin lakes and streams.",
            "id": "ZOOLOGY 316",
            "parent": "ZOOLOGY",
            "title": "LABORATORY FOR LIMNOLOGY-CONSERVATION OF AQUATIC RESOURCES"
        }
    },
    {
        "data": {
            "description": "Biology, ecology and evolution of dinosaurs. Use anatomical correlates and phylogeny to understand physiology, adaptation, and evolutionary transitions. Examples include predator-prey interactions, the evolutionary transition to flight, and how late Mesozoic ecology gave rise to our modern world.",
            "id": "ZOOLOGY 275",
            "parent": "ZOOLOGY",
            "title": "BIOLOGY OF THE DINOSAURS"
        }
    },
    {
        "data": {
            "description": "Comprehensive course on modern aspects of cell biology.",
            "id": "ZOOLOGY 570",
            "parent": "ZOOLOGY",
            "title": "CELL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Covers the necessary mathematical tools needed to succeed in our algebra course and provides fundamental mathematical skills. Topics include real numbers, linear equations and inequalities, integral and fractional exponents, polynomials and their arithmetic, polynomial equations and equations with fractional exponents, the quadratic formula and completing the square, systems of two linear equations, graphing, and problem solving using algebra and graphs. All students must pass an assessment on basic mathematical skills to complete the course. The course does not count for degree credit.",
            "id": "MATH 96",
            "parent": "MATH",
            "title": "PREPARATORY ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Descriptive statistics, distributions, one- and two-sample normal inference, power, one-way ANOVA, simple linear regression, categorical data, non-parametric methods; underlying assumptions and diagnostic work.",
            "id": "F&WECOL/STAT 571",
            "title": "STATISTICAL METHODS FOR BIOSCIENCE I"
        }
    },
    {
        "data": {
            "description": "Develop a broad understanding of how life works at the molecular level. Covers structure, chemistry, and functions of macromolecules, focusing primarily on how nucleic acids carry out their central roles in cells, rather than transmission genetics. Other topics include the governing principles by which life evolved, functions, and is organized; the experimental methods used to study these processes; and the historical context for our understanding of them. In other words: soup-to-nuts of nucleic acid biology and chemistry.",
            "id": "ZOOLOGY 370",
            "parent": "ZOOLOGY",
            "title": "GENERAL MOLECULAR BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Developmental anatomy and laboratory manipulations of representative animal embryos used extensively for analysis of developmental phenomena (sea urchins, amphibia, annelids, molluscs, ascidians, insects, chicks, fish, mice).",
            "id": "ZOOLOGY 555",
            "parent": "ZOOLOGY",
            "title": "LABORATORY IN DEVELOPMENTAL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Directed study/independent research. Experience hypothesis development, research through faculty mentorship.",
            "id": "ZOOLOGY 199",
            "parent": "ZOOLOGY",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Directed study/independent research. Experience hypothesis development, research through faculty mentorship.",
            "id": "ZOOLOGY 299",
            "parent": "ZOOLOGY",
            "title": "DIRECTED STUDIES IN ZOOLOGY"
        }
    },
    {
        "data": {
            "description": "Ecology of individual organisms, populations, communities, ecosystems, landscapes, and the biosphere. The interaction of organisms with each other and their physical environment. These relationships are studied, often in quantitative terms, in both field and laboratory settings.",
            "id": "BOTANY/F&WECOL/ZOOLOGY 460",
            "title": "GENERAL ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Emphasizes spatial patterning (its development and importance for ecological processes) and often focuses on large regions. Learn concepts, methods, and applications of landscape ecology.",
            "id": "BOTANY/F&WECOL/ZOOLOGY 879",
            "title": "ADVANCED LANDSCAPE ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Emphasizes the importance of spatial patterns at broad scales. Concepts and applications are covered.",
            "id": "F&WECOL/LANDARC/ZOOLOGY 565",
            "title": "PRINCIPLES OF LANDSCAPE ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Essential concepts of differential and integral calculus; exponential and logarithmic functions; functions of several variables. Primarily for students in prebusiness and some social sciences. Students preparing for advanced study in mathematics, physics, engineering and other sciences (including most biological sciences) should takeMATH 221.",
            "id": "MATH 211",
            "parent": "MATH",
            "title": "SURVEY OF CALCULUS 1"
        }
    },
    {
        "data": {
            "description": "Evolutionary biology, emphasizing how modern scientists study evolution. Topics include: nature and mechanisms of microevolution, macroevolution, adaptation, speciation; systematics and taxonomy; quantitative genetics and measurement of natural selection; phylogenetic analyses of behavior, physiology, morphology, biochemistry; current controversies in evolution.",
            "id": "ANTHRO/BOTANY/ZOOLOGY 410",
            "title": "EVOLUTIONARY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Examines general physiological principles by comparing taxa from diverse evolutionary histories and ecological adaptations. Examples include adaptation to environments differing in salinity, temperature, altitude, pressure, or pollution, and examines how nervous and endocrine systems evolved to support the adaptations.",
            "id": "ZOOLOGY 611",
            "parent": "ZOOLOGY",
            "title": "COMPARATIVE AND EVOLUTIONARY PHYSIOLOGY"
        }
    },
    {
        "data": {
            "description": "Explore some of the most important themes and debates that have permeated evolutionary biology over the last 50 years. Read key papers related to each controversial topic, debate the pros and cons of competing viewpoints, and reflect on the relevance of the issue to contemporary evolutionary biology.",
            "id": "BOTANY/ENTOM/GENETICS/ZOOLOGY 820",
            "title": "FOUNDATIONS OF EVOLUTION"
        }
    },
    {
        "data": {
            "description": "Explore the biological and ecological systems of the oceans and marginal seas. Focus on understanding how marine organisms interact with their physical environment and how the biological components of the oceans are interconnected through trophic interactions and habitat selection.",
            "id": "ZOOLOGY 304",
            "parent": "ZOOLOGY",
            "title": "MARINE BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Explore the biological and molecular adaptations of parasitic arthropods that allow them to feed on vertebrate host and facilitate the transmission of vector-borne pathogens. Examines how anthropogenic activities, behaviors, and effects on climate affect the biology of vectors, the pathogens they transmit, and the emergence of vector-borne epidemics in the world. Emphasis on the molecular and physiological interaction between pathogens, their vector, and the vertebrate host and the fundamentals on how vectors and vector-borne pathogens cause disease in humans. Evaluate real control programs deployed globally for the control of vector-borne diseases.",
            "id": "ENTOM/ZOOLOGY 371",
            "title": "MEDICAL ENTOMOLOGY: BIOLOGY OF VECTOR AND VECTOR-BORNE DISEASES"
        }
    },
    {
        "data": {
            "description": "Explores a detailed atomic and molecular view of matter and its interactions, with a specific focus on quantum theory, molecular structure, and chemical bonding. Application required for enrollment.",
            "id": "CHEM 115",
            "parent": "CHEM",
            "title": "CHEMICAL PRINCIPLES I"
        }
    },
    {
        "data": {
            "description": "Foundational ideas in the field of ecology. Discussion topics trace the development of ecology as a discipline, and the roots of modern ecological thought, as well as the research approaches in ecology.",
            "id": "BOTANY/ENTOM/F&WECOL/ZOOLOGY 821",
            "title": "FOUNDATIONS OF ECOLOGY"
        }
    },
    {
        "data": {
            "description": "General biological principles. Topics include: evolution, ecology, animal behavior, cell structure and function, genetics and molecular genetics and the physiology of a variety of organ systems emphasizing function in humans.",
            "id": "BIOLOGY/ZOOLOGY 101",
            "title": "ANIMAL BIOLOGY"
        }
    },
    {
        "data": {
            "description": "General concepts of animal biology at an introductory level emphasizing the evolutionary relationships between animals. Learn about general body plans and strategies used to accomplish the basic tasks of staying alive in major animal groups using preserved and live animals. Study the diversity within each group of animals by integrating the body plans with the lifestyle and ecology of animals. Dissections of earthworm, freshwater mussel, squid, sea star, and rat aid the study of these general principles.",
            "id": "BIOLOGY/ZOOLOGY 102",
            "title": "ANIMAL BIOLOGY LABORATORY"
        }
    },
    {
        "data": {
            "description": "General limnology. Physical, chemical and biological characteristics and processes of lakes. Environmental problems and rehabilitation of lakes.",
            "id": "ENVIRST/ZOOLOGY 315",
            "title": "LIMNOLOGY-CONSERVATION OF AQUATIC RESOURCES"
        }
    },
    {
        "data": {
            "description": "Genetics in eukaryotes and prokaryotes.  Includes transmission genetics, molecular genetics, evolutionary genetics, genetic engineering, and societal issues associated with genetics.  Illustrative material includes bacteria, plants, insects, and vertebrates.",
            "id": "GENETICS 466",
            "parent": "GENETICS",
            "title": "PRINCIPLES OF GENETICS"
        }
    },
    {
        "data": {
            "description": "Geologic processes; structure and history of the earth; earthquakes, volcanos, glaciers, groundwater, minerals, rocks, deserts, fossils; topographic and geologic maps; climate change on geologic and human time scales.",
            "id": "GEOSCI 100",
            "parent": "GEOSCI",
            "title": "INTRODUCTORY GEOLOGY: HOW THE EARTH WORKS"
        }
    },
    {
        "data": {
            "description": "How ecological principles can be used to address contemporary environmental issues such as water quality, invasive species, and population growth. Emphasis on midwestern issues, practical approaches, the role of history, and geographic context.",
            "id": "BOTANY/ZOOLOGY 450",
            "title": "MIDWESTERN ECOLOGICAL ISSUES: A CASE STUDY APPROACH"
        }
    },
    {
        "data": {
            "description": "Independent experimental modules exploring neurophysiology and behavior will be completed in groups.  Learn techniques and develop investigations into three separate areas of neurobiology.",
            "id": "NEURODPT/ZOOLOGY 616",
            "title": "LAB COURSE IN NEUROBIOLOGY AND BEHAVIOR"
        }
    },
    {
        "data": {
            "description": "Interactions of fishes with their physical, chemical, and biotic environment; physiological ecology, community ecology and fisheries sciences. Lake Mendota perch fishery and Shedd Aquarium field trips.",
            "id": "ENVIRST/ZOOLOGY 510",
            "title": "ECOLOGY OF FISHES"
        }
    },
    {
        "data": {
            "description": "Introduces new graduate students to the diversity of ecologists across the UW-Madison campus. Includes discussions of key topics in professional development, research presentations by faculty members, and discussions of assigned papers with senior graduate students.",
            "id": "AGRONOMY/ATMOCN/BOTANY/ENTOM/ENVIRST/F&WECOL/GEOG/ZOOLOGY 953",
            "title": "INTRODUCTION TO ECOLOGY RESEARCH AT UW-MADISON"
        }
    },
    {
        "data": {
            "description": "Introduction to bird biology, ecology, and behavior. Topics include the evolutionary origin of birds and flight, anatomy and physiology, functional morphology, migration, communication, reproductive strategies, ecological adaptations and roles, and biogeographical patterns.",
            "id": "ANSCI/F&WECOL/ZOOLOGY 520",
            "title": "ORNITHOLOGY"
        }
    },
    {
        "data": {
            "description": "Introduction to differential and integral calculus and plane analytic geometry; applications; transcendental functions.",
            "id": "MATH 221",
            "parent": "MATH",
            "title": "CALCULUS AND ANALYTIC GEOMETRY 1"
        }
    },
    {
        "data": {
            "description": "Introduction to invertebrate diversity and biology, with emphasis on anatomy, development, and systematic relationships of the main animal phyla. Phyla are discussed in the context of major themes in animal evolution, such as the origin of tissue layers, the diversity of feeding mechanisms, the evolution of terrestrialization, patterns of diversification through time, and the conservation of transcriptional circuitry. Focus on animal diversity from a phylogenetic and developmental perspective.",
            "id": "ZOOLOGY 300",
            "parent": "ZOOLOGY",
            "title": "INVERTEBRATE BIOLOGY AND EVOLUTION"
        }
    },
    {
        "data": {
            "description": "Introduction to invertebrate diversity and biology, with emphasis on anatomy, development, and systematic relationships of the main animal phyla. Phyla are discussed in the context of major themes in animal evolution, such as the origin of tissue layers, the diversity of feeding mechanisms, the evolution of terrestrialization, patterns of diversification through time, and the conservation of transcriptional circuitry. Focus on animal diversity from a phylogenetic and developmental perspective.",
            "id": "ZOOLOGY 301",
            "parent": "ZOOLOGY",
            "title": "INVERTEBRATE BIOLOGY AND EVOLUTION LAB"
        }
    },
    {
        "data": {
            "description": "Introduction to modern statistical practice in the life sciences, using the R programming language. Topics include: exploratory data analysis, probability and random variables; one-sample testing and confidence intervals, role of assumptions, sample size determination, two-sample inference; basic ideas in experimental design, analysis of variance, linear regression, goodness-of fit; biological applications.",
            "id": "STAT 371",
            "parent": "STAT",
            "title": "INTRODUCTORY APPLIED STATISTICS FOR THE LIFE SCIENCES"
        }
    },
    {
        "data": {
            "description": "Introduction to techniques used in the study of the biology, chemistry, geology, and physics of the marine environment.",
            "id": "ATMOCN/ENVIRST/GEOSCI/ZOOLOGY 750",
            "title": "PROBLEMS IN OCEANOGRAPHY"
        }
    },
    {
        "data": {
            "description": "Introduction to the major features and mechanisms of early embryonic development in animals, including (1) the major stages of early development, (2) how form arises in the embryo (morphogenesis), (3) how differences arise between cells in the embryo, and (4) how specific genes control these processes.",
            "id": "ZOOLOGY 470",
            "parent": "ZOOLOGY",
            "title": "INTRODUCTION TO ANIMAL DEVELOPMENT"
        }
    },
    {
        "data": {
            "description": "Introduction to theoretical ecology, including hands-on experience in computer modeling.",
            "id": "ENTOM/ZOOLOGY 540",
            "title": "THEORETICAL ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Introductory topics in biological sciences.",
            "id": "ZOOLOGY 200",
            "parent": "ZOOLOGY",
            "title": "TOPICS IN BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Investigating physiological adaptations in different animals. Design and execute experiments.",
            "id": "ZOOLOGY 612",
            "parent": "ZOOLOGY",
            "title": "COMPARATIVE PHYSIOLOGY LABORATORY"
        }
    },
    {
        "data": {
            "description": "Learn basic methodology in scientific research and discovery, including laboratory techniques, quantitative reasoning, scientific communication, and collaboration. Gain hands-on laboratory experience working with microbes to test original hypotheses concerning the discovery of potential antibiotic compounds while addressing the world's antibiotic resistance crisis by contributing data to the global \"Tiny Earth\" network of researchers to advance potential drug development. Tiny Earth seeks to encourage students to pursue careers in science through real-world, applied research experiences and aims to address a worldwide health threat of the diminishing supply of effective antibiotics by \"student-sourcing antibiotic discovery.\" Concurrent enrollment inBIOLOGY/​BOTANY/​ZOOLOGY  152is required for permission to enroll.",
            "id": "PLPATH/ZOOLOGY 154",
            "title": "TINY EARTH: ANTIBIOTIC DISCOVERY RESEARCH"
        }
    },
    {
        "data": {
            "description": "Learn to navigate open access biological and biomedical databases that include a wealth of information regarding genes, gene expression, gene pathways, behavioral characteristics, and disorders or diseases. This includes extracting information to develop new ideas, and using multiple databases to develop new ideas on which genes may be playing important, but previously underappreciated or unknown roles.",
            "id": "ZOOLOGY 604",
            "parent": "ZOOLOGY",
            "title": "COMPUTER-BASED GENE AND DISEASE/DISORDER RESEARCH LAB"
        }
    },
    {
        "data": {
            "description": "Mentored individual research and study for students completing a senior thesis.",
            "id": "ZOOLOGY 691",
            "parent": "ZOOLOGY",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Mentored individual research and study for students completing a senior thesis.",
            "id": "ZOOLOGY 692",
            "parent": "ZOOLOGY",
            "title": "SENIOR THESIS"
        }
    },
    {
        "data": {
            "description": "Mentored individual research and study for students completing a thesis in an Honors program.",
            "id": "ZOOLOGY 681",
            "parent": "ZOOLOGY",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Mentored individual research and study for students completing a thesis in an Honors program.",
            "id": "ZOOLOGY 682",
            "parent": "ZOOLOGY",
            "title": "SENIOR HONORS THESIS"
        }
    },
    {
        "data": {
            "description": "Molecular and ecological aspects of the interactions between plants and microorganisms. Explores many of the themes, from genetic to integrative, of modern biology, and illustrates how study of plant-microbe interactions contributes to understanding of fundamental plant science.",
            "id": "BOTANY/ENTOM/PLPATH 505",
            "title": "PLANT-MICROBE INTERACTIONS: MOLECULAR AND ECOLOGICAL ASPECTS"
        }
    },
    {
        "data": {
            "description": "Multiple ways in which arthropods exploit plants, plant traits that deter or augment insects, environmental mediation of these interactions, effects on population dynamics, community ecology and co-evolution, and implications to natural resource management, environmental quality, and sustainable development.",
            "id": "BOTANY/ENTOM/ZOOLOGY 473",
            "title": "PLANT-INSECT INTERACTIONS"
        }
    },
    {
        "data": {
            "description": "Origins and structures of mind, brain, and consciousness. Transitions from early mammalian through primate to hominid intelligence. Genetics and plasticity in brain development. Modern studies of human brain mechanisms and consciousness.",
            "id": "ANTHRO/NTP/PSYCH/ZOOLOGY 619",
            "title": "BIOLOGY OF MIND"
        }
    },
    {
        "data": {
            "description": "Outdoor and indoor labs/lectures emphasizing identification of southern Wisconsin birds by sight and vocalization. Two required Saturday field trips in Southern Wisconsin.",
            "id": "ANSCI/F&WECOL/ZOOLOGY 521",
            "title": "BIRDS OF SOUTHERN WISCONSIN"
        }
    },
    {
        "data": {
            "description": "Physical evolution of the earth and its relationship to the development of life through geologic time. Includes field trip.",
            "id": "GEOSCI 204",
            "parent": "GEOSCI",
            "title": "GEOLOGIC EVOLUTION OF THE EARTH"
        }
    },
    {
        "data": {
            "description": "Principles and application of chemical equilibrium, coordination chemistry, oxidation-reduction and electrochemistry, kinetics, nuclear chemistry, introduction to organic chemistry, and chemistry laboratory skills.",
            "id": "CHEM 104",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY II"
        }
    },
    {
        "data": {
            "description": "Principles including morphology and classification.",
            "id": "ENTOM/ZOOLOGY 302",
            "title": "INTRODUCTION TO ENTOMOLOGY"
        }
    },
    {
        "data": {
            "description": "Promotes scientific and professional development. Presenters develop and deliver research presentations to a scientific audience, field questions, and receive critiques about their presentation style and scientific approach. Additional presentations include professional development, career advancement opportunities, and topics of interest to the endocrinology and reproduction community at large.",
            "id": "ANSCI/OBS&GYN/ZOOLOGY 954",
            "title": "SEMINAR IN ENDOCRINOLOGY-REPRODUCTIVE PHYSIOLOGY"
        }
    },
    {
        "data": {
            "description": "Properties of elementary functions, such as polynomial, absolute value, radical, rational, exponential, and logarithmic functions. Topics include equations, inequalities, functions, and their graphs. Students will formulate, analyze, solve, and interpret mathematical and real-world problems. Intended to provide the algebra skills required for calculus.",
            "id": "MATH 112",
            "parent": "MATH",
            "title": "ALGEBRA"
        }
    },
    {
        "data": {
            "description": "Provides a hands-on, research-driven experience within a marine environment, centering on exposure to 1) the diverse organisms and ecological interactions of coastal marine habitats 2) conservation issues relevant in these habitats 3) the research process from formulating interesting biological questions to conducting scientific research. Features immersion in a variety of marine habitats along with presentations by experts on marine conservation issues.",
            "id": "ZOOLOGY 320",
            "parent": "ZOOLOGY",
            "title": "FIELD MARINE BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Provides an overview of natural history museums, including history, field collecting, specimen preparation, collection preservation, ethics, education and employment opportunities. Introduces the natural science museums and library collections located on the UW campus.",
            "id": "ZOOLOGY 405",
            "parent": "ZOOLOGY",
            "title": "INTRODUCTION TO MUSEUM STUDIES IN THE NATURAL SCIENCES"
        }
    },
    {
        "data": {
            "description": "Provides support and structure for those interested in gaining hands-on experience working as a volunteer with local environmental, ecological or conservation groups.",
            "id": "ZOOLOGY 677",
            "parent": "ZOOLOGY",
            "title": "INTERNSHIP IN ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Scope and objectives of ecosystem ecology; roles of theory, long-term studies, comparative studies, and large-scale experiments; scaling problems; ecosystem services and ecological economics; adaptive ecosystem assessment and management.",
            "id": "BOTANY/ZOOLOGY 725",
            "title": "ECOSYSTEM CONCEPTS"
        }
    },
    {
        "data": {
            "description": "Sections in various fields of zoological research.",
            "id": "ATMOCN/BOTANY/CIVENGR/ENVIRST/GEOSCI/ZOOLOGY 911",
            "title": "LIMNOLOGY AND MARINE SCIENCE SEMINAR"
        }
    },
    {
        "data": {
            "description": "Sections in various fields of zoological research.",
            "id": "ZOOLOGY 955",
            "parent": "ZOOLOGY",
            "title": "SEMINAR-LIMNOLOGY"
        }
    },
    {
        "data": {
            "description": "Sections in various fields of zoological research.",
            "id": "ZOOLOGY 956",
            "parent": "ZOOLOGY",
            "title": "SEMINAR-ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Sections in various fields of zoological research.",
            "id": "ZOOLOGY 957",
            "parent": "ZOOLOGY",
            "title": "SEMINAR-EVOLUTION"
        }
    },
    {
        "data": {
            "description": "Sections in various fields of zoological research.",
            "id": "ZOOLOGY 960",
            "parent": "ZOOLOGY",
            "title": "SEMINAR IN CELLULAR BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Sections in various fields of zoological research.",
            "id": "ZOOLOGY 962",
            "parent": "ZOOLOGY",
            "title": "SEMINAR-ETHOLOGY"
        }
    },
    {
        "data": {
            "description": "Selected research projects for juniors and seniors.",
            "id": "ZOOLOGY 698",
            "parent": "ZOOLOGY",
            "title": "DIRECTED STUDY"
        }
    },
    {
        "data": {
            "description": "Selected research projects for juniors and seniors.",
            "id": "ZOOLOGY 699",
            "parent": "ZOOLOGY",
            "title": "DIRECTED STUDIES IN ZOOLOGY"
        }
    },
    {
        "data": {
            "description": "Stoichiometry and the mole concept, the behavior of gases, liquids and solids, thermochemistry, electronic structure of atoms and chemical bonding, descriptive chemistry of selected elements and compounds, intermolecular forces, and chemistry laboratory skills.",
            "id": "CHEM 103",
            "parent": "CHEM",
            "title": "GENERAL CHEMISTRY I"
        }
    },
    {
        "data": {
            "description": "Study the importance of past events for current ecosystems. Emphasizes concepts and applications.",
            "id": "BOTANY/F&WECOL/ZOOLOGY 672",
            "title": "HISTORICAL ECOLOGY"
        }
    },
    {
        "data": {
            "description": "Survey of the principles guiding neuronal development. Covers descriptive and experimental analyses of developmental mechanisms underlying the formation of both vertebrate and invertebrate nervous systems.",
            "id": "ZOOLOGY 625",
            "parent": "ZOOLOGY",
            "title": "DEVELOPMENT OF THE NERVOUS SYSTEM"
        }
    },
    {
        "data": {
            "description": "Systematically explores current animal models of human diseases that affect the central nervous system. Topics will include birth defects that disrupt normal brain architecture (holoprosencephaly and neural tube closure defects), birth defects affecting the visual system, and postnatal disease, e.g. neurodegeneration and stroke.",
            "id": "ZOOLOGY 655",
            "parent": "ZOOLOGY",
            "title": "MODELING NEURODEVELOPMENTAL DISEASE"
        }
    },
    {
        "data": {
            "description": "The biology of water-borne, food-borne, soil-borne and vector-borne parasites of animals including humans. Parasites are explored in the context of transmission, associated disease, diagnosis and treatment options, and environmental, cultural and socioeconomic drivers of disease epidemiology.",
            "id": "ENTOM/MM&I/PATH-BIO/ZOOLOGY 350",
            "title": "PARASITOLOGY"
        }
    },
    {
        "data": {
            "description": "The evolutionary history, morphology, and ecology of fossil invertebrates. Labs emphasize fossil identification and recognition of basic morphological features.",
            "id": "GEOSCI/ZOOLOGY 542",
            "title": "INVERTEBRATE PALEONTOLOGY"
        }
    },
    {
        "data": {
            "description": "The evolutionary process as interpreted from the fossil record. Topics include: the study of form; tempo and mode of evolution; levels and mechanisms of evolutionary change; extinction in the fossil record; trends and patterns in the history of life; macroevolution.",
            "id": "GEOSCI/ZOOLOGY 541",
            "title": "PALEOBIOLOGY"
        }
    },
    {
        "data": {
            "description": "The form, function, development, basic physiology and ecology of the freshwater and marine invertebrates in the context of their environment. Study live invertebrate specimens, their habitat selection, adaptation and diversity.",
            "id": "ZOOLOGY 303",
            "parent": "ZOOLOGY",
            "title": "AQUATIC INVERTEBRATE BIOLOGY"
        }
    },
    {
        "data": {
            "description": "The relationships of organisms and the environment. Population dynamics and community organization, human-environment relationships, action programs.",
            "id": "BOTANY/ENVIRST/ZOOLOGY 260",
            "title": "INTRODUCTORY ECOLOGY"
        }
    },
    {
        "data": {
            "description": "The two semester sequenceMATH 112-MATH 113covers similar material asMATH 114, but in a slower pace. Not recommended for students with less than an AB inMATH 96.",
            "id": "MATH 114",
            "parent": "MATH",
            "title": "ALGEBRA AND TRIGONOMETRY"
        }
    },
    {
        "data": {
            "description": "Topics in algebra, trigonometry and precalculus are integrated with elementary differential calculus. Part of a 2-semester sequence withMATH 217; these two courses together are equivalent toMATH 114and221.",
            "id": "MATH 171",
            "parent": "MATH",
            "title": "CALCULUS WITH ALGEBRA AND TRIGONOMETRY I"
        }
    },
    {
        "data": {
            "description": "Topics in earth system science. Emphasis on the coupling between atmospheric, oceanic and land surface systems, involving physical geochemical and biological processes, and including interactions with human systems.",
            "id": "ATMOCN/BOTANY/ENVIRST/F&WECOL/GEOG/GEOSCI/ZOOLOGY 980",
            "title": "EARTH SYSTEM SCIENCE SEMINAR"
        }
    },
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics and selected topics in Animal Physiology.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Topics include: cell structure and function, cellular metabolism (enzymes, respiration, photosynthesis), information flow (DNA, RNA, protein), principles of genetics, and selected topics in Animal Physiology. Designed for engineering majors that do not need a lab component.",
            "id": "ZOOLOGY 153",
            "parent": "ZOOLOGY",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Topics include: selected topics in plant physiology, a survey of the five major kingdoms of organisms, speciation and evolutionary theory, and ecology at multiple levels of the biological hierarchy.",
            "id": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "title": "INTRODUCTORY BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Various advanced topics in the Biological Sciences",
            "id": "ZOOLOGY 800",
            "parent": "ZOOLOGY",
            "title": "ADVANCED TOPICS IN THE BIOLOGICAL SCIENCES"
        }
    },
    {
        "data": {
            "description": "Various intermediate level topics in Biology. Each section will explore a different topic in biology.",
            "id": "ZOOLOGY 400",
            "parent": "ZOOLOGY",
            "title": "TOPICS IN BIOLOGY"
        }
    },
    {
        "data": {
            "description": "Writing-intensive with opportunities to make observations and generate and test questions. Includes ecology field trips and research projects that focus on genetics and evolution.",
            "id": "BIOCORE 382",
            "parent": "BIOCORE",
            "title": "EVOLUTION, ECOLOGY, AND GENETICS LABORATORY"
        }
    },
    {
        "data": {
            "id": "BIOCORE",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CHEM",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "CROSSLISTED",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "GENETICS",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "GEOSCI",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MATH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "MICROBIO",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "PSYCH",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "STAT",
            "type": "compound"
        }
    },
    {
        "data": {
            "id": "ZOOLOGY",
            "type": "compound"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "ANTHRO/BOTANY/ZOOLOGY 410"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "BIOCORE 382"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "ENVIRST/F&WECOL/ZOOLOGY 360"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "ENVIRST/ZOOLOGY 510"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "F&WECOL/ZOOLOGY 660"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "GENETICS 466"
        }
    },
    {
        "data": {
            "source": "BIOCORE 381",
            "target": "ZOOLOGY 425"
        }
    },
    {
        "data": {
            "source": "BIOCORE 382",
            "target": "ENVIRST/F&WECOL/ZOOLOGY 360"
        }
    },
    {
        "data": {
            "source": "BIOCORE 382",
            "target": "ZOOLOGY 425"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 152"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "BIOLOGY/ZOOLOGY 101"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 151",
            "target": "ZOOLOGY 570"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "target": "BIOLOGY/ZOOLOGY 102"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "target": "BOTANY/F&WECOL/ZOOLOGY 460"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "target": "BOTANY/ZOOLOGY 450"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/BOTANY/ZOOLOGY 152",
            "target": "ENVIRST/ZOOLOGY 315"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ANSCI/F&WECOL/ZOOLOGY 520"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ANSCI/F&WECOL/ZOOLOGY 521"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "BIOLOGY/BOTANY/ZOOLOGY 151"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ENTOM/MM&I/PATH-BIO/ZOOLOGY 350"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ENTOM/ZOOLOGY 302"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ENTOM/ZOOLOGY 371"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "MICROBIO 303"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "NEURODPT/PSYCH/ZOOLOGY 674"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "PSYCH/ZOOLOGY 523"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ZOOLOGY 153"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ZOOLOGY 300"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ZOOLOGY 303"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ZOOLOGY 304"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ZOOLOGY 320"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ZOOLOGY 370"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ZOOLOGY 415"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ZOOLOGY 430"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ZOOLOGY 444"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ZOOLOGY 470"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ZOOLOGY 603"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ZOOLOGY 604"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 101",
            "target": "ZOOLOGY 611"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 102",
            "target": "ANSCI/F&WECOL/ZOOLOGY 520"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 102",
            "target": "ANSCI/F&WECOL/ZOOLOGY 521"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 102",
            "target": "ENTOM/MM&I/PATH-BIO/ZOOLOGY 350"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 102",
            "target": "ZOOLOGY 300"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 102",
            "target": "ZOOLOGY 303"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 102",
            "target": "ZOOLOGY 304"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 102",
            "target": "ZOOLOGY 320"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 102",
            "target": "ZOOLOGY 415"
        }
    },
    {
        "data": {
            "source": "BIOLOGY/ZOOLOGY 102",
            "target": "ZOOLOGY 430"
        }
    },
    {
        "data": {
            "source": "BOTANY/ENTOM/PLPATH 505",
            "target": "BOTANY/ENTOM/ZOOLOGY 473"
        }
    },
    {
        "data": {
            "source": "BOTANY/F&WECOL/ZOOLOGY 460",
            "target": "BOTANY/ENVIRST/F&WECOL/ZOOLOGY 651"
        }
    },
    {
        "data": {
            "source": "BOTANY/F&WECOL/ZOOLOGY 460",
            "target": "F&WECOL/LANDARC/ZOOLOGY 565"
        }
    },
    {
        "data": {
            "source": "CHEM 103",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "MICROBIO 303"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "PSYCH/ZOOLOGY 523"
        }
    },
    {
        "data": {
            "source": "CHEM 104",
            "target": "ZOOLOGY 370"
        }
    },
    {
        "data": {
            "source": "CHEM 115",
            "target": "GENETICS 466"
        }
    },
    {
        "data": {
            "source": "ENVIRST/GEOSCI 106",
            "target": "GEOSCI 100"
        }
    },
    {
        "data": {
            "source": "ENVIRST/ZOOLOGY 315",
            "target": "ZOOLOGY 316"
        }
    },
    {
        "data": {
            "source": "ENVIRST/ZOOLOGY 510",
            "target": "ENVIRST/ZOOLOGY 511"
        }
    },
    {
        "data": {
            "source": "F&WECOL/STAT 571",
            "target": "ENTOM/ZOOLOGY 540"
        }
    },
    {
        "data": {
            "source": "GENETICS 466",
            "target": "ENTOM/GENETICS/ZOOLOGY 624"
        }
    },
    {
        "data": {
            "source": "GEOSCI 100",
            "target": "ENVIRST/GEOSCI 106"
        }
    },
    {
        "data": {
            "source": "GEOSCI 100",
            "target": "GEOSCI 204"
        }
    },
    {
        "data": {
            "source": "GEOSCI 204",
            "target": "GEOSCI 304"
        }
    },
    {
        "data": {
            "source": "GEOSCI 204",
            "target": "GEOSCI/ZOOLOGY 542"
        }
    },
    {
        "data": {
            "source": "GEOSCI 304",
            "target": "GEOSCI/ZOOLOGY 541"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 113"
        }
    },
    {
        "data": {
            "source": "MATH 112",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 113",
            "target": "MATH 221"
        }
    },
    {
        "data": {
            "source": "MATH 114",
            "target": "CHEM 104"
        }
    },
    {
        "data": {
            "source": "MATH 171",
            "target": "CHEM 103"
        }
    },
    {
        "data": {
            "source": "MATH 211",
            "target": "STAT 371"
        }
    },
    {
        "data": {
            "source": "MATH 221",
            "target": "MATH 211"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 112"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 114"
        }
    },
    {
        "data": {
            "source": "MATH 96",
            "target": "MATH 171"
        }
    },
    {
        "data": {
            "source": "MICROBIO 303",
            "target": "BOTANY/ENTOM/PLPATH 505"
        }
    },
    {
        "data": {
            "source": "PSYCH 202",
            "target": "PSYCH 454"
        }
    },
    {
        "data": {
            "source": "PSYCH 454",
            "target": "NEURODPT/ZOOLOGY 616"
        }
    },
    {
        "data": {
            "source": "PSYCH/ZOOLOGY 523",
            "target": "NEURODPT/ZOOLOGY 616"
        }
    },
    {
        "data": {
            "source": "PSYCH/ZOOLOGY 523",
            "target": "NTP/ZOOLOGY 620"
        }
    },
    {
        "data": {
            "source": "PSYCH/ZOOLOGY 523",
            "target": "ZOOLOGY 500"
        }
    },
    {
        "data": {
            "source": "PSYCH/ZOOLOGY 523",
            "target": "ZOOLOGY 625"
        }
    },
    {
        "data": {
            "source": "PSYCH/ZOOLOGY 523",
            "target": "ZOOLOGY 655"
        }
    },
    {
        "data": {
            "source": "STAT 371",
            "target": "F&WECOL/LANDARC/ZOOLOGY 565"
        }
    },
    {
        "data": {
            "source": "ZOOLOGY 300",
            "target": "ZOOLOGY 301"
        }
    },
    {
        "data": {
            "source": "ZOOLOGY 470",
            "target": "ZOOLOGY 555"
        }
    },
    {
        "data": {
            "source": "ZOOLOGY 611",
            "target": "ZOOLOGY 612"
        }
    }
]