{
    "course_reference": {
        "course_number": 179,
        "subjects": [
            "ARTHIST",
            "ASIAN"
        ]
    },
    "course_title": "PASSAGE THROUGH INDIA: SOUTH ASIA'S GLOBAL ARCHITECTURAL HISTORIES",
    "cumulative_grade_data": null,
    "description": "Historical overview of India and South Asia's global architectural histories from the ancient to the modern periods.  While focusing predominantly on architectural sites in India, examine architecture at multiple sites across the globe which share connected histories with South Asia.  We live in a world of nation states and are shaped by national histories.  However, in the arc of human history, nation states are of recent vintage.  Examine India's global architectural histories not only through comparison but, in the words of historian Sanjay Subrahmanyam, \"by seeking out the at times fragile threads that connected\" India to \"the globe.\"  Capturing the mobility of populations, traders, conquerors, missionaries, pilgrims, tourists, colonists, architects, artists, scholars, religion, merchandise, art, architecture, and ideas, we show that South Asia's global architectural histories are themselves the complex products of varied histories of cultural encounters.",
    "optimized_prerequisites": null,
    "prerequisites": {
        "abstract_syntax_tree": "None",
        "course_references": [],
        "linked_requisite_text": [
            "None"
        ],
        "prerequisites_text": "None"
    },
    "similar_courses": [
        {
            "course_number": 203,
            "subjects": [
                "ARTHIST"
            ]
        },
        {
            "course_number": 779,
            "subjects": [
                "ARTHIST"
            ]
        },
        {
            "course_number": 379,
            "subjects": [
                "ARTHIST",
                "ASIAN"
            ]
        },
        {
            "course_number": 210,
            "subjects": [
                "ARTHIST"
            ]
        },
        {
            "course_number": 428,
            "subjects": [
                "ARTHIST",
                "ASIAN"
            ]
        }
    ],
    "term_data": {}
}