{
    "course_reference": {
        "course_number": 363,
        "subjects": [
            "HISTORY",
            "ASIAN"
        ]
    },
    "course_title": "CHINA AND WORLD WAR II IN ASIA",
    "cumulative_grade_data": null,
    "description": "This course is intended to help students understand World War II from the perspective of Asia. The focus is not only on the American and Japanese roles in the war but also on lesser, often overlooked participants such as China, Korea, and Southeast Asia. The course will focus not only on the diplomatic, political, and military situation of wartime Asia, but also on perceptions and experiences of the war from those most heavily affected by it: those experiencing it on the ground. Understanding this war is critical for helping us understand contemporary Asia. The foundations of the Cold War and the post-Cold War world that we live in today were forged on battlefields in mainland China, Burma, small islands in the Pacific, and in the skies over the archipelago of Japan. In order to provide the background and understand the legacies, this course covers an extended time frame, beginning in the 19th century with the arrival of the West in Asia and continues into the 1950s.",
    "keywords": [
        "asia perceptions",
        "understanding war",
        "asia foundations",
        "war ii",
        "asia course"
    ],
    "optimized_prerequisites": null,
    "prerequisites": {
        "abstract_syntax_tree": "Sophomore standing",
        "course_references": [],
        "linked_requisite_text": [
            "Sophomore standing"
        ],
        "prerequisites_text": "Sophomore standing"
    },
    "satisfies": [],
    "similar_courses": [
        {
            "course_number": 332,
            "subjects": [
                "HISTORY",
                "INTLST"
            ]
        },
        {
            "course_number": 103,
            "subjects": [
                "HISTORY",
                "ASIAN"
            ]
        },
        {
            "course_number": 725,
            "subjects": [
                "HISTORY"
            ]
        },
        {
            "course_number": 456,
            "subjects": [
                "HISTORY",
                "ASIAN"
            ]
        },
        {
            "course_number": 335,
            "subjects": [
                "HISTORY",
                "ASIAN"
            ]
        }
    ],
    "term_data": {}
}