{
    "course_reference": {
        "course_number": 355,
        "subjects": [
            "EDPOL"
        ]
    },
    "course_title": "THE POLITICS OF EDUCATION INJUSTICE IN THE US",
    "cumulative_grade_data": null,
    "description": "Public education in the United States is an inherently political site that offers an important institution to understand politics, power, and injustice broadly. Explore these themes from multiple angles: (a) the layered histories of injustice at the intersection of race, class, gender, and more in historical and present cases; (b) the power of ideas in shaping policy possibilities; (c) shifting levels of governance and questions of injustice; and (c) perspectives of key actors, interests, and stakeholders. Consider the politics of education in relation to broader social, spatial, historical, and political economic contexts. Develop critical analytic and conceptual tools to deeply understand and analyze how power and politics are impacting contemporary educational policy events. By drawing from grassroots and subjugated perspectives, cultivate a policy imagination towards more just educational possibilities, and explore the necessary policy infrastructure and movements to sustain them.",
    "optimized_prerequisites": {
        "abstract_syntax_tree": "Sophomore standing",
        "course_references": [],
        "linked_requisite_text": [
            "Sophomore standing"
        ],
        "prerequisites_text": "Sophomore standing"
    },
    "prerequisites": {
        "abstract_syntax_tree": "Sophomore standing",
        "course_references": [],
        "linked_requisite_text": [
            "Sophomore standing"
        ],
        "prerequisites_text": "Sophomore standing"
    },
    "similar_courses": [
        {
            "course_number": 505,
            "subjects": [
                "EDPOL"
            ]
        },
        {
            "course_number": 200,
            "subjects": [
                "EDPOL"
            ]
        },
        {
            "course_number": 145,
            "subjects": [
                "EDPOL"
            ]
        },
        {
            "course_number": 305,
            "subjects": [
                "EDPOL"
            ]
        },
        {
            "course_number": 150,
            "subjects": [
                "EDPOL"
            ]
        }
    ],
    "term_data": {}
}