{
    "course_reference": {
        "course_number": 739,
        "subjects": [
            "MEDSC-V"
        ]
    },
    "course_title": "VETERINARY PROFESSIONAL SKILLS II",
    "cumulative_grade_data": null,
    "description": "Develop critical, non-medical skills needed to excel in today's demanding clinical veterinary environment. Emphasizing a strong foundation in areas that complement veterinary medical expertise, fostering a more rewarding career, improving patient care, and creating a positive work environment for the veterinary healthcare team. Through a structured approach comprising various modules, including career, communication, ethics, financial, individual and team awareness, leadership, legal, mentorship, practice management, and wellbeing/wellness, delve into essential professional skills for future veterinarians. Develop a deeper grounding into key ethical and legal aspects of a veterinary career, including veterinarian-owner-client confidentiality, animal welfare, owner responsibility and euthanasia. Practice verbal and written communication skills in relation to commonly encountered scenarios. Veterinary career paths will be explored and defined; career planning networks developed.",
    "has_meetings": false,
    "keywords": [
        "including veterinarian",
        "veterinary environment",
        "veterinarians develop",
        "clinical veterinary",
        "future veterinarians"
    ],
    "optimized_prerequisites": null,
    "prerequisites": {
        "abstract_syntax_tree": "Declared in Doctor of Veterinary Medicine DVM with first year standing",
        "course_references": [],
        "linked_requisite_text": [
            "Declared in Doctor of Veterinary Medicine DVM with first year standing"
        ],
        "prerequisites_text": "Declared in Doctor of Veterinary Medicine DVM with first year standing"
    },
    "satisfies": [],
    "similar_courses": [
        {
            "course_number": 748,
            "subjects": [
                "MEDSC-V"
            ]
        },
        {
            "course_number": 746,
            "subjects": [
                "MEDSC-V"
            ]
        },
        {
            "course_number": 736,
            "subjects": [
                "MEDSC-V"
            ]
        },
        {
            "course_number": 738,
            "subjects": [
                "MEDSC-V"
            ]
        },
        {
            "course_number": 737,
            "subjects": [
                "MEDSC-V"
            ]
        }
    ],
    "term_data": {}
}