{
    "course_reference": {
        "course_number": 108,
        "subjects": [
            "MUSIC"
        ]
    },
    "course_title": "MUSIC AND TECHNOLOGY FROM EDISON TO THE PRESENT",
    "cumulative_grade_data": null,
    "description": "How has modern technology shaped the composition, performance, and reception of music? In turn, how has music influenced technology? And what sorts of anxieties arose from these cultural currents? Evaluate the changing relationships between music and technology from the late Romantic era to the present day. Considering broader political, cultural, and aesthetic contexts, explore both popular and art music alongside important developments in instrument design, compositional techniques, media, and recording. Consider what it means for something to be considered a \"technology\" and the social, cultural, and environmental ramifications therein. Musicians to be studied include Bela Bartok, Karlheinz Stockhausen, Gyorgy Ligeti, Donna Summer, Grandmaster Flash, Afrika Bambaataa, Beyonce, and more. Gain a better understanding of the cultural and social constructions of technologies like the wax cylinder, radio, gramophone, microphone, synthesizer, and internet.",
    "has_meetings": false,
    "keywords": [
        "influenced technology",
        "turn music",
        "ramifications musicians",
        "art music",
        "musicians studied"
    ],
    "optimized_prerequisites": null,
    "prerequisites": {
        "abstract_syntax_tree": "None",
        "course_references": [],
        "linked_requisite_text": [
            "None"
        ],
        "prerequisites_text": "None"
    },
    "satisfies": [],
    "similar_courses": [
        {
            "course_number": 240,
            "subjects": [
                "MUSIC"
            ]
        },
        {
            "course_number": 449,
            "subjects": [
                "DANCE"
            ]
        },
        {
            "course_number": 201,
            "subjects": [
                "MUSIC"
            ]
        },
        {
            "course_number": 416,
            "subjects": [
                "MUSIC"
            ]
        },
        {
            "course_number": 101,
            "subjects": [
                "MUSIC"
            ]
        }
    ],
    "term_data": {}
}