{
    "course_reference": {
        "course_number": 402,
        "subjects": [
            "POLISCI"
        ]
    },
    "course_title": "WISCONSIN IN WASHINGTON INTERNSHIP COURSE",
    "cumulative_grade_data": null,
    "description": "This course offers the opportunity to apply many things learned in the classroom to the professional world and to apply things learned in the professional world to a student's liberal arts education. Interning will introduces students to the professional world of political organizations giving them the chance to enhance professional skills, build a network of contacts, and explore possible career choices. This class stresses active reflection, self-assessment, and the honing of critical thinking and writing. The internship course builds structure with written assignments, activities, reflections, and readings to help students to make the most of their internships. Analytical work in this course will allow students to systematically analyze the workplace in ways that help them recognize prevailing office dynamics, adapt to accepted organizational standards, and to identify opportunities to be a more effective colleague. The course will ask students to analyze their current experiences and to relate them to their past learning and future possibilities.",
    "optimized_prerequisites": {
        "abstract_syntax_tree": "None",
        "course_references": [],
        "linked_requisite_text": [
            "None"
        ],
        "prerequisites_text": "None"
    },
    "prerequisites": {
        "abstract_syntax_tree": "None",
        "course_references": [],
        "linked_requisite_text": [
            "None"
        ],
        "prerequisites_text": "None"
    },
    "similar_courses": [
        {
            "course_number": 202,
            "subjects": [
                "POLISCI"
            ]
        },
        {
            "course_number": 327,
            "subjects": [
                "PUBAFFR"
            ]
        },
        {
            "course_number": 315,
            "subjects": [
                "POLISCI"
            ]
        },
        {
            "course_number": 316,
            "subjects": [
                "POLISCI"
            ]
        },
        {
            "course_number": 322,
            "subjects": [
                "INTLST"
            ]
        }
    ],
    "term_data": {}
}