{
    "course_reference": {
        "course_number": 242,
        "subjects": [
            "PUBAFFR"
        ]
    },
    "course_title": "FOUNDATIONS OF DATA ANALYSIS FOR HEALTH POLICY",
    "cumulative_grade_data": null,
    "description": "We have entered a new era of \"big data.\" It is now possible to collect and analyze genetic information, digital health records, and many other types of data quickly, cheaply, and non-invasively from large numbers of people. This new wealth of information creates exciting opportunities for more targeted, individualized approaches to health care and better management of public health risks such as age-related diseases or pandemics. However, it also creates policy challenges such as privacy, discrimination, equality, and fairness. Covers what types of health-relevant data exist, how such data is typically analyzed and used, and discuss what types of applications this enables, what type of policy challenges this brings about, and which options policy makers have to deal with these challenges. Analytic methods will include regression, principal component and cluster analysis, statistical approaches for prediction, how to interpret the results of such analyses and their limitations.",
    "keywords": [
        "types health",
        "data quickly",
        "diseases pandemics",
        "public health",
        "big data"
    ],
    "optimized_prerequisites": null,
    "prerequisites": {
        "abstract_syntax_tree": "Sophomore standing",
        "course_references": [],
        "linked_requisite_text": [
            "Sophomore standing"
        ],
        "prerequisites_text": "Sophomore standing"
    },
    "similar_courses": [
        {
            "course_number": 863,
            "subjects": [
                "PUBAFFR"
            ]
        },
        {
            "course_number": 201,
            "subjects": [
                "PUBAFFR"
            ]
        },
        {
            "course_number": 523,
            "subjects": [
                "PUBAFFR"
            ]
        },
        {
            "course_number": 819,
            "subjects": [
                "PUBAFFR"
            ]
        },
        {
            "course_number": 360,
            "subjects": [
                "PUBAFFR"
            ]
        }
    ],
    "term_data": {}
}